{
  "url": "https://sonichu.com/cwcki/Alec_Benson_Leary_Phone_Call_8",
  "title": "Alec Benson Leary Phone Call 8",
  "display_title": "Alec Benson Leary Phone Call 8",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Alec Benson Leary Phone Call 8</b> is the eighth and the second to last of the available phone conversations between <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> and Alec Benson Leary, the creator of <a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a>. It took place on 18 February 2010.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Summary\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Summary</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Video\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Video</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Transcript\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Transcript</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#External_links\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">External links</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Summary\">Summary</span></h2>\n<p>Alec calls Chris, at the latter's request, to discuss the inclusion of <a href=\"/cwcki/Asperchu#Sonichu_Revolution\" title=\"Asperchu\">Sonichu Revolution</a> in the <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> ad space. Chris, naturally, wants the pages taken down, but Alec explains the many ways in which Chris reneged on their earlier agreement concerning the removal of Asperpedia's ads. From there, the conversation spirals out into a lengthy discussion of Chris's laziness, hypocrisy, bigotry, and dishonesty, until <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a> finally overwhelms him and he refuses to continue.\n</p><p>Some of Chris's strangest psychological issues find prominent display here. For instance, his difficulty accepting the fact that his fictional characters are exactly that - fictional - leads to a bizarre passage where Alec is able to swamp him with guilt regarding the death of <a href=\"/cwcki/Simonla_Rosechu\" title=\"Simonla Rosechu\">Simonla Rosechu</a>. It takes several minutes for Chris to come up with a partial admission that his characters don't actually have a life of their own. Chris's repetition of the idiom \"killing people left and right\" suggests a very minor <a class=\"mw-redirect\" href=\"/cwcki/CWC-ism\" title=\"CWC-ism\">CWC-ism</a> (Chris likes idioms).\n</p><p>On more everyday topics, Chris claims to be spending some time lately cleaning up his family's <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">disaster area of a house</a>, <a class=\"mw-redirect\" href=\"/cwcki/Lies\" title=\"Lies\">although there has never been any corroborating evidence to confirm this</a>. Of course, he describes simple household maintenance tasks in tones most people usually reserve for the torments of the damned. He also claims to have some 30 pages of his comic in the works for publication on his birthday, February 24, but can't come up with a decent explanation for why he wouldn't upload at least some of those pages sooner and maintain a more regular update schedule. (In the end, he managed to upload only 20 of the promised pages, and they arrived a day late.) When Alec tells Chris that he has seen the video tour of his house, Chris panics and mashes buttons on his phone in a desperate attempt to disconnect from the call. (How Chris <a href=\"/cwcki/Honor_roll\" title=\"Honor roll\">managed to believe that would disconnect the call and not simply pressing the \"End\" button</a> is a mystery.)\n</p><p>Chris's fear of <a href=\"/cwcki/Homos\" title=\"Homos\">homosexuals</a> seems to remain in effect, despite his recent claims of a change of heart on the subject. While at one point Chris says he now \"sees them in a more positive light,\" he apparently still wants to see all the homos vaccinated and turned into decent, honest straight people. Chris claims that this will save them from going to hell, but he's unable to cite any scriptural or other basis for this belief. Alec points out that Chris is unfairly stereotyping homosexuals in the same way other people might stereotype autistics, a point that was likely lost on Chris two or three minutes after Alec made it.\n</p><p>Eventually, just as in their <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">previous phone call</a>, Alec's comments become ever-so-slightly pointed, which is enough to drive Chris into a full-speed retreat. He manages to muster a polite goodbye instead of simply hanging up, but he is clearly in no mood to face any more harsh reality.\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<center>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Alec Benson Leary Phone Call 8</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/nKZogX_Q0BY\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>18 February 2010\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Featuring</b>\n</td>\n<td><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>; <a class=\"mw-redirect\" href=\"/cwcki/Alec\" title=\"Alec\">Alec</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Asperchu</span><a href=\"/cwcki/Asperchu\" title=\"Asperchu\"><img alt=\"Asperchu\" decoding=\"async\" height=\"32\" src=\"/w/images/e/e8/Asperchu_saga2.png\" width=\"32\"/></a> <a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#FFFF00; color:#008080; color:#008080;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">Audio Recordings\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">Alec Benson Leary Phone Call 7</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_9\" title=\"Alec Benson Leary Phone Call 9\">Alec Benson Leary Phone Call 9</a>\n</td></tr></tbody></table>\n</center>\n<h3><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h3>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Hello?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hey Chris, it's Alec.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hi Alec.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So uh, [<i>Chris attempts to talk over Alec, but Alec wins</i>] I got your e-mail, uh, looks like you want to talk. What's, uh, what's up?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, uh, just to let you know that I'm uh, that I'm in the middle of dinner right now so we'll have to make this short. But, ahh, yeah, I am a bit, uh, concerned that you have continued with the, ahh, oversized ads on the <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a>... I mean those- the smaller banner ads- that was that was okay. I would have accepted that- I would have accepted that on a daily basis. But, no, you had to add- you had to go and... [<i>Alec begins to talk over Chris</i>] \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> add- \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> a whole- \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris-!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> to the big- \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris-!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> to the big- \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> CHRIS!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> page-\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> <i>CHRIS!</i>\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You asked me to call you... <i>right</i> at 9:30 and when I do, you're <a href=\"/cwcki/Obesity\" title=\"Obesity\">eating dinner?</a>\n</p><p>[<i>Alec sounds understandably annoyed.</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, I wasn't sure, because I'm...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What are you eating?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm having some chicken.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I- ugh. Chris, <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">if you're going to ask someone to go out of their way for you for something you should probably... actually allow them to do so and not act like you are inconvenienced when they do.</a> That's just a suggestion. But I-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, I'm sorry.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But I- well... I-I-I think [<i>Chris attempts to talk over Alec for this whole sentence</i>] maybe, if you actually want to have a serious discussion- that's why I called... but... maybe let the chicken wait until we're done with our call, how about that?           Cuz' I don't like calling you only to hear that you have something else to do even though this is the exact time you told me to call.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mm. Yeah. Yeah. I understand. I'm sorry.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So. So. So, why don't we have our talk, and maybe the chicken will get cold, but you can microwave it when we're done.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. So we had the understanding that we were not going to go back to the oversize ads again.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh. Okay, well, I can explain that. Do you remember how I told you that if you met my requirements exactly, I would remove the ads, but if you failed to meet my requirements, the ads would get worse? Do you remember when I said that to you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] Yes...I...that...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So you failed to meet my requirements. You did meet Evan's requirements, apparently. Evan is happy with you, and I'm proud of you for doing that, because Evan is, he's satisfied that you killed Simonla. However, I am not Evan, and I had different requirements than Evan.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, okay, well, why are you not satisfied?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Mm. Well, there's a few reasons. First and foremost, you did not state all of the things that I told you to in your apology video. Like how Sonichu cannot make money in its current form and is a doomed franchise and you will need to start over with something original. You made no mention of that. Alrighty, next, your <a href=\"/cwcki/I_am_Alive\" title=\"I am Alive\">last apology video</a> was... well, \"insincere\" is kind of too lenient, if I called it that. It was just, it was just insulting. I mean, you obviously felt absolutely no remorse whatsoever. Even though you swore up and down to me when I talked to you that you did. But I'm pretty sure you just wanted to finish the phone call, and you thought that you could just read things off a list and that would please me. Oh, and then you hung up on me, I think like five or six times.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I did, the last one I did apologize for that in the e-mail I sent you.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, but you hung up on me multiple times. Chris, I think that you believe, I think you believe that if you do something wrong and then you offer a superficial apology, you believe that gives you license to just do it all over again. You know, that's not what apology is about, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That is not what apologies are about.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. And the reason you hung up on me is because you were trying to avoid me. You were trying to just brush me off.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, I will admit that, the last one, and I apologize for that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. So, if you want that apology to mean anything, then in the future, including this call, and if we talk again, you are actually going to have to stick to that word and not ever again attempt to brush me off.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That make sense? Now. Let's talk about those ads for a bit. If you notice, they really aren't ads for Asperpedia anymore. What I started, I started a new comic, called <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_Revolution\" title=\"Sonichu Revolution\">Sonichu Revolution</a>. And that's actually what I'm using the adspace for. And what Sonichu Revolution is, it's actually, it's like a reboot of Sonichu, see, since you aren't uploading pages I thought I would do a nice thing for your fans and use my ad space to keep your fans happy.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>has been trying to interrupt</i>] Well, no, I am, I am doing the pages now. Listen, your comic pages, they should, they should stay on your website, your website alone. I do not want your pages on my website that only shows my pages. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh, it's kinda too bad that I bought ad space on your website, when I gave you multiple opportunities to get out of me having web space, er, ad space on your website. You didn't take them. I can do what I want with my ad space.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How many times did I, was I gracious enough to give you an extremely easy way out of all of this?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Well, not sure. Define, define \"easy.\"\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. Um, by \"easy\" I mean, how many times did I lay out a very clear, very specific set of requirements that I had of you, and where I promised that if you followed those requirements, exactly, then I would remove all my ads and I would do my best to stop Evan from, you know, attempting to sue you. Evan's, you know, in the past, he's happy now, but my ads are still an issue. And you know, I asked you to be sincere about the apology, which you never were.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. Okay, well, just to let you know, okay, well, I understand for, yes, uh, you did offer me with, you did tell me very descriptively, very detailed-ly, what you wanted, a number of times. I'm gonna est-, I'm gonna give, I'm gonna estimate like about five to 10 times at this point. Because we have not talked over the phone that much. For maybe 20, or 20 max, I'm gonna say, I'm gonna say, I'm gonna go with that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah, we've talked... Well, it's not quite that high. I think three or four times I specifically laid everything out for you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, it's, well, okay, at this point, yeah. An overbid is a good estimate.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hm. Alright, I'll give you that one. So yeah, multiple times I gave you opportunities to, you know, to handle the situation and to come out scot-free. And, if I remember correctly, I did talk about how you are the luckiest person in the world, to have competition like me, who would be so generous and go out of his way to help his competition. I mean, a lot of other companies would have just blown you out of the water and not thought twice about it. But, you know, I like Sonichu, or I used to like it, back when you actually updated it, and I know that it does have some fans still and I wanted to see it continue. Because I don't want to just take over everything. I don't want to be the only artist out there.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That's not fun. You kind of want to be the only artist in existence, I don't know why you want that. Why do you want that, anyway? Why do you not want other artists to exist?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um, I never said, I never said that I did not want other artists to...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, you said it with your actions, if not with words directly.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, okay, well, maybe...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I think we talked about that one time. Actions are louder than words, you know?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, okay, well, perhaps my actions were misunderstood in this case...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Ooh, not misunderstood in the least! Oh, no, your actions are very clear. You slandered and smeared me as much as you possibly could. You put all of your effort into trashing me rather than building up your own comic. There's... If you can convince me there's some way to misunderstand that, then you know, by all means try, but as far as I could see that was a pretty clear message. It's hard to misunderstand that, it's hard to misunderstand, you know, you repeatedly hanging up on me.\n</p><p><font color=\"#7D26CD\"><b>Barbara:</b></font> [<i>Distant background</i>] Who are you on the phone with? [<i>She continues to occasionally make background noise</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I know, I...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You've been out of commission for like three weeks, you haven't done shit for your fans. When are you going to come back with your comic?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I, I am, I, I still, I am, I have been working on my comic, for your information. I am up to pages in book number 11 where I have drawn that far, and I'm about halfway colored through all those pages which I drew up.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How many pages is that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's over 30 now.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Over 30. Really. How many days since you started that particular 30 pages? Has it been, like, what, two weeks? 15 days, around there?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Around there.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, uh... I'm not really sure if asking this is going to be useful, but why would you partially complete 30 pages instead of, say, completing and uploading 20 pages? Or 25?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That would hap-, that would happen to make up for lost time on on my birthday, which is this coming, which is the next Wednesday.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I'm sorry, what about your birthday? What are you going to do with it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm going to upload all those, all those, all those pages, all the main pages in a bundle, in a bunch, on my birthday, which is next Wednesday.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, well, until then I think I'll just keep uploading <i>Sonichu Revolution</i>, because I want to please your fans, even if you don't. Chris, why, why would you...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I gave my new, I put up a new page yesterday as well. The last page I had...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So that... That, yep, I saw that, actually, that one page, plus I think you had two pages where you killed Simonla, so that's three pages total in like three weeks.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, anyways...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I do two pages a day. That means I've uploaded, in the past 15 days I've uploaded 30 pages of my own. And it's... When's your birthday, like eight days from now? So I'll have another 16 pages up, so that's 46 pages...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, you are, you are mistaken, we're not talking about, we're not talking about eight days, my birthday is on the 24th. Of February.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh. My mistake. So six days. Well, I'll have 12 new pages by then. In addition to the 30 I've already uploaded.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I'm sorry, I didn't know when your birthday was.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, it's specifically stated on the, on my bio page on the CWCipedia, and in a couple other places. The 24th of February, 1982.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hey, Chris. Chris. When is my birthday?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't know, I do not study your bio, I did not study your bio page...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, Chris, Chris, it's on my bio page on the Asperpedia. Why wouldn't you know it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Well, I did not make an effort to study you, because...</a>\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I mean, if I'm supposed to know your page, don't you know mine? Chris, I'm kinda hurt.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, I apologize for that, and after we're done here I'll go to your bio page and learn, and learn with my mind when your birthday is.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Nah, you don't have to do that, don't worry about it. I'd rather you work on pages than go look up info about me. Because, you know, I actually don't know your birthday because I've been working on my pages rather than, you know, looking up your bio. Um, yeah, so, I do really have to recommend that you, um, begin uploading those 30 pages immediately. Like as soon as we're done with the call or whatever. It, just, get to work on it. Stay up all night if you have to. Get those pages up. Because, here's the thing about the way fans work. If you leave your fans in the dark for a week or two weeks or a month or however long, it really doesn't matter if you're partially completing something. Because if you don't put out any product, then your fans have nothing to work with. Have you ever heard of the game <i><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Duke_Nukem_Forever\" title=\"wikipedia:Duke Nukem Forever\">Duke Nukem Forever</a></i>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, I'm sorry, you said <i>Duke Nukem Forever</i>?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah. Well, you know the <i>Duke Nukem</i> video games? You ever played any of those?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, I have seen, I have seen samples of that game.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. Well, the company that made those, they were working on a game called Duke Nukem Forever. That was going to be their next great title. And they were working on that for actually about 15 years. And they kept promising, \"Oh, you know, we've got the engine built, we've got the characters designed, we've got all this built, all that's left is for us to release it.\" And they never released it because they kept retooling and tinkering with it. And finally the company actually went out of business. So now there won't ever be any other Duke Nukems. And if you keep doing the same thing, Sonichu is going to go out of business. Well, not permanently, because I have Sonichu Revolution, so it'll live on in some form.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, yes, well, your, yes, well, still, your Rev-, your Revolutions are not the original, are not the original Sonichu pages, of which only I can draw up and tell.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But what they are is existent. And the fans appreciate that. Your pages are nonexistent.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> And if you stop Sonichu, then, you know, the fans are going to want something.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Okay, well, I get, well, don't worry, you will see, you will see, all those pages, and the completion of the 10th book.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. Um, does this mean... \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> In fact, it's a...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I'm a little, I'm a little confused, how, what, do you remember when I told you... Well, of course you remember, I brought it up plenty of times, about how you really need to either do some sort of major reboot of Sonichu, or else just come up with a completely different comic? Because of all of the elements that you stole from other franchises? Are you still thinking about that? Because if you're going to finish book 10, then...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have been thinking about that, actually.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What do you think about it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Some of those, some of those changes will be talked about in the clip show that's gonna be in book 11.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um... So, is book 11 gonna be like a transition from the current Sonichu to another one?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, yes, yes, a transitions.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh. Oo-kay. Um, well, that's not really what a reboot is about. See, what you're doing, like a transition, suggests that the Sonichu that exists now is going to be, like, part of the same universe or world as whatever new Sonichu. What a reboot is, is a hard stop. You reset completely. You start over from scratch. Everything that came before is just, means nothing, it's null and void. Like, for example, the Spider-Man movies, they aren't in the same world as the comic, they were sort of a reboot. Because they told everything over from the beginning.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. I see. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah. I mean, I know it's... I can sympathize with you on this. I mean, you've been working on Sonichu for 10 years now, and the thought that you have to abandon it completely and start over with something new, I understand that that's kind of a scary thought. But it is true.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Have you, have you, uh... What do you think of Sonichu Revolution, by the way? Have you been reading it? I'm only like seven pages in right now, so...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have taken a look at it, and I did not like the way you were killing characters left and right! That's no good, it's just terrible! Don't go killing, don't go killing, don't go killing characters, that just does not, that just, that just does not, that just does not work. It's like...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's like doing Zombie X-Men, <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Marvel_Zombies\" title=\"wikipedia:Marvel Zombies\">Marvel Zombies</a>.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah. I remember that. That was actually a pretty popular comic, wasn't it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's actually on the <a href=\"/cwcki/PlayStation_Network\" title=\"PlayStation Network\">PlayStation Network</a> digital comic download, only on the <a class=\"mw-redirect\" href=\"/cwcki/PSP\" title=\"PSP\">PSP</a> right now.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, I've seen it in stores, though. Well, it was pretty popular, was my point.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Anyway, that's, anyway, that's the point. That's still, like, you know, killing, you're just like killing everybody left and right. It's not...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, um, how many, how many comic books and TV shows and movies and, you know, whatever other media have you seen where characters die? Do you think they're all bad?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, well, well, yeah, they are bad, because that's just totally sad. And plus, to do it in such a gory way is just terrifying. It's like any, it's like any of the <i><a href=\"/cwcki/Saw\" title=\"Saw\">Saw</a></i> movies. It's especially like, especially like the first trap in <i><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Saw_VI\" title=\"wikipedia:Saw VI\">Saw VI</a></i>.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Did you like those movies?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That was horrifying.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Did you like those movies, Chris? The <i>Saw</i> movies?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I liked them, I mean I enjoyed the falling, the telling...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>talking over Chris</i>] You liked them? But there's death in it! How could you like a movie that has death in it, Chris?! Death is bad. You said death is bad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, I'm not talking about...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Death is bad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm not saying, I mean, yeah, I'm not talking about the death part, I did not say I liked the death parts, I liked the building of the character of John Kramer. In the movies.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But the point is, you still liked the movies overall, right? I mean, you went to see them, you'd probably see them again?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I mean, yeah, they were hor-, yeah, I mean, I will admit they are horrifying, and they do frighten me, but think about, but think about, think about...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hence the genre, horror, if it's horrifying it's doing its job, I guess.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. Yeah, but I mean, still, that's Hollywood magic, you know, that's, you know, the people, the actors in those movies are still, are still alive and well, they just...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh, well, right, I forgot, <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_2\" title=\"Alec Benson Leary Phone Call 2\">because comic characters are real people</a> and apparently I'm guilty of, of multiple homicide now? Chris, you, remember when you killed <a class=\"mw-redirect\" href=\"/cwcki/Simonla\" title=\"Simonla\">Simonla</a> because we strong-armed you into it, because you refused to do it willingly? Are you guilty of homicide now? Because you killed Simonla?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, actually, that would, actually, you could blame the Voltorb that was placed by the toilet, placed by the toilet that exploded. Because the Voltorb exploded, it blew up the...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, you drew the Voltorb. You drew the Voltorb! Chris, you knew Simonla was going to die! You knew there was going to be a Voltorb there and you did nothing to stop it! You are an accessory to murder! Who cares if someone else placed it? You knew, of course you knew she was going to die because I've been telling you for weeks to kill her.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're, you're, well, read, yeah, well, read the pages after I put 'em, after I put 'em all up and you will see that there is, that there was, that it wasn't preventable. That there was a way that, it could not have been prevented. You will find out.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, um... Did you see my page where <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">Son-Chu</a> killed himself? Did you see how depressed he was? I couldn't have prevented that. Sometimes people are so depressed that you just can't reach them. And it's tragic but, you know, sometimes people commit suicide because they believe there's just no way out for them.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have a question for you. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You said you like Sonichu.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Why did you make him, why did you draw him killing himself?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Soni-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> If you liked him you would not have done that!\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I didn't draw Sonichu killing himself. I said Son-Chu, your car, your... I don't want to say \"Autobot\" 'cause that's trademarked, but...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, it's, excuse me, well, I misunderstood. Well, yeah, that was, that was wrong. I mean, that was like you're killing my vehicle, it's like you're making me have to pay, like... \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>cutting off Chris</i>] No, Chris, I didn't kill your, I didn't kill him. He committed suicide. He was depressed because he had a name that he hated, and all the other Autobots made fun of him.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, the Autobot, the Autobots do not make fun of each other for their names.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No, they make fun of Son-Chu. Chris! Look at what he says in that page! He says that he hates his name because it's not a strong, manly Autobot name. Why would he lie?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, it's only because you're, you're putting...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> He had nothing to lie about, he had nothing to lose. He was gonna kill himself.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, I did not, I'm not the one that drew, that drew my car, my Autobot, to say that. I did not.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah, but I did.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You did that, pretending to be me, in a sense.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I wasn't pretending to be you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You were pretending to be...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, look up at the page. Do you see on the comic page where it says \"Copyright 2010 Alec Benson Leary\"? I'm pretty sure that shows that I was not pretending to be you. I was actually trying to... [<i>Chris talks over him</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, still, you have no right, you have no right in killing a character that was originally mine, and that I have never said, have never said personally, had died. When a character dies, I will let every, I will let everybody know myself. Anybody else who, who makes up, who says outside of my jurisdiction, it's just a whole bunch of bogus baloney.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, maybe I can say it's a parody, and that'll make it okay, right? If Sonichu Revolution is a parody? Would that be okay?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> It would?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I would accept that, yeah. And plus, don't make them so big. Maybe like three quarters of the current size, three quarters. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No. Nah. Then no one can read the text. I'm not gonna make it smaller, it's kinda hard to read the text already.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You should have those pages on your Asperpedia! People could just go over there and read them for themselves.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, but the whole point of Sonichu Revolution is to make up for your lack of updates. Why would I put it on my Asperpedia? That defeats the purpose. I, I'm...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But, but you're just...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I'm keeping the fans there for you, Chris!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because you're drawing...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You could thank me once.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because you're drawing those pages, not me.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah, that's right, I'm drawing the pages. You're not drawing anything. Or you say you are, but we have no proof.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am, I, you're wrong, I have been drawing the pages, and I have been coloring them.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But you're not uploading them.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because I have, because I'm too busy working on the, working on coloring after I have drawn them all up! And plus, I have real life things, like I have to go hang, like I have to hang out with my family. I have errands to run...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>cutting him off</i>] Chris! Take a guess, right, I want you to guess...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And plus...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Between, Chris, no, Chris! I want you to guess, between one and 10, how many hours did I spend in school yesterday? Take a guess, right now.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> How many hours you spent in school yesterday...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yes.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> The average of 10.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That's right. I spent 10 hours in school yesterday. I also uploaded a page of Sonichu Revolution yesterday.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>heavy sigh</i>] Well, what about your job? You have your job as well.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah. What about my job? I upload pages while I have a job and school. So what about my job?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, you got all your, you're spending your time there as well.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yes, that's correct.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, okay, well, I admit, <a href=\"/cwcki/Autism\" title=\"Autism\">I'm not sure really what the point I was trying to make there</a>, I lost my train of thought.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, well, yeah. It's true that, yes, I spend a lot of time in school, and a lot of time at my job. And I, you know, and I have errands too. Not really for my family, I don't live with my family, but I do errands on my own. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Alright. Well, okay, well...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How much time... You've mentioned that several times, that you have to run errands for your family. Like, what do you have to do for them? What did you do yesterday? What... How... Like, are they having you break rocks with sledgehammers or something all day? Because you say it's like some huge, serious thing.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, they're old. I have to do chores for them. I have to do chores for them around the house. Like I had to even, I even shoveled snow to get the, to get the, to make a path for them and get the cars out. And my, and my car, it was stuck in, two front tires were stuck in their own dug grooves, and we finally, and finally got the car out of those two grooves today.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So you've, like, been working on that solid, non-stop, just digging your car out? [<i>pause</i>] I mean... I live in Minnesota, you know, we get some bad snowstorms sometimes, and my car will just get completely buried in snow. And it...it might take me, like...in the worst-case scenario of storms, it might take me half an hour to dig enough snow out for my car to move. We usually don't get that much snow, though.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Wha-are-you said some chores around your house, too, like besides shoveling. What else do you have to do?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I clean the kit-, I clean the big kitchen, I do the, I vacuum, I move stuff around, I...clean the bathroom as well, I do a lot of things around the house.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You kind of sound like you're talking to someone who has not seen that video <a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">tour of your house</a> right now. And I want to let you know that I actually <i>have</i> seen it, so I'm pretty sure...that house is..... [<i>Alec is interrupted by a rapid series of DTMF tones. Decoded so far: 3125632589632145896321258624231561523635832147413663574147236464</i>] Chris, can you hear me? Hello? Chris, are you pressing buttons? [<i>tones end</i>]\n</p><p>[<i>Note: Even though these calls are in one file, according to <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>, Chris actually hung up on Alec at the end of the dial tones. Alec promptly called him back.</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hey, Alec?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hey, hey Chris, did we get disconnected there?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a class=\"mw-redirect\" href=\"/cwcki/Lies\" title=\"Lies\">Yeah, 'fraid we did.</a> It happens to me, between me and my, uh, gal-pal as well, in our conversations sometimes. Reception goes bad during this time of night.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh, okay. Well, uh, glad I got you back. Okay, well, we were talking about, uh, the chores you need to do, I think, in your house. So you're saying you clean your house up?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Uh, okay, um... Have you cleaned your, cleaned your room at all?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, I do clean my room.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Mmm, how much do you clean it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I clean my room like once a week.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Really.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> O-kay. So, how long does it take when you do that? Because if you do that once a week, that's just, like, maintenance, shouldn't take too long.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It takes like two hours.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Two hours. Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um... How long does it take you to clean the rest of the house?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It takes me, it pretty much takes me one to two hours per room.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hm. Okay. Like, what do you do when you clean? What specific stuff do you do?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I move this, I move stuff around, I take the vacuum cleaner, I vacuum, I take, I scrub the floors with 409 and paper towels. It's really hard work, back-breaking!\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Back-breaking.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. My back hurts.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I hope you don't mean... Your back hurts from cleaning?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, after extensive long time, I mean, sure.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I thought you, I thought you were strong, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, <a href=\"/cwcki/I_AM_STRONG\" title=\"I AM STRONG\">I am strong</a>.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Why would your back just... How strong are you? Like... Because it seems the videos...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Believe me, I'm very strong. Believe me, I'm very strong.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Really. Like... Uh...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Anybody, anybody, anybody will tell you that, like, yeah, they, they just feel like they break their backbones after, after a very extensive time scrubbing the floors, getting up and down, as well.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You should get a Swiffer. Swiffer Wet-Jet, because then you can stand while you're scrubbing the floor. I use it, it's really useful.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> It's quick, too.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, we don't have it, we don't have that here.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Huh. Maybe you could sell some of those video games like I was talking about. Then you could afford one. Have you thought at all about selling any more of your, your games, Chris? Because...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, I have no plans, I have no plans of that at the moment.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Why would you want to hold on to video games that you don't play anymore?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I do play them, when I feel nostalgic...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> ALL of them? Chris, you've got... How many <a class=\"mw-redirect\" href=\"/cwcki/List_of_Chris%27s_games\" title=\"List of Chris's games\">hundreds of games</a> do you have? And you play all of them regularly? Is that what you're telling me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] Regularly, like... Yeah. Every, like, uh, I'd say, yeah, on a regular basis I do.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Every single one.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah!\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That must take, that must take a lot of time. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Is video-game-playing back-breaking too? Just out of curiosity? I wouldn't think it would be. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, no, but it's one way for me to relax after I, after I have done the work of cleaning the room. Or shoveling the snow in the yard.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, but you only clean once a week, and shoveling, that doesn't happen all the time. I know Virginia got a snowstorm recently, right, but that was kinda like a one-time thing. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's, well, okay, well, just to correct you, I was not talking about cleaning period once a week, we're talking about cleaning my room once a week. And, and then, we have other, then, it's like, on another day I'll clean up the kitchen, and on another day I'll clean up the living room, on another day I'll clean up the, I'll clean up my parents' bedroom...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, I've seen the video tour of your house.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's like, that was, that was like, that was like over, that was like over a year ago.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Over a year ago. You really... You should film a new tour, then, actually, because people still think that your house is, you know, a mess like that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll think, well, I'll consider that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You really should, you know. It would be a good idea. Chris, here's, okay, here's what I don't get about you. There are so many things, like, you know, if your house is clean, you could just make a video and show people that. And if you've really been working on the pages, you could just upload them. And if, you know, if you wanted to prove to people that you have <a href=\"/cwcki/Nintendo\" title=\"Nintendo\">Nintendo</a>'s permission to use <a class=\"mw-redirect\" href=\"/cwcki/Pikachu\" title=\"Pikachu\">Pikachu</a>, shit like that, you could just show them the letter that Nintendo sent you, that gives you permission. Why do you, why do you take the hard way through everything? Why do you want to keep receiving, you know, demands and questions about this and that subject when one little action on your part could just stop all of it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because for me it's not all that easy.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What's not easy about it? Like, okay, the Nintendo...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because, I'll, I'll just, also <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">my father</a>'s <a href=\"/cwcki/THAT_IS_MY_HOUSE\" title=\"THAT IS MY HOUSE\">still very angry at me</a> for doing the video touring the house over a year ago. And he's making me all mad, he's very angry...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Why, why, why was he angry about it? Just refresh my memory.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's like an invasion of privacy?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How is it an invasion? You live there, I mean, it's your house, if you choose to upload a video, that's not an invasion of privacy. If you <a href=\"/cwcki/Mailbag_31#In_which_Chris_crosses_yet_another_line\" title=\"Mailbag 31\">try to videotape people without their consent</a>, that would be an invasion of privacy. But I don't think your parents were in that video.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You don't, you don't, you don't understand, I, and I forget all of the details my father said, but he's still very angry at me for doing, for having done that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Alright, well, I guess if you say he's angry then okay, that's that, but... Um, what about, um... Well, like the Nintendo thing. Couldn't you... Did Nintendo, like, write you a letter saying, you know, yes, go ahead and use Pikachu? Couldn't you just scan that and show that to people? 'Cause everybody...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I misplaced the letter.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You mis-, you misplaced it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I misplaced the letter. Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That seems like a really important thing, how could you misplace that? And if you clean your house so regularly, I mean, it seems like you would find things that you had lost regularly.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. It takes, yeah, moving, moving stuff, if I had, I had, I regularly look at stuff, and that, and it got misplaced that way.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I'm sure you could just actually call up Nintendo, because... I mean, that would be... You know, the legal department of a company keeps records of everything they do. They would be happy to just fax you or send you another copy of the letter.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll keep that in mind.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Businesses lose papers sometimes, and you know, that's why there's redundancy, that's why. And not only your fans, you know, but if you showed that letter publicly, then I couldn't demand that you admit Sonichu's a doomed franchise, now, could I? You wouldn't, you wouldn't even have to do the reboot? I mean, think about it. If either you, you know, reboot your entire comic that you've been working on for 10 years, that's one choice, or your other choice is, you just call up Nintendo and ask them to send another letter, and show it to everyone.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Destroy 10 years of personal hard labor, or show a letter.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright, well, I will think, I will, I will look, I will look into that later.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, okay. Um, this is reminding me of... In your recent, where you started updating the Mailbags again, um... Let me take a look at a Mailbag, because I don't remember the exact phrase, but... You responded with kind of a stock phrase to a lot of letters. Let's see here. Um, where is it. Ah! \"Your letter has been read fully and your thoughts have been in-pyoo-ted...\" I guess inputted. \"And accepted for better improvement. Thank you for your time and efforts.\" Chris, you spend even less time responding to these e-mails than you do normally. What's up with that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, for your information I actually read, I actually read and re-read each letter before I make a final response.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But your final response is, is not thought out at all. See, this is kind of an interesting parallel to your comic work, because you say, you say that you...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, yeah, well, there are points where, there are points, there are points where I don't...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>trying to interrupt</i>] Chris, Chris, Chris. CHRIS. CHRIS! Let me talk, and don't interrupt, alright? I will let you speak after I finish this sentence. This is how it goes. One person speaks, the other person responds, the first person is... Okay. Um, you say that you spend a lot of time \"reading and re-reading\" and really considering the letters, but when it comes time for the final step, which is, you know, the response, you don't really put any effort into that. And that's an interesting parallel to your comics, because you say you spend a lot of time drawing and coloring and, you know, preparing your pages, but that final step, uploading them, you don't put any effort into that. So it seems... It kind of sounds like you go 90 percent of the way, but you don't actually finish that crucial last 10 percent. And just to let you know, people are mad about this stock response that you made. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, when it comes to the Mailbag, it's just that, you know, even after re-reading it, I still cannot, I still could not come up with an appropriate response. So I had to go with a neutral response.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Why... What do you mean, you can't come up with a... There's a lot of different subjects to these letters, and you give the same neutral response to every one. Are you telling me that all of these subjects, you really can think of absolutely nothing?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> There are a few subjects on which I come up blank! Yes. I'll admit that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay. Um... Like... Um, someone wrote you a letter about your comments about homosexuals being bigoted and offensive, and you gave the stock response to that. Um, that seems like a huge Achilles' heel with you, is if people mention the word \"homosexual.\" Your mind goes blank.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, yeah, of course, I could not think of an appropriate response to that letter.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> \"Your comments...\" I'm reading the letter right now. \"Your comments on homosexuals are bigoted and offensive. You want them to die in explosions. You want a vaccine for them, just because they tick you off...\" Um, the last two parts, those are actually very clear questions, as far as I can see. Like, if someone asked me those questions... If someone asked me, \"Do you want homosexuals to die in explosions?\" I would tell them, \"No.\" If someone asked me, \"Do you want a vaccine for them just because they tick you off?\" I would explain, \"No, homosexuals don't actually tick me off, and I would never want to vaccinate them.\" I just came up with that right now. That would be my response if such a question was asked of me. And that's not even that long of a response. You don't need a page worth of response.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, plus, plus I perceived that, because I perceived those statements as insults, and...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh, so we're back to everything is an attack on you, this... Remember when you thought that my ads were an attack on you? So now someone... So, so you thought my ads were an attack on you, now this homosexual thing, um, you've made plenty of offensive comments about homosexuals, which they could, and plenty have interpreted as attacks by you. And so when someone asks you about them, how is that an attack on you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> They said when I, it was an e-mail, and that's in that where you just read about it, they called me bigoted.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That's because you <i>are</i> bigoted. You want... \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am not bigoted.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You hate homosexuals. How many, how many times...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I actually said that, actually I have, actually, thanks to <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a> I recently, I have, I actually see them in a more positive light! It was, I think it was...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Is that the same Jack Thaddeus that is an evil villain, that does underhanded deals for ad space?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, you kinda flip-flop a lot. No, forget what I said. Um...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, well, well, for your information, though, specifically, Jack Thaddeus has told me about, uh, homosetts-, about homosexuals from his point of view and how that they would never, they would never make any actions towards me because I'm not even try-, I'm not even that attractive to him. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You know, Chris...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Attract him. 'Cause he's a homosettsual.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Uhh-huh. You know, um, I've actually been hit on, I've been hit on by homosexuals, once in a while. It happens to me in my life.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oo-kay.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> It's, I never got ticked off by it, I never saw it as offensive. I mean, I'm, I'm not gay, so I wouldn't really be interested, but if, if someone, man or woman, thinks I'm attractive, then, you know, well, it's flattering. Even if I'm not interested. Why would you think it's an attack if a gay person finds you attractive? I take it as a compliment that people think I'm attractive.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. Well, it's, yeah, well, still, I mean, if I was, well, okay, well, if a homosexual came up to me and flirted with me like that, I wouldn't, uh, no, no, I would let them know that, no...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That you're not interested?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And, yeah, I cannot accept your, I cannot accept that because I'm not interested, I am straight, nnn...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, well, that's...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And then leave it at that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That sounds, yeah, that sounds like a good...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And then, then, if the, and then if the guy continued to, continue on like that after the warning, then I would get really mad.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, that's understandable. And you know what? That happens, not just with gay people. I mean, straight people, plenty of straight people have trouble getting a hint. I mean, you know, guys, all the time, there are guys who, you know, hit on a girl, and she says, \"No, thank you, I'm not interested\", and they just keep pressing the point. <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Overstepping their boundaries</a>. <a href=\"/cwcki/Kacey\" title=\"Kacey\">Trying to hold their hands, things like that</a>. That is... You know, in a situation like that, it's perfectly acceptable to get offended if they don't respect, er, if they don't respect your, um, your decline. Your negative response. You see? Um, but I... When, when did you talk to Jack about this, this homosexual thing? When did you have that conversation?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It was about, it was like over a, it was like over a week ago.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> When did you answer Mailbag 52? Pretty sure it was less than a week ago, wasn't it? Because if your issues with homosexuals are resolved now, then why couldn't you offer a simple response to that? Okay, here's what you could have said. Um... Well, just to be clear, do you still want a vaccine for homosexuals?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>long pause</i>] Uh, I'm sorry, I did not understand, I do not understand that. Could you repeat that please?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>slowly this time</i>] Do you want to create a vaccine to eliminate homosexuality?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] Hmm...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Do you understand that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Honestly... Yeah, okay, yeah, I understood that. So yeah, you're asking me that right now. Or are you, or are you just, I mean, uh, okay.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah, I am asking you right now.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay. [<i>pause</i>] In an attempt to make a better world, a better world, I would support it. I would support that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oooo-kay, so, when you said that you don't have problems with gays anymore, that wasn't actually true. Chris, well, like I said, I'm not gay, but I have a number of gay friends, um, a few family members that are gay, and it's part of who they are. That's part of their identity. Why would you want to take that away from them? What, what about removing homosexuality would make the world a better place?[<i>exasperated sigh</i>] It shouldn't be that hard, Chris, because you already, um, established a predicate that \"no gays equals the world is a better place.\" So, having said that, that must mean that you do have an idea of how the two things are connected.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh... Well, what two things?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, do you... Do you understand the words that are coming out of my mouth? Chris, you said, you said \"no gays equals the world is a better place.\" That, \"no gays\" is point one. That connects to \"world is better,\" point two. How do those connect? What is... Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ah, okay, okay, okay, okay, well, yeah, okay, now I get it, I mean, it's just that, you know, uh, <a class=\"mw-redirect\" href=\"/cwcki/Lies\" title=\"Lies\">I'm getting an incoming call right now</a>, and, uh, taking it will interrupt this conversation...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, you should probably ignore it. Yeah. Um, so please...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's like, hard to, though, it cancels, it cancels your, it cancels your vocal input out at that point when the...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, did you... Yeah. Did you hear my point, though? Please explain how no gays equals world's better.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>long pause</i>] You know, okay, well, I'm not necessarily saying... I'm not saying that as in reference to them as people. I'm saying that in reference, and like...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, removing, removing homosexuality equals a world better. Explain that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because there will be less risk of those people going... to... hell.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Hell?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. When they die.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What do you... Oh, you mean instead of heaven?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So you're saying gay people go to hell? Um, so are you, you're a Christian, then? If you believe that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What, um, like... You know, it's been a while since I've read a Bible, where in the Bible is that whole gays-go-to-hell thing?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's implied within parts of the Bible.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, it's, understandably it's implied in parts of the Bible, I'm asking where. I'm not a Christian, so I don't have to read the Bible, but you're a Christian, when's the last time you read the Bible?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I have read the Bible, but...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You're sitting here judging people based off their sexuality without even knowing, like, you know, what parts of the Bible... Hey, hey, um, <a href=\"/cwcki/Chris_and_religion#Chris_the_Shaman\" title=\"Chris and religion\">you know what else the Bible condemns? Black magic</a>.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>long pause</i>] So?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How many times have you tried to curse people? Cursing is black magic. <a href=\"/cwcki/Curse-ye-ha-me-ha\" title=\"Curse-ye-ha-me-ha\">Curse-ye-ha-me-ha</a>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. I get it. It get, I get what you're saying right now.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So you're going to hell, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>heavy sigh</i>] Well, I'm making, I'm making atones for that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Uhhhh...are you? Really?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, you... I asked you to give Mao a Forgiveness Blessing, that was the most lackluster one I've ever seen you do. Do you believe that black magic, uh, works, Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> There's a po-, there's a chance that it can, but...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, not if you're Christian. Because the Christian God says that all magic and supernatural stuff that doesn't come from God is false.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>] Hm. I, I have no comment to that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, well, um... Let's go back to the gay thing, because, you know, we've established that you don't really know a whole lot about the religion you claim to believe in.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> So I would, I would, um, when you're in the absence of important information like that, I would think, just go with what you know. Go with what you see. And by that I mean, you know, you've never been attacked by a homosexual, they've never done anything evil to you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] <a href=\"/cwcki/Nathanael_Greene_Elementary_School\" title=\"Nathanael Greene Elementary School\">Actually, yes, I was abused by one!</a> A homosexual principal at my elementary school, slapped me on his lap, said some offensive, said some offensive things to me, and I felt uncomfortable, so I jumped off his lap and hid under his desk.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> What did he say to you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't 'member, I don't remember what he said to me, but they were offensive.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, so... Okay, well, there are bad gay people, just like there are bad straight people. Um... So, one gay person did something bad to you that you don't really remember, therefore all gay people are going to hell? Is that the logic you're doing there?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, more or less.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> How many... Okay, so, I should condemn all straight people because you've been horrible to me. You've said a lot of bad things to me, you've threatened me. Maybe, or, not just straight, maybe I should condemn autistic people, because you identify with autism a lot and you've been a very bad person in most of our dealings.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Are all autistic people, um, really selfish and demanding and...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>] No. Not all of them are.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But all homosexuals are bad? Because you had one bad experience? That's a double standard.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, I, okay, well, okay, well, they're all not. [<i>sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well. You know, I'll wait to see if you really stick to that belief or not, I guess. I mean, I guess it's good that you're saying it now, but... Why do you sigh so much?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, I'm a little tired right now. I had to, I actually cleaned more, I cleaned the kitchen again today.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> <a href=\"/cwcki/Biological_clock\" title=\"Biological clock\">Don't you usually stay up to like 4:00 A.M. or something</a>, you said? This is kinda like the middle of the day for you, isn't it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, this is not the middle of the day for me, this is the middle of the night for me.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But... Okay, you said you sleep until like noon, right? And then you stay up 'til like three or four at night. That's kind of a, that's a really weird schedule, by the way.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but actually, late-, actually I am, I'm mostly going to bed before midnight and I get up at like 9:00 A.M.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Oh. Well. I actually go to bed, like, around 11, so I'm closer to my bedtime than you are to yours, but I feel fine. We all get tired, but...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Anyway...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Um, what do you think of... Let's see here...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>long pause</i>] Um, oh, here's another good question. When someone asked you about the Mailbag that you fabricated, and you gave them that stock response again. I just, I really want to see you actually... My, my main goal right now is I want to see you put real effort into your Mailbags. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I will... I put as much effort as I could, but it's, you know, sometimes I do come up blank, and that cannot be helped.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, you're... I know you've said plenty of times, you're a pretty smart guy, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but sometimes I'm quick, sometimes I'm <a href=\"/cwcki/Slow-in-the-minds\" title=\"Slow-in-the-minds\">slow</a>.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Why?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It just happens! I don't know why. It's my head. I'm not a psychiatrist. A psychologist.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You don't have to be a... You... You remember that <a href=\"/cwcki/Mailbag_52#This,_if_anything,_requires_a_canned_response\" title=\"Mailbag 52\">Mike Jackson memorial e-mail</a> you got here? You used the copy-and-paste response on that too.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>heavy sigh</i>] Yeah, well, I didn't know who that was, I didn't realize that that was the, uh, that was a guy that, that went out, and that moved out when their, the prostitute did. Lose him. And I apologize...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> I thought that you, I thought that you said that you spent a lot of time reading and carefully re-reading these e-mails. How do you not know the basics of what it's about?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, I miss a detail or two sometimes, it happens to a lot!\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You missed all the detail, Chris! You missed all the detail.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, I thought they were talking about Michael Jackson, the pop star.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Maybe if you'd read the e-mail you would've, you know, seen that that wasn't the case? Did you even look at that memorial? Chris, do you...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I can say I have not looked... I did not...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> <i>Chris</i>, why do you not put effort into <i>anything</i>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sudden anger</i>] <b>I DO PUT EFFORT in every-, in everything!</b>\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Everything?! No! I told you that your website was going to get taken down because of a lawsuit over a stolen character, and you did nothing. Y'know, I tell you you gotta upload pages and you do nothing. I tell you you gotta respond...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <b>I am, I am working on the pages...!</b>\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> But you don't upload them!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <b>Yes I will, yes I do, and I will!</b>\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No, \"will\" is different from \"do.\" \"Will\" is the future tense, and it hasn't happened yet.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>angry sigh</i>] I'm getting tired, I'm getting tired of this. You're raising your voice at me, I'm not, and I'm not, I don't appreciate it. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, I... I think I kind of, I'm just trying to enunciate a point, I'm trying to get you to respond. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Chris, um... A person raising their voice, that really is enough to just, you know, completely discombobulate you? Besides, you yelled at me first.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, you raised your voice at me first.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No. No. I asked you, \"Chris, why do you not care about anything? And you screamed, \"I DO CARE!\"\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're being, you're being, you're being ridiculing to me. \n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Uh, is that the pot calling the kettle black? Chris, I want to, I want to understand why it is okay for you to do so many things to other people that make you mad when they do them back to you. Please, I'm asking you a simple question. Please explain this to me. Why is it that any level, any tiny level of stress or inconvenience, and you immediately will fall back on, you know, you're being attacked, or you're being, you know, your world is...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It just happens, espec-, it just happens, especially when I'm tired.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No. That's not an excuse. That is not an excuse. That's an excuse that a child uses. Children complain that they have to do a little bit of hard, you know, work, or deal with unpleasant situations. Honestly? I have been very polite with you, Chris. I don't swear at you, except, you know, on a few occasions where you really piss me off, but for the most part I don't. I don't yell at you, I raise my voice in response to you raising your voice. I'm trying to help you, I'm trying to talk to you like an adult. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, well, I'm just tired right now.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>snorts</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And you know, considering your bed at 11:00, uh, you probably want to finish this up, want to wrap this up as well. So I...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> No, I'm doing good.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Let's just that, let's just agree that, uh, I will be uploading the pages, and uh, what you got, perhaps, perhaps after book 10 is completed, uh, we could, uh, actually, you know what...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Well, you know what? If you want to...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Don't worry about the ads, don't worry about that, uh, ad space at this point. I'll just agree to that, but, uh, but, yeah, but you know...\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>talking over Chris</i>] Please, Stop, Running, Away from me, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What?\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Please stop running away from me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/Autism\" title=\"Autism\">I'm not running away from you, I'm right here.</a>\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> [<i>snort</i>] I know you're not literally running away, but you're trying to end the conversation because I'm making you feel bad. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>heavy sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> And it's not even because I'm attacking or insulting you, I'm just presenting, you know, a few things that are very minorly unpleasant. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. Okay, well, with that, uh, sometimes, there are things that, yeah, we don't, we generally, we would not prefer, we would prefer the opposite of unpleasant.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You seem to prefer the opposite of unpleasant literally all the time.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>heavy sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Any little bit of stress and you run for the hills. You avoid anything unpleasant, even, even in cases where dealing with a small problem now will avert a very big problem later. You always choose the hard way, you choose to deal with the big problem that you could have avoided. Bad news is gonna happen, Chris, life is not all fun and games.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I'm sure, well, I'm sure that that's happened to you and you actually had to do that as well.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Yeah, but then I turned 10 and I started learning to get over it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>]\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Man the fuck up, Chris. Pardon my language, but...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, well, I get, I get, and I said that.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> You're gonna have to show that with your actions, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. And I will.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Do you believe that we, um, could ever be friends, Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] Maybe.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Maybe?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Okay, well, you gotta start listening to people that are trying to help you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am open to, I am open to opinions and thoughts when they are presented in a non-condescending, uh, appro-, acceptable tone, or, or whatever.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> That's what you always say, but you never act on them. I'm showing you things you haven't done, and you still don't do them. Because I've done this with you several times.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm. Yeah. I will, listen, I gotta go, I'm really, seriously, I'm feeling really sleepy right now.\n</p><p><font color=\"#04B45F\"><b>Alec:</b></font> Alright, well, have a good night. Maybe I'll talk to you later.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright. Take care. Bye-bye.\n</p><p>[<i>Call ends</i>]\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"> <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">Chris and Alec Call 7</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/Alec_Benson_Leary_calls\" title=\"Alec Benson Leary calls\">Alec Benson Leary calls</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_9\" title=\"Alec Benson Leary Phone Call 9\">Chris and Alec Call 9</a><span style=\"color: #000\"></span> \n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"External_links\">External links</span></h2>\n<ul><li><a class=\"external text\" href=\"https://docs.google.com/open?id=0B6mRSOBYFcaBY2M3SW5ybWg0Q2s\" rel=\"nofollow\">The original audio</a></li>\n<li><a class=\"external text\" href=\"https://www.youtube.com/watch?v=nKZogX_Q0BY\" rel=\"nofollow\">YouTube version</a></li></ul>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"50%\">\n<tbody><tr align=\"center\" style=\"background:#FFFF00\">\n<td colspan=\"3\"><b><a class=\"image\" href=\"/cwcki/File:Asperchu_saga2.png\"><img alt=\"Asperchu saga2.png\" decoding=\"async\" height=\"32\" src=\"/w/images/e/e8/Asperchu_saga2.png\" width=\"32\"/></a> <a href=\"/cwcki/Asperchu\" title=\"Asperchu\"><span style=\"color:black;\">Asperchu Saga</span></a> <a class=\"image\" href=\"/cwcki/File:Asperchu_saga2.png\"><img alt=\"Asperchu saga2.png\" decoding=\"async\" height=\"32\" src=\"/w/images/e/e8/Asperchu_saga2.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<th align=\"left\">The Players:\n</th>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a></li>\n<li><a href=\"/cwcki/Alec_Benson_Leary\" title=\"Alec Benson Leary\">Alec Benson Leary</a></li>\n<li><a href=\"/cwcki/Evan\" title=\"Evan\">Evan Christopher George</a></li>\n<li><a href=\"/cwcki/Mao_Ling\" title=\"Mao Ling\">Mao Ling</a></li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/Sean_August_Watley\" title=\"Sean August Watley\">Sean August Watley</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a></li>\n<li><a href=\"/cwcki/Asperchu/Background\" title=\"Asperchu/Background\">The Comic itself</a></li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/Asperpedia\" title=\"Asperpedia\">Asperpedia</a></li>\n<li><a href=\"/cwcki/Alec_Benson_Leary_calls\" title=\"Alec Benson Leary calls\">Alec Benson Leary calls</a> (<a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_1\" title=\"Alec Benson Leary Phone Call 1\">1</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_2\" title=\"Alec Benson Leary Phone Call 2\">2</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_3\" title=\"Alec Benson Leary Phone Call 3\">3</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_4\" title=\"Alec Benson Leary Phone Call 4\">4</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_5\" title=\"Alec Benson Leary Phone Call 5\">5</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_6\" title=\"Alec Benson Leary Phone Call 6\">6</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">7</a>  <a class=\"mw-selflink selflink\">8</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_9\" title=\"Alec Benson Leary Phone Call 9\">9</a>)</li>\n<li><a href=\"/cwcki/Moon-Pals\" title=\"Moon-Pals\">Moon-Pals</a></li>\n<li><a href=\"/cwcki/Alec_Q%26A\" title=\"Alec Q&amp;A\">Alec Q&amp;A</a></li>\n<li><a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">Sonichu 10</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/12_January_2010\" title=\"12 January 2010\">12 January 2010</a></li>\n<li><a href=\"/cwcki/Down_with_Asperchu\" title=\"Down with Asperchu\">Down with Asperchu</a></li>\n<li><a href=\"/cwcki/U8C43P2A37A8_y_U8C1N023V0L\" title=\"U8C43P2A37A8 y U8C1N023V0L\">U8C43P2A37A8 y U8C1N023V0L</a></li>\n<li><a href=\"/cwcki/Asperchu_is_a_Horrendous_Joke\" title=\"Asperchu is a Horrendous Joke\">Asperchu is a Horrendous Joke</a></li>\n<li><a href=\"/cwcki/Address_to_Mao,_the_S.O.B.\" title=\"Address to Mao, the S.O.B.\">Address to Mao, the S.O.B.</a></li>\n<li><a href=\"/cwcki/9_February_2010\" title=\"9 February 2010\">9 February 2010</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"3\"><b>Coinciding Sagas</b>: <a href=\"/cwcki/Template:CWCipediaSaga\" title=\"Template:CWCipediaSaga\"><span style=\"color:#C0C0C0\"><b>CWCipedia</b></span></a>\n</td></tr></tbody></table>\n<center><b>Chats and calls</b></center>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Classic_Chris_era&amp;action=edit&amp;redlink=1\" title=\"Template:Classic Chris era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Classic_Chris_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Classic Chris era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Classic_Chris_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Classic_Chris_Era_(27_October_2007_to_20_March_2010)\" title=\"Saga\">Classic Chris era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Sonichu_(IRC_chat)\" title=\"Sonichu (IRC chat)\">IRC</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b><a href=\"/cwcki/2008\" title=\"2008\">2008</a>:</b> <a href=\"/cwcki/IRC_(16_October_2008)\" title=\"IRC (16 October 2008)\">Oct 16</a>  <a href=\"/cwcki/IRC_(24_October_2008)\" title=\"IRC (24 October 2008)\">Oct 24</a>  <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_Sonichu_IRC_Chloe_Introduction\" title=\"Chris's Sonichu IRC Chloe Introduction\">Oct 26</a>  <a href=\"/cwcki/IRC_(26_November_2008)\" title=\"IRC (26 November 2008)\">Nov 26</a>  <a href=\"/cwcki/IRC_(13_December_2008)\" title=\"IRC (13 December 2008)\">Dec 13</a>  <a href=\"/cwcki/IRC_(15_December_2008)\" title=\"IRC (15 December 2008)\">Dec 15</a>  <a href=\"/cwcki/IRC_(17_December_2008)\" title=\"IRC (17 December 2008)\">Dec 17</a>  <a href=\"/cwcki/IRC_(18_December_2008)\" title=\"IRC (18 December 2008)\">Dec 18</a>  <a href=\"/cwcki/IRC_(22_December_2008)\" title=\"IRC (22 December 2008)\">Dec 22</a>  <a href=\"/cwcki/IRC_(27_December_2008)\" title=\"IRC (27 December 2008)\">Dec 27</a>  <a href=\"/cwcki/IRC_(28_December_2008)\" title=\"IRC (28 December 2008)\">Dec 28</a>  <a href=\"/cwcki/IRC_(31_December_2008)\" title=\"IRC (31 December 2008)\">Dec 31</a><br/><b><a href=\"/cwcki/2009\" title=\"2009\">2009</a>:</b> <a href=\"/cwcki/IRC_(02_January_2009)\" title=\"IRC (02 January 2009)\">Jan 2</a>  <a href=\"/cwcki/IRC_(03_January_2009)\" title=\"IRC (03 January 2009)\">Jan 3</a>  <a href=\"/cwcki/IRC_(04_January_2009)\" title=\"IRC (04 January 2009)\">Jan 4</a>  <a href=\"/cwcki/IRC_(20_January_2009)\" title=\"IRC (20 January 2009)\">Jan 20</a>  <a href=\"/cwcki/IRC_(21_January_2009)\" title=\"IRC (21 January 2009)\">Jan 21</a>  <a href=\"/cwcki/IRC_(23_July_2009)\" title=\"IRC (23 July 2009)\">Jul 23</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">PandaHalo</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_Sex_Logs\" title=\"Chris Sex Logs\">Skype Sex Logs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> / <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivitheg%27s_AIM_chat\" title=\"Vivitheg's AIM chat\">Vivitheg's AIM chat</a>  <a href=\"/cwcki/Hooker_incident#Result\" title=\"Hooker incident\">Hooker incident call</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">BlueSpike</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b><a href=\"/cwcki/BlueSpike_PSN_Chats\" title=\"BlueSpike PSN Chats\">PSN Chats</a>:</b> <a href=\"/cwcki/BlueSpike_PSN_Chat_1\" title=\"BlueSpike PSN Chat 1\">1</a>  <a href=\"/cwcki/BlueSpike_PSN_Chat_2\" title=\"BlueSpike PSN Chat 2\">2</a>  <a href=\"/cwcki/BlueSpike_PSN_Chat_3\" title=\"BlueSpike PSN Chat 3\">3</a> (<a href=\"/cwcki/BlueSpike_PSN_Chat_3.5\" title=\"BlueSpike PSN Chat 3.5\">3.5</a>  <a href=\"/cwcki/BlueSpike_PSN_Chat_3.7\" title=\"BlueSpike PSN Chat 3.7\">3.7</a>)  <a href=\"/cwcki/BlueSpike_PSN_Chat_4\" title=\"BlueSpike PSN Chat 4\">4</a><br/><b><a href=\"/cwcki/BlueSpike_Skype_Logs\" title=\"BlueSpike Skype Logs\">Skype Logs</a>:</b> <a href=\"/cwcki/BlueSpike_Skype_Logs_1\" title=\"BlueSpike Skype Logs 1\">1</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_2\" title=\"BlueSpike Skype Logs 2\">2</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_3\" title=\"BlueSpike Skype Logs 3\">3</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_4\" title=\"BlueSpike Skype Logs 4\">4</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_5\" title=\"BlueSpike Skype Logs 5\">5</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_6\" title=\"BlueSpike Skype Logs 6\">6</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_7\" title=\"BlueSpike Skype Logs 7\">7</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_8\" title=\"BlueSpike Skype Logs 8\">8</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_9\" title=\"BlueSpike Skype Logs 9\">9</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_10\" title=\"BlueSpike Skype Logs 10\">10</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_11\" title=\"BlueSpike Skype Logs 11\">11</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_12\" title=\"BlueSpike Skype Logs 12\">12</a>  <a href=\"/cwcki/BlueSpike_Skype_Logs_13\" title=\"BlueSpike Skype Logs 13\">13</a><br/><b>Other:</b> <a href=\"/cwcki/CWC_Cums_for_a_Cat\" title=\"CWC Cums for a Cat\">CWC Cums for a Cat</a>  <a href=\"/cwcki/Bob_Walks_In\" title=\"Bob Walks In\">Bob Walks In</a>  <a href=\"/cwcki/Bob_Walks_In_Aftermath\" title=\"Bob Walks In Aftermath\">Bob Walks In Aftermath</a>  <a href=\"/cwcki/Julie_Reveals_Herself:_The_Prequel\" title=\"Julie Reveals Herself: The Prequel\">Julie Reveals Herself: The Prequel</a>  <a href=\"/cwcki/Julie_Reveals_Herself\" title=\"Julie Reveals Herself\">Julie Reveals Herself</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Mumble\" title=\"Mumble\">Mumble</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mumble_1\" title=\"Mumble 1\">1</a>  <a href=\"/cwcki/Mumble_2\" title=\"Mumble 2\">2</a>  <a href=\"/cwcki/Mumble_3\" title=\"Mumble 3\">3</a> (<a href=\"/cwcki/Mumble_3.5\" title=\"Mumble 3.5\">3.5</a>)  <a href=\"/cwcki/Mumble_4\" title=\"Mumble 4\">4</a>  <a href=\"/cwcki/Mumble_5\" title=\"Mumble 5\">5</a>  <a href=\"/cwcki/Mumble_6\" title=\"Mumble 6\">6</a>  <a href=\"/cwcki/Mumble_7\" title=\"Mumble 7\">7</a>  <a href=\"/cwcki/Mumble_8\" title=\"Mumble 8\">8</a>  <a href=\"/cwcki/Mumble_9\" title=\"Mumble 9\">9</a> (<a href=\"/cwcki/Mumble_9.5\" title=\"Mumble 9.5\">9.5</a>)  <a href=\"/cwcki/Mumble_10\" title=\"Mumble 10\">10</a>  <a href=\"/cwcki/Mumble_11\" title=\"Mumble 11\">11</a>  <a href=\"/cwcki/Mumble_12\" title=\"Mumble 12\">12</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Sarah_May\" title=\"Sarah May\">Sarah May</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Sarah_May_Skype_Logs\" title=\"Sarah May Skype Logs\">Sarah May Skype Logs</a>  <a href=\"/cwcki/Barb_almost_goes_off\" title=\"Barb almost goes off\">Barb almost goes off</a>  <a href=\"/cwcki/Supporting_Sarah_May\" title=\"Supporting Sarah May\">Supporting Sarah May</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Alec_Benson_Leary\" title=\"Alec Benson Leary\">Alec Benson Leary</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Alec_Benson_Leary_calls\" title=\"Alec Benson Leary calls\">Alec calls</a> (<a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_1\" title=\"Alec Benson Leary Phone Call 1\">1</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_2\" title=\"Alec Benson Leary Phone Call 2\">2</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_3\" title=\"Alec Benson Leary Phone Call 3\">3</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_4\" title=\"Alec Benson Leary Phone Call 4\">4</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_5\" title=\"Alec Benson Leary Phone Call 5\">5</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_6\" title=\"Alec Benson Leary Phone Call 6\">6</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">7</a>  <a class=\"mw-selflink selflink\">8</a>  <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_9\" title=\"Alec Benson Leary Phone Call 9\">9</a>)   <a class=\"mw-redirect\" href=\"/cwcki/Matthew_Noble_call\" title=\"Matthew Noble call\">\"Matthew Noble\" call</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Vanessa_Saga\" title=\"Vanessa Saga\">Vanessa AIM chats</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vanessa_AIM_Chat_1\" title=\"Vanessa AIM Chat 1\">1</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_2\" title=\"Vanessa AIM Chat 2\">2</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_3\" title=\"Vanessa AIM Chat 3\">3</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_4\" title=\"Vanessa AIM Chat 4\">4</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_5\" title=\"Vanessa AIM Chat 5\">5</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_6\" title=\"Vanessa AIM Chat 6\">6</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_7\" title=\"Vanessa AIM Chat 7\">7</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_8\" title=\"Vanessa AIM Chat 8\">8</a>  <a href=\"/cwcki/Vanessa_AIM_Chat_9\" title=\"Vanessa AIM Chat 9\">9</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">Liquid Saga</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/SHOWDOWN:_The_TRUE_CWC_Confronts_The_FAKE\" title=\"SHOWDOWN: The TRUE CWC Confronts The FAKE\">SHOWDOWN</a>  <a href=\"/cwcki/Kacey_calls\" title=\"Kacey calls\">Kacey calls</a> (<a class=\"mw-redirect\" href=\"/cwcki/Kacey_Phone_Call\" title=\"Kacey Phone Call\">1</a>  <a href=\"/cwcki/Kacey_Call_1.5\" title=\"Kacey Call 1.5\">1.5</a>  <a href=\"/cwcki/Kacey_Call_2\" title=\"Kacey Call 2\">2</a>  <a href=\"/cwcki/Kacey_Call_3\" title=\"Kacey Call 3\">3</a>  <a href=\"/cwcki/Kacey_Call_4\" title=\"Kacey Call 4\">4</a>  <a href=\"/cwcki/Kacey_Call_5\" title=\"Kacey Call 5\">5</a>  <a href=\"/cwcki/Kacey_Call_6\" title=\"Kacey Call 6\">6</a>  <a href=\"/cwcki/Kacey_Call_7\" title=\"Kacey Call 7\">7</a>  <a href=\"/cwcki/Kacey_Call_8\" title=\"Kacey Call 8\">8</a>  <a href=\"/cwcki/Kacey_Call_9\" title=\"Kacey Call 9\">9</a>  <a href=\"/cwcki/Kacey_Call_10\" title=\"Kacey Call 10\">10</a>  <a href=\"/cwcki/Kacey_Call_11\" title=\"Kacey Call 11\">11</a>  <a href=\"/cwcki/Kacey_Call_12\" title=\"Kacey Call 12\">12</a>  <a href=\"/cwcki/Kacey_Call_13\" title=\"Kacey Call 13\">13</a>  <a href=\"/cwcki/Kacey_Call_14\" title=\"Kacey Call 14\">14</a>  <a href=\"/cwcki/Kacey_Call_15\" title=\"Kacey Call 15\">15</a>  <a href=\"/cwcki/Kacey_Call_16\" title=\"Kacey Call 16\">16</a>  <a href=\"/cwcki/Kacey_Call_17\" title=\"Kacey Call 17\">17</a>  <a href=\"/cwcki/Kacey_Call_18\" title=\"Kacey Call 18\">18</a>  <a href=\"/cwcki/Kacey_Call_19\" title=\"Kacey Call 19\">19</a>  <a href=\"/cwcki/Kacey_Call_20\" title=\"Kacey Call 20\">20</a>  <a href=\"/cwcki/Kacey_Call_21\" title=\"Kacey Call 21\">21</a>  <a href=\"/cwcki/Kacey_Call_22\" title=\"Kacey Call 22\">22</a>  <a href=\"/cwcki/Kacey_Call_23\" title=\"Kacey Call 23\">23</a>  <a href=\"/cwcki/Kacey_Call_24\" title=\"Kacey Call 24\">24</a>)  <a href=\"/cwcki/Father_Call\" title=\"Father Call\">Father Call</a>  <a href=\"/cwcki/Kacey_and_Liquid_Call\" title=\"Kacey and Liquid Call\">Kacey and Liquid Call</a>  <a href=\"/cwcki/The_End_For_Real_(Kacey_call)\" title=\"The End For Real (Kacey call)\">The End For Real</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a> calls\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_Phone_Call\" title=\"Jack Thaddeus Phone Call\">1</a><b>  </b><a href=\"/cwcki/Jack_Thaddeus_Phone_Call_2\" title=\"Jack Thaddeus Phone Call 2\">2</a><b>  </b><a href=\"/cwcki/Jack_Thaddeus_Phone_Call_3\" title=\"Jack Thaddeus Phone Call 3\">3</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_Chat_1\" title=\"Jackie Chat 1\">1</a><b>  </b><a href=\"/cwcki/Jackie_Chat_2\" title=\"Jackie Chat 2\">2</a><b>  </b><a href=\"/cwcki/Jackie_Chat_3\" title=\"Jackie Chat 3\">3</a>  <a href=\"/cwcki/Jackie_Chat_4\" title=\"Jackie Chat 4\">4</a><b>  </b><a href=\"/cwcki/Jackie_Chat_5\" title=\"Jackie Chat 5\">5</a><b>  </b><a href=\"/cwcki/Jackie_Chat_6\" title=\"Jackie Chat 6\">6</a>  <a href=\"/cwcki/Jackie_Chat_7\" title=\"Jackie Chat 7\">7</a><b>  </b><a href=\"/cwcki/Jackie_Chat_8\" title=\"Jackie Chat 8\">8</a><b>  </b><a href=\"/cwcki/Jackie_Chat_9\" title=\"Jackie Chat 9\">9</a><b>  </b><a href=\"/cwcki/Lars_Call\" title=\"Lars Call\">Lars Call</a><b></b></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Andrew_Simmons_chat\" title=\"Andrew Simmons chat\">Andrew Simmons chat</a>  <a href=\"/cwcki/Car_Pranks\" title=\"Car Pranks\">Car Pranks</a>  <a href=\"/cwcki/Maggie_Thomas_call\" title=\"Maggie Thomas call\">Maggie Thomas call</a>  <a href=\"/cwcki/Prank_calls\" title=\"Prank calls\">Prank calls</a>  <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris-chan_Discusses...\" title=\"Chris-chan Discusses...\">Guru Larry</a>  <a href=\"/cwcki/Christian_Weston_Chandler_Interview\" title=\"Christian Weston Chandler Interview\">Christian Weston Chandler Interview</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Dark_Ages_era&amp;action=edit&amp;redlink=1\" title=\"Template:Dark Ages era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Dark_Ages_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Dark Ages era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Dark_Ages_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Dark_Ages_(20_March_2010_to_3_September_2014)\" title=\"Saga\">Dark Ages era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/July_25,_2014_Leaks\" title=\"July 25, 2014 Leaks\">July 25, 2014 Leaks</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/ThePCAssassins\" title=\"ThePCAssassins\">ThePCAssassins</a>  <a href=\"/cwcki/Rocky_Shoemaker_call\" title=\"Rocky Shoemaker call\">Rocky Shoemaker call</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Renaissance_era&amp;action=edit&amp;redlink=1\" title=\"Template:Renaissance era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Renaissance_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Renaissance era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Renaissance_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Renaissance_(3_September_2014_to_24_October_2017)\" title=\"Saga\">Renaissance era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a> / <a href=\"/cwcki/Colin\" title=\"Colin\">Colin</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b>Catherine:</b> <a href=\"/cwcki/Date_with_Catherine\" title=\"Date with Catherine\">Date with Catherine</a> <br/> <b>Colin:</b> <a href=\"/cwcki/Colin_Chat_1\" title=\"Colin Chat 1\">Colin Chat 1</a><b>  </b><a href=\"/cwcki/Colin_Chat_2\" title=\"Colin Chat 2\">Colin Chat 2</a><b></b></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Marvin_DMs\" title=\"Marvin DMs\">Marvin DMs</a>  <a href=\"/cwcki/Misc_texts\" title=\"Misc texts\">Misc texts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Arthur_Spatchcock_Interviews\" title=\"Arthur Spatchcock Interviews\">Arthur Spatchcock Interviews</a>  <a href=\"/cwcki/BraveryJerk_Interviews\" title=\"BraveryJerk Interviews\">BraveryJerk Interviews</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/2014_Jail_calls\" title=\"2014 Jail calls\">2014 jail calls</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit&amp;redlink=1\" title=\"Template:Transcendental Awakening / The Rise eras (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit&amp;redlink=1\" title=\"Template talk:Transcendental Awakening / The Rise eras (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Transcendental_Awakening_(August_2017_to_30_July_2021)\" title=\"Saga\">Transcendental Awakening</a> / <a href=\"/cwcki/Saga#Rise-N-Fall_(Mid_2018_-_31_July_2021)\" title=\"Saga\">Rise-N-Fall</a> eras</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Idea_Guys\" title=\"Idea Guys\">Idea Guys</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Misc_Idea_Guy_chats\" title=\"Misc Idea Guy chats\">Misc Idea Guy chats</a>  <a href=\"/cwcki/Gruppenfuhrer_Fegelein_chat\" title=\"Gruppenfuhrer Fegelein chat\">Gruppenfuhrer Fegelein chat</a>  <a href=\"/cwcki/The_Bad_Beginning\" title=\"The Bad Beginning\">The Bad Beginning</a>  <a href=\"/cwcki/Cryzel_Torture\" title=\"Cryzel Torture\">Cryzel Torture</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Guard_Dogs\" title=\"Guard Dogs\">Guard Dogs</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Null_DMs\" title=\"Null DMs\">Null DMs</a>  <a href=\"/cwcki/Captain_DMs\" title=\"Captain DMs\">The Captain DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Watchmen\" title=\"Watchmen\">Watchmen</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Watchmen_Chats\" title=\"Watchmen Chats\">Watchmen Chats</a> (<a href=\"/cwcki/Anaxis_DMs\" title=\"Anaxis DMs\">Anaxis DMs</a>  <a href=\"/cwcki/AquaDiamond8_DMs\" title=\"AquaDiamond8 DMs\">AquaDiamond8 DMs</a>  <a href=\"/cwcki/Kyle_DMs\" title=\"Kyle DMs\">Kyle DMs</a>  <a href=\"/cwcki/MKR_DMs\" title=\"MKR DMs\">MKR DMs</a>  <a href=\"/cwcki/Naught_DMs\" title=\"Naught DMs\">Naught DMs</a>  <a href=\"/cwcki/Spunky_DMs\" title=\"Spunky DMs\">Spunky DMs</a>  <a href=\"/cwcki/WCT_DMs\" title=\"WCT DMs\">WCT DMs</a>)</div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Ben_Saint\" title=\"Ben Saint\">Ben Saint</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Ben_Saint_-_Chatting_with_Chris-Chan\" title=\"Ben Saint - Chatting with Chris-Chan\">Ben Saint - Chatting with Chris-Chan</a>  <a href=\"/cwcki/Ben_Saint_DMs\" title=\"Ben Saint DMs\">Ben Saint DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/2020_Discord_leaks\" title=\"2020 Discord leaks\">2020 Discord leaks</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Other_chats_leaked_by_Naught_(April_2020)\" title=\"Other chats leaked by Naught (April 2020)\">April '20</a>  <a href=\"/cwcki/Other_chats_leaked_by_Naught_(May_2020)\" title=\"Other chats leaked by Naught (May 2020)\">May '20</a>  <a href=\"/cwcki/Other_chats_leaked_by_Naught_(July_2020)\" title=\"Other chats leaked by Naught (July 2020)\">July '20</a>  <a href=\"/cwcki/Other_chats_leaked_by_Naught_(August_2020)\" title=\"Other chats leaked by Naught (August 2020)\">Aug '20</a>  <a href=\"/cwcki/Other_chats_leaked_by_Naught_(September_2020)\" title=\"Other chats leaked by Naught (September 2020)\">September '20</a>  <a href=\"/cwcki/Other_chats_leaked_by_Naught_(undated)\" title=\"Other chats leaked by Naught (undated)\">undated</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Isabella_Loretta_Janke\" title=\"Isabella Loretta Janke\">Bella</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Bella_chats\" title=\"Bella chats\">Bella chats</a>  <a href=\"/cwcki/Incest_Call\" title=\"Incest Call\">Incest Call</a>  <a href=\"/cwcki/Incest_Texts\" title=\"Incest Texts\">Incest Texts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Fiona_Cooper\" title=\"Fiona Cooper\">Fiona</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Fiona_DMs\" title=\"Fiona DMs\">Fiona DMs</a>  <a href=\"/cwcki/Fiona_Facetime_Videos\" title=\"Fiona Facetime Videos\">Fiona Facetime Videos</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/100MegaMeh\" title=\"100MegaMeh\">100MegaMeh DMs</a>  <a href=\"/cwcki/Bible_Enabler_DMs\" title=\"Bible Enabler DMs\">Bible Enabler DMs</a>  <a href=\"/cwcki/Bryanfrogboy_Chats\" title=\"Bryanfrogboy Chats\">Bryanfrogboy Chats</a>  <a href=\"/cwcki/Cedric_Eff_DMs\" title=\"Cedric Eff DMs\">Cedric Eff DMs</a>  <a class=\"mw-redirect\" href=\"/cwcki/Cirrusfire_DMs\" title=\"Cirrusfire DMs\">Cirrusfire DMs</a>  <a href=\"/cwcki/Copitz_DMs\" title=\"Copitz DMs\">Copitz DMs</a>  <a href=\"/cwcki/Desiree_Delightful\" title=\"Desiree Delightful\">Desiree Delightful DMs</a>  <a href=\"/cwcki/Dillin_Thomas_DMs\" title=\"Dillin Thomas DMs\">Dillin Thomas DMs</a>  <a href=\"/cwcki/Fan_visits\" title=\"Fan visits\">Fan visits</a>  <a href=\"/cwcki/Geno_Samuel_DMs\" title=\"Geno Samuel DMs\">Geno Samuel DMs</a>  <a href=\"/cwcki/Helena_DMs\" title=\"Helena DMs\">Helena DMs</a>  <a href=\"/cwcki/Justin_DMs\" title=\"Justin DMs\">Justin DMs</a>  <a class=\"mw-redirect\" href=\"/cwcki/Kai_DMs\" title=\"Kai DMs\">Kai DMs</a>  <a class=\"mw-redirect\" href=\"/cwcki/KwaiiSandbag_calls\" title=\"KwaiiSandbag calls\">KwaiiSandbag calls</a>(<a href=\"/cwcki/Chris_Chan_Psychic_Chat_1\" title=\"Chris Chan Psychic Chat 1\">1</a>  <a href=\"/cwcki/Chris_Chan_Psychic_Chat_2\" title=\"Chris Chan Psychic Chat 2\">2</a>  <a href=\"/cwcki/Chris_Chan_Psychic_Chat_3\" title=\"Chris Chan Psychic Chat 3\">3</a>  <a href=\"/cwcki/Chris_Chan_Psychic_Chat_4\" title=\"Chris Chan Psychic Chat 4\">4</a>  <a href=\"/cwcki/Chris_Chan_Psychic_Chat_5\" title=\"Chris Chan Psychic Chat 5\">5</a>)  <a href=\"/cwcki/Larry_Vaughn_DMs\" title=\"Larry Vaughn DMs\">Larry Vaughn DMs</a>  <a href=\"/cwcki/Midnight_Moonflower_DMs\" title=\"Midnight Moonflower DMs\">Midnight Moonflower DMs</a>  <a href=\"/cwcki/Opuscon789_DMs\" title=\"Opuscon789 DMs\">Opuscon789 DMs</a>  <a href=\"/cwcki/Sockness_DMs\" title=\"Sockness DMs\">Sockness DMs</a>  <a href=\"/cwcki/Sonichu_Mania\" title=\"Sonichu Mania\">Sonichu Mania Livestream</a>  <a href=\"/cwcki/Teen_Troon_Squad_chats\" title=\"Teen Troon Squad chats\">Teen Troon Squad chats</a>  <a href=\"/cwcki/Tings_Tingz_DMs\" title=\"Tings Tingz DMs\">Tings Tingz DMs</a>  <a href=\"/cwcki/Tlaw_DMs\" title=\"Tlaw DMs\">Tlaw DMs</a>  <a href=\"/cwcki/Toffee_Rosechu_DMs\" title=\"Toffee Rosechu DMs\">Toffee Rosechu DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Discord\" title=\"Discord\">Discord</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\">Arbitarch CWC Alliance</a>  <a href=\"/cwcki/Blepcon\" title=\"Blepcon\">Blepcon</a>  <a href=\"/cwcki/Chess_Group_15\" title=\"Chess Group 15\">Chess Group 15</a>  <a href=\"/cwcki/Children_of_Kefentse\" title=\"Children of Kefentse\">Children of Kefentse</a>  <a href=\"/cwcki/Cwc_frens\" title=\"Cwc frens\">cwc frens</a>  <a href=\"/cwcki/CWCville_(Discord_server)\" title=\"CWCville (Discord server)\">CWCville</a>  <a href=\"/cwcki/Golden_Church_of_Sonichu\" title=\"Golden Church of Sonichu\">Golden Church of Sonichu</a>  <a class=\"mw-redirect\" href=\"/cwcki/Kaiyosh%27s_server\" title=\"Kaiyosh's server\">Kaiyosh's server</a>  <a href=\"/cwcki/Midnight%27s_Nightlings_and_Starettes\" title=\"Midnight's Nightlings and Starettes\">Midnight's Nightlings and Starettes</a>  <a href=\"/cwcki/Official_CWCki_Server\" title=\"Official CWCki Server\">Official CWCki Server</a>  <a href=\"/cwcki/Rowdy_Fuckers_Cop_Killers%27_ENDLESS_WAR\" title=\"Rowdy Fuckers Cop Killers' ENDLESS WAR\">Rowdy Fuckers Cop Killers' ENDLESS WAR</a>  <a href=\"/cwcki/Sonic_World_DX_Lounge\" title=\"Sonic World DX Lounge\">Sonic World DX Lounge</a>  <a href=\"/cwcki/Sonichu_Mania\" title=\"Sonichu Mania\">Sonichu Mania Plus Server</a>  <a href=\"/cwcki/The_group\" title=\"The group\">The group</a>  <a href=\"/cwcki/The_Knights_of_CWC\" title=\"The Knights of CWC\">The Knights of CWC</a>  <a href=\"/cwcki/The_Place\" title=\"The Place\">The Place</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_Chan_%26_Max_Mandu_LIVE_/_Leftovers_Tonight\" title=\"Chris Chan &amp; Max Mandu LIVE / Leftovers Tonight\">Chris Chan &amp; Max Mandu LIVE / Leftovers Tonight</a>  <a href=\"/cwcki/CopperCab\" title=\"CopperCab\">CopperCab</a>  <a href=\"/cwcki/Copitz\" title=\"Copitz\">Copitz</a>  <a href=\"/cwcki/Count_Dankula\" title=\"Count Dankula\">Count Dankula</a>  <a href=\"/cwcki/Discord_Q%26A\" title=\"Discord Q&amp;A\">Discord Q&amp;A</a> (<a href=\"/cwcki/Discord_Q%26A_1\" title=\"Discord Q&amp;A 1\">1</a>  <a href=\"/cwcki/Discord_Q%26A_2\" title=\"Discord Q&amp;A 2\">2</a>  <a href=\"/cwcki/Discord_Q%26A_3\" title=\"Discord Q&amp;A 3\">3</a>  <a href=\"/cwcki/Discord_Q%26A_4\" title=\"Discord Q&amp;A 4\">4 (call)</a>  <a href=\"/cwcki/Discord_Q%26A_5\" title=\"Discord Q&amp;A 5\">5</a>  <a href=\"/cwcki/Discord_Q%26A_6\" title=\"Discord Q&amp;A 6\">6</a>  <a href=\"/cwcki/Discord_Q%26A_7\" title=\"Discord Q&amp;A 7\">7</a>  <a href=\"/cwcki/Discord_Q%26A_8\" title=\"Discord Q&amp;A 8\">8</a>  <a href=\"/cwcki/Discord_Q%26A_9\" title=\"Discord Q&amp;A 9\">9 (audio)</a>  <a href=\"/cwcki/Discord_Q%26A_10\" title=\"Discord Q&amp;A 10\">10</a>  <a href=\"/cwcki/Discord_Q%26A_11\" title=\"Discord Q&amp;A 11\">11</a>  <a class=\"mw-redirect\" href=\"/cwcki/Discord_Q%26A_12\" title=\"Discord Q&amp;A 12\">12</a>)  Internet Dream Lounge (<a href=\"/cwcki/Internet_Dream_Lounge_4_-_Chris_Chan_(unused_version)\" title=\"Internet Dream Lounge 4 - Chris Chan (unused version)\">1</a>  <a href=\"/cwcki/Internet_Dream_Lounge\" title=\"Internet Dream Lounge\">2</a>)  <a href=\"/cwcki/Jackson_Dalton\" title=\"Jackson Dalton\">Jackson Dalton</a>  <a href=\"/cwcki/Pappy_Van_Poodle_Interview\" title=\"Pappy Van Poodle Interview\">Pappy Van Poodle Interview</a>  <a href=\"/cwcki/CLog_10042017_-_Q%26A_1\" title=\"CLog 10042017 - Q&amp;A 1\">Q&amp;A with Kiwi Farms</a>  <a href=\"/cwcki/Sachumo_Interview\" title=\"Sachumo Interview\">Sachumo</a>  <a href=\"/cwcki/The_Create_Unknown\" title=\"The Create Unknown\">The Create Unknown</a>  <a href=\"/cwcki/The_Chris_Chan_Conspiracy\" title=\"The Chris Chan Conspiracy\">The Making of an Internet Monster</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/KwaiiSandbag#Interviews_with_Kwaii\" title=\"KwaiiSandbag\">KwaiiSandbag Interview</a>  <a href=\"/cwcki/Lily#Interview_with_Lily\" title=\"Lily\">Lily Interview</a>  <a href=\"/cwcki/Aly_Hirschberg_DMs\" title=\"Aly Hirschberg DMs\">Aly Hirschberg DMs</a>  <a href=\"/cwcki/Bella_and_Fiona_chats\" title=\"Bella and Fiona chats\">Bella and Fiona chats</a>  <a class=\"mw-redirect\" href=\"/cwcki/Chess_Club_Chats\" title=\"Chess Club Chats\">Chess Club Chats</a>  <a href=\"/cwcki/Chris_Chan_Conservation_Collective\" title=\"Chris Chan Conservation Collective\">Chris Chan Conservation Collective</a>  <a class=\"mw-redirect\" href=\"/cwcki/Copitz%27s_Server\" title=\"Copitz's Server\">Copitz's Server</a>  <a href=\"/cwcki/Helena-WCT_DMs\" title=\"Helena-WCT DMs\">Helena-WCT DMs</a>  <a class=\"mw-redirect\" href=\"/cwcki/Incest_Leak_Interview\" title=\"Incest Leak Interview\">Incest Leak Interview</a>  <a href=\"/cwcki/The_Sons_of_the_Miscreants\" title=\"The Sons of the Miscreants\">The Sons of the Miscreants</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Silent_Years_era&amp;action=edit&amp;redlink=1\" title=\"Template:Silent Years era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Silent_Years_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Silent Years era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Silent_Years_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Silent_Years_(1_August_2021_-_16_October_2023)\" title=\"Saga\">Silent Years era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Central_Virginia_Regional_Jail\" title=\"Central Virginia Regional Jail\">Central Virginia Regional Jail</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Communications\" title=\"Jail Communications\">Jail Communications</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/March_2023_Praetor_Interview\" title=\"March 2023 Praetor Interview\">March 2023 Praetor Interview</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Second_Coming_era&amp;action=edit&amp;redlink=1\" title=\"Template:Second Coming era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a><span style=\"font-size:80%;\"></span><a class=\"new\" href=\"/w/index.php?title=Template_talk:Second_Coming_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Second Coming era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a><span style=\"font-size:80%;\"></span><a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Second_Coming_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span> </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Second_Coming_(16_October_2023_-_Present)\" title=\"Saga\">Second Coming era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Miscellaneous chats\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Helena_DMs\" title=\"Helena DMs\">Helena DMs</a>  <a href=\"/cwcki/Lolcow_Live\" title=\"Lolcow Live\">Lolcow Live DM</a>  <a href=\"/cwcki/Ren_Ryghts_DMs\" title=\"Ren Ryghts DMs\">Ren Ryghts DMs</a>  <a href=\"/cwcki/Waltah_White_Calls\" title=\"Waltah White Calls\">Waltah White Calls</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Discord\" title=\"Discord\">Discord</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catboy_Ranch\" title=\"Catboy Ranch\">Catboy Ranch</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Keffals_videos\" title=\"Keffals videos\">The Chris Chan Interview</a>  <a href=\"/cwcki/The_Chris_Chan_Conspiracy\" title=\"The Chris Chan Conspiracy\">The Resurrection of Chris Chan</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251119203503\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.270 seconds\nReal time usage: 0.290 seconds\nPreprocessor visited node count: 3511/1000000\nPostexpand include size: 104416/2097152 bytes\nTemplate argument size: 32057/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip postexpand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   89.831      1 -total\n 58.23%   52.309      1 Template:FanChats\n 52.43%   47.100      6 Template:Navbox\n 19.16%   17.216      1 Template:Infobox/Audiofile\n 15.48%   13.910      1 Template:AsperchuSaga\n 12.72%   11.430      1 Template:Saga\n  9.03%    8.111      6 Template:Tnavbar\n  6.82%    6.124      1 Template:Asperchu\n  6.07%    5.457      4 Template:Saga/core\n  3.63%    3.265      1 Template:Succession\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:9443-0!canonical and timestamp 20251119203503 and revision id 329488. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Alec_Benson_Leary_Phone_Call_8&amp;oldid=329488\">http://sonichu.com/w/index.php?title=Alec_Benson_Leary_Phone_Call_8&amp;oldid=329488</a>\"</div></div>",
  "categories": [
    "Category",
    "Alec Benson Leary calls"
  ],
  "links": [
    "The Comic itself",
    "Dec 22",
    "Dec 31",
    "Guru Larry",
    "Alec Benson Leary Phone Call 7",
    "Midnight Moonflower DMs",
    "PSN Chats",
    "Anaxis DMs",
    "Golden Church of Sonichu",
    "Vivitheg's AIM chat",
    "Bella and Fiona chats",
    "Sydney Contacts",
    "Bob Walks In",
    "I'm not running away from you, I'm right here.",
    "Catboy Ranch",
    "Dec 27",
    "Mao Ling",
    "Alec Q&A",
    "Jul 23",
    "BlueSpike",
    "Sonichu Revolution",
    "14",
    "Andrew Simmons chat",
    "CWCipedia",
    "Ben Saint DMs",
    "Chess Group 15",
    "Kyle DMs",
    "I am strong",
    "Alec calls",
    "Bryanfrogboy Chats",
    "Midnight's Nightlings and Starettes",
    "Helena-WCT DMs",
    "Simonla",
    "Idea Guys",
    "Chris and Alec Call 9",
    "Children of Kefentse",
    "PandaHalo",
    "Oct 16",
    "hundreds of games",
    "21",
    "because comic characters are real people",
    "Nintendo",
    "Dec 15",
    "Alec Benson Leary calls",
    "9",
    "3.7",
    "Bible Enabler DMs",
    "Yeah, 'fraid we did.",
    "Aug '20",
    "The Place",
    "Chris Chan Conservation Collective",
    "Sonichu Mania Plus Server",
    "Vivian Gee",
    "Helena DMs",
    "Aly Hirschberg DMs",
    "12 January 2010",
    "22",
    "Catherine",
    "5",
    "Jan 2",
    "12",
    "Colin Chat 1",
    "Cirrusfire DMs",
    "Dec 13",
    "Pappy Van Poodle Interview",
    "9 February 2010",
    "Chris Chan & Max Mandu LIVE / Leftovers Tonight",
    "15",
    "Jackie",
    "Misc texts",
    "September '20",
    "Oct 26",
    "PSP",
    "Nov 26",
    "Sarah May Skype Logs",
    "Justin DMs",
    "Christian Weston Chandler Interview",
    "Rocky Shoemaker call",
    "Down with Asperchu",
    "100MegaMeh DMs",
    "The Bad Beginning",
    "Official CWCki Server",
    "July 25, 2014 Leaks",
    "Asperchu is a Horrendous Joke",
    "Watchmen",
    "Saw",
    "Ren Ryghts DMs",
    "Dec 17",
    "Marvin DMs",
    "WCT DMs",
    "CWC-ism",
    "tour of your house",
    "Kacey calls",
    "17",
    "Skype Sex Logs",
    "4 (call)",
    "Kai DMs",
    "The Captain DMs",
    "Barb almost goes off",
    "Cryzel Torture",
    "The Making of an Internet Monster",
    "AquaDiamond8 DMs",
    "Ben Saint",
    "Ben Saint - Chatting with Chris-Chan",
    "Overstepping their boundaries",
    "Sockness DMs",
    "Actually, yes, I was abused by one!",
    "Copitz's Server",
    "Lolcow Live DM",
    "Jan 20",
    "Pikachu",
    "Null DMs",
    "Sonic World DX Lounge",
    "Facebook",
    "Larry Vaughn DMs",
    "stress",
    "Jail Communications",
    "Incest Leak Interview",
    "18",
    "Bella",
    "Arbitarch CWC Alliance",
    "Copitz DMs",
    "Toffee Rosechu DMs",
    "Gruppenfuhrer Fegelein chat",
    "2014 jail calls",
    "Jackson Dalton",
    "Clyde Cash",
    "4",
    "Kacey and Liquid Call",
    "Address to Mao, the S.O.B.",
    "managed to believe that would disconnect the call and not simply pressing the \"End\" button",
    "Fiona Facetime Videos",
    "Jan 4",
    "Discord",
    "CWCville",
    "Colin Chat 2",
    "Sachumo",
    "The Resurrection of Chris Chan",
    "Central Virginia Regional Jail",
    "Supporting Sarah May",
    "Spunky DMs",
    "Blepcon",
    "The Knights of CWC",
    "19",
    "Tings Tingz DMs",
    "eating dinner?",
    "Sarah May",
    "still very angry at me",
    "slow",
    "BraveryJerk Interviews",
    "CopperCab",
    "Bella chats",
    "Incest Call",
    "if you're going to ask someone to go out of their way for you for something you should probably... actually allow them to do so and not act like you are inconvenienced when they do.",
    "previous phone call",
    "Sonichu 10",
    "Guard Dogs",
    "Chess Club Chats",
    "The End For Real",
    "Alec Benson Leary",
    "Arthur Spatchcock Interviews",
    "Liquid Saga",
    "MKR DMs",
    "8",
    "9 (audio)",
    "homosexuals",
    "Simonla Rosechu",
    "10",
    "2",
    "3.5",
    "cwc frens",
    "Naught DMs",
    "Q&A with Kiwi Farms",
    "2008",
    "Bob Walks In Aftermath",
    "Mumble",
    "ThePCAssassins",
    "The Sons of the Miscreants",
    "Car Pranks",
    "Fiona DMs",
    "The Create Unknown",
    "Waltah White Calls",
    "Tlaw DMs",
    "Curse-ye-ha-me-ha",
    "The group",
    "Lars Call",
    "Evan Christopher George",
    "Helena DMs",
    "Maggie Thomas call",
    "3",
    "U8C43P2A37A8 y U8C1N023V0L",
    "March 2023 Praetor Interview",
    "I'm not sure really what the point I was trying to make there",
    "7",
    "Asperchu",
    "Copitz",
    "\"Matthew Noble\" call",
    "11",
    "23",
    "Moon-Pals",
    "Dec 28",
    "Rowdy Fuckers Cop Killers' ENDLESS WAR",
    "9.5",
    "2009",
    "13",
    "Incest Texts",
    "Discord Q&A",
    "Asperpedia",
    "Teen Troon Squad chats",
    "Skype Logs",
    "PlayStation Network",
    "I'm getting an incoming call right now",
    "Count Dankula",
    "24",
    "Well, I did not make an effort to study you, because...",
    "Asperchu Saga",
    "1.5",
    "Chris",
    "Trying to hold their hands, things like that",
    "KwaiiSandbag calls",
    "Vanessa AIM chats",
    "although there has never been any corroborating evidence to confirm this",
    "Jack Thaddeus",
    "Fiona",
    "Watchmen Chats",
    "Kaiyosh's server",
    "2020 Discord leaks",
    "1",
    "The Chris Chan Interview",
    "Geno Samuel DMs",
    "Date with Catherine",
    "last apology video",
    "my father",
    "Jan 21",
    "Father Call",
    "Desiree Delightful DMs",
    "Cedric Eff DMs",
    "Alec",
    "Don't you usually stay up to like 4:00 A.M. or something",
    "CWC Cums for a Cat",
    "Dec 18",
    "Prank calls",
    "20",
    "Alec Benson Leary Phone Call 9",
    "April '20",
    "May '20",
    "Opuscon789 DMs",
    "Chris and Alec Call 7",
    "disaster area of a house",
    "July '20",
    "Misc Idea Guy chats",
    "Interviews",
    "Sonichu Mania Livestream",
    "Oct 24",
    "16",
    "Jan 3",
    "Son-Chu",
    "6",
    "Julie Reveals Herself",
    "Colin",
    "Fan visits",
    "Sean August Watley",
    "Dillin Thomas DMs",
    "undated",
    "IRC"
  ],
  "scraped_at": "2025-11-26T15:27:51.183230"
}