{
  "url": "https://sonichu.com/cwcki/Arbitarch_Interview",
  "title": "Arbitarch Interview",
  "display_title": "Arbitarch Interview",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"boilerplate metadata\" id=\"incomplete\">\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:#ffff88; border:5px outset #06c4ff;\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:Stress.jpg\"><img alt=\"Stress.jpg\" decoding=\"async\" height=\"91\" src=\"/w/images/thumb/2/2c/Stress.jpg/120px-Stress.jpg\" srcset=\"/w/images/thumb/2/2c/Stress.jpg/180px-Stress.jpg 1.5x, /w/images/thumb/2/2c/Stress.jpg/240px-Stress.jpg 2x\" style=\"vertical-align: bottom\" width=\"120\"/></a>\n</td>\n<td><p style=\"text-align: center;\"> <span style=\"font-family:comic sans ms\"><b>This article is still yet to be completed due to <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>.</b></span></p><p> <span style=\"font-family:comic sans ms\">We get a lot of stressful torture in our lives that makes us crash into slumber. Given that inspiration is a big variable, and we may have been lacking of it, this article will be completed as soon as possible, at our own pace... <i><a class=\"mw-redirect\" href=\"/cwcki/HONEST\" title=\"HONEST\">HONEST</a>!</i></span></p> <span style=\"font-family:comic sans ms\"><b>This article is missing the following:</b>\n<p><br/>• Finish highlights\n</p>\n</span></td></tr></tbody></table></div>\n<p>On an unspecified date, but likely on January 2020, Chris had <b>an interview with various members from the Arbitarch CWC Alliance server</b>. The interview was one of the things leaked by the <a class=\"mw-redirect\" href=\"/cwcki/MRKs_Bloody_Chunks\" title=\"MRKs Bloody Chunks\">MRKs Bloody Chunks</a> account.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Highlights\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Highlights</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#The_Interview\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">The Interview</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Transcript\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Transcript</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Raw_captions\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Raw captions</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Highlights\">Highlights</span></h2>\n<ul><li>Chris thanks <a class=\"mw-redirect\" href=\"/cwcki/Joseph_Draft\" title=\"Joseph Draft\">Joseph Draft</a> for his recording for <a class=\"mw-redirect\" href=\"/cwcki/Chris_Chan_Vs._The_Internet\" title=\"Chris Chan Vs. The Internet\">Chris Chan Vs. The Internet</a>.</li></ul>\n<h2><span class=\"mw-headline\" id=\"The_Interview\">The Interview</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Arbitarch CWC Alliance</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/GlUkT4QAwHc\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td><a href=\"/cwcki/January_2020\" title=\"January 2020\">January 2020</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Arbitarch</span><a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch\"><img alt=\"Arbitarch\" decoding=\"async\" height=\"32\" src=\"/w/images/5/5b/MKRIcon.png\" width=\"32\"/></a> <a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\">Arbitarch</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#FFFF00; color:#008080; color:#008080;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">Audio Recordings\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/>N/A\n</td>\n<td><b>next</b> <br/>N/A\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:3px outset #bb2222\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:CWCism-IllBreakYouDead.png\"><img alt=\"CWCism-IllBreakYouDead.png\" decoding=\"async\" height=\"113\" src=\"/w/images/0/05/CWCism-IllBreakYouDead.png\" width=\"150\"/></a>\n</td>\n<td><i> This media needs a <a href=\"/cwcki/CWCki:Transcription_Style\" title=\"CWCki:Transcription Style\">transcript</a>. Help CWCki by <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Arbitarch_Interview&amp;action=edit\" rel=\"nofollow\">transcribing the content</a>. If the media is too long, transcribe select portions which are funny or informative.</i>\n</td></tr>\n</tbody></table></center>\n<p>[<i>Audio recording seemingly starts in the middle of conversation.</i>]\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Eh, yeh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> A- nice little hole.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I have a full team of six! Thanks to, uh, the- thanks to... Joe, who, uh, came over to help with the- record me for <a class=\"mw-redirect\" href=\"/cwcki/Chris_Chan_Vs._The_Internet\" title=\"Chris Chan Vs. The Internet\">that documentary that... was unable to get off the ground</a>.\n</p><p><b>Voice3:</b> Yeah, that's sad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Eh, I keep- I keep optimistic and positive. I'm sh- certain we'll get back on that.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Do you mi- do you miss Joe?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. He's aight.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Yeah, I remember I- I remember I spoke with, uh, I spoke with Joe. It's unfortunate how the Internet reacted to that particular, uh,\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>] Yeah.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> uh, event. Because...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Yeah. I- I- I- I- don't- I don't know-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Haters, trolls, they can be quite stupid.\n</p><p><b>Voice3:</b> Yeah.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> I- I'm- I'm s- I- I- I apologi- I- I don't know whether or not you want it relea- whether or not <i>you</i> wanted it released or not, but I- I unfortunately was on the side where we kind of kept it m- I don't know, I never really asked your, uh, permission- but, uh, yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mm. I'm sorry, say again. What was this?\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> I thi- Uh, I think Joe still has a copy he's- never- internet, but I, uh, as far as I know, yeah. He- Yeah. That's, uh-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, if- if it can- Ehh, if it can be distributed, uh... in one way or another, even if its just digital, I would say, \"Yeah, go for it.\" At this point. I was hoping for, like, DVD and Blu-Ray release of the documentary, but, oh well. It's- it is what it is at this point.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Uh, well, uh, just between- just between this, uh, this tiny little group, uh, I- You know, I pulled a- I pulled a page from <a href=\"/cwcki/Marvin\" title=\"Marvin\">Marvin</a>'s playbook and told everybody that I just deleted it. So, it still exists.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> If you like- Yeah. I'm pretty sure if he, uh, you know, if and when- if you ever want to meet him again, I'm pretty sure he would- he would show you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. I would want me- I would want to me- want to hang out with Joe again. He's really cool.\n</p><p><b>Voice3:</b> Yeah, it'd be cool if they could start on the documentary again, but I know that... people got pretty crazy about it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><b>Voice4:</b> Especially with the other one- all- all around, and- er-\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Eh, it's- it's not even that, it's a whole YouTube mafia thing. It's like there's a mafia of YouTubers, that, uh,\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>]\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> that, uh, that want... some sort of content or something. I- I- I don't know what to call it- Yeah. It's you- sort of-\n</p><p><b>Voice3:</b> Yeah, YouTube's turned into a less happy place, that's for sure.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, a bunch of picky, picky people.\n</p><p><b>Voice3:</b> Yup.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Well, I mean- I mean people specifically like, uh- people specifically like Dillin, uh, Dillin Thomas or somebody, you know, people who-\n</p><p><b>Voice3:</b> Egh.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> just harp on one subject.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><b>Voice3:</b> He doesn't even check his facts. He just reads things off <a class=\"mw-redirect\" href=\"/cwcki/The_CWCki\" title=\"The CWCki\">the CWCki</a> and makes, like, really mean remarks.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep. Eh, whud he do-\n</p><p><b>Voice3:</b> Seriously, dude. Get a life.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> And snickers to himself and, like, not- not in, like, laughing along way, but, like, you know, laughing at.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. He mean.\n</p><p><b>Voice5:</b> He's laff- He's laughing at, not with.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#FE2E2E\"><b>Naught:</b></font> Yeah, but, uh, but that- Oh, that's another thing I wanted to mention, uh, to you, is- uh, I, uh, for <a class=\"mw-redirect\" href=\"/cwcki/BABScon\" title=\"BABScon\">BABScon</a>, I think if you, uh, were to do a couple more livestreams and just turn o- uh, if you could, like, turn off your chat and just interact with the cards that seemingly interact with the, uh, with- with the thing, I- interact with the camera- I- like, I know people will send you Super Chats.\n</p>\n<h2><span class=\"mw-headline\" id=\"Raw_captions\">Raw captions</span></h2>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Text from YouTube's captions\n</th></tr>\n<tr>\n<td>0:00\n<p>in nice little hole and I have a fourteen wasit's\n0:05\nthanks to the thanks to Joe who came over to help with to record me for that\n0:12\ndocumentary that was unable to get off the ground yeah that's yeah I keep I\n0:20\nkeep optimistic and positive I'm certain we'll get back on that do you meant do\n0:26\nyou miss Joe yeah he's right yeah I\n0:33\nremember I remember I spoke with I spoke with Joe it's unfortunate how the internet\n0:39\nreacted to that particular event because\n0:44\nI don't know yeah I'm saya Paulo Jai I\n0:52\ndon't know whether or not you won't want it really not you wanted it released or not but I unfortunately was on the side\n1:00\nwhere we kind of kept it I don't know I never really asked your permission for\n1:07\nbut yeah what was this I think Joe still\n1:14\nhas a copy never internet but I as far as I know\n1:20\nyeah he yeah that's a you know if it\n1:25\ncould be distributed in one way and if it's just digital I would say yeah go\n1:31\nfor it at this point I was hoping for like DVD and blu-ray release of the documentary\n1:37\nbut oh well it is what it is at this point well it's between just between\n1:44\nthis this tiny little group I you know I pulled the I pulled the page from\n1:50\nMarvin's playbook and told everybody that I just deleted it though it's still like this yep if you like yeah I'm\n2:00\npretty sure if he you know if and when if you ever want to meet him again I'm pretty sure he would you would show you\n2:06\nyeah I would want me I would want to be want to hang out with Joe again he's really cool\n2:15\nyeah it'd be cool if they could start on the documentary again but I know that\n2:20\npeople got pretty crazy about it yeah\n2:27\nit's it's not even that it's the whole YouTube Mafia thing they think there's a\n2:33\nmafia of youtubers that that that want some sort of content or something i I\n2:41\ndon't know what but yeah this you sort of YouTube's turned into a less happy\n2:46\nplace that's for sure picky picky people well I'm you know and people\n2:52\nspecifically like people specifically like Dylan Joe and Tom or somebody you\n2:57\nknow people harp on one subject yeah well he doesn't even check his facts he\n3:04\njust reads things off the quick key and makes like really mean remarks yeah\n3:10\nand Snickers to himself and like not not in like laughing a long way but like you\n3:15\nknow laughing at yeah but that oh that's\n3:25\nanother thing I wanted to mention to you is a I for Babs con I think if you were\n3:31\nto do a couple more live streams and just turn out if you could like turn off your chat and just interact with the\n3:38\ncard but seemingly interact with the with with the thing I'm interact with\n3:43\nthe camera I I'm like I know people will send you super chats yeah the thing is I\n3:48\nam that one who would just keep a camera and want to keep a camera on one hand\n3:55\nand just do as I go and because no it's just typical it's just complicated I\n4:01\nwould need like because I would need both my hands do things at some point and a convention I tend to not travel\n4:09\nlight it's not an option with me I have a bunch of stuff it's not like a big old\n4:17\nsuitcase or anything I could use one of those one of those backpack type things\n4:22\nbut that piece of luggage with the wheels on them so I could roll it behind me had one that to many games but wheels\n4:30\nbroke off hey I wanted to ask when you\n4:36\nlivestream do you have like a tripod that you use on your phone or do you have like a little set up of books I did\n4:45\nsort of have a tripod it's more those thing it's one of those things that you has the neck comfort and you're put in\n4:52\nit just I think the phone just chills in front of your face there but I use it like a stand okay well yeah seems like\n5:03\nit worked pretty good yeah more recently though I found a small tripod which I\n5:11\nfigure I could use that instead would just stand a little bit easier then I wouldn't have to put anything underneath\n5:16\nthe base of the can of the camera holder died was using phone holders I was using\n5:24\nso yeah as long as it's one of those short legged tripods of the flexible legs yes I'm saying that they will\n5:33\nflexible tripods or balls stick logical\n5:43\nJudi or cork I'll chew yes oh I'm up\n5:59\nbefore any questions y'all may have for me as well you know just to keep their conversations going\n6:04\notherwise I'm cool for chilling well we\n6:10\nsort of do this every once in a while so alright guy your your voice used to it -\n6:16\nno I am yeah just like you mentioned not\n6:22\nwanting to livestream I wouldn't want a live stream in general okay yeah would\n6:27\nnice I would like I said I want somebody else holding the camera if I'm if I were to what live stream or you know make\n6:35\nrecorded content while I'm at a convention no no not even not even an\n6:40\napplicant but in the interim like in between between so that you all have money to\n6:45\nspend sort of the money that possibly that you want to spend on meeting\n6:50\nmeeting silver or you know silver all those people yeah the possible super\n6:57\ncats that you could get for that would be able to you know make up for what you're going to possibly spend is what I\n7:03\nmean yeah Oh fortune bag actually do have a generous donor that donates one\n7:09\nsnow well and he's done the end I get like a few hard dollars from him up occasionally so that's a big help\n7:18\nyeah aside from that yeah I just yeah\n7:25\nstreaming my life for doing videos that's not really a typical norm of me\n7:32\nyeah and when I did many many years ago it was more on a spur a moment thing\n7:39\nyeah I'm not tournament yeah now I'm not trying to make any of that nonsense happen I just want to get all the\n7:44\npossibly tedious things off of the list before there's we can get to more interesting topics like like something\n7:51\nsimilar the the Oracles the person who mentioned earlier about who mentioned\n8:01\nthe male mentioned bringing back a similar version of the mailbag all the people in the Judy are in the arbitrary\n8:08\nserver will collect all the all of their questions and make sure nothing you know\n8:14\nnon non harsh or nothing you know cruel gets through and then if you could\n8:19\npossibly you know answer one one or two out of you know the five or so that will accrue over the week do you think that\n8:27\nwould be something that you'd be interested in yeah possibly but you see\n8:33\non the daily basis I tend to I definitely tend to work as they're do as\n8:38\nI feel so it's not always consistent when I do one day I didn't next and so\n8:45\nfor except for hoping it's starting today with the meditation over an hour of tetris ninety nine at this point yes\n8:53\nbut that's the beauty yeah but yes the beauty of it that's the beauty of what makes you you know I'm spontaneous\n9:01\nyeah they can see yeah the sponte the spontaneity is good and I'm just saying you know like for instance people have\n9:08\nsome people just have very simple questions like you know like what's your favorite game and then there was that\n9:14\none person who had that kind of complex question about about the lifespan of\n9:22\nSawhney sonnies and Rosie's that's the I brought that question to you because the\n9:29\nrest of the question said people because I wrote the I put a little section you know questions for CWC then I gathered\n9:36\nthe one the Sahni one and I thought oh that's that's interesting nobody's ever really thought or as far as I know\n9:42\nthat's why I asked you you know what's the life of asani so just little things like that yeah let's go there's good\n9:50\nI love Sony's and Rosie's they're so cute somebody should make plushies is\n10:08\nthey haven't already Oh little pleasure someone here Rosie they'd be so adorable\n10:15\nI wish I could so in general what somebody could so and I'm sure they do\n10:22\nit not sure I would I definitely would recommend choo choo cosplay because she\n10:28\ndid do this to the sonic toothbrushes was nice stuff as was a nice tour bus\n10:34\nand you know she did good job bow for them oh yeah she could probably make some really cute little Sony and Rosie\n10:40\nplushies it's pattern making software\n10:46\nthe most an art Sam but I might do that\n10:53\nanyway cuz it sounds fun yeah Martin\n11:02\nthat was one of my favorite parts of the sonichu comic book series watching the\n11:07\nchaotic calm grow up you Sam\n11:14\nyeah I'll get help deaf I would definitely be able to expand on that when I get back\n11:20\nto that get back to working on the books I'm still working on these ship fit cards I end up making that a few more\n11:26\nrecently you're working on I'm starting on expansion where it's essentially\n11:32\nextra credit so it's like a budget ship extra ship and go cards just in general\n11:38\nbut also like literal items and\n11:44\nlocations so it's like I mean I'm coming I made a couple of start a couple of\n11:51\nstart cards one for the quick fill mall and one to one of each for D two silicon\n11:58\nsand quick though the one originally Oh quick the only one from comma they're different Basilica yet now they're both\n12:05\nin the same city because Congress relocate from West Virginia to click\n12:11\nthere everybody moved and we bought the\n12:16\nbig tall building with it bet that was\n12:22\nhard to move one piece said time took he\n12:27\ntook took it apart and rebuild it right across the street from the other Basilica that's cool to have two more\n12:36\nroom for the Transformers and such yeah and I should also cuz you know considering that the immersion of the\n12:42\nsilicon was more of a living library tight and gaming type of entertainment\n12:48\nthing the one from college pretty much now used for more of the business aspect\n12:55\nmore the local government aspect and all that oh yeah it makes sense it's like I\n13:03\nforget exactly how many stories it's a split s'more 200 stories and has the\n13:08\ncounter logo on the top that's like a big old antenna something I forget\n13:15\nexactly but yeah it's up there it's all that's a tall building\n13:22\nthere is a quick field for calm is like a mansion there's even a swimming pool\n13:31\nin the backyard there I want to hang out there but we have art we have arcade\n13:36\nmachines and video games in there too but also definitely libraries of books and music throughout the ages it's\n13:44\nmainly the theme of the Basilica that was the quick fill the circum is technology and music we throughout the\n13:51\nages and I know I know my father's been enjoying that since he arrived in quick\n13:58\nfill in the science-u form after he lost his original human entry losses human\n14:03\nbody in 2011 yeah well he's alive he's\n14:10\nthere he's there yeah he comes here keeps keeps my mama company now and then\n14:18\nthey have so it's awesome that's good\n14:25\nher best Scylla comes more of like it's kind of like a big Pokemon Center we\n14:32\ntake care of and rehabilitate a lot of pokémon there yes yes that's cool they\n14:42\ngo talking my servers like also big old hotel and office space a little bit yeah\n14:52\nlet's go I like that it all works it's functional it sounds nice it doesn't\n14:58\nhave a swimming pool though I want us I\n15:04\nmean have y'all seen like like you know the basura comps you know the original\n15:09\nfour CPUs have game industry between Neptune Blondo are in vert I know vert\n15:15\nshe has like a big old fountain type setup in front of her be so calm I want\n15:21\na fountain so fancy yeah that reminds me\n15:26\nof sort of futuristic art like futurism that's just as the style of neptunes so\n15:34\ncalm Plan F - it's like a futuristic style\n15:39\ntile just pyramid type cowards it started at our pains everybody's in\n15:46\nthat shape arbitrary talk in chat is\n15:52\nsaying oh they were saying that you could even know that yeah they said that\n15:58\nbut such as such as an S chuubo that has mega mega shells or special shells and\n16:07\nthen and then she said I should have I should have I've been all over the different territories I remember meeting\n16:14\ncompa for the first time have you have\n16:24\nyou ever heard of selective mutism before selective mutism I do believe that is\n16:29\nwhere only they're like random individuals just they remain mute even\n16:36\nthough they are able to speak or they end up they can say certain things out\n16:43\nloud but there are certain things where just like you know shut up on the among\n16:50\nthe spot there or like specific context I think yeah holy [ __ ]\n16:57\nBuddhist monks who take that vow of silence or whatever you're really really smart dude that's that's spot-on that is\n17:05\nthat was spot-on yes before so I definitely knew about it that that\n17:12\nthat's that's exactly what it is\n17:18\nwell I've always had I've always had a theory about you know about the way god\n17:27\nthis is gonna seem random but it has to do with the you know you're the that when what people called you know your\n17:34\nyou know your random-access humor that we live in a random-access humor society\n17:40\nif you look at the way for instance Family Guy is everything is filled with the other thing yep that's right just\n17:49\nwell that's hardly dude also I partly cloak because the way our brains work\n17:54\ntoo like biological computers so we have random access memory so we have access\n17:59\nto random access humor random access fat random artists seriousness random acces\n18:07\nretardedness and that's not even funny the way I save right there I it's funny\n18:14\nwhen you say it when you when you when\n18:25\nyou reach a certain point you've earned you've earned the right to say certain things you know what I mean yeah I've\n18:31\nlived a long life with autism so I guess it's alright I have immunity I could say\n18:36\nit's hardness and make everybody laugh yeah well you know just like how the gay\n18:44\npeople get to get the gay pass and you know everybody as it gets there gets their passes like how mister not mr.\n18:54\ngarrison I'm trying to remember his name the gun be hunter it was cows uncle I do believe anyway\n19:01\nyes and I want episode where they were doing that [ __ ] episode and that guy's\n19:08\n[ __ ] oh yeah yeah well there again and\n19:18\noh man at the and at the end of that\n19:23\nepisode I was tired of hearing the word [ __ ] they really prove their I know I know I get it yeah it was like it was\n19:30\nlike wow you can say the word that's that's great that was actually a really smart series yeah yeah well uh oh wait I\n19:38\nremember what I was going to ask it's a\n19:45\nit's a vast improvement over the third season\n19:50\nI heard Rick and Morty if you're talking about that yeah I haven't been able to see the fourth season because I haven't\n19:56\nbeen on cable television that much I mainly keep my cable television on one\n20:02\nof music and also smooth jazz type of thing yeah\n20:10\nI'm looking forward to in season four gets uploaded on to Hulu oh you oh yeah\n20:16\noh that's right I forget you like to you like to pay for everything if you if you'd like I you know I could send you\n20:22\nsome links to it some links to it on the internet I mean you're still gonna pay for it as you know as you know because\n20:28\nyou you know you pay for your stuff you're a good customer yeah well at least I'm least I know what\n20:34\nI like and know what I need yeah well because you know cuz torrents\n20:39\nare at torrents are out there and a lot of people usually use torrents that's\n20:45\nalso like product in the sense you're not like here you take that away from\n20:50\nfree just marching there see Darcy end up less likely to buy the media later\n20:56\nsure they come out on the physical or digital format I like having physical\n21:03\nthings best like physical things too but the thing that sucks is often the artist\n21:09\ndoesn't get paid there's a lot of people in between who end up getting paid and the artist who makes it never really\n21:15\nprofits it's just yeah intra middleman yeah yeah proud family on Disney Plus\n21:22\nand I binge watch a bunch of episodes recently around her i and scarlet did\n21:27\nwhile she was still doing to work for my body yesterday I think yeah but we definitely saw the it in the Napster\n21:35\nesque episode you can be covered to the matrix in downtown or any type of it for\n21:43\nfree it's our birthright that sloppy it\n21:49\nwas a good show to appreciate a little bit bear you know Bobby proud with Oscar\n21:57\nproud butter who sing talks a lot it's just fine and then the Christmas episode\n22:02\nyou just like oh I love me some fruitcake more smells like boot cake oh\n22:11\n[ __ ] I always liked them the most\n22:17\nyeah for Oscar I like it really I didn't\n22:23\nsee it I didn't find episode yeah I didn't get that episode yet in the series but I like the one where they're\n22:29\nI think if I remember correctly their house was being fumigated and something happened where Oscar got exposed to the\n22:37\nair from inside the inflated balloon that was surrounded housing himself and\n22:46\ndaddy did do do you have an eidetic memory\n22:52\nlike do you do you do you vision it seems like you have almost perfect recall certain extent I'm not totally\n23:02\neverything but as much as possible and I can actually I could learn the site\n23:08\nword-for-word the episode of filmation's Ghostbusters the bow for ghosts command\n23:13\nit was the episode where the paint cut where the toxic waste dump and he was\n23:18\njust illegally dumping waste into the source and those of Fenton ghosts command oh that's that's funny you\n23:27\nmentioned in the ghostbusters because that that that that night that night not\n23:34\nvery nice that but not very nice brownie analyst Ben st. tried to pull the holes\n23:39\nslime thing in one of the ideas to one of the one of the notions was to get the\n23:45\nslime away was like a Ghostbusters type deal where where it always existed and\n23:51\nit was well you know the rest from there but that was one that was a ya know why\n24:00\nso intent on my night Mikey in the server he's a oh yeah that's right yeah\n24:07\nwell I did it ever get that far Ben\n24:15\nsangstrup he has not touched on that commentary yet and there's definitely still a bit more to go on specially\n24:22\nsince now the last I checked was at the crossroads where where fan of horn from\n24:28\nthe beta timeline was being Rico if I kill her SOT you and my killer was\n24:34\ntalking to me about it like you know and yeah don't get her don't get our way don't do anything else and you know so\n24:40\nwhat's your response to that and eyeshade typed in response and in the comment underneath that there still had\n24:46\nbeen now what what that is and I'm sure that he is gonna drive it up as soon as possible he's on he's just taking a\n24:53\nbreak from that right now and I love know what happens after that I pretty\n24:58\nmuch saw the whole thing pretty much the Payette timeline falls apart and crumbles and the Christian acai from\n25:06\nthat time line it just essentially was momentarily deceased but then but to\n25:12\nwith her shared or yet with her reality stone brings the entire alternate\n25:18\ntimeline back and so now kill her and everybody else has all times debate\n25:23\ntimeline to go back to well as as the Judy Ark or couch you would say been\n25:31\nsaying will always be in the beta mine as opposed to your alpha mostly rear I\n25:43\ndefinitely did my made my favorite intrusion of wish to specify which made\n25:49\nhim think and specify about that so yeah but at least me were able to touch on on\n25:54\nthat yeah well I found his attempts\n25:59\nrather rather juvenile to be honest to it it because I had a discussion with\n26:05\nhim before before the art was even being popularized before you know all of that\n26:12\nbecame lore I had a conversation with him and he he kind of was very\n26:17\ncondescending to me and tried to you know pronoun police me even though he doesn't know my pronouns or didn't care\n26:23\nto ask and the you know miss portray what I didn't like is he tried to miss\n26:28\nportray a maker and yeah I might for saying that you know you you and he\n26:35\nlaughed he laughed it laugh at us because we said that you deserve real friends and I did and I just didn't\n26:42\nappreciate that yeah I've didn't I remember yeah I do remember didn't I remind of the panel\n26:48\nwhere you see had where the kids next door were brought to cop-killers for judgment yeah yes weird how the lack of\n26:58\nself-awareness in that he was trying to make fun of you but he didn't call you unoriginal even though he was copying\n27:05\nyour idea for taking down four cent garbage except he just did it with the\n27:11\nkids next door hmm Wow yeah and and Ian\n27:16\nwhat's what's even funnier is the kids next door was it was just a group that\n27:22\nwas made up to you know to make sure that nobody was messing around you know messing around you know around any of\n27:28\nour secret love houses the Oh C's are real and it didn't need to mess with that yeah yeah yeah once he put them in\n27:36\nonce he put them in Chains so that's when I got kind of upset because I know number you know like I know number one\n27:42\nyou know and number three kuuki-chan you know they're not they're not bad people they don't and you know like he\n27:48\nwants to call himself progressive and say that he's a you know but he puts a little black girl in Chains that's not\n27:54\nvery nice no they're just children you\n28:00\nknow and you're safe now yeah I'm glad they're safe now and I\n28:06\njust wanted to be done with them I just had to bend for that event event that a little bit because yeah yeah I think I\n28:14\nmentioned too I think I mentioned to your business bismuth about how the aging process tends to work in C 197\n28:20\nit's a bit more it's a bit more slowly for everybody so everybody does live\n28:27\nvery long time which is why Sonic is still 16 around 16 in appearance they\n28:32\nstill a lot older he's actually still a lot older than that to be honest chin\n28:37\nthat freaked me out like when an egg like on an existential level when when\n28:43\nyou told me that because like I thought of I thought of you know just think\n28:48\nabout what that would be like to live to live in that way like your your life sort of resets every once in a while or\n28:56\nlike time moves slowly that's it's very like\n29:01\nlike a Greek Greek tragedy that's kind\n29:07\nof a scary thing when you think about it in the sense where you're seeing the situation over and over again in your\n29:14\nvision or your Lehrer going groundhog danger just reliving the same day for\n29:19\nlike just under would just change this light circumstances slightly until you get it right well not well not only that\n29:27\nbut like where yeah like they're there's so many different like cause-and-effect\n29:33\nissues that go on it's it's similar to time travel because it's like you would\n29:38\nstill have like how long how long would one's consciousness be able to you know\n29:43\nstay stay fresh before your body would become like because like your body could\n29:49\npossibly stay spry and young you could still be spry and young in your body but you know your consciousness could\n29:55\npossibly grow grow weary are tired from all the knowledge gathered and even you\n30:01\nknow they're not having the knowledge itself could be somewhat painful or if that makes sense I don't know yeah I hear I hear that you can definitely\n30:09\ndefinitely recommend you could ask about this count gradual on himself because he's been reincarnated a few times\n30:15\nbefore over the past centuries are you kidding me I love gradual on I'm not\n30:21\nkidding he was originally born and I do believe I remember correctly and like the 14 50s or so and he got me a car\n30:29\ndate a few times over the centuries until he was born last recently in the\n30:35\nlate 1970s and this in his last body before he lost that became just a soul\n30:42\nin New York that he was when brightly and merrily what wins Marilyn Walsh met\n30:47\nhim and and then the story as it goes then he finds somebody else that looked exactly as he did when he was alive as\n30:55\nwell in amongst his amongst this sound the fight is possessed raka'a he was possessing magic the male science you\n31:01\nthey met us aren't you and he goes and then he this possesses that guy move\n31:08\njust push this though out entirely and site you be itself once again and end up\n31:15\nworking under his employ now just body\n31:20\nhopping you have always wondered what what gradual nose up to yeah yeah but\n31:26\nthat was life cells back in 2010 or so I\n31:33\ndo believe I have the books nearby have to double-check but anyway anyway aside\n31:38\nfrom that I have a question you you III\n31:45\nbelieve it was either it was either you or scarlet mentioned that you had found\n31:50\nyour success for a year success your success or no it was the success it was\n31:56\nspeaking of Christian or whether or not yes scarlet who typed it up and she was\n32:01\ntalking about me in being successor to her share of responsibilities and\n32:06\nabilities and powers good okay making\n32:12\nmaking sure in more recent years and\n32:18\nincluding ones with idea guy he had become more like okay so I'm just tired\n32:24\nof well I had become tired of torturing people just like make a lovely go\n32:30\nbecause he was he was he was unable to feel loved and I was like I should talk\n32:36\nwith him and we were actually we became we became friends that we found common\n32:41\nground and so he's kind of more like an antihero now and he's been not he's been\n32:47\ngood and helpful to us and quick fell and everything since that that's it like\n32:53\nI I'm honestly not being condescending to you like that's brilliant that's why I like the idea of the cpu's you you\n33:00\nknew how to fight the idea guys you're yourself with the with the CPUs like you\n33:07\nknew exactly how to fight those bastards partly I had to learn along the way\n33:12\nimagine you know that you had the tool so is what I'm saying you know and I'm\n33:17\nproud of you for that yes thank you and I'm like almost gonna cry about it cuz I'm like I'm subject\n33:23\nanyway yeah me you yeah I hope grad you\n33:28\nwan finds and is able to feel loved someday he kind of gets it but it's not\n33:34\ntotally I mean I learned what the word was from that episode of supervillain\n33:40\nwith the burning questions about life and I was actually so one who submitted\n33:48\nthe question and they can decide me as the saint Chandler as they just Chandler\n33:55\nnot Christian or Christine Chandler just Chandler it's hard for me to recall what\n34:08\nthat word was guess it's multi symbolic\n34:16\nremember it are you free to gradual on\n34:29\nfuller strange they keep calling me Knight V and it's kind of frustrating well they're not Knight me your friend\n34:36\nis nightmare I like to I like to call you now you say good night and at the\n34:44\nsame time it's cute well I just want to take it as you're saying good night tonight V as well yeah\n34:54\nyeah no I mean the other people like the trolls and stuff we they try so hard I\n35:07\nthink they're so lame luckily we distract hey am i mom look I'm looking\n35:19\non my other phone on YouTube right now parenting the subscription so that my skin is gonna upload a video soon talk\n35:27\nabout the very first ever real Dungeons &amp; Dragons game session she ever had\n35:35\nthat's kind of perfect yeah how about that it was the person\n35:41\nthat created Dungeons &amp; Dragons was it Gary Gygax right yeah I would say that\n35:49\nsounds about right fun there's much much collection as I know about from references that I've heard over the\n35:55\nyears and from seeing everything I recall the cartoon that came out what\n36:05\nthat came out in the 90s it was kind of was it uh Wayans brothers in it yeah\n36:16\nthough the Wayans brothers was in a Dungeons &amp; Dragons movie that came out in the 90s and it was like kind of bad\n36:22\nwhat's that's a live-action one yeah I just remember like the rib footage of\n36:28\nthe Ranger clinking his bow yeah but you just reminded me bismuth of that guy we\n36:34\nknow who thinks the guy who created Dungeons &amp; Dragons is uh that that guy\n36:39\nwho did you know - uh Terry oh yeah oh yeah somebody thought somebody\n36:45\nmistakenly thought that Terry Davis was the creator of Dungeons and Dragons and\n36:50\nyeah that frustrated me because he created Temple OS not he created he\n36:57\ncreated an operating system he wrote a compiler I just I just looked\n37:07\nI just looked up the video that has the our word of the day they're talking about and not be you know feel loved or\n37:15\nsimilar emotions the term there is a lecithin young\n37:27\nyou\n38:32\nChris do you have anything a special plan for the anniversary of sonichu that's coming up yeah nothing special\n38:40\nright off the top of my head cuz I'm more focused on the dimension merge and the present process set of events on\n38:49\nthat well what about your birthday I mean your birthday's coming up soon yeah\n38:56\nthat yeah that too um I just I take it as it goes what what happens happens and\n39:02\nif something really positive happens I don't know maybe someday comes over and\n39:08\nactually it binds to take me out to wood grill or something we celebrate there or\n39:14\nI get like a whole massive amount of presents just simply delivered to my front door on that day it's or just or\n39:21\nnothing happens or or the merge happens and I'm or imagined finally gets full\n39:28\ngets finally is able to come back into 12 18 Foley and he and I are st.\n39:33\ndimension woe or whatever and so forth so I mean it's just like it's it's so a\n39:41\nday I'll look forward to and what happens when that day happens but between what birthday in March 17th well\n39:49\nif you want Chris and you're not doing anything that day we can watch movies\n39:55\nlike over the Internet yeah I got tried\n40:02\nthat why it seems like it was okay but it was like hmm it's like it's like\n40:10\npersonally with me if I find more enjoyment and in when I'm doing things with others in person face-to-face yeah\n40:18\nactually lived closer I see well it I mean if you're not doing anything that\n40:24\nday just let us know and you have nothing to do and we'll figure something out that we can do on just just for an\n40:33\nidea but you can bring some for yourselves okay all right go it'd be cool [Music]\n40:39\nwatch the Transformers movie was a good movie yes oh yeah that's right yeah\n40:46\nten about the original right yeah I mean it's sad I don't like an optimist eyes\n40:51\nbut I can't tuck got totally upset over\n40:57\nit just I think locked himself in the room for a while after that but yeah but\n41:05\nyeah I could say I still identify with that with the way what happened when I saw my women I saw my father as he left\n41:13\nand then suddenly I succeeded him and his life in this became I felt like I\n41:19\ncould relate to hot rod Rama's Prime there yeah that's right I was Orson\n41:29\nWelles who did the voice a Unicron yeah\n41:35\nhe is creepy giant war Beast I've never seen the animated\n41:42\nTransformers movie you need to see it the way a delay scenes together is great it's a it's done in an anime style\n41:50\nI mean it's based it's based on Japanese toys anyway but then the way that\n41:55\nanimation is done it's very ugly yeah it's very like it's very pretty okay I'll have to check it out does\n42:10\nanyone in here are you guys a Ralph baski fans yes yes yes yeah I love Ralph\n42:17\nashbey yes he made some good animation films I really liked his Lord of the\n42:26\nRings that's probably one of my favorite movies oh yeah The Hobbit was good to bless universe my\n42:32\nfavorite though is yes absolute favorite I didn't know he did that yeah I\n42:42\nremember Ralph back spassky's more risky and trees though oh oh look what's that one\n42:51\nwizard Fritz the Cat yeah that's it Fritz the Cat yeah he also did the movie\n42:57\nheavy traffic oh yeah I remember that one Mary Ann Marie's huh\n43:12\nFritz the Cat I think was one of the furries yeah you know yeah in a way\n43:20\nwell one of the first not-safe-for-work furries oh yeah Ralph esky back she did\n43:26\nthe Mighty Mouse animated series not the original 1970s few cartoons like Fritz\n43:34\nthe Cat yeah at least the first one yeah\n43:44\nunder involved in Fritz the Cat to the\n43:49\nartist right the guy used to draw it says yeah yeah yeah yeah the guy Henry\n43:58\nClay Henry Crum something crumb our crumb from a crawl\n44:04\nyeah something crying something crumb was a guy who catches for Fred's oh did\n44:18\ny'all see discord in The Princess Bride that I love kids possible a lot uploaded\n44:24\nrecently oh yeah yeah yeah that was it that was a wholesome that was a\n44:29\nwholesome meme yeah that was really cool and just you know when tempest tells\n44:34\nPinkie Pie rotate the lever course then\n44:42\nthere's my two pieces of art that got featured in there just the cave of this\n44:47\nbear with the chute no cage of despair\n44:53\nJack cage Nic Cage Nic Cage there it is Nicolas Cage there drawing Nic Cage and\n44:58\nthen of course blood of Cora that lovely piece flourish shines the Cora embracing\n45:06\nand laughs oh that's a cute pairing\n45:13\nSakura do you remember when we used to have that I know other people in the\n45:23\ncolor are gonna gonna get mad if I ask this but what do you think of it and what do you think of the new Star Wars Episode six oh you're like fortunately I\n45:37\nhave Disney Plus yeah does he pull help\n45:52\nhow big of a Star Wars fan are you my my hardly Oh\n45:59\nare you more like me are you more of a trek fan I've watched I touched on Star Trek\n46:09\nI've watched I've mostly watched Star Wars I liked Voyager I like the old Star Trek\n46:19\nbecause it's more like The Twilight Zone where it's it's just like one science\n46:24\nfiction story per episode that kind of has a twist at the end it's all classic\n46:31\nyeah well there's also yeah there's a\n46:37\nlot more a lovely tale wrapped up in there well III like I said a few before\n46:43\nbut I don't think that chin has had it I've heard it CME's heard it but I think\n46:50\nStar Trek is like the ideal idealized way like how society should be but Star\n46:55\nWars at a society is gonna be so utopian\n47:00\nJane was kind of weird yeah you want to talk about utopia you should mention I\n47:07\nfeel like I could just mentioned the movie version of The Giver I love that\n47:14\nmovie yeah and I read the book when I was in high school it was really different in the lead role I put\n47:20\nKnuckles the Echidna there well that's actually really interesting and in the\n47:25\nyounger and the in his younger brother who said I want my smack instead of I want my\n47:32\nsnack I put a tails in that role oh I\n47:38\nwill never look at that movie the same way ever again but I was back in my high school days I\n47:45\nstill for my I found site you personally you know yeah between between prominence\n47:55\nmiddle and high school I put but just nearly every side character in the various roles just that's the way I was\n48:03\nso I was definitely in tuned to you know to I was definitely more to would see\n48:10\nwhat nice and way back then and I thought about this thing about sign for a jog every day\n48:15\nand that's a sign for me being a die-hard fan and watching Saturday morning and adventures of and all that\n48:21\nand I only seen a few episodes a few episodes of underground in high school\n48:29\ndid they ever um when you read The Giver did they ever give you like a report or\n48:34\nlike a project that's what you had to make up your own ending um I'm not sure\n48:41\nI do believe that question was asked I don't remember exactly why I said so I'm\n48:47\ngonna say yeah we had to do that because the book lift up on such a cliffhanger\n48:53\nthey're like no you have to create your own ending and thanks to the movie now\n49:01\nwe do have an ending yeah and the same thing and the same can be said for the\n49:07\nmist stephen congress the mist oh yeah i heard in the comments here i did read\n49:14\nthe book but I heard the commentary day there was no ending in the book but then\n49:19\non the movie but got oh shoot his family's dead he's still alive if you if\n49:29\nyou really like the mist at all the MS Stephen King essentially ripping off HP\n49:36\nLovecraft HP Lovecraft wrote a lot of short stories that are quite creepy but\n49:43\nthey're they're very good and I think I think you would like them but uh anyway\n49:50\nyou you you remind me I think I said but you're like cereal you might move Lane\n49:56\nlike you're like the god of the wired oh yeah lean so kawaii I smell like the\n50:03\nfirst three episodes so far I need to watch I need to watch the rest of it though kind of true that's so everything\n50:12\nis services yeah if Lane was on\n50:23\ncrunchyroll for example I'd be definitely a client so just finish the series there I'm just saying I I think\n50:32\nthey have the sub and up on YouTube but yeah if you don't have advocate gets tiresome I'm sure they saw the DVD\n50:38\nonline maybe buy the DVD set oh yeah buy a DVD DVD sesh look at that\n50:43\nyou look that up I think the Funimation the Funimation channel gets the revenue anyway because they're partnered with\n50:50\nYouTube but it's it's difficult to get physical copies of home you have to get\n50:57\nin order to get digital copies you have to go to Japan or at least order yeah\n51:04\nthey do a blu-rays oh yeah I have they blu ray/dvd combo of the complete series\n51:13\nof the original of the original animation the Hyperdimension Neptunia so\n51:19\nthere is a 13-episode so yeah someone\n51:31\nmention the Lovecraft Bible is that the one written by a Robert Robert M price\n51:40\nI think are you talking about the Book\n51:45\nof the Dead no someone mentioned they mentioned the ad Lovecraft Bible and I think oh it's\n51:53\njust it's little it's just the Lovecraft collection I guess he's collection\n51:58\nbecause I love crap Lovecraft was very ahead of his time like he created as an\n52:03\nown entire world of God did everything yeah and there are people to this day\n52:09\nwho follow him yeah that's right the\n52:22\nNecronomicon has fo glisten and nothing like that will yeah of course they're nothing like the real demonic runes HP\n52:29\nLovecraft made it up just like what's his name Abdul el doesn't look rapture like\n52:37\ntentacle creatures well he's I don't think he liked him hey I'm not easy if\n52:47\nyou this way he describes him he doesn't sound fond I'm not a big fan of Stephen\n52:53\nKing but I do really like the Darabont films who knows how to you know that I\n53:00\nadapt him yes\n53:07\nShawshank Redemption and and the mist that he did yeah as a matter of fact\n53:12\nwell Chris brought up the mist I was like that's the one movie I actually like I wonder if you saw the black and\n53:21\nwhite version or the color version though whether in black and white\n53:27\nyeah cuz Frank dare about he wanted to release it in black and white but the\n53:34\nstudio made him shoot it in color so there's a director's cut that all the\n53:40\nonly differences it's in black and white that's really cool that's what they\n53:46\nshould have done with Jun Jie Ito's anime well they didn't\n53:52\nget it they didn't get the proportions or the a lot of things right no they didn't try it was kind of half-assed\n53:58\nthey didn't understand what made it so good in the first place I wonder if the\n54:03\nwho's a mom I like I saw clips from and it just a little better in black and white I'll bet you it would probably I\n54:14\nmean it's part of his style that's part of his aesthetic at this point I mean\n54:19\nyeah just the black and white and there's there some of the some junior\n54:26\nyou know stories where you know right at the last couple page turns it gets you\n54:32\nhey next time we do this and Chris is\n54:38\ncoming on just let me know beforehand and all bringing the other guy okay Kiki\n54:44\nSonny still hasn't come on even though I think she's here lurkin my brother came\n54:58\ndown and chance was going off oh my tummy's been hurting but I'm bearing\n55:04\nwith it I don't think going to the bathroom would really help me at this point I'm sorry it's okay it just hurts\n55:22\nwhat localized or general or what\n55:30\nlocalized or general um sure I know it feels like it hurts in my intestines and\n55:36\nit's got like a sharp pain mm-hmm and I'm afraid to go to the bathroom again\n55:42\ncuz I don't want to release any more bloody chunks cuz that doesn't seem like something that should be coming out of\n55:48\nmy body hey I need to uh get ready I'll I'm\n55:54\ngonna stay on I'm gonna keep my mic muted I'll be back on okay all right later guys later yeah if it's anywhere\n56:02\nspecifically near the surgical site that would be not good yeah it's around that area but it's been\n56:10\na while since the surgery so I'm not sure I don't know [ __ ] about medicine\n56:27\nthat's why it's good I'm seeing the doctor tomorrow I guess she actually\n56:36\ncame don't be afraid of Christian she's\n56:45\nnice I'm not afraid of Chris it's not it's not Chris I promise it really isn't in fact I'm\n56:52\nreally excited to talk to Chris um but I did want to say um the is it possible\n56:58\nthat it could be an infection because I had an infection in my intestine once and that's exactly what it was like\n57:04\nexcept all the bloody stuff it was like a stabbing pain and I'm good really bad\n57:09\ndid you poop out gelatinous bloody chunks no I didn't run into that pit but\n57:15\nI didn't throw up and I did I did get like yeah I was soon it was enlarged to\n57:22\nsomething they had like a cat scan was it kept that John the name Kyle medical\n57:28\nman helped it was a big tunnel and they\n57:34\nput me in and yeah I mean you know the\n57:39\nbest thing was as well they gave me medication and the medication like holy [ __ ] was like someone pouring whiskey\n57:46\ndirectly on my brain like and I was just not there and they have the IV in my arm and they're like\n57:52\nokay you're gonna feel a little funny in a moment I'm like sure okay and then as I was sat there at this feeling just\n57:58\nlike rushed on my body and I was like holy [ __ ] so high he was great he went\n58:05\ninto the un's of the sinking place yeah I was high as a kite it was great but\n58:12\nthe problem was that like my super conservative Christians mother-in-law\n58:18\nwas there at the time so I couldn't swear by nearly did and she gave me this look like I just barely stopped myself from\n58:24\nsaying holy [ __ ] she just gave me this look like I know what you was this\n58:34\nperson and why are they messaging man things are slowly wean it's that bun bum\n58:43\nbum none he's a firm stone yeah I got that don't\n58:50\nworry yeah excuse me miss aquamarine but can I ask you something and I'm like no\n58:56\ndon't people do you know I don't know what it is about you I quit but like it's always you I'm so weak because I'm\n59:04\nthe nicest feel like I'm nice too but I\n59:13\ncan be kind of a [ __ ] to a lot make\n59:20\nsure I found the best meme just I need a post that hold on hold on they sent me a\n59:26\nmessage but I don't know I don't don't\n59:31\neven message him I literally have his I have his QE Farms tag and I can write on his wall and yeah okay yeah I also like\n59:42\nsomething a family some I found this meme I really I never minded me you I posted it in the discard in the the\n59:50\nplace yeah okay I'm gonna send you a\n1:00:13\nkind of gross picture and ask your opinion on it that okay sure okay let me find you here\n1:00:26\nin before it's something like much worse than gross that's like so my friend\n1:00:33\nfarmers oh it's floating and it seems to be blood and mucus could be an\n1:00:40\nintussusception which is the intestine\n1:00:46\nkind of telescoping into itself that\n1:00:55\nsounds like a bad thing it's it's not great pain if the pain\n1:01:07\ngets really bad yeah go take an urgency room they can develop complication yeah\n1:01:15\nit seems kind of mucousy yeah it is and\n1:01:21\nit keeps coming out of me I'm really worried I'm honestly really worried the\n1:01:26\nguys hearing you I'm not gonna die oh my\n1:01:32\nand exist without screaming needs work\n1:01:40\nI'm gonna check on you in like 12 hours and if you don't answer then hey when\n1:01:53\nthat happens because then the person who's actually sick ends up having to comfort the other people it's really weird\n1:01:59\nyeah don't be weird\n1:02:05\nyeah here's a cute picture of a snake\n1:02:12\njust a tiny noodle very big eyes so\n1:02:22\nsmall so thin little noodle equal this\n1:02:33\nis what I got done so far when we were talking misty oh that's cute you may\n1:02:40\ntake a little Cyclops baby yeah there's a coupe baby Oh\n1:02:47\nsnick maybe thought of a name firm yep I'm gonna call me Jeff really yes what\n1:03:00\nBush I think that's the first thing that comes to mind for some reason why Jeb\n1:03:07\nyeah yeah okay George so I go I'm gonna\n1:03:20\ngo Jeff okay aqua look what BB's where\n1:03:28\nright there it's Oh baby oh I love the ones where it\n1:03:38\nshows like the the big crimson I'll hold in the little imp a dip the little blip\n1:03:44\nBeast here we go baby god I hope she doesn't\n1:03:52\nfind that fricken those things in general I hope she doesn't find that duck-call thing girls I'd be muting all\n1:04:00\nnight I don't think I don't think Christine wants to hear the sound of the\n1:04:06\nduck no I don't think anyone does this whatever the heck it's called here my\n1:04:17\ngirls gotten a little thingy that when you blow into it sounds like a duck oh I know what you mean like a like a caller\n1:04:24\nyeah I think it's a party favor though that got like the little wrapping ticking off on the end so weird why\n1:04:32\nwould you want to get one of those as a party favor are you gonna do the track ducks hello but when Donald freaks out\n1:04:58\nand makes the noises yeah yes those ones have you guys seen the UM\n1:05:06\nthe duck tales episode where his voice like in the new series where his voice changes and it's super manly yes to\n1:05:21\nnormal he's like for testing oh yeah hi\n1:05:36\nI'm Christine hi by the way I'm sunny sunny hi nice to finally talk to you oh\n1:05:44\nyeah well the thing is Muriel obviously like when I'm channeling Ariel she's\n1:05:50\nyoung like a younger mindset than I am so this is me an Ariel I don't think\n1:05:56\nshe's going to come out after all cuz no\n1:06:03\nvery shy very small way shy she might come out if we encourage I should I say\n1:06:17\nrather it's that I'm not lying her I guess that's the way best way you put it cuz I'm shy so you're being protective\n1:06:24\nparent yeah another time another time\n1:06:29\nshe's don't cry tell me or sweater down\n1:06:42\nwhere it's wetter take it from me we're\n1:06:49\nall mermaids ask you Christine what do you think of the the live-action My\n1:06:54\nLittle Mermaid what are your thoughts on it I have not seen it I have not seen any of the live-action Disney movies it's\n1:07:02\nnot out yeah um well into how in the yes yeah they just made a bunch of changes\n1:07:11\nthat are kind of baffling yeah I don't know about any of the changes I only know that all the mermaids and now I have\n1:07:19\ndark skin that's the only thing I know that with like a man I I heard they did\n1:07:31\nwait really really was based on the drag\n1:07:36\nqueen so really no yeah he really wants was this really famous drag queen hold\n1:07:43\non let me look it up there's this really famous track clean and at some point and um they based our Sheila off of this\n1:07:49\ntruck she's really famous hold on I mean now let now makes more sense why at\n1:07:56\nrandom times when a drag shows or whatever they tend to quote it's in the\n1:08:01\nplay Ursula song from The Little Mermaid yeah they're doing all march to the\n1:08:14\nDisney villain and now I see this merciless person a drag queen mission\n1:08:26\nexcuse me I've always liked Ursula is an\n1:08:35\nUrsula supposed to be like a like a black character that's it divine divine\n1:08:40\nyeah yes Oh way made the Ursula was based on\n1:08:47\ndivine yeah yeah she's a jack performer from the eighties I don't actually know\n1:08:52\nanything about it but I read that online and I was like that's really interesting I've seen a movie playing pink flamingos\n1:08:59\nyeah yeah that's linked in the am Wikipedia article I think I've seen that\n1:09:04\none it's pretty good do you like it is it good baby it's it's\n1:09:10\nright but it's quite quite dirty\n1:09:24\nor yes have you ever seen crybaby with a Johnny Depp no I think that was his\n1:09:33\nfirst big movie like his first studio movie and it's really it's a musical\n1:09:39\nit's really strange what was that what was that side again cry-baby\n1:09:46\nOh cry-baby I know why it's just it's just I think in the contest the\n1:09:51\nconversation may be slipping that's right now go hide it's uh it's about a\n1:10:03\ngreaser like in the fifties it's kind of but but it's not Greece okay it's a\n1:10:08\nmusical about a Greece in the fifties but oh yeah okay anyway yeah dog yeah\n1:10:20\ndog pants he's very very vocal there you\n1:10:27\ngo cookie chance even little Pomeranian know how adorable he is kind of like my\n1:10:36\ncat she's like she's got this really weird habit of if she gets let in the house by someone other than me she runs\n1:10:42\nup to my room and screams at me I don't know why I don't know what she's doing\n1:10:49\nmaybe I don't know why I'm just like what do you want and then she goes again so it's like okay how did I just imagine\n1:10:57\na cat screaming at the top of its lungs well I mean she there's a good description that's really what she does\n1:11:03\nshe just comes in and what do you wanna I mean she goes away again to lick her\n1:11:10\nbone or something I think she misses you\n1:11:18\nwhen she's outside maybe could be right I thought maybe it was like she check to\n1:11:25\nsee if I'm here because then sometimes she goes straight back outside again so it's like you just come in to scream at\n1:11:30\nme a little yes just gotta scream at her mommy and then go in the back\n1:11:37\nshe was doing yeah that's cute\n1:11:42\nyou like pop-tarts a lot reasons I still can't fathom she freaked out and like\n1:11:49\ntry to bite the pop-tart away from me and like your cat you're not supposed to like these things it was strawberry she\n1:12:01\nlikes the best she had a preference she did she'd go after any of them but if I had a\n1:12:07\nstrawberry one oh boy it was on sure was\n1:12:14\nI left in my own art you know there's something funny about the us actually you guys have a lot of pop tart flavors\n1:12:21\nlike we don't yeah my favorite are the s'mores do you guys have cherry cut yeah\n1:12:36\nwe have cherry coke it's really nice\n1:12:45\nokay I feel like we're switching topics from pop-tarts to soda well technically\n1:12:54\nit here it here we have a soda flavored pop-tarts oh yes I think lemonade flavor\n1:13:04\npop-tarts those are really nice yeah we\n1:13:10\nhave this thing over here that you guys don't have it's called freedom medical\n1:13:19\nbills enjoy it yes that's why they give\n1:13:32\nyou options with anything the toys you buy em girl just loves going and options\n1:13:41\nare what are good sure to have the\n1:13:47\noptions yeah just like good you can make punch counter punch now but or Decepticon\n1:13:53\nroars do as I did I found it in between I love them all yeah I wish I could\n1:14:07\nafford them all but I cannot Transformers are expensive oh they are they've got more expensive these days\n1:14:14\nyes I mean I definitely want to get the new Transformers siege Omega Supreme\n1:14:21\nbecause I'm a collector of the micro masters and debt nap and countdown is\n1:14:27\ncomes with Omega Supreme as the original countdown came with the transforming\n1:14:33\nlounge launchpad place it with the white and grey rocket I have one of those I\n1:14:43\ngot me a jet fire boy got her a big jet\n1:14:51\nfire yeah so what I gave you my copy of jetfire and\n1:14:58\njetstorm you did I love my boys they're\n1:15:04\nadorable I wish that series could have got another season so we could see more of them Indian a season four apparently I\n1:15:13\nheard that they've done reflect with Lecter in that series oh that's Mirchi to become a tank\n1:15:20\ninstead of a camera still feel we got robbed\n1:15:25\nyeah oh well well this season these seas came out with the refractor and\n1:15:31\nreflector between both and cartoon colors and the toy colors in the in the\n1:15:39\ngift pack which I end up getting both because I got the camera parts with the\n1:15:46\ntoy color and I also got the upgrade kit for the cartoon color oh cool so I got\n1:15:55\nso they both have their flashes and upper pieces up for centerpieces\n1:16:02\nand yeah I mean it's questionable decisions but we still love them magic\n1:16:09\nchant actually Gabe told me the reason why I was allowed to have both sets of camera box to remind me to keep my focus\n1:16:16\noh and there's also sitting there's also\n1:16:23\na literal symbolic reference in hwhiteland in the cameras and the way I have right\n1:16:30\nand the way I have both of them in my room right now sort of like a way of\n1:16:36\nlike you know just watching me from where I am on the bed and watching me\n1:16:42\nportal that opens at the bedroom door\n1:16:49\nit's romantic yeah my hubby's got my back oh yes we\n1:17:02\nmaker is a SAP for romantic things yes so a Steven universe yeah ah now\n1:17:09\nsomething I can actually talk about I don't know anything about transformers but Steven universe mmm by the way I had\n1:17:17\nmy away the events of Steven universe happens everything else in the universe happens in an alternate timeline where\n1:17:25\nWorld War 2 never happened really yeah so let's just let you know\n1:17:31\nhow the crystal gems fare to world war ii because it didn't happen that makes a\n1:17:37\nlot of sense actually hmm I would imagine that if they were around then\n1:17:42\nthey wouldn't have gone it wouldn't have been drawn out so long because they're so powerful doesn't make any sense there\n1:17:49\nwould be peace and harmony like if there was that and there would be no internal strife or struggle I don't know of the\n1:17:56\nyeah of this of the series I've seen up to the end of season 4 I'm surprised they don't go beyond that on Hulu cuz\n1:18:04\notherwise I'd be fully caught up yeah they don't enough lakes either I'm the\n1:18:10\nsame I actually skipped like half of the office areas in the middle and went straight to the one\n1:18:16\nthey just released like Neyman days they're really good Christine you should watch them lame it's so Steven universe\n1:18:23\nis on Netflix it is yeah but they've only got I think the first two series are then again\n1:18:29\nthough this is the this is in the u.s. Netflix I have a different one because I'm obviously so but yeah they only have\n1:18:36\ntwo series it's really annoying yeah Hulu pairs up to the end of season four in the u.s. that's a little better not\n1:18:44\nperfect though ideally have them all yeah I have seen the movie oh you have I\n1:18:52\nhaven't seen it is it good yes it's really good he says you see essentially the crystal\n1:18:58\ngems are referred back to where they were when they first started losing all memories and steven has to remind them\n1:19:06\nand spinel is just all sorts of fun it's\n1:19:12\njust quite good yeah pink diamond was\n1:19:17\nwas part of it too I won't spoil it oh really yeah no don't spoil it I'm I'm\n1:19:23\npretty hype for it it's you know it wasn't shown over here that's why I haven't seen it how stupid is that they\n1:19:29\ndidn't actually show it over here use the Internet I I should but you know\n1:19:36\nwhat I'm like I'm so behind and watching everything like you told me to watch bumblebee right it was on TV\n1:19:42\naround Christmas over and over again on the movie tunnels and I didn't watch that was your anything about wait what'd\n1:19:48\nI tell you about the bumblebee movie yeah there's a transformers one yeah I\n1:19:54\nlike I like the bumblebee movie yeah my um maker told me to watch it and I\n1:20:01\nhaven't I didn't I didn't do it no it was so cute I know I will and actually\n1:20:10\nit works better to me to make Michael Bay movie so much yeah that's what she\n1:20:15\nsaid yeah yeah I'm saying now I'm saying it okay so I've got two words of\n1:20:24\naffirmation here yeah okay tube you watching that I have to watch full movie no Doritos Starscream's\n1:20:31\nexcept the one I got for Christmas cuz I love my mom and she didn't know any better Dorito Starscream yeah the triangular\n1:20:39\none in the Michael Bay movies oh okay yeah you say trying your start you say\n1:20:47\ntriangle and Starscream and that makes me think Starscream when he was on\n1:20:52\nCybertron in the generation 1 cartoon before we came to earth as well as the\n1:20:58\nother seekers and that he was in the corner he was me released as in the siege line yeah them ghosts like you\n1:21:08\nknow before Starscream into his jet mode he's like in beg Charlie ah you caught\n1:21:15\nup so easily just like a paper airplane\n1:21:22\nthey are entertaining yeah but yeah yes\n1:21:28\nI put on my Christmas list my mom wanted me to do a Christmas list and I put Starscream on it not thinking about how\n1:21:34\nmany iterations there are so she got me the Michael Bay one and he's still\n1:21:39\npretty cool I like him is I like the\n1:21:53\nTransformers Prime stars Green a lot I think that's one of my favorite iterations yep and yes you look like you\n1:22:00\nwore high heels yeah it was just so devious and it was\n1:22:09\nfun to watch him fail episode and that\n1:22:16\nlate season episode leave this season 3 where essentially to make it the\n1:22:21\nDecepticon base became up Resident Evil haunted house with the effect we get\n1:22:27\ndown knockout and Starscream messed up\n1:22:32\nreal big and then guess who saves today\n1:22:38\nSoundwave here's to baby said all these Decepticons yeah he couldn't speak in\n1:22:48\nthe city this iteration yeah I think he did say one line but it was really short\n1:22:55\nI wish they would have done more with him yeah yeah it was a song it was\n1:23:02\nAutobots inferior Soundwave superior yeah yeah he did say that and then he\n1:23:09\ngave the little smiley face mmm it scared Optimus Prime I think that wasn't\n1:23:14\nthe series finale he said that for season four yeah it was near oh yeah\n1:23:20\nhe's the series yeah the Beast hunter serious the season yeah yeah yeah that's\n1:23:27\nseason four these hunters season four either way today up tomato Optimus Prime\n1:23:36\nkeeps breaking my heart why does he have to die and everything why did you have to die the pilot of Transformers\n1:23:42\nanimated but yes sorry miss Ives him I guess he gets to live in the end of\n1:23:47\nthat one but then again they never got season four so we'll never know you know\n1:23:53\nI looked on the internet I saw on YouTube apparently there's a fan-made version somebody actually baked season\n1:24:01\nfour of transformers and made but it's fan made so there's that has a bit of\n1:24:07\nbad quality in it I saw the first episode yeah still pretty fun to think\n1:24:15\nof what could have been though yep well there's one iteration that man did they make the fans made season four\n1:24:23\nso there you go it's like once it's like a so once the season three site the\n1:24:30\nHedgehog Saturday morning oh I know that would have been so cool yeah we were up\n1:24:37\nto that one two also robbed original Teen Titans season six I believe oh yeah\n1:24:45\nthen we got Teen Titans go which is just like a major slap in the face well at least we got Teen Titans go vs Teen\n1:24:51\nTitans so Chancellor she could that's--it's season they actually have talked about that would be cool yeah finally what\n1:24:59\nhappened to Beast Boy and was an overpowered guy overpowered monster the\n1:25:05\ntimes were fighting and la terra or not oh yeah she was never revived or better\n1:25:13\nshe was but her memories aren't there yeah they weren't there she wasn't fully oh okay again first\n1:25:30\nscreen found the piss drawer posted it\n1:25:35\nin the general that meme of that little like toddler that possessed a cybernetic\n1:25:50\nrobot schoolgirl the concepts for Denis\n1:25:56\nthis thing you know the girl body would\n1:26:05\nstart he never gets the respect props to\n1:26:14\nyou Japan I didn't see that one coming no I didn't become aware that until the death ballot but so between stars\n1:26:20\npremiering will - I haven't seen that one yet it's right good\n1:26:25\nit was generation 1 Starscream vs. friendship is magic rainbow - oh man who\n1:26:32\nwon well then again I guess that would spoil the ending it's obvious I'll give\n1:26:38\nyou a hint it was not the cunning one rainbow - that's true Starscream is\n1:26:51\npretty easy to beat you should watch\n1:27:07\nthat's really good it's right I will look up on YouTube it sends you a\n1:27:13\nlink right down Megan let's see and I\n1:27:59\nsent you a text message there we go yeah Pizza just came so I'm\n1:28:07\ngonna mute myself a little bit and watch it Willie I'll be around though enjoy the pizza yeah okay I'm gonna have to\n1:28:20\nrestart my phone then I'm gonna rejoin the call then I'm gonna mute myself\n1:28:26\nwe'll be here all right yeah real real pizza not that fake\n1:28:33\nBritish pizza how do I'm so confused what do you mean fake\n1:28:39\nBritish pizza yeah me too it's not real Peter it's not real what is it made of\n1:28:45\nthen you just imagine you're having\n1:28:55\npizza do you guys don't have the freedom for real pizza no keep it's over there\n1:29:07\nman they'll be mean you guys I don't think\n1:29:18\nI've met an Italian ever exactly you have a point there it's all fun and\n1:29:27\neverything I like the art of fun - really [Music]\n1:29:32\nyeah oh we do have Scottish people people are\n1:29:40\nreally good to it I just like all kinds of culture yeah me too when I talk to\n1:29:46\nsomebody on the individual front I tend to copy their voice - don't you know a\n1:29:52\nthat was a leprechaun interpretation I\n1:29:58\nhope I don't sound like a leprechaun I\n1:30:06\njust said at least you don't sound like any like South Park well imitating Kenny well that was a very\n1:30:12\ngood imitation because I could not tell what you said Kristine they used to\n1:30:22\nwatch some Park I have a watch in a long time I could still I could still use the ketchup - I think a cop's like just\n1:30:30\nbeyond season said Wow so you haven't seen that there's a lot more now I actually really like South\n1:30:36\nPark yeah I know do I just one of the newer seasons I've seen was the one where carbon was doing\n1:30:45\nlike oh I need to go up so he was so he just sets one set like a murder thing\n1:30:50\nwith all this dogs oh yeah yeah that was a few uh yeah there's a few there's been\n1:30:56\na few series since then but that one was a good episode actually and he's like yeah he stinks someone's out to destroy\n1:31:03\nall of his dolls and then it turns out to be him oh it's probably pretty cool once he says they're prissypants that's\n1:31:09\na mop yeah yeah and then I saw them so\n1:31:14\nthat one episode where we got the I'm going to say I'm going to say it we got\n1:31:20\nthe Yahweh and tweek and Craig yeah in\n1:31:31\nthe middle of that episode there's like a Japanese guy that yells out like yeah yeah I make sense\n1:31:42\ndid you guys I love the fact that they actually included fun art from from\n1:31:47\npeople like on the Internet yeah that was fun I do remember that people yeah\n1:31:54\npeople doing animation and separate getting more involved with the people who watched up it's like the guy who\n1:32:01\nmade Rick and Morty he said that anything that's wrong in that style is\n1:32:06\ncabinet is canon or whatever really\n1:32:18\nabout transformers it's just automatically that case where you got em\n1:32:28\ngoes interpretation don't they you got let me try and enjoy burritos\n1:32:34\nversus up to this prime loving eats of a homes my impersonation no Rick yeah\n1:32:41\nthose are you I might I say Wi-Fi over\n1:32:58\none who likes one or the other oh speaking of Rica morning I'm really\n1:33:05\nlooking forward to the rest of season for actually did you get to watch it like all yet near the recent one yeah I\n1:33:14\nwas talking I met you about it I was like I watched the one with with the snakes yeah I did yeah yeah yeah they\n1:33:24\nsaid they would never do it the way they said they would never do time travel but they did it yeah they did but to be fair\n1:33:29\nit was like I it was like sending up time travel I don't know it was really\n1:33:37\ngood I just think this whole series so far has been really good time travel\n1:33:43\ndidn't make sense going forward there's possibly\n1:33:50\nthat's they pull this season to Timecop\n1:33:56\nyou know like the interdimensional multi-dimensional like a weird-looking\n1:34:01\ncreature three premiere where that where\n1:34:06\nthey were in Rick's mind the guy from airpo and they were ordering Szechuan\n1:34:11\nsauce oh yeah when he gives his fake back Lori I'd go back in time for this\n1:34:20\nfor the Szechuan starts to take as many as I can yeah it was just a fabrication the\n1:34:26\nentire backstory was just a yeah just so he could bring back the Szechuan sauce\n1:34:41\nand it happened watch watching make it burn and McDonald's a this way you say\n1:34:48\nthat that's my one hour man Morty that's that's what I care about nothing else\n1:34:55\nwhen they released essentially McDonald's they had this post for it\n1:35:00\nlike advertising hey we've got Szechuan sauce again and they didn't stay it was supposed to be like we could they didn't\n1:35:07\nsay anything about recovery but the art style was like obviously almost exactly\n1:35:12\nlike Rick amore it was like an alien or something and it was like set your own sauce it's like yes I really trying to\n1:35:18\nrip off a brick morning I thought that they did it together\n1:35:23\nwell they said now you know they really weren't involved at least I got to try\n1:35:31\nthe Szechuan sauce when it was to release me at least I liked it and I say\n1:35:37\nRyu at least not there is no current like during the Mulan movie yeah I missed out on that didn't think I was\n1:35:45\nwhat do you want they're gonna be what do you think of the new moolah movie I\n1:35:50\nwould say that but I have seen the original I like it me actress who plays\n1:35:59\nMoo plays Milan or the actress Liu no no\n1:36:05\nno remind you of the episode of tf2 analyst anarchy at the yang where was essentially an April Fool's episode with\n1:36:11\na ship silver quill and Mary Sue and at the end is what you should link what you\n1:37:09\nshould um link post a link to what you're quoting I haven't seen it right\n1:37:16\nnow yeah it's on that much gives Chan on YouTube she reviewed the Trivial Pursuit\n1:37:23\nup so from season 9 ok and if this was\n1:37:29\nthe introduction bit I mean this is pretty much steals the show I had the\n1:37:36\nwhole video hmm and she also recently upload about her story about how she met\n1:37:42\nher fiance did you hear she say that he proposed to her at BroNYCon like last\n1:37:48\nyear I didn't know that you guys know yeah well they did it was dirt and it\n1:37:56\nwas during a tf2 panel I was there that sounds really cute it was awesome I\n1:38:02\ncongratulate them yeah it was awesome are they gonna have the marriage they're\n1:38:10\nthe playing field since she talked about a little bit why they were more recent\n1:38:16\nvideos she and he are planning on coming to are coming she's moving to America\n1:38:22\nessentially I believe he lives in America so where's she from\n1:38:29\nshe knows Scotland oh really huh I could drive up and see her if I wanted to if\n1:38:35\nyou wanted to but you have to well she actually has an address we could send her fan art so if you get in touch with\n1:38:42\nher and you'd be like hey Maddie I don't live too far I meet you say hello to I\n1:38:49\ndon't know about that I have to think about get back to you yeah see if we can\n1:38:55\ndo I see we can do maybe a little big grease up you know I don't know I don't know if I'd even get that far to be\n1:39:01\nhonest hey no hugs no I don't like hugs at all yeah Jesse says to her\n1:39:09\nMaddie sue her Maddie she's just like no hugs she doesn't like hugs how can you know\n1:39:16\nlike hugs hugs are the fans she just gets squeamish I suppose but they're so\n1:39:22\ncuddly and warm and comforting yeah but she talks about that in episode mail analysis anarchie so yeah but of course\n1:39:30\nyou know she does not play the bagpipes you know what she does play musical\n1:39:35\ninstruments Chris Christine most people who's coming don't play the bagpipes she\n1:39:48\nplays the ukulele oh yeah that's really popular these days like a lot of people\n1:39:53\nare learning to play the ukulele should I be ukulele\n1:40:05\nsorry did I rip someone there sorry I was just laughing cuz I was picturing\n1:40:11\nsomeone playing a bagpipe I can imitate bagpipes the thing is about bagpipes\n1:40:23\nthey're really they're really loud they're so loud yeah if you want to know\n1:40:30\nanother good instrument I can imitate I can imitate pinkie pie's flugelhorn\n1:40:40\n[Music]\n1:40:49\nstill learn to play nearly an episode she suddenly got there at the end of the\n1:40:55\nepisode she was in yakyakistan but she was so depressed that she was eaten aalia's came out of places she was like\n1:41:01\ngive me another but people already had three guys I reminds me of it is it's a\n1:41:11\nbit from the Spongebob movie where he does the same thing you know the first sponge from maybe and there yeah was a\n1:41:22\ngood impression on you and everybody for\n1:41:46\nso many reasons that's actually a pretty good Patrick it is yet all right\n1:41:56\ntogether now let's play the clarinet [Music]\n1:42:07\ngod I haven't seen spongebob in forever they still didn't didn't the guy that\n1:42:19\nmade it he passed yes he did it's kind of like within the\n1:42:25\npast year there's a big thing about um\n1:42:30\neveryone wanted them a place wheat victory at the Super Bowl and in remembrance of Stephen Hillenburg and\n1:42:36\nthey didn't mean everyone got really mad about it on the internet you know everyone tweeting and typing they didn't\n1:42:43\nplay a sweet victory at the Super Bowl allah rabbul izzah rabbil mayonnaise\n1:42:59\nmayonnaise is not an instrument Patrick\n1:43:09\nhope I can make mayonnaise into an instrument oh that reminds me Oh\n1:43:18\nChristina let me show you something actually did you post a link to the to the video to the pony video I posted\n1:43:26\nonto the yeah onto the google hangouts app oh okay sorry I was looking at the\n1:43:32\ndiscord oh shoot Anna balls taken I sure went to discord oh well where the\n1:43:40\nDiscordian yes mine hey we have one yeah\n1:43:51\nit's like the evil but we're friends oh yeah what she's blood we've just be good\n1:43:58\nshake up some Ponyville song title the discord eum's\n1:44:04\nthat's what i came from\n1:44:10\nhave you ever heard of discordianism\n1:44:16\ndiscordianism let me think oh I've heard of that I think well give me well I'm a\n1:44:23\nfew bars and I'll follow the street I'll follow the soon it's it's a it's it's a\n1:44:31\nlike pseudo religion making it's like making it's it's like an abstract\n1:44:37\nreligion it's playing with language so that people can it's like just a\n1:44:43\nbreaking down of language no wait oh yeah and just rearrange and all but not like spelling words backwards and\n1:44:50\npronouncing them that way yeah that's really what it is I'm not confusing it's\n1:44:58\nsomething that's one aspect unless you want to just it's all say egg pay at lay\n1:45:04\nold a a day I'm so bad with big lion I\n1:45:12\nhave no idea what you just said I just said unless you want to talk pig latin\n1:45:17\nall day Three Stooges episode where\n1:45:22\nLarry you more talking pig lightning and curry was like behind my back again and\n1:45:30\nkirtland Tabo was trying to teach curly I speak Pig Latin he's like okay ending it last night just\n1:45:37\nlike and it's like remember this one okay now I'll explain sleeve and you can understand it follow me Larry I relay\n1:45:46\nMoe ohm a curly Q chronic you it should\n1:45:55\nbe early che yeah this is fun cannot you\n1:46:10\nmister grammar yeah I've never taken never taken the time I can't find that\n1:46:18\nvideo sorry I'll put up can't be put on this chord thank you\n1:46:26\nunder under the place right well yeah I was trying to find a video of someone\n1:46:31\nplaying mayonnaise as well but I can't find it like there's a bunch of them but there isn't one the one that I found so\n1:46:40\nokay and I just found the name they said maker uploaded Starscream found the\n1:46:46\nPistor now I say that not to get away\n1:46:53\nwith it fools progress I love rules dear chief\n1:46:58\njustice Cyrus I'm so alone I can't deal with\n1:47:07\nthat right now oh I just oh um Christine yes did you\n1:47:16\nwant to talk about the D&amp;D stuff yeah when I was clicking on taps right now\n1:47:22\nand I know I was looking on YouTube I just noticed I had words still open with the document in it so yeah here you go\n1:47:28\nwe can read that top to bottom and I can fill in the blanks like first up I did take a peek at it glanced at the test I\n1:47:35\ndownloaded the file hey Sonic you and Rose choose hide from top ahead 2/10 to foot\n1:47:42\nnot counting the ears it's three foot five not three foot zero okay three four\n1:47:47\nfive well what would be the minimum size minimum mm-hmm because that's like a um\n1:47:54\nso the base height and the base wait those are the smallest I think they're not averages they're just the smallest\n1:47:59\nthey can be what I'm showing it is the\n1:48:07\naverage okay well I'll put it in I'll put in four brackets underneath of average as\n1:48:14\naverage high well what was that you said three foot five three five okay yes I'm\n1:48:27\nin Sonic you and Rosie are definitely three foot five apiece so most everybody\n1:48:32\nelse but there are shorter and taller scientists most using as well okay you know site you know I even\n1:48:38\nlearned Ivan deaf I definitely know that Sonic is shorter than any side she arose\n1:48:44\ntrue just by two inches because he's like no rocket three foot three yeah I thought to be honest I've always thought\n1:48:51\nthat just cuz of the way he looks like he looks like he's a little bit shorter yeah by about two inches but they still\n1:48:58\nlike to race together did you I remember you said something about the ears as\n1:49:03\nwell oh yeah Sasha's ears are on average seven inches\n1:49:10\nlong so it goes from three foot five to an even four feet okay and a roast shoes\n1:49:18\nears at least a female variety are and are an inch long email yeah and then of\n1:49:27\ncourse we do have there are female side shoes and Melrose choose which I did I\n1:49:33\ndid release images of recently so the male roast used to have the right shoe style ears okay so I mean so the average\n1:49:41\nheight would be without not count in the ears right just the top of their heads yeah okay I've wrote that down yeah and\n1:49:48\nlike you know just well whatever's have rich lanes for right for the typicals\n1:49:54\nride choose ears you can put that down for the mail rows choose ears okay a\n1:50:01\ncrutch and Mahajan I got a I got a hold the Jo would you\n1:50:07\nlike to speak to him sure okay um let me send I sent him the\n1:50:14\nlink he said he could be here within you should be here in a little bit you ever\n1:50:29\nheard that one mm-hmm it's just a fun you know song or what no I really\n1:50:38\nhaven't well no wait there is that um I really like the movie artificial intelligence and like there's a bit\n1:50:45\nwhere they say hey Joe what do you know but I've never heard a song that's not my words so I guess I get\n1:50:53\nthat reference now there's actually a song yeah there's also there's also a\n1:51:01\nsong of Joe DiMaggio Joe Joe DiMaggio we\n1:51:09\nwant you on our side that's it's a classic man she played that song I'm\n1:51:16\nduring the ending credits of the episode of Seinfeld where'd a reference Joe\n1:51:21\nDiMaggio eating at dinky doughnuts but he's not seen on screen interesting yeah\n1:51:31\nDiMaggio here think he doughnuts on me yo yo yo yeah we don't there's\n1:51:42\nthere's a lot of stuff that goes translate over a lunar that's the easy a\n1:51:52\ninterdimensional mage it's very timely\n1:52:02\njust coming in at the same time Hey Joe eNOS\n1:52:10\n[Music] okay so um so we've got the height and\n1:52:16\nwe've got the weight down I'll probably talk with Kyle to to try and cuz I'm not\n1:52:24\ngood with numbers um what didn't so the first thing you need is like a physical description but\n1:52:31\nit needs to be like a general description of the right and the like a specific sonichu eros you're just\n1:52:37\ngenerally what they look like general description okay on physical appearance\n1:52:44\nI would say yellow fur with brown\n1:52:49\nstripes and black ear tips and red cheek pouches\n1:52:55\nthat's mate that's but that's the basic load down and typically wear blue shoes\n1:53:04\nwith brown stripes on them okay and socks white socks and should I say that\n1:53:12\nokay so they're in terms of the whole race their humanoid and the Kotov like\n1:53:21\nthere were covered in four parts of the body like everywhere except them around the muzzle in the stomach\n1:53:29\nI guess humanoid is an optional term to\n1:53:34\ndescribe them if you think of a ballon I can put it down extra point yeah but they're really more\n1:53:41\nlike you know Hedgehog mouse combinations so we're talking about genetics between electric mouse and\n1:53:48\nhumanoid Hedgehog okay that's definitely very accurate right there I just now\n1:53:54\nrealize it okay I'll put it down um code and fire everywhere except stomach and\n1:54:03\nmuscle but it's right right it's the stomach in the muzzle or is no wait sometimes they smoke the summer cause\n1:54:08\nit's just a mother yeah sometimes they I think they always sometimes they don't\n1:54:14\nyeah okay I'll put that down sometimes they have the tan area it's not just a\n1:54:19\nbelly that goes up from somewhere just around the belt and they have whole hair\n1:54:25\nhe had to to chest area if you were to compare site you to hume it to a human\n1:54:32\nthat sense mm-hmm it's just tanker but they don't all have that like you know\n1:54:39\njust obvious reference of blake magic chant punchy wild but what about the\n1:54:46\naverage typical science you okay yeah one second okay um and let me think\n1:54:56\nOh what about gloves do they usually wear clothes I was only just a few oh yeah they do typically get pair gloves\n1:55:04\nokay but also I should note that between sign shoes and rose shoes clothing\n1:55:09\nattire is optional so they can be dressed however they they individually\n1:55:16\nchoose to be or remain as our just being naked instead we say\n1:55:21\nwouldn't I wear the socks and shoes at all hey there we have a Darwin complex if y'all watch Adventures of gumball\n1:55:28\nmm-hmm you don't watch gumball with the amazing world of gumball no I really\n1:55:33\ndon't it's on Cartoon Network it's really good it's a really good show it seems really weird it took like I've\n1:55:39\nseen clips and it's like really wacky it Darwin Darwin is the Darwin is the orange fish and he only wears socks and\n1:55:46\nshoes and he doesn't really have a genital area the speak of that typically\n1:55:52\ngets censored they joked about that in the show so sometimes so sometimes they\n1:55:58\nwould just put like a censor blur over his bare feet mm-hmm yeah but anyway\n1:56:10\nyeah closing sorry I got distracted for a moment I got distracted too I wasn't\n1:56:15\noff talking about gumball versus a naked sonichu without the shoes socks and\n1:56:24\ngloves mm-hmm it's very true yeah okay I've got okay so let me think\n1:56:30\nOh tails shall I put o in I should put um they're very in a color right they\n1:56:36\nhave lots of different colors fur yeah I can't yeah fur color can vary especially especially if they don't have\n1:56:44\nthey didn't have a matching side shoe or roast you're a parasite she ordered pair roast you well a pair of sonic you first\n1:56:52\nmaking a size your pair roast you to make us to make a rose shoe parents all\n1:56:58\nright but I do believe it is possible for a pair of either to make the opposite like a pair of science use\n1:57:05\ncould make a rosy or a pair of Rose choose could make a Sahni it's just it's a it's a very genetics okay let me put\n1:57:13\nthat on that's kind of important it's\n1:57:23\nit's Jo [Music] what's up Chris how you doing good how\n1:57:29\nare you good have you been I've been doing alright are you and how you doing with your late\n1:57:36\nwith your sweetheart oh not bad not bad is uh how's your mom she's doing okay\n1:57:44\nshe does pretty good she looks pretty good for herself at least in getting up and doing things and doing physical\n1:57:50\nlabor and doing all that uh did you just shout hell out to me yeah I think yeah\n1:57:58\nyou got out for a second yeah I'm wearing earbuds so anyway my mom's doing okay Pokeball you gave me yes and I've\n1:58:12\ngot your DVD - I've been meaning to send that back oh yeah that's right I did\n1:58:18\nlend it to you at the original CWC young TV DVD yeah I tried to copy it but the\n1:58:24\nthe discs are like kind of messed up hmm\n1:58:30\ninteresting well I do have actually I do believe I have data files of the individual videos\n1:58:38\non my backup - might i stern a hard drive I could send you a flash drive but\n1:58:45\nthose are then I suppose okay yeah that sounds good I'll probably I'll probably\n1:58:51\nsend aqua the stuff so she can send to\n1:58:56\nyou and we'll just play chainmail or do you still have my address hmm um I do\n1:59:02\nbelieve I believe I do let me check the contact list\n1:59:09\nat least Jojo excuse me okay apparently\n1:59:25\nI don't yeah I still have your phone number and your email addresses but I don't have\n1:59:31\nyour mailing address okay I'll send you I'll send you my address and I still have yours actually I'll\n1:59:39\njust send us in the package to you just don't make a video on it yeah I won't make a video okay and under and after I\n1:59:49\nget that out send you to near the flash drive with the videos okay cool it was\n1:59:57\nfun weekend it was a fun weekend you and I shared together I just I really do remember that have you gone back to that\n2:00:06\nburger place yeah yes I have\n2:00:11\nyeah they liked you their burger the day\n2:00:18\nbefore I think we went out to eat and I\n2:00:24\nhighly recommend that one I'm just now\n2:00:34\nrealizing what remember this here no time is that it's almost 9:30 that's my\n2:00:42\nthing it's after 2:00 in the morning here so oh well yeah then again I\n2:00:52\nusually say it later [Laughter]\n2:01:03\nyeah I can stay up late sometimes but most of the time I end up making myself\n2:01:10\nbraid to hit the shower around 9:00 or 10:00 that's good it's nice to have a\n2:01:16\nroutine cuz yeah I don't have any routine it's really bad yeah my routines\n2:01:23\nare rather not a rudder lacking except\n2:01:30\nfor the fact that nowadays I may I'd say for about an hour what point Tetris 99\n2:01:35\nthis really good my meditations really good for just actually it promotes\n2:01:41\nhealing like physically buddy I went to the seminar where they talked about it and they talked about how I like helps\n2:01:48\nwith pathways in the brain and all that kind of stuff so that's really good are you big on healing healing and magic\n2:01:54\nstones mm-hmm I really like moon stones\n2:01:59\nwhereas quartz I mean I don't have a big collection to be honest like I have\n2:02:05\nmoney I have like more than six pouches worth of healing stones and magic stones\n2:02:13\nWow I have four chunks of amethyst in my bedroom and arrangement along with a few\n2:02:18\nother stones and and a friend of mine you know her as the artist for Liliana\n2:02:26\nRose - I don't think I never know well she's on Twitter anyway she said she\n2:02:33\nsent me what she sent me why those glass water glass water bottles it's a that's\n2:02:39\nwhat's now sighs but more is that her Twitter handle or is she another Jew\n2:02:46\nbecause I've looked into many Rosa chews and it seems that there's a lot of people named Rosa - yeah oh I'll send\n2:02:53\nyou a link to a profile all right thank you anyway so anyway so she sent me a glass\n2:03:01\nbottle and that's Bell with GL ACCE because it comes with\n2:03:07\na healing a big old a moderate-sized tower healing stone within it so it's\n2:03:14\nlike you're literally getting your water on the rocks and you're drinking the\n2:03:20\nbenefits of the stone including they have choices like amethyst quartz rose\n2:03:26\ncroats rose quartz - and to others as well on the main website and then they\n2:03:33\nalso have a lower less expensive version of it on Amazon it's about that's I do\n2:03:41\nbelieve it's the same bottle but they have like three additional stone interations one of which I'm sure I\n2:03:48\nwould not sure I would recommend cuz I looked on the internet on stones that\n2:03:54\nare not safe to drink while they are I mean stones they're not safe to have in with\n2:04:01\nwater with the water that you're drinking and they include all stones that end with ite\n2:04:08\nso with eight at the end really I want yeah and why doesn't use a lot yeah\n2:04:16\nthey're very various different minerals that would be hat would be harmful so I believe one of the eight stones and that\n2:04:22\nAmazon this thing is fluorite so I would\n2:04:27\nexercise caution or just avoid that one yeah well to be honest I wouldn't be\n2:04:33\nable to get anyway like I'm really poor but the most of the ones I got like inherited for my mum because she used to\n2:04:40\ncollect them so oh that's lovely oh thanks and I've deaf I'm definitely\n2:04:47\nnever heard of lightning strike quartz I haven't no that sounds really nice it's\n2:04:53\na it's it's basically quartz stone but constantly struck by lightning it's\n2:04:59\nmainly found in the high in the highest mountains of Brazil apparently they also have them over and over and we're met\n2:05:07\nover we're maker is in her home state in the desert because I believe it was her\n2:05:13\ngrandmother who found who got lightning quartz lightning strike quartz in the\n2:05:19\ndesert that's really interesting there's actually like there's a gem that's just\n2:05:24\nlike that so I walk out what's he called why it's really rare and you can only\n2:05:30\nget it from one meteor that was made like a meteor came down to earth and it made a crater and you can only get the\n2:05:38\ncrystals from that career so it's like they're really rare and really pretty I just kind of the name let me have a look\n2:05:44\nthere's rare rare examples of shock metamorphosis anyway anyway essentially\n2:05:55\nalso just a note like these straight quartz is like an ultimate healing stone and also I found this out from personal\n2:06:03\nexperiences between regular quartz and lightning strike orbs at least or you know between two regular court systems\n2:06:09\nlsq is in general you can strike two of them together and make make light like a\n2:06:16\nspa okay well yeah because well Bob I'll\n2:06:36\nactually feel better if you send it back to me I would love to have you with being my true pump if abs on okay if I\n2:06:44\nmight I might be there I want announce\n2:06:50\nit and if you do come along I recommend you know if you want to do something better than the adult ticket get the\n2:06:56\nhigh society badge cuz that's the one I got it's yeah I end up splurging I got\n2:07:03\nthe three hard dollar badge\n2:07:09\nI'll meet up with you and maybe we can get might meet or something is that cool yeah I'm going with some of my peeps\n2:07:16\nwe're two of them here and this chat right now but yeah good works that will\n2:07:21\nwork something else you know I was just saying oh sorry gone\n2:07:26\nokay have you heard of this rock called shunga\n2:07:32\nit's this sort of dark black rock that can purify water\n2:07:37\nalright I think it was from Russia I believe I know wanted to take one the Russian kings used it to purify one of\n2:07:45\nhis water this critical stuff they have little cool sculptures made in jean-guy stuff that's very interesting I found it\n2:07:54\nwhen I was talking about Hannam I'll link it in the discord server it's called moldavite is only yeah you\n2:08:02\ncan only find it from this one meteorite that impacted the earth about 15 million years ago it's bright green yes yeah\n2:08:09\nit's right it's very pretty it is it's really expensive though because it's so rare and it only comes\n2:08:16\nis literally from space so yeah I think\n2:08:21\nso either that or it was formed when the meet the wind the meteor struck one of the two I don't remember but I think\n2:08:27\nit's called space class this movement um oxide it could be shocked metamorphosis\n2:08:35\nyou just have to have surface level aluminum deposits for that to happen hmm\n2:08:42\ncould occur in Australia to maybe I just\n2:08:50\nknow the chemistry and you say Australia that's I'm just putting it out there\n2:08:56\nyeah I feel sorry for the fires that they've been having lately oh yeah no it's awful\n2:09:02\nyeah it's really really awful I don't like thinking about it maybe I'm sad I\n2:09:09\ndon't like think about either but I just feel like get out of the way it came up in my mind just okay now we can go back\n2:09:15\nto talking about we were talking about moldavite okay there's a table yeah that\n2:09:23\nyeah tektite what would be a shock many more consistent mostly sad okay I have\n2:09:28\nno idea without you but okay sure I mean when it was formed when the meteor hit as opposed to coming from like from the\n2:09:34\nmeteorite yeah there's not much actually unique about meteorites they love that in fiction but\n2:09:41\nno I know that I love that it only comes from this one specific meteorite like that you can't\n2:09:47\nfind it in any of the craters anywhere around the world I just I don't know I think that's fascinating there's\n2:09:54\nabout they see it scattered around the world they say there's about 275 tons so\n2:10:01\nit is still quite rare tektite mm-hmm\n2:10:06\nI'm looking up demotivate on the air now on its healing benefits and apparently\n2:10:13\nit's also known as the Holy Grail stone interesting yeah and definitely notes\n2:10:20\nI'll quote I quote it all the genuine pieces so the crystal come from only one\n2:10:26\narea of the world and they Schick Republic the meaning of the name Olduvai\n2:10:32\nrelates to the Modell River in Czechoslovakia yep timeout I'm gonna\n2:10:42\nlink a video of this other it's not to like I hope I'm not overwhelming you there's this other stone that I really\n2:10:49\nlove called great agate and it's so pretty I've just posted it well when it uploads\n2:10:55\nit was a little short clip of it of someone like showing off it's already\n2:11:00\ngreat yeah I just posted it in the discard\n2:11:05\noh boy you know what that makes me think of hanna-barbera at one moment Scooby\n2:11:14\nDoo check him out what's the password the great eight is first-rate\n2:11:24\nthank you mostly from Indonesia say\n2:11:32\nagain mostly from Indonesia the ones I'm saying are you talking about them at the\n2:11:40\nmall tonight the golden night was a great game yeah and then the great gate\n2:11:48\nnow you heyget okay it might be a regional thing\n2:11:53\nwe say okay over here but it might be agate and America which is probably right to be honest yeah yeah I see I'm\n2:12:03\nactually just googled great the gate and yeah isn't it amazing you're all the\n2:12:08\nlittle clusters I just think it's so pretty yeah they look like bunches of grapes they do but they they're glarry grapes\n2:12:17\nthat you can't eat but they're still very ready probably still similar to\n2:12:23\nthose maybe I think that's just iron a long time I'll be right back guys okay\n2:12:35\nall right actually me too I got a question break\n2:12:51\nso how is everybody all right and good hey been there I've been doing\n2:13:00\ngood just got to wake up early tomorrow so I thought yeah might as well talk to\n2:13:06\nChristian yes yes sooner yes sir oh by\n2:13:16\nthe way hi guys I don't think I've actually spoken to either of you so hi\n</p>\n</td></tr></tbody></table>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"60%\">\n<tbody><tr align=\"center\" style=\"background:#C71585\">\n<td colspan=\"4\"><b><a class=\"image\" href=\"/cwcki/File:MKRIcon.png\"><img alt=\"MKRIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/5/5b/MKRIcon.png\" width=\"32\"/></a> <a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\"><span style=\"color:white\">Arbitarch Saga</span></a> <a class=\"image\" href=\"/cwcki/File:MKRIcon.png\"><img alt=\"MKRIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/5/5b/MKRIcon.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<td colspan=\"4\"><center><span style=\"font-size:150%\"><b>The Players</b></span></center>\n<p><b>Organizations</b>: <a href=\"/cwcki/The_Sons_of_the_Miscreants\" title=\"The Sons of the Miscreants\">The Sons of the Miscreants</a> • <a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\">Arbitarch CWC Alliance</a> • <a href=\"/cwcki/CWCVille_Rebellion\" title=\"CWCVille Rebellion\">CWCVille Rebellion</a><br/>\n<b>People</b>: <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> • <a href=\"/cwcki/MKRNightVee\" title=\"MKRNightVee\">MKRNightVee</a> (<a href=\"/cwcki/Creamarina_(Twitter_Account)\" title=\"Creamarina (Twitter Account)\">Creamarina</a>) •  <a href=\"/cwcki/Owls\" title=\"Owls\">Owls</a> • <a href=\"/cwcki/AquaDiamond8\" title=\"AquaDiamond8\">AquaDiamond8</a> (<a class=\"mw-redirect\" href=\"/cwcki/Wendy\" title=\"Wendy\">Wendy</a>) • <a href=\"/cwcki/Jacob_Sockness\" title=\"Jacob Sockness\">Jacob Sockness</a> • <a href=\"/cwcki/Dillin_Thomas\" title=\"Dillin Thomas\">Dillin Thomas</a> • <a href=\"/cwcki/GiBi\" title=\"GiBi\">GiBi</a> • <a href=\"/cwcki/Kyle\" title=\"Kyle\">Kyle</a> • <a href=\"/cwcki/Naught\" title=\"Naught\">Naught</a> • <a href=\"/cwcki/The_WCT\" title=\"The WCT\">The WCT</a> • <a class=\"mw-redirect\" href=\"/cwcki/Smoky_Chris\" title=\"Smoky Chris\">Smoky Chris</a> • <a class=\"mw-redirect\" href=\"/cwcki/ThatSperge\" title=\"ThatSperge\">ThatSperge</a> • <a class=\"mw-redirect\" href=\"/cwcki/Talia_Nakara\" title=\"Talia Nakara\">Talia Nakara</a> • <a class=\"mw-redirect\" href=\"/cwcki/Joseph_Draft\" title=\"Joseph Draft\">Joseph Draft</a> • <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a> • <a href=\"/cwcki/Tings_Tingz\" title=\"Tings Tingz\">Tings Tingz</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sarah_and_Steve\" title=\"Sarah and Steve\">Sarah and Steve</a> • <a href=\"/cwcki/Midnight_Moonflower\" title=\"Midnight Moonflower\">Midnight Moonflower</a> • <a class=\"mw-redirect\" href=\"/cwcki/MRKs_Bloody_Chunks\" title=\"MRKs Bloody Chunks\">MRKs Bloody Chunks</a><br/>\n<b>Fictional Characters</b>: <a href=\"/cwcki/CPU_Goddesses\" title=\"CPU Goddesses\">CPU Goddesses</a> • <a href=\"/cwcki/NightVee_(character)\" title=\"NightVee (character)\">NightVee</a> • <a href=\"/cwcki/Creamarina_(character)\" title=\"Creamarina (character)\">Creamarina</a> • <a class=\"mw-redirect\" href=\"/cwcki/Tri\" title=\"Tri\">Tri</a> • <a href=\"/cwcki/Val_Valentino\" title=\"Val Valentino\">Val Valentino</a>\n</p>\n<hr/>\n<center><b>Chats:</b> <a href=\"/cwcki/The_Sons_of_the_Miscreants\" title=\"The Sons of the Miscreants\">The Sons of the Miscreants chats</a> • Arbitarch CWC Alliance (<a href=\"/cwcki/Arbitarch_CWC_Alliance_chats_(November_2019)\" title=\"Arbitarch CWC Alliance chats (November 2019)\">Nov '19</a> • <a href=\"/cwcki/Arbitarch_CWC_Alliance_chats_(December_2019)\" title=\"Arbitarch CWC Alliance chats (December 2019)\">Dec '19</a> • <a href=\"/cwcki/Arbitarch_CWC_Alliance_chats_(January_2020)\" title=\"Arbitarch CWC Alliance chats (January 2020)\">Jan '20</a> )\n<hr/>\n</center></td></tr>\n<tr>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Creamarina_(Twitter_Account)\" title=\"Creamarina (Twitter Account)\">Creamarina Socking</a></li>\n<li><a href=\"/cwcki/Tings_Tingz\" title=\"Tings Tingz\">Conflicts with Tings Tingz</a></li>\n<li><a href=\"/cwcki/CPU_Goddesses\" title=\"CPU Goddesses\">CPU Goddesses</a></li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/Wendy\" title=\"Wendy\">Wendy Scandal</a></li>\n<li><a href=\"/cwcki/The_Place_chats_-_Jacob_Sockness#Art_request_for_Sockness_lore\" title=\"The Place chats - Jacob Sockness\">Val Roleplaying</a></li>\n<li><a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\">Chris's invite to Arbitarch Server</a></li>\n<li><a href=\"/cwcki/BABSCon\" title=\"BABSCon\">BABSCon</a></li>\n<li><a href=\"/cwcki/Chris_Chan_VS._The_Internet\" title=\"Chris Chan VS. The Internet\">Chris Chan VS. The Internet</a></li>\n<li><a href=\"/cwcki/Beneath_the_Bridge\" title=\"Beneath the Bridge\">Beneath the Bridge</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/NightVee_(comic)\" title=\"NightVee (comic)\">NightVee Comic</a></li>\n<li><a href=\"/cwcki/Medallions#NightVee_Medallion\" title=\"Medallions\">NightVee Medallion</a></li>\n<li><a href=\"/cwcki/Kiwi_Farms_posts_(GhostBird50)\" title=\"Kiwi Farms posts (GhostBird50)\">Owls Kiwi Farms posts</a></li>\n<li><a href=\"/cwcki/MKRs_Bloody_Chunks_Leaks\" title=\"MKRs Bloody Chunks Leaks\">MKRs Bloody Chunks Leaks</a></li>\n<li><a href=\"/cwcki/The_Place_chats_-_Megan_Obsession\" title=\"The Place chats - Megan Obsession\">Megan Obsession</a></li>\n<li><a class=\"mw-selflink selflink\">Arbitarch Interview</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"2\"><b>Coinciding Sagas</b>: <a href=\"/cwcki/Template:JacobSaga\" title=\"Template:JacobSaga\"><span style=\"color:#FF00FF\"><b>Jacob</b></span></a>, <a href=\"/cwcki/Template:ShipficSaga\" title=\"Template:ShipficSaga\"><span style=\"color:#5D3FD3\"><b>Secret Shipfic</b></span></a>, <a href=\"/cwcki/Template:SoftExileSaga\" title=\"Template:SoftExileSaga\"><span style=\"color:#c68120\"><b>TF2 Analysis</b></span></a>, <a href=\"/cwcki/Template:WatchmenSaga\" title=\"Template:WatchmenSaga\"><span style=\"color:#F3D64F\"><b>Watchmen</b></span></a>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<!-- \nNewPP limit report\nCached time: 20251005221556\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.166 seconds\nReal time usage: 0.352 seconds\nPreprocessor visited node count: 1289/1000000\nPost‐expand include size: 99764/2097152 bytes\nTemplate argument size: 92643/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%  142.795      1 -total\n 48.37%   69.075      1 Template:ArbitarchSaga\n 44.57%   63.641      4 Template:Saga\n 26.75%   38.203      1 Template:Infobox/Audiofile\n 18.11%   25.854     16 Template:Saga/core\n 17.34%   24.767      4 Template:Color\n 11.10%   15.857      1 Template:Arbitarch\n  8.28%   11.817      1 Template:Transcript\n  7.51%   10.726      1 Template:Incomplete\n  6.38%    9.108      6 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:39917-0!canonical and timestamp 20251005221556 and revision id 347347. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Arbitarch_Interview&amp;oldid=347347\">http://sonichu.com/w/index.php?title=Arbitarch_Interview&amp;oldid=347347</a>\"</div></div>",
  "categories": [],
  "links": [
    "BABScon",
    "The Sons of the Miscreants chats",
    "Marvin",
    "CWCVille Rebellion",
    "Dec '19",
    "Jan '20",
    "Sarah and Steve",
    "Chris",
    "Kyle",
    "Megan Obsession",
    "Joseph Draft",
    "GiBi",
    "Talia Nakara",
    "ThatSperge",
    "that documentary that... was unable to get off the ground",
    "Arbitarch Saga",
    "MKRNightVee",
    "Megan Schroeder",
    "Val Valentino",
    "Chris Chan Vs. The Internet",
    "Midnight Moonflower",
    "Dillin Thomas",
    "Chris Chan VS. The Internet",
    "Owls Kiwi Farms posts",
    "Wendy",
    "MRKs Bloody Chunks",
    "Conflicts with Tings Tingz",
    "the CWCki",
    "The Sons of the Miscreants",
    "Wendy Scandal",
    "Tri",
    "Smoky Chris",
    "Creamarina Socking",
    "Chris's invite to Arbitarch Server",
    "AquaDiamond8",
    "Beneath the Bridge",
    "HONEST",
    "NightVee Comic",
    "Creamarina",
    "Naught",
    "Tings Tingz",
    "stress",
    "NightVee",
    "Arbitarch CWC Alliance",
    "BABSCon",
    "MKRs Bloody Chunks Leaks",
    "CPU Goddesses",
    "The WCT",
    "January 2020",
    "Arbitarch",
    "Nov '19",
    "Owls",
    "Jacob Sockness"
  ],
  "scraped_at": "2025-11-26T14:45:16.678801"
}