{
  "url": "https://sonichu.com/cwcki/Bob_Chandler%27s_call_with_The_P_Capsaicins",
  "title": "Bob Chandler's call with The P Capsaicins",
  "display_title": "Bob Chandler's call with The P Capsaicins",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center><i>NOTE: Chris was not directly involved in this conversation.</i></center>\n<p><b>Bob Chandler's call with the P Capsaicins</b> (also known as <b>Bob Call 4</b>) is a <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> video that originated on <a href=\"/cwcki/ThePCAssassins\" title=\"ThePCAssassins\">ThePCAssassins</a> account, and now exists only as an archive on Albert Clukey's account. The video is notable as it's title is a legendary misspelling of \"ThePCAssassins\". The video's upload date is listed as 1 <a href=\"/cwcki/July_2018\" title=\"July 2018\">July 2018</a>, however the video was recorded around the same time as <a href=\"/cwcki/Bob%27s_got_Cancer\" title=\"Bob's got Cancer\">Bob's got Cancer</a> and <a href=\"/cwcki/Bob_Call_6\" title=\"Bob Call 6\">Bob Call 6</a> which would place it in the year <a href=\"/cwcki/2011\" title=\"2011\">2011</a> or possibly late <a href=\"/cwcki/2010\" title=\"2010\">2010</a>. \n</p><p>An Internet Archive link exists of the video on the original channel, showing it's upload date as 1 <a href=\"/cwcki/May_2011\" title=\"May 2011\">May 2011</a>. The original video was the same length with the only difference between the two being the background picture, in the original Bob Call 4 video it is a black-and-white sketch of a cemetery.\n</p><p>Bob discusses several topics with Craig, this is the third call that the same man can be heard speaking with Bob, and is the same person who spoke to him in Bob Call 6 and Bob's got Cancer. The two again discuss Chris learning how to read and write through closed captioning on his television set as well as Chris's autism and his inability to find a job.\n</p>\n<h2><span class=\"mw-headline\" id=\"Audio\">Audio</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Bob Chandler's call with The P Capsaicins</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/C_Bx3WqqsV4\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td><a href=\"/cwcki/2011\" title=\"2011\">2011</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Other</span><a class=\"image\" href=\"/cwcki/File:UnknownIcon.png\"><img alt=\"UnknownIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/0/07/UnknownIcon.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">Bob</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Other</b>\n</td>\n<td><span style=\"display:none\">Leaked</span><a href=\"/cwcki/Category:Leaked_videos\" title=\"Leaked\"><img alt=\"Leaked\" decoding=\"async\" height=\"20\" src=\"/w/images/2/25/Leaked.png\" width=\"20\"/></a> <a href=\"/cwcki/Category:Leaked_videos\" title=\"Category:Leaked videos\">Leaked</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#FFFF00; color:#008080; color:#008080;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">Audio Recordings\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Catch_A_Wild_Snorlax_Plus_Update_on_Bob\" title=\"Catch A Wild Snorlax Plus Update on Bob\">Catch A Wild Snorlax Plus Update on Bob</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Get_in_touch_with_Bobby_C\" title=\"Get in touch with Bobby C\">Get in touch with Bobby C</a>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p><font color=\"#8A0808\"><b>Craig:</b></font> And to be quite frank with you I'm really amazed at all the stuff that, y'know that yo- you've invented and created to help automate the world and I'm just- I'm just so blown back by it.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You'll probably never find my name mixed up with any of it either.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> And that's the sad part.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> That's the beauty- that's the beauty of working the background for GE (<i>General Electric</i>)\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yep! Aw man.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> I'll tell you another thing I always did.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> What?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And I've always chalked it up as a form of pride. Really. And whenever I shipped one of my control valves, my work was going into the world, I always signed the inside of the control case.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Really?\n</p><p>[<i>There is some noise on the phoneline, unclear whether it is on Bob or Craig's end</i>]\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> I always signed my work, and I was proud of my work and I always signed it, and took responsibility for it.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's good.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font>  If you can't feel that way about your work it shouldn't be going out the door.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Exactly, and that it- it's amazing though because like you- you could just take apart those machines and see the guy who made it and that's you! And I- I like that how you personalised it and you take pride in your job.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well it's just- at first you gotta learn the language then you gotta learn what they want to do, then you got to do what you got to do it. Then you put it together and you sell it to them. hahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> hahahaha! It's- it's so-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> It's that simple.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah! it's- it's- it's true and uh- once you get the language down I hope to become as better- as good as an engineer as you.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah well... What year are you in now? [<i>Referring to Craig's university studies as an engineer.</i>]\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Uh- I'm done my first year.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You- You've done your first year huh?\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You got through all the chemistry and- and physics and junk right?\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah I'm almost bald now because of it.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Second year is a little better, we- you get to get in some of the calculus and stuff now I guess, right?\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah, and uh- then we started learning that stuff and then we started touching off base on to some other ideas and, such and such it's uh- I'm just glad my first year is over with cause that is like the hard- I dunno it was a pretty tough year.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well colleges use the first two years to weed students out. That's where they flunk them out is the first two years, and the third year they started teaching them what they're going to- teach them for the degree. Like my son now he's high-functioning autistic, he was never supposed to be able to write his name.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh really?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he's uh- And he's got two degrees from the community college in computer uh- aided drafting or architecture and computer aided drafting for engineers.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh wow.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he was never supposed to be able to read his- to write his name. I worked with him for some 28 years now. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Te- Tell me more about that please like, like how did you help- or how did you work with him?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well we just, I just worked with him I spent, I spent his whole high school- around middle school and high school career in Richmond with him. So he could go to school in the public system in Richmond cause they wanted to put him in an institution where we live. And I had to kidnap my own son in order to get him- to keep him in a public school.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> So- So they wanted to put him in an institution that's- that's horrible.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah well that's the school system for you, but anyway I spent 20 years fighting the school system, I learned alot about the school system hahahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> hahahaha! That- That's terrible though like you pretty much had to kidnap your own kid to get him a public education. That's...\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> I did they tried to get me for kidnapping.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Geez!\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he was my own son! Anyway I- I'll tell you a little secret that he, he came up with himself which I think is very significant. And if you have any relatives or any friends or anybody that you know of and you- most people do know people, that are either autistic, you know the autistic children, or the ones that are born slow learners, and th- the uh- ADT types. You- you know this category of kids that they have troubles with in schools. If you know anybody that's got kids like that, now Christian taught himself to read by simply turning on the close captions on his TV. And I think that was one of the big crossovers that got him to where he was able to communicate with the world.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's pretty smart.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> They didn't teach him how to read in the school, he taught himself by reading the close captions, while he was hearing it on the television screen. And if- I tell all these people that got these autistic children that can't do anything with em, \"Turn on the close caption they'll read it, they'll learn from it.\"\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's amazing.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> So I got- I got- I got a son that's uh- that's uh- proved it! He's proven the point.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> But you know these PhD and doctors and psychiatrists and all this, they think I'm full of crap.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh no Bob you- you're a genius and ob- obviously your son- obviously your son's a genius too though if he was able to learn to read like that, like... And that just proves to you- that proves to us- that proves to everybody how bad the public school system is now.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah well he's been- he has an advantage I don't have, him being autistic like he is, or high-functioning autistic, he has a- he has a photographic memory.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh really?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Did you ever- did you ever play uh- the video game called \"Mario's World\"?\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah- Yeah I have when I was younger.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah well before you got King Koopa up on the top you know.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And you got Yoshi- you got Yoshi down on the bottom, hahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> haha!\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well, I could get almost past Yoshi's Island.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Really?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> My son- my son because he could remember all steps and every bit of the programming in that thing and everything that was gonna happen, he was up there within 2 days and had knocked off King Koopa.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> hahaha! Oh man that's amazing.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> He- He'd go see these video games like they're going out of style, he uh- I mean he could remember what was coming up. And if you can remember then you've automatically got him defeated, you know where the bat's gonna come from in the cave right?\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh yeah totally.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You can shoot it down. And that's- so- that's what he's got autistic children they have these photographic memories\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And most people, don't utilise that, that category\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah that- that's so true I- that's amazing though that like, you know, that your son is so gifted that way.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font>  Well that's just the way they are, all of them seem to be that way that's one of the characteristics, that uh- the- the- the- the- their- their- their strengths are their technical abilities and their memory rather than their social skills and because they don't measure up socially all the psychiatrists and everything wanna put them in these institutions.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh yeah that's horrible that's horrible but you know, your son must like- your son must be popular like, with the ladies by- with having such a good photographic memory and being so smart.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well he's got uh- he's got uh- he has invented this cartoon character called <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a>.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh really?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah he's the inventor of that and he- he uh- invented that and drew his own lines back in 2000. He was drawing all his own cartoons and he's got clubs all over the world. Sonichu clubs.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's amazing does he- is he- like- like- like- has he made it into like a video game or is he still doing the comic books?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> They're in comic book form.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh wow.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he's got whole volumes of that stuff he been sharing with the public now for ei- eight years.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh nice!\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Or ten years I guess.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's amazing like-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> People are hating for it and people love him for it.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh you- you know what Bob like the haters are always gonna hate but I think that's amazing that your son is so intelligent to actually become like and entrepreneur in the arts that- that's- that's amazing.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> But anyway... He's a nice kid, he's got social problems, he still doesn't know how to interact really, he's 28 years old now and he still do- doesn't really know how to interact. But then that's part of the uh- that's the only part of the autism that's left now.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah, but the main thing is though that he's- he's creative he's smart he's got a photographic memory and he creates something that is amazing to him and to his whole family, to the whole world.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah he's got all these degrees and yet he can't get a job, he can't even get a job at <a href=\"/cwcki/McDonald%27s\" title=\"McDonald's\">McDonald's</a>.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's horrible.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> That's the way the system works in this country.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> I- that's-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> It's an awful- it's a terribly awful country really. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> You've- aw that's horrible why can't he get a job?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Nobody wants to hire autistic children. Or anybody that's got any kind of difficulties, learning difficulties or attention deficit disorders or anyone  like that.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's terrible it's-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> They don't want anything to do with them.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> So he's never had a job before?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> He's never had a job.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh wow that's su- that's horrible.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> He can't- he won't even get hired at McDonald's.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh that's- that's terrible- that's terrible sir that's just horrible. But-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> But he- as far as I'm concerned he's head and shoulders above everyone that works at McDonald's.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh yeah ju- just from what-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> hahahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> ha! just from what you've told me alone like- like all that stuff that he's accomplished you know he's- he should be like owning McDonald's you know.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah well... I don't know but that's just the way it works.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You can get a job- you see you can go out and get a job at McDonald's without any question, because you don't have any problems uh- socially, with interacting with the other people because you went through a normal childhood, I guess, and when you went to school you knew when to close your mouth and when to open it.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And uh- but the autistic children don't work that way. They don't know necessarily when to open and when to close their mouths hahahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> hahaha! But he must've gotten really good grades in high school and college though right?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> He did alright.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah? Was he on- was he like- I was never on the <a class=\"mw-redirect\" href=\"/cwcki/Honor_Roll\" title=\"Honor Roll\">Honor Roll</a> in high school and I've never actually known anybody who was ever on the actual Honor Roll in high school so like, I was just wondering if he was on the Honor Roll. Or if he made it...\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">NO</a> but he was in special education most of the time.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh okay.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> The last four years he was mainstreamed. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You know with- you know what I mean by mainstreamed, he just goes to class like the other kids.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah, yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> But uh- he got a- he got a high school degree and the people in social services people where I now live... well they were the ones that wanted to put him away because they said he'd never be able to write his name.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> But you know what Bo- you know what Bob he proved them wrong and that's the main thing.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> ...Yeah I think it's- I- I'm glad that I did it, it was worth it I got to spend a lot of money on it, my wife and I were separated for about ten years so she was in <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a> and I was in Richmond. And I was over there with him and she was over here trying to make some money, hahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> haha!\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> So uh- but- we're all back together and it was worth it we got him educated we know what he can do. [<i>Inadible'] these dumb places in- in the world that will- have to hire him won't know what he can do or not, they're just afraid to take a chance.</i>\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> They're just afraid of what they don't know.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Exactly and that's a shame. Cause, from what you- from what you've just told me-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> The whole- the whole world, the whole world looks down on handicapped people. You- a handicapped person can hardly get a job. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah it's true.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> I think it's a- a crime.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yeah it is it's a gross mis- it's a gross injustice in our society Bob.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> It is. And uh- but that's just the way it is, cause he's a great cartoonist, he can- he can draw he can portray- he knows the internet like the back of his hand. And he writes, he writes all these volumes of stuff, and he just shares it with the world, he's got a, he won a patent thing in England just recently. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Really?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> So some guy over there was trying to say that he was infringing on something this guy did, and uh- the- the patent people in England, \"your majesty's patent service\" or something came to our defense and proved the guy wrong so he's got a now- he can do his Sonichu's all [<i>Inaudible</i>] trademarked and- and uh- copyrighted.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh nice.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> So he's got full ownership of it.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> It- does- has he set up a website where I can read the comics?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> It's a combination of Sonichu and Pikachu, uh- Sonic and Pikachu.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Okay.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he invented this whole family of cartoon characters. There's Sonic, uh- Sonichu and uh- <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a> and a whole bunch of them, and he- he does cartoons and he does have them on the internet but I- I think he's pulled them all down now.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh really? That's too bad.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> He got tired of dealing with all these people trying to <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">kill him</a>. There's so many people that hate his guts in the world.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh that's horrible.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> You get all kinds of death threats and all kind of stuff.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Oh well like- have- have you taken it to the <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">police</a>?\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Yeah they don't care. I get phone call's all the time. Where they [[<i>Inaudible</i>] using my phone, to kill these people[<i>?</i>].\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's terrible.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> It is. There are always people out in the world trying to get you, particularly if you're successful.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Geez.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> And he is successful, but he can't get a job, he cannot earn any money. \n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That's terrible like-\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> In- ain't that sad? hahaha!\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> That is very sad actually that's horrible\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> That's the world you're expecting to go into.\n</p><p><font color=\"#8A0808\"><b>Craig:</b></font> Yep that is true. And I'm hoping to make it a better place just like you did Bob.\n</p><p><font color=\"#00AF33\"><b>Bob:</b></font> Well you gotta learn how to brown-nose.\n</p><p>[<i>The call abruptly ends after 15 minutes. It is likely that this is only a partial segment of a longer video that was originally uploaded.</i>]\n</p>\n<h2><span class=\"mw-headline\" id=\"Analysis\">Analysis</span></h2>\n<p>Bob provides some very interesting insights into Chris's life, he reiterates his opinion that Chris cannot find a job because employers are cautious about hiring autistic and special needs employee's, and he repeats the same advice as given in <a href=\"/cwcki/Bob_Call_6\" title=\"Bob Call 6\">Bob Call 6</a> to \"Turn on the close captioning if you have an autistic, or ADT or special needs child\". Bob also confirms that Chris was never on the high school nor college <a class=\"mw-redirect\" href=\"/cwcki/Honor_Roll\" title=\"Honor Roll\">Honor Roll</a> and only attended 4 years of high school, with the rest of his time being spent in special education. \n</p><p>Information about Bob's character can also be gleamed from this conversation. Early on Bob mentions that when he worked at <a class=\"new\" href=\"/w/index.php?title=General_Electric&amp;action=edit&amp;redlink=1\" title=\"General Electric (page does not exist)\">General Electric</a> and was presumably overseeing or in charge of producing control valves (Unclear whether this refers to a standard valve or precision components meant to act as a 'control' in a factory/laboratory setting) he would mark the case of the valve with his signature, Bob was obviously proud of his work at General Electric and was very confident in his oversight/manufacturing skills.\n</p><p>He also claims that the local council of <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a> attempted to have him charged for the kidnapping of Chris when Bob took him to Richmond, in order for him to be enrolled in a public school, rather than into a special needs school or institutionalized in a mental asylum like Bob believes.\n</p><p><br/>\n</p><p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible autocollapse\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:LeakedVideos\" title=\"Template:LeakedVideos\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:LeakedVideos&amp;action=edit&amp;redlink=1\" title=\"Template talk:LeakedVideos (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:LeakedVideos&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Chris's leaked videos</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/2000s\" title=\"2000s\">2000s</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">For Julie's Eyes Only</a> • <a href=\"/cwcki/Barb_almost_goes_off\" title=\"Barb almost goes off\">Barb almost goes off</a> • <a href=\"/cwcki/A_CWC_Audition\" title=\"A CWC Audition\">A CWC Audition</a> • <a href=\"/cwcki/April_16_Fetish_Vids\" title=\"April 16 Fetish Vids\">April 16 Fetish Vids</a> • <a href=\"/cwcki/Power\" title=\"Power\">Power</a> • <a href=\"/cwcki/CWCFlyingElephants\" title=\"CWCFlyingElephants\">CWCFlyingElephants</a> • <a href=\"/cwcki/CWC_%22Boyfriend%22#Alternate_leaked_edition\" title='CWC \"Boyfriend\"'>CWC \"Boyfriend\" Leaked Edition</a> • <a href=\"/cwcki/Chris_humps_his_PS3\" title=\"Chris humps his PS3\">Chris Humps His PS3</a> • <a href=\"/cwcki/Chris_Chan_creepy_smile\" title=\"Chris Chan creepy smile\">Chris Chan creepy smile</a> • <a href=\"/cwcki/THAT_IS_MY_HOUSE#Uncut\" title=\"THAT IS MY HOUSE\">THAT IS MY HOUSE (Director's Cut)</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/2010s\" title=\"2010s\">2010s</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/For_J-R%27s_Eyes_Only.MOV\" title=\"For J-R's Eyes Only.MOV\">For J-R's Eyes Only</a> • <a href=\"/cwcki/The_MovingFoward_videos\" title=\"The MovingFoward videos\">The MovingFoward videos</a> • <a href=\"/cwcki/ItIsFinished.MOV\" title=\"ItIsFinished.MOV\">It Is Finished</a> • <a href=\"/cwcki/100_2278\" title=\"100 2278\">Outdoors workout</a> • <a href=\"/cwcki/You%27re_Always_Pretty\" title=\"You're Always Pretty\">You're Always Pretty</a> • <a href=\"/cwcki/JenkinsJinkiesCwckiApplication.MOV\" title=\"JenkinsJinkiesCwckiApplication.MOV\">JenkinsJinkiesCwckiApplication</a> • <a href=\"/cwcki/Cwcsicle\" title=\"Cwcsicle\">Cwcsicle</a> • <a href=\"/cwcki/Call_Bobby_Chandler\" title=\"Call Bobby Chandler\">Call Bobby Chandler</a> • <a href=\"/cwcki/Bob%27s_got_Cancer\" title=\"Bob's got Cancer\">Bob's got Cancer</a> • <a href=\"/cwcki/Catch_A_Wild_Snorlax_Plus_Update_on_Bob\" title=\"Catch A Wild Snorlax Plus Update on Bob\">Catch A Wild Snorlax Plus Update on Bob</a> • <a class=\"mw-selflink selflink\">Bob Chandler's call with The P Capsaicins</a> • <a href=\"/cwcki/Get_in_touch_with_Bobby_C\" title=\"Get in touch with Bobby C\">Get in touch with Bobby C</a> • <a href=\"/cwcki/Bob_Call_6\" title=\"Bob Call 6\">Bob Call 6</a> • <a href=\"/cwcki/Message_for_John_Kyle\" title=\"Message for John Kyle\">Message for John Kyle</a> • <a href=\"/cwcki/A_few_kicks\" title=\"A few kicks\">A few kicks</a> • <a href=\"/cwcki/Chris%27s_Specimen_Sample\" title=\"Chris's Specimen Sample\">Chris's Specimen Sample</a> • <a href=\"/cwcki/Women_Only_Need_Apply_-_No_STD%27s\" title=\"Women Only Need Apply - No STD's\">Women Only Need Apply - No STD's</a> • <a href=\"/cwcki/Tour_of_Chris%27s_House_III\" title=\"Tour of Chris's House III\">Tour of Chris's House III</a> • <a href=\"/cwcki/Chris_apologizes_to_Gwen\" title=\"Chris apologizes to Gwen\">Chris apologizes to Gwen</a> • <a href=\"/cwcki/Chris_slaps_himself\" title=\"Chris slaps himself\">Chris slaps himself</a> • <a href=\"/cwcki/Chris_pleads_to_stop_Cryzel_Torture\" title=\"Chris pleads to stop Cryzel Torture\">Chris pleads to stop Cryzel Torture‎</a> • <a href=\"/cwcki/All_Star\" title=\"All Star\">All Star</a> • <a href=\"/cwcki/Chris_Kisses_Cryzel\" title=\"Chris Kisses Cryzel\">Chris Kisses Cryzel</a> • <a href=\"/cwcki/Chris_lost_Crystal\" title=\"Chris lost Crystal\">Chris lost Crystal</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/2020s\" title=\"2020s\">2020s</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Taser_Discussion\" title=\"Taser Discussion\">Taser Discussion</a> • <a href=\"/cwcki/Chris_Kisses_Rosechu\" title=\"Chris Kisses Rosechu\">Chris Kisses Rosechu</a> • <a href=\"/cwcki/Chris%27s_Last_Will_and_Testament\" title=\"Chris's Last Will and Testament\">Chris's Last Will and Testament</a> • <a href=\"/cwcki/Randy_Stair#Video\" title=\"Randy Stair\">Chris channels Randy Stair</a> • <a href=\"/cwcki/Fiona_Facetime_Videos\" title=\"Fiona Facetime Videos\">Fiona Facetime Videos</a> • <a href=\"/cwcki/Waltah_White_Calls\" title=\"Waltah White Calls\">Waltah White Calls</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251119201920\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.159 seconds\nReal time usage: 0.170 seconds\nPreprocessor visited node count: 656/1000000\nPost‐expand include size: 16161/2097152 bytes\nTemplate argument size: 5165/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   61.275      1 -total\n 60.73%   37.212      1 Template:LeakedVideos\n 55.13%   33.783      1 Template:Navbox\n 32.78%   20.088      1 Template:Infobox/Audiofile\n  9.97%    6.107      1 Template:Tnavbar\n  9.80%    6.007      1 Template:Other\n  6.19%    3.796      2 Template:Icon\n  5.85%    3.584      1 Template:AbsentChris\n  5.12%    3.139      1 Template:Leaked\n  4.41%    2.701      9 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:39672-0!canonical and timestamp 20251119201920 and revision id 354174. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Bob_Chandler%27s_call_with_The_P_Capsaicins&amp;oldid=354174\">http://sonichu.com/w/index.php?title=Bob_Chandler%27s_call_with_The_P_Capsaicins&amp;oldid=354174</a>\"</div></div>",
  "categories": [
    "Chats without Chris",
    "Leaked videos"
  ],
  "links": [
    "Tour of Chris's House III",
    "McDonald's",
    "Women Only Need Apply - No STD's",
    "Taser Discussion",
    "Chris Chan creepy smile",
    "2010",
    "JenkinsJinkiesCwckiApplication",
    "Chris slaps himself",
    "Bob's got Cancer",
    "Chris apologizes to Gwen",
    "April 16 Fetish Vids",
    "For J-R's Eyes Only",
    "Chris pleads to stop Cryzel Torture‎",
    "2011",
    "2020s",
    "Get in touch with Bobby C",
    "Sonichu",
    "All Star",
    "A few kicks",
    "Chris Humps His PS3",
    "Honor Roll",
    "Outdoors workout",
    "Rosechu",
    "ThePCAssassins",
    "YouTube",
    "For Julie's Eyes Only",
    "Barb almost goes off",
    "Ruckersville",
    "Call Bobby Chandler",
    "Chris's Specimen Sample",
    "Chris Kisses Rosechu",
    "CWCFlyingElephants",
    "NO",
    "2000s",
    "Waltah White Calls",
    "Chris Kisses Cryzel",
    "You're Always Pretty",
    "July 2018",
    "Chris's Last Will and Testament",
    "Message for John Kyle",
    "Cwcsicle",
    "kill him",
    "May 2011",
    "police",
    "Power",
    "It Is Finished",
    "Catch A Wild Snorlax Plus Update on Bob",
    "Bob Call 6",
    "2010s",
    "Fiona Facetime Videos",
    "A CWC Audition",
    "Bob",
    "The MovingFoward videos",
    "Chris lost Crystal"
  ],
  "scraped_at": "2025-11-26T15:57:30.558356"
}