{
  "url": "https://sonichu.com/cwcki/Bob%27s_Letters_to_Chris",
  "title": "Bob's Letters to Chris",
  "display_title": "Bob's Letters to Chris",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:202px;\"><a class=\"image\" href=\"/cwcki/File:CLog_09042017_-_Mister_C.00001.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"263\" src=\"/w/images/thumb/9/9d/CLog_09042017_-_Mister_C.00001.png/200px-CLog_09042017_-_Mister_C.00001.png\" srcset=\"/w/images/thumb/9/9d/CLog_09042017_-_Mister_C.00001.png/300px-CLog_09042017_-_Mister_C.00001.png 1.5x, /w/images/thumb/9/9d/CLog_09042017_-_Mister_C.00001.png/400px-CLog_09042017_-_Mister_C.00001.png 2x\" width=\"200\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:CLog_09042017_-_Mister_C.00001.png\" title=\"Enlarge\"></a></div>Bob's vision for the <i>Sonichu</i> comic.</div></div></div>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">The reason for this open letter to you which will grow as time goes on, is that I know now that I, at best, haven't much time left to share myself with you. Particularly to share my things, my dreams, and my thoughts with you at a time in the future when you will be able to understand, remember to use my things and carry on my dreams if you want to.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite><a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Bob</a>, 1987</cite>\n</td></tr></tbody></table>\n<p>In <a class=\"mw-redirect\" href=\"/cwcki/1987\" title=\"1987\">1987</a>, in the wake of a serious health scare and a belief that he would not be around to see his son grow to adulthood, <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Bob</a> wrote a long letter for <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Chris</a>, who was then five years old, to remember him by. Although Chris was still nonverbal at this point, Bob is extremely optimistic about his son's future and hopes that he has provided his family with enough money to send Chris off to <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">college</a>.\n</p><p>Bob puts an absurd amount of focus on his material possessions, collections, personal life story, and achievements, only mentioning Chris in passing. Years after Bob's death, Chris and <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">Barbara</a> sold several of the items in his collection to help resolve their <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">financial issues</a>, although Bob did note that he was fine with Chris passing on his collection to others.\n</p><p>In 2008, Bob wrote another, much shorter letter to Chris, in which he detailed how he hopes Chris and <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a> could gain international fame as mascots for <a href=\"/cwcki/Autism\" title=\"Autism\">autism</a>. For a given measure of online fame, Chris actually succeeded here. In the video in which Chris read it, Chris mockingly scoffed at his father's suggestion, looking visibly embarrassed.\n</p><p>Chris revealed the contents of these letters during a <a href=\"/cwcki/CLog_09042017_-_Mister_C\" title=\"CLog 09042017 - Mister C\">live Captain's Log</a> in <a href=\"/cwcki/September_2017\" title=\"September 2017\">September 2017</a>.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Letters\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Letters</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Open_Letter_-_December_26th,_1987\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Open Letter - December 26th, 1987</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Sonichu_Letter_-_August_18th,_2008\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Sonichu Letter - August 18th, 2008</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Analysis\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Analysis</span></a></li>\n</ul>\n</div>\n<div style=\"clear:both;\"></div>\n<h2><span class=\"mw-headline\" id=\"Letters\">Letters</span></h2>\n<h3><span id=\"Open_Letter_-_December_26th.2C_1987\"></span><span class=\"mw-headline\" id=\"Open_Letter_-_December_26th,_1987\">Open Letter - December 26th, 1987</span></h3>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Text\n</th></tr>\n<tr>\n<td>\n<p>To Christopher Weston Chandler, from your Daddy. Started December 26th, 1987.\n</p><p>\tThe reason for this open letter to you which will grow as time goes on, is that I know now that I, at best, haven't much time left to share myself with you. Particularly to share my things, my dreams, and my thoughts with you at a time in the future when you will be able to understand, remember to use my things and carry on my dreams if you want to. Hopefully you will grow much older together. I will probably be rambling until I drive you to distraction, but just bear with me, because I will get to the point sooner or later. I hope I have been able to provide for you and your mother until you at least get to college, and for your mother, until she joins me at the great sing-a-long in the sky, or wherever. Anyway, I expect you to take care of her, love her, and never disappoint her for as long as she lives. I also expect you to never disappoint me, because I will always be with you to help you when the going gets tough, and you need me. Since everything always seems to happen for the best for me, and when I needed it, I have always felt like my mother was my guardian angel. You look exactly like my mother and I.\n</p><p>\tI didn't plan my life. I just took it as it came along. I seem to have had no control over it. It always came along with what was right for me. Look at me eight years ago in <a href=\"/cwcki/Pre-1980#1979\" title=\"Pre-1980\">1979</a>. When I was really down and out, no friendship from <a class=\"mw-redirect\" href=\"/cwcki/Alan\" title=\"Alan\">Alan</a> and <a class=\"mw-redirect\" href=\"/cwcki/Carol\" title=\"Carol\">Carol</a>, and ready to cash in my chips with heart problems that I didn't even know about. Your mother, <a class=\"mw-redirect\" href=\"/cwcki/Barbara\" title=\"Barbara\">Barbara Ann</a>, helped me through the rough spots and together we had you. Now, I really had something to live for. No better things or events could have happened to me. We have come a long way in the last eight years. Together, we have built a whole new life with an exciting set of dreams. I also expect you to never disappoint yourself. If you think you are at a dead end at something you are trying to do, just stand back, and if it is meant to be, an answer or break will appear. Just remember, there are many sides to a mountain and many ways to climb it. If you get stopped, back off, regroup, and try another way. If you are still not successful, maybe it is not meant to be. Accept is as experience and go after something else for a while. If it is meant to be, having it on the backburner simmering for a while is not bad. It will pop up again, and the way to attain it will be there. Everything in its time. Your mother and I have done our best for you, and in return we expect at least that from you, for yourself, and your children.\n</p><p>\tI will be talking about a lot of things in no particular order. I won't always spell words right, or have the best sentence structure, but then, I am an electrical engineer, not an English major. As a matter of fact, English was my worst subject. I am going to try to write this just as if I'm talking to you face-to-face, any time you care to read this. All of the physical objects and things I have, we'll talk about. Your mother, Barbara, or your Aunt Harriet will keep for you until you are ready for them. If you don't think you will ever need some of them, or don't want some of them, don't waste them. Try to do something with them that you and your mother think I would do. Recycle them back into the world, for the world to use. After all, remember we are only the custodians for a while, and what is one man's junk is another man's treasure. Okay, so here I go. Enough of the preamble. If you are still with me, turn the page.\n</p><p>Well, Christopher, one of my actions that I regret most when I was a young man, sometimes in the late 1940s, I think, I was entrusted with my grandfather's straight razor by means of his last will and testament, and I carelessly misused it and broke it by trying to use it as a screwdriver. I found out later that my grandfather Holloman had specifically wanted me to have it, because it had been very personal to him, and he wanted me to have something of his that had been very personal to him. Something that he had used every day. Well, I still have that broken razor of his, and I still carry the burden of carelessly, with no concern, breaking it. I knew that I would never use it to shave with, but it was my one personal bond with him, and I still feel like I betrayed his trust by carelessly and thoughtlessly misusing it and breaking it. Maybe that razor did have a purpose greater than anything my grandfather and I ever dreamed of, for it is because of my careless ??? of my grandfather's razor that I am writing this open letter to you. I hope that you will not carelessly misuse, waste or destroy the value of the many things I have collected for you. Do not be in such a hurry to use, play, or work with these things. First, learn all about them, how to use them and enjoy them, their value, and how you can <a href=\"/cwcki/Chris_and_money\" title=\"Chris and money\">thoughtlessly waste</a> their value, then enjoy them as I have. For example, my very good stamp collection, or all the recorded popular music on cassette tape, VCR tapes and records. The oil paintings, United Nations art graphics, first of the issue covers, first LIFE covers, the complete set of the very valuable wrong first day issues of the United Nations covers. The musical movies I have collected for you on VCR tapes. My books on popular music, movies, entertainers, musical theater. <a class=\"mw-redirect\" href=\"/cwcki/Lars\" title=\"Lars\">Ship models</a>, my <a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">day lilies</a>, <a class=\"mw-redirect\" href=\"/cwcki/Gazebo\" title=\"Gazebo\">gazebo</a>, and <a href=\"/cwcki/Dreams\" title=\"Dreams\">dreams</a>.\n</p><p>\tAs a boy, my greatest dream was to have inherited things from my mother, father, grandparents, etc. But alas, they were poor, and we were poor, and the things that we and they had didn't stay around long. I am a collector of things, even more than your mother. And as a boy, I always wished I had a stamp collection, or coin collection, or book collection, in a large old house from my grandparents. Well, I did end up with a few things which you will get from me. I have the Chandler family Bible from grandfather and grandmother Chandler, the graveyard plots from my grandfather Chandler and mother are buried, in <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Sylacauga,_Alabama\" title=\"wikipedia:Sylacauga, Alabama\">Sylacauga, Alabama</a>. A few books from my stepgrandmother, Holloman, and a few of my mother's sister's books. My father's picture album as a boy. My mother's picture album as a girl. My picture album as a boy. A box of assorted pictures. A box of my mother's things, when she was a young girl, including a teddy bear she cut the hair off, thinking it would grow back. My baby clothes. All of my books, stamp collection, records, tapes, paintings, scout badges, trumpet, grandfather clock, my dreams for you, your mother, and other personal things. The things that are left from my parent's lives together and apart, except for the memories which I will try to write down in a separate document called \"My Memoirs\".\n</p><p>\tMy father had a second married life, much as I did, and just as you have half-brothers and half-sisters, I have a large number of half-brothers and sisters in which in Salem, North Carolina, where my father is buried. I have another notebook full, called \"This Is My Working Life\", which you might find interesting as to how I spent the forty two years of the working part of my life from high school graduation in 1945 to my retirement in <a class=\"mw-redirect\" href=\"/cwcki/1987\" title=\"1987\">1987</a>. I have the first and only Scout handbook that belonged to my mother's half-brother, Dr. John James Holloman Jr.. This book started me on the road to becoming an Eagle Scout and a Scoutmaster. More about this in my memoirs. You will get this book as well as all of my Scout books, Scout badges, and my dreams for you as a Boy Scout.\n</p>\n</td></tr></tbody></table>\n<h3><span id=\"Sonichu_Letter_-_August_18th.2C_2008\"></span><span class=\"mw-headline\" id=\"Sonichu_Letter_-_August_18th,_2008\">Sonichu Letter - August 18th, 2008</span></h3>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Text\n</th></tr>\n<tr>\n<td>\n<p>August 18th, 2008\n</p><p>Dear Christian,\n</p><p>\tAt this time in life, you and <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a> need a quest and purpose in life. Let Sonichu become a champion for autistic persons everywhere, and continually defeat the perils of autism. Sonichu could become the spokesperson for <a class=\"mw-redirect\" href=\"/cwcki/Autistic\" title=\"Autistic\">autistic</a> persons, with an ongoing fight for them in chapter after chapter, or good deeds on the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">internet</a>. He could become the spokesperson from now on. You and Sonichu could become famous worldwide.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Analysis\">Analysis</span></h2>\n<p>A lot can be gleaned about Bob's character from these open letters. We see what he claims to be the origin of his collecting hobby. An upbringing in poverty, combined with worries that other objects may have personal value to people, serves as the basis for acquiring sets of <a href=\"/cwcki/Stamps\" title=\"Stamps\">stamps</a>, records, and the like. \n</p><p>It's also worth noting that Chris is not Bob's only child. He seems to place more emphasis on Chris carrying on his name (and whatever collections he amassed) simply because Chris is the child he had with Barbara. Chris, being the child he had with the woman he loved the most, was enough to make him the favorite (Barbara's other child, <a href=\"/cwcki/Cole_Smithey\" title=\"Cole Smithey\">Cole Smithey</a>, was not treated well by Bob, to say the least). In the letter, Bob is seen trying to teach him some valuable life lessons based on his own upbringing. It is obvious that he saw Chris as a chance to start anew as a father and had high hopes for his son.\n</p><p>In the final letter we can see how Bob's disappointment with Chris was rationalized. His desire for Chris to combat autism implies that it's what he blames most for Chris's character and behavior (despite ample evidence that his and his wife's incompetent parenting may have done more damage). To Bob, Chris could have been \"normal\" if it weren't for his mental condition. But at the time of writing the letter, when Chris had become famous on the internet, he wanted Chris to fight autism in his comic as a way for his son to possibly \"get better\". Bob likely spent the rest of his days blaming autism for the problems he and Barb gave his son.\n</p>\n<!-- \nNewPP limit report\nCached time: 20250112151749\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.052 seconds\nReal time usage: 0.056 seconds\nPreprocessor visited node count: 74/1000000\nPost‐expand include size: 9797/2097152 bytes\nTemplate argument size: 8526/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   10.548      1 -total\n 36.16%    3.814      1 Template:Quote\n 21.27%    2.244      2 Template:Collapsible\n 19.30%    2.036      1 Template:Articleofthenow\n 19.15%    2.020      1 Template:Clear\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:24889-0!canonical and timestamp 20250112151748 and revision id 330875. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Bob%27s_Letters_to_Chris&amp;oldid=330875\">http://sonichu.com/w/index.php?title=Bob%27s_Letters_to_Chris&amp;oldid=330875</a>\"</div></div>",
  "categories": [
    "Historical Documents",
    "Articles of the Now"
  ],
  "links": [
    "internet",
    "Carol",
    "Chris",
    "Cole Smithey",
    "financial issues",
    "Sonichu",
    "Alan",
    "Barbara",
    "live Captain's Log",
    "Barbara Ann",
    "autistic",
    "gazebo",
    "college",
    "dreams",
    "day lilies",
    "1987",
    "stamps",
    "autism",
    "September 2017",
    "thoughtlessly waste",
    "Ship models",
    "Bob"
  ],
  "scraped_at": "2025-11-26T15:15:06.316270"
}