{
  "url": "https://sonichu.com/cwcki/Chris_Chan_Psychic_Chat_3",
  "title": "Chris Chan Psychic Chat 3",
  "display_title": "Chris Chan Psychic Chat 3",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:5px solid gold\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:January18SonichuBodyswapArt.jpg\"><img alt=\"January18SonichuBodyswapArt.jpg\" decoding=\"async\" height=\"54\" src=\"/w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/50px-January18SonichuBodyswapArt.jpg\" srcset=\"/w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/75px-January18SonichuBodyswapArt.jpg 1.5x, /w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/100px-January18SonichuBodyswapArt.jpg 2x\" width=\"50\"/></a>\n</td>\n<td><b>Delusion disclosure:</b> This article or section takes place during Chris's <a href=\"/cwcki/Spirit_possession\" title=\"Spirit possession\">phase of role-playing</a> as <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a>. He may refer to his <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christine Chandler</a> personality and physical body in the third person by using terms such as \"mama\".\n</td></tr></tbody></table>\n</center>\n<p><b>Chris Chan Psychic Chat #3</b> was the third chat that occurred between Chris and KwaiiSandbag.\n</p>\n<h2><span class=\"mw-headline\" id=\"Highlights\">Highlights</span></h2>\n<h2><span class=\"mw-headline\" id=\"Call_3\">Call 3</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Chris Chan Psychic Chat #3</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/MvCret3n10s\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>20 February 2021\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#FFFF00; color:#008080; color:#008080;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">Audio Recordings\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/>Chris Chan Psychic Chat #2\n</td>\n<td><b>next</b> <br/>Chris Chan Psychic Chat #4\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h3><span class=\"mw-headline\" id=\"Call_3_transcript\">Call 3 transcript</span></h3>\n<table class=\"wikitable mw-collapsible\" role=\"presentation\">\n<tbody><tr>\n<td><strong>Transcript</strong>\n</td></tr>\n<tr>\n<td><font color=\"green\"><b>KwaiiSandbag:</b></font> Alright, here we go. Hello?\n<p><font color=\"#FF1493\"><b>Lily</b>:</font> Hello?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hey there.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Hi, how are you doing?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm pretty good, about y'all?\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Uh, I am wonderful. I've had a very restful weekend.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> I'm doing great. It's uh it's it's great to finally uh meet you Sonichu.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's nice to be on once again. Uh, you just muted yourself there, Lily.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Yeah, sorry. one second, I'll be right back.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So, uh how I know last night was kind of rough for you, but uh how have you been?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, feeling better today.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, that's amazing. I'm glad to hear that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, obviously I typed out what what mostly what happened earlier and uh Rosie and I we've uh spent the day also just watching whatever on YouTube and then uh we uh eventually end up on HBO Max watching a few episodes of girls.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Oh, do you like that show?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Pretty good show.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mm, I see Lily, you just unmuted yourself. Are you back?\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Yes, yes, sorry about that.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Oh, your audio is turned down for me. Let me just...Okay um so, do you want to talk at all about the feelings you were feeling last night?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm well, I feel like it's just uh it's just feelings that were going on since a few days ago when the body when the body remember realized it's never been laid or coddled or kissed properly by anyone else in mutual respect and love and consent and all that.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> So so you are you you Sonichu and Chris's body are are receiving the the previous memories from the body, right? Is that what you're saying?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, receiving the memories and then the present feelings of regret, feeling like this this body feels felt like it failed in uh getting that far and yet uh it literally has had sex at one time, but that was uh but that was with a hooker and fortunately that was a clean hooker that I I don't want to go into too many details. I'll spare you the TMI. But yeah, this body and Chris they've uh grown up together. They uh literally talked with so many other people and between both between both genders and in between and all that. They've been on dates, had some relationships, even a theoretical relationships against the uh trolls who were faking it. faking their interest and all that. And uh-\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So would would that be someone like uh I I again, I started watching the <a href=\"/cwcki/Geno_Samuel\" title=\"Geno Samuel\">Geno Samuel</a> documentary like last week, but I really haven't made that much progress with that. Would that be someone like <a class=\"mw-redirect\" href=\"/cwcki/Panda\" title=\"Panda\">Panda</a>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, that was one of the uh theoretical exes that turned out to be a fake fat hater type.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm so-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So yeah. So yeah, the body was just feeling bummed out lately and I've been uh consoling it and try and talking with it, trying to count the uh blessings for it. It's been it's been very rough. I think we're making I feel like we're making progress though. Plus also I've been mostly focusing on healing and re-energizing this body which that's been which that's been succeeding very well.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So that's great. Um, and as we end the near the end of the pandemic, um, are you since Sonichu is obviously very, very immensely powerful. Uh are you immune to Corona in that body or do will you need to get the vaccine?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um, yeah, the guy's body is pretty much uh immune. So it'd be just like uh...kind of like I'm trying to think of the word. Uh this this this brain has trouble thinking of specific words. I mean it's heard the words before, it's said before.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Would it be redundant?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um, well that's one word or mute point. But well anyway, well it just be an optional thing.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Are we talking Sorry, uh this body or the other one in Is it I'm sorry, uh C-137?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh the you yep, the universe are in this one is C-197.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> 197, my my bad. Yeah. So are you referring to that body being immune or or this current one?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, this one here in that's still Yeah, we're talking we're in universe 1218 here. This is 1218, not C-197 where merging to get the two universes are merging merging together. Everybody's coming through the dimension rift a few at a time and the events are happening and so on and so forth. But yeah, I'm talking about this body.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm. And what about uh would you make sure that uh Chris's uh Christine's mother Barb, would she that she receives the vaccine or is she has she already gotten it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um, she's going to get the vaccine at some point later on. We have her we have her signed up to receive a call for that appointment to be made with the local things later later on.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, that's great to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But aside from that, yeah, I've been having playing more of the visions and everything's been happening. It's been coming everybody. I've also uh checked out I also checked out a few videos on YouTube recently. Apparently on finding like you know, videos that tell you the signs you're experiencing when you're when you got psychic powers or when you got or when you're approaching becoming more spiritually aware or going or ascending to your higher self higher state of self. Uh because uh Chris had already gone that far over over 10 months ago and before that before the body swamp between her and I. I was not in that state as much though I was pretty much though I had been through a whole lot with Magi-Chan and Rosie helped me out and everything. Of course, Magi-Chan being psychic and you know, chilling in his shared subspace and whatnot.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So I have a question. So you are inhabiting Christine's body at the moment, correct\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm Yeah, I'm the I'm the uh I'm inhabiting this body.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So what about Magi-Chan and uh Rosechu? Are- are they inhabiting bodies or is it just their spirits?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, Everybody in C-197 and from there has been existent alive in their own bodies as they have been chronicled. So, Rosie has has is in her body alive safe and well so as Magi-Chan and everyone else.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because C-197 is the universe where pretty much all the magic that's been stripped away from 1218 has ended up. As originally from from the days of King Arthur and all that, the two universes were had were already combined and they were separated by command of not only King Arthur but a bunch of other kings because they didn't want to have to deal with the dragons and shit.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm, I understand.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And so yeah, it's going to be like, you know, more than 500 years would pass since then and then yeah, two dimensions will be the two universes will be fated to remerge.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> And and and will that uh bring what kind what kind of benefits will that bring? Will there be pros, cons? Uh...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, there's a lot there's definitely a lot of pros like you know, everybody's going to become everybody from 1218's going to become more magically able and whatnot and and with powers and abilities that have been dormant with them throughout the majority of their lives. And uh of course uh all the all the original creations, all the original characters and quote fictional characters will be able to uh literally meet and get together with their actual creators or just the people who discovered them through their creative processes which in which in that case was literally them accessing the other dimensions and and hanging out together and just being and vibing. And that'd be very good especially since you know, uh it's way too soon for G5 and my little pony friendship is magic because G4 is destined to have five more seasons.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's a whole but that's a whole different issue. I kind of veered off track a bit.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> No, don't worry about it. Um, So have you been leaving the house much in Christine's body?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I've had yeah, I've been having to go out and run errands. So uh I mean, until when I get this body into C-197 which which that's happening shortly enough, I'll be uh it's not able to totally run at mach mach speed speeds like it should have been. And I'll definitely miss that miss that one thing from being from not being in my body. Of course, higher up than that, miss being together with uh Rosie in the same universe. Which but that's mostly resolved because you know, she's been hanging out with me here but I mean it's just like you know, so near yet so far in the exact same spot but where the- we got like this whole this this dimension curtain between us, which only makes her partly visible.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I believe you called it an iron curtain last time.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, iron curtain.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> And and you are uh you're able to communicate across the iron curtain which many people cannot do. I understand that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, and yet a lot of creators and artists and whatnot, they literally do communicate through the iron curtain but it's like they only address it but so much or otherwise they don't address it at all. And they think it's and a lot of people and to them unless they're really spiritually awakened and they know the truth, then it's like, oh if I address the original characters that I've been creating and chronicling about over the years, I people are going to call me crazy and shit but you know, the obvious the obvious fact is it's not crazy, they're not crazy.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, to the people who have called you crazy in the past, like if you could stand face-to-face with them now, what would you tell them?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'd tell them you're scared Christine's soul, your devil in you is telling is really scared of her and y'all are just trying to disrespect me and disrespect her. So, not cool, man. We're not crazy. You the crazy one.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I see. So now that I'm so oh, oh, um, so last week you couldn't quite get the physical manifestation thing going. How how is your progress been coming with that? Have you been able to manifest anything physical yet?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's making greater progress of which uh in in regard to the body remembering and realizing obviously what it felt and what it feels like it still needs. It's we're uh working on guiding Magi-Chan from C-197 to 1218. So him so he and this body get together and uh along which they would actually literally cuddle and all that because you know, Chris is married to Magi-Chan.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Uh huh, Now, I- I don't know your personal life. Was there a wedding?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, there was a wedding and uh she's probably she's actually polyamorous. She's got uh kind of Magi-Chan, she has four spouses. There's Magi-Chan and then there's Cryzel Rosechu and then Sylvana Rosechu and then the one and only Mewtwo that was literally cloned in Team Rocket's laboratory.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah, Okay. And you were talking also about your your gateway that is in the Gazebo. How is that coming along?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm letting that progress as is. I'll be I'll be definitely making them participating event with the Gazebo tomorrow because that's that's going to be like you know, clear time of day w-weather it's going to be perfect. I mean we've had snow that's kind of prevented me from being able to do it sooner. I mean, shoot, fifth snowstorm on the East Coast within four weeks time.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm. Now, I-\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> I- I said I said something's greater is at play with the uh with the snow. I don't think it's just kind of a weather. I think it might be like a sign of the what's to come, you know?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Obviously, yes, it's it's definitely one of the dimension merge events. You definitely got that right on.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Now, I- I have a question. So I know that uh there are still a lot of trolls and haters out there. Some good, some bad, but um have you thought about uh putting out like content like- like updates on like C-197 and uh I forget the other dimensions exact digits but uh like making like a TikTok account or uploading YouTube videos like talking about um...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, but yes, but that would be very complicated especially considering how- how heavy into this and how much of a conduit this body is. So, it's just not easy to be one to make not make constant updates.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, they don't have to be constant.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And everybody in this universe what's happening in now in C-197 but also other universes and other timelines. Because among which especially in other timelines, I mean, it's nice to tell the majority of people should not know. It's- it's like that thing in the Bible where nobody is supposed to know the exact hour of Jesus Christ's return. It's the same with the dimension merge is fully complete. Nobody's going to know the exact hour when that happens.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, you you...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> All we can do is just see the signs along the way and yet, you know, most the majority of which are going to be blind to it. So, whoop do well. You are unless- unless they're spiritually awakened or as advanced as uh this body and Chris are. So, there's that.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Mhm and and and um I know so your- your power like level spiritually and physically is much higher than a lot of the trolls. So is there any kind of force or rival or anything like that that could try to stop uh what is to come with the merge or are you are you not worried about that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um yeah, there's a lot of forces that are trying that are wanting to- to prevent the merge from happening, but they're be but it's But it's like a lot less than 40% as opposed to the 60% that want the merge to happen. So, it's So it's fated to happen regardless. So whether you like it or not, it's going to happen.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Okay.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Now, you said that and of course, it's in the Bible, it's pretty well known. Nobody's supposed to exactly know the time where Jesus is supposed to come back, but you in your semi- infinite knowledge, do you know?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, we have general ideas because this brain has literally foreseen into the future a whole bunch of times and as well and as Magi-Chan and Mewtwo and like consultants and that and so on and so forth, remembering all that, getting the new visions and updates and as the timeline progresses and closer coming closer to the actual event. So, we have like so it's like we have a general bunch of ideas or theories of when the exact hour is, but the but the the obvious deal is we shouldn't we are not to go public with said details because\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well, this isn't public.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, I mean even even right now I can't really-\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah, I understand\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Yeah, yeah that's fine\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Say because I mean, yeah, it could be it could literally be on the 24th, it could be next month or whatever, but yeah, like I said, it's just nope, I can't say the exact hour.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah, yeah, yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But I'm optimistic for it happening sooner at this point.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> And is the return of Christ uh related to the merge? Are they going to happen at the same time whenever they do happen or is one going to happen before the other?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, wait I didn't understand that question.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Oh sorry, is- is the return of is like Jesus coming back is that uh connected to the Dimensional Merge are they going- are they supposed to happen at the same time?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, actually yeah, that's part of it because everything magical has been mostly dominantly existent in C-197 as opposed to 1218, but yet obviously those that are spiritually enlightened are in this universe are able to actually see into C-197 and vice versa into 1218. So, people have literally seen Jesus Christ and uh all the other deities. So that has happened.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So, I mean, since it's not just uh them though, but we also have like, you know, the CPU goddesses if you played the Hyperdimension Neptunia series. Uh if you know about them. Of course, uh Chris is one of them. She's the goddess of the Commodore consoles.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Uh and I apologize if my questions are kind of um uh low level uh lower level than you. I'm- I'm kind of uh Caleb's apprentice, you know, studying under him just trying to learn the spiritual ways and harness my my kind of like powers. But uh yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's understandable. So, what's your what's your next question?\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So, I have been kind of doing some research on Christine and so have you had any contact with any harmful trolls lately?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Not within not since we uh finished up uh the faded event with having to do with uh well, he named himself Mr. Von, but he really he's uh guy named Daniel who works at a vineyard here in Virginia. But I mean, obviously, we knew that this was an obvious thing, but he decided to play a hand. He uh had literally come up to the house and he left uh a kind gift of a bottle of wine, a jar of pickles and a bag of gummy shark candy. So, so going along with Mewtwo's instructions at the time, this was like uh a couple this was like about a couple of months ago. So yeah, we played along with uh with uh Danny Boy there and uh just went along to see where where it went and then eventually, we found we found him out and got his additional details. So, we ratted him out, give him the give him a taste of his own medicine, and finally making an example of him to all the other haters and bad people. If you mess with us, you you you don't mess with us because we know about you.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Sort of thing.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> And now, I'm- I'm kind of going away from that now. Uh this is kind of a non-sequitur. Um have you ever tried experimenting with psychedelics to try and harness more psychic ability?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, so you mean like uh you mean like going on like weed or any type of drugs of that sort of thing?\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Uh sure. I was thinking something a little stronger than traditional cannabis and THC, like something more akin to like mushrooms.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, the majority of her life, she has not, and she definitely does not smoke cigarettes either. She does not care to, she never wants to. Though she has drank alcohol and she has a really high tolerance. She stays very lucid. I mean, you can get her really drunk and she'll stay lucid and remember everything afterwards and no hangover the next day.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm. But what about-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But yeah, she's she's partaken in a bit of weed with a few friends one time with a kind of a yellow bit, but she also remained lucid through that.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So, so that was the that was a failed experiment we uh we encouraged her to participate in. So that was a that was a good moment there when she had her three friends there at the time but uh they were kind of trollish but she while she was genuine and they felt they felt like, oh, she's too pure. We don't really want to mess with her anymore. So they they split the scene, so to speak.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But yeah, she's she's partaken in that, but it's not a constant thing and she's she's been on an anxiety type of prescription for the majority of her life. But it's not-\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Do you know what that's do you know what that's called?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but yeah, but the uh that pill does not have anything to do with her psychic powers. She's had them even before that's before that started, but originally it was Paxil, but then when she when she became an age, she it changed to Paroxetine, and then and then like about a year ago or so when Barbara found there was an additional side effect to Paroxetine that uh would have been very bad. She talked with her she talked with her doctor and uh then she got switched over to fluoxetine.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Have you ever tried taking like Lexapro for anxiety and stress?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> She has not.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Of all of the patients that I've seen who've dealt with anxiety and me helping to like find the root of trauma. Uh usually going on Lexapro helps a significant amount.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, obviously obviously the doctors she had seen throughout her life have not heard or thought of that. So...\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I mean, sometimes it happens. Now, uh I actually have to uh get going in a second. Um I have a I have another appointment, so we might want to wrap up here if uh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's a shame. So, Lily, did you say you had another question or thought?\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Um Sorry, I've just been listening and trying to, you know, learn and learn from, you know, the I guess uh I can't think of a better word, the big kids, you know, um because you guys are clearly on a uh a higher spiritual level. I mean, my cat just like uh came up to me because I think she can sense the the spiritual energy in this uh this conversation because I- I you you I believe you have cats. I think you know that they can like uh see ghosts and like spirits and stuff like that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, it's true. I mean, yeah, we have cats inside and outside the house, so obviously.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> I don't I don't think I have another question. Caleb, do you have uh anything? I I will try to come up with some for next time. I'm I'm very honored to have been in this conversation though.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font>: Well, you can just uh message me anytime and uh I'll answer them for you.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah. Um, so I have to unfortunately I have a a 9:30 appointment, but uh, and I like to take breaks in between. But, uh, it's been really great talking to you again and I will, I will be in touch to set up our next appointment.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> All right, cool. Well, thank y'all for uh talking with me and uh I'll talk to I'll talk with y'all again next time and like I said, message me any questions, I'll uh answer them.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> All right. See you.\n</p><p><font color=\"#FF1493\"><b>Lily</b>:</font> Absolutely. Thank you so much. Bye.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Bye now.\n</p>\n</td></tr></tbody></table>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"60%\">\n<tbody><tr align=\"center\" style=\"background:#ffec1c\">\n<td colspan=\"4\"><b><a class=\"image\" href=\"/cwcki/File:SonoichuIcon.png\"><img alt=\"SonoichuIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/7/73/SonoichuIcon.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/KwaiiSandbag_calls\" title=\"KwaiiSandbag calls\"><span style=\"color:white\">KwaiiSandbag Saga</span></a> <a class=\"image\" href=\"/cwcki/File:SonoichuIcon.png\"><img alt=\"SonoichuIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/7/73/SonoichuIcon.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<th align=\"left\">The Players:\n</th>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a></li>\n<li><a href=\"/cwcki/KwaiiSandbag\" title=\"KwaiiSandbag\">KwaiiSandbag</a></li>\n<li><a href=\"/cwcki/Lily\" title=\"Lily\">Lily</a></li>\n<li><a href=\"/cwcki/Anaxis\" title=\"Anaxis\">Anaxis</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/KwaiiSandbag_Instagram_DMs\" title=\"KwaiiSandbag Instagram DMs\">Claims of being Psychic</a></li>\n<li><a href=\"/cwcki/KwaiiSandbag_Discord_DMs\" title=\"KwaiiSandbag Discord DMs\">Preparing for the Calls</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li>Calls (<a href=\"/cwcki/Chris_Chan_Psychic_Chat_1\" title=\"Chris Chan Psychic Chat 1\">1</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_2\" title=\"Chris Chan Psychic Chat 2\">2</a> • <a class=\"mw-selflink selflink\">3</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_4\" title=\"Chris Chan Psychic Chat 4\">4</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_5\" title=\"Chris Chan Psychic Chat 5\">5</a>)</li>\n<li><a href=\"/cwcki/KwaiiSandbag#Interviews_with_Kwaii\" title=\"KwaiiSandbag\">Interview with Kwaii</a></li>\n<li><a href=\"/cwcki/Lily#Interview_with_Lily\" title=\"Lily\">Interview with Lily</a></li></ul>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250526002247\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.085 seconds\nReal time usage: 0.145 seconds\nPreprocessor visited node count: 264/1000000\nPost‐expand include size: 2935/2097152 bytes\nTemplate argument size: 240/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   22.617      1 -total\n 37.50%    8.482      1 Template:Infobox/Audiofile\n 36.61%    8.280      1 Template:SonichuPossession\n 24.50%    5.542      1 Template:KwaiiSaga\n 14.64%    3.312      3 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:39866-0!canonical and timestamp 20250526002247 and revision id 341957. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Chris_Chan_Psychic_Chat_3&amp;oldid=341957\">http://sonichu.com/w/index.php?title=Chris_Chan_Psychic_Chat_3&amp;oldid=341957</a>\"</div></div>",
  "categories": [
    "Category",
    "Sonichu Possession"
  ],
  "links": [
    "Claims of being Psychic",
    "phase of role-playing",
    "Geno Samuel",
    "Preparing for the Calls",
    "1",
    "Lily",
    "Anaxis",
    "Chris",
    "KwaiiSandbag Saga",
    "KwaiiSandbag",
    "Sonichu",
    "2",
    "4",
    "5",
    "Christine Chandler",
    "Panda"
  ],
  "scraped_at": "2025-11-26T15:30:42.570117"
}