{
  "url": "https://sonichu.com/cwcki/Chris_Chan_Psychic_Chat_5",
  "title": "Chris Chan Psychic Chat 5",
  "display_title": "Chris Chan Psychic Chat 5",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Chris Chan Psychic Chat #5</b> was the fifth and final chat that occurred between Chris and KwaiiSandbag.\n</p>\n<h2><span class=\"mw-headline\" id=\"Highlights\">Highlights</span></h2>\n<h2><span class=\"mw-headline\" id=\"Call_5\">Call 5</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Chris Chan Psychic Chat #5</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/hL3wLJLVIgA\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>9 March 2021\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#FFFF00; color:#008080; color:#008080;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">Audio Recordings\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/>Chris Chan Psychic Chat #4\n</td>\n<td><b>next</b> <br/>N/A\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h3><span class=\"mw-headline\" id=\"Call_5_transcript\">Call 5 transcript</span></h3>\n<table class=\"wikitable mw-collapsible\" role=\"presentation\">\n<tbody><tr>\n<td><strong>Transcript</strong>\n</td></tr>\n<tr>\n<td><font color=\"green\"><b>KwaiiSandbag:</b></font> Oh hello, um, sorry about that, uh little bit of a communication issue, uh Lily's- getting out of the shower right now so it'll be a second for her, but I'm here.\n<p><font color=\"#0033FF\"><b>Chris:</b></font> OK. How are you doing?\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I'm great, how are you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I feel pretty good.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Had a good week?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, improving, things have been improving I feel better.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well it's good to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm starting to figure out my powers, um, working, i'm working, my conscious brain is starting to figure out these powers for real, at least for, in terms of this universe.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I see.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And, uh... And uh essentially pretty much I was told that, i was told by you know everybody in from C-197 just you know Magi-Chan, MewTwo, and what not, they tell me i need to definitely meditate and search within myself a whole bunch.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> And have you done that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I'm doing that I still have a lot more soul- a lot more in depth work to do but making good progress. And I also went out today, I went to the uh, I went down to Ivy Creek Nature Area and walked a lap around and uh stopped by the creek, had a meditate, sit on the big ol rock and put my feet in the water.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> And how did that feel?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It was cold, but it was good. Felt alive.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> That's good to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So yeah, uh among that's also a part of, aspect of reconnecting with nature.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yes.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So... What have you been thinking about over the past week?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sighs</i>] Hard, it's hard to say off hand but just thinking about everything and of course the dimension merge, everybody and real, and, just reanalyzing the situation in myself, and present, and so on so forth. [<i>loud hoot</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's a lot of brain work.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yes, I can definitely understand that. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But yeah, I mean it's- it's not as much brain work as y'know projecting myself so much and being in another universe a lot of the time. And doing all that work.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yes. So, speaking of doing a lot of work, so while you were in C-197 I understand you caught up on comic book pages and uh, stuff like that. When do you think that's gonna be released?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well considering all those books are in C-197, I'd say... post-dimension merge? In the very near future.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because i'm still unlocking my- I'm still unlocking my powers for this universe, which will shortly- shortly enough be fully tangible and work, well to where I can barely do a show for everybody, be like hey I can do this I can do that. [<i>unintelligible</i>]\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah have you thought about like uploading a youtube video or something on Twitter?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm, yes I have thought about it, but- but the way my powers manifest in my universe at this point? It's like they're- they're more tangible in feeling so it's like you'd have to be right here in person to feel it or you'd have to be so sensitive that you had to view it and actually see it if I were to record a video.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well... I would know what you're doing and I'm sure other psychics out there if they watched it would be able to feel the energy coming from it so I don't really see the harm in uploading a video of you trying to manifest something.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> We'll take that under consideration and think about that further.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm also figuring out my other self mental blocks, so I can dispose of them and get them out of the way.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Well why don't you tell me about those?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, the obvious one the fact that I was born high functioning autistic, I mostly got over that.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> And how did you get over that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Just, pretty much...\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Sorry- sorry I'm late, I just got out of the shower. Uh hello?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hey there.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Hey there Christine, sorry about that.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> We're talking about uh, kind of roadblocks in Christine's life, and how she's gotten over them.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> I see ok, sorry sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well not, it's not- it's mostly various and whatnot but it's really about um, trying to think. Right here I have the term written down, it's essentially- oh yeah, essentially just trying to clear away any remaining self judgements and self criticisms...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So there's that. Anyways, just been doing- anyway to catch you up I've been doing a lot of further self-examining and uh... certain... meditating looking more into myself as opposed to outward.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Mhmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I also took a nature walk today and meditated on a big ol rock, dipped my feet in the flowing river. It's cold! But it felt alive and it felt great. \n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> That's really wonderful. I understand the uh- was this- this involved the gazebo? Is that part of your nature walk? It's kinda an interdimensional rift? Is that what it is, I'm sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well the gazebo in the backyard is uh, it's kinda- it's kinda like a beacon or a kind of a link between the two universes as well, but, in reference to earlier I was talking about today I went to a nature area.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Oh, alright.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I walked a big ol lap around there, down and up hills.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> That's great, that's really great I feel like, I mean like uh, I think it's the same for you, kinda your psychic energy, spiritual energy really gets awakened when you're in these kinda nature settings.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but it's also, I've realized and learned recently that my uh, both my root and sacral chakras, they need a heavy amount of recharging, cause all my energy is just in between my third and crown and soul star chakra points. So those are like overcharged.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So i've taken, conscious ability to redirect energy from the higher chakra points down to the lower one, the excess energy.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So, I saw on Twitter today that you posted about the amount of willpower it takes to manifest something in this dimension.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And it's not brainpower, it's not willpower but...\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Yeah, physical power.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Do you mind telling us, like, exactly how much power that takes?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh... Well, you're psychics, you should know!\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> That is very true, but... sometimes it's good to hear a second opinion.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It is good to hear a second opinion, anyways. Um, anyway yeah, just, well it takes massive amounts and obviously my brain is overpowered along with all my other abilities, along with the rest of my body and everything. But it still gets very tiring.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Mhmm.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> So... Lily do you have anything to ask?\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Uh, sorry I'm just still kind of uh, kind of spaced out from the- just got out of the shower, was just doing my evening routine, uh let me think. Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I'm kinda feeling in spacing, zoning, in and out myself right now.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Very interesting, maybe it's, uh something connecting all of us in our spacing.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, the... it's definitely connected with the dimension merge or as I heard somebody else call it, um... Darn it, that word stayed there but...eh.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Yeah I definitely think it's probably like a- a mind merge, like the dimensions haven't fully merged yet but our consciousness might be uh- kinda phasing in and out of between in the dimensions.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah that's what we're doing it uh...\n</p><p>[<i>pause</i>]\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Hmm, so...\n</p><p>[<i>pause</i>]\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I'm sorry I'm like a little tired.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm a little tired too. I'm just... I'm trying to think of this word, but anyway yeah dimension merge, EVERYBODY who is psychic um, magic, or just at least that level- that high level sensitive, they're, i mean we all are feeling this, so yeah. And we're all in this together so everybody's at least doing their, at least a little bit, if not a massive amount. Among, the levels I've done, jeeze.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Good to know that we're not alone. Good.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. It's a shame that we can't actually show this to some- some regular mental... uh neurotypical type of person who's like, hey come on manifest something in front of us. But then it's like, I'm SO difficulty doing it in this universe.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Did you find in the um, C-197, it came- manifesting came with a lot greater ease due to the magic that was lost?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, it's a lot easier there.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Can even uh... sorry that was uh- I was gonna say could even non-magical people do it, but everyone's magical there, my bad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Eh. I think it's uh, mostly psychics and magic types, and then also creative types who write, draw, and so forth, that have explored C-197, at least in their imaginations and whatnot. It's like in essence ___ vs. sonichu, where the- where [<i>unclear, timestamp 11:50</i>] and Courtney end up writing things into effect while they were in dimension, I mean universe N641 with essence to get out of that massive dimension merge which mistakenly did that to allllllll of the other universes, as opposed to just the two, the two neighbouring.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right, and there's- there's an infinite number of universes, according to the multiverse and all that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> So is it just C-137's merging or is it every universe that's merging?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's just, it's just 1218 and C-197. \n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Gotcha, I'm sorry, mixing em up. Um... So will the rest join at one time, or are these the only two that are fated to join?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, most of the other pairs of universes within all the other dimensions, they have merged.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Mmm. So we're behind-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So this pair, our pair of universes here is amongst the last- amongst of the last to be.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right. So we're kinda behind the trends, everyone else is already merging and we're behind all of them.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but in a sense it's a good thing because all the- cause like Magi-Chan and MewTwo they were able to observe into the other dimensions and universes, those that were- did merge and were able to see and witness it as it happened, what events happened that led to that eventuality in there so they could make that- so we could get that in similar effect to what we have here within this timeline between our pair of universes.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right, right. And that'll- you know we can kinda be more prepared and not um... \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's the deal!\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Repeat mistakes that maybe other, other pairs have made.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah like for an obvious example, one time in a- in a distant dimension uh essentially, Sonichu Prime there uh just usurped the powers and abilities from his respective Chris-Chan and took over a Chris, that Chris-Chan's world. And that did not work out at all. And then obviously another one where that Chris-Chan was just all dark magic, dark powers as opposed to light magic and light powered and that didn't work out either. \n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Was that- did that Chris-Chan turn evil or just uh?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's, yep, yeah.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Wow, have you had any- obviously not physical, but spiritual encounters with this version?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, I've, yeah, I've encountered uh, just pretty much nearly all of my other self counterparts between all the other dimensions and universes and timelines. And of course I have a bunch of self counterparts in C-197.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Are you friends with any of them? I understand- no- they can't all be bad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I'm friends and acquaintances and uh, you know neutral relationships on uh, with the majority of them, so we kind of have uhh, neutral to good vibes for the most part between each other, as a group. \n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Anyways, so what have y'all been feeling lately? Seeing...\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I've been seeing a lot of energy in Virginia, and I'm pretty sure that's you. Uhh, just generally like manifesting and um, kind of bringing together, you know? And... I don't know, I remember we talked last week about relationships and um, stuff like that, has anything happened with that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um, yeah a bit of a- bit of progress on that um...\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Oh really?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah I managed to get a little bit of a further understanding in that from uh, my further internal self exploration I still need to uh, estab... things like when I would be desired... for such satisfaction from a part... from a partner if not Magi-Chan that would manifest herself within this universe.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> And you're looking for a girl, a female so not...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well my body is yeah, but also on that note I've learned that the important key is self love. Because if i love myself the way I would want my partner to love me so I can have all that figured out then that would attract... that aspect would attract the other person. It's like uh, you're programming a magnet to, with these certain qualities to attract this type of individual and then eventually when you get all the details sorted out then [<i>Chris whoops</i>]\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> You know what you want it's easier to manifest it. You gotta know exactly what you're looking for, um.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> So I understand um, Magi-Chan is polyamorous, in a polyamourous relationship correct?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I'm there uh, yeah between me, Magi-Chan, Cryzel Rosechu, Silvana Rosechu and the one and only MewTwo that was cloned in Giovanni's lab, we're all married together, the 5 of us.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> It's not um, it's not those are just Magi-Chan's partners and you all share each other?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, we all share each other and uh, yeah it's a very good and it's also open relationships for any other explorations to... cause considering heavy psychic power types this particular arrangement and extradimensional at least in Cryzel's case, so yeah there's all that. So yeah it's polyamourous and I just feel like this is a good fit for me and it allows me room to still... I mean especially in this universe if not Magi-Chan finds somebody who can actually satisfy my body's physical needs so with- my realization that I need self love I managed to find within my abilities the healing energy to where I could actually instill the positive feelings of that particular type of satisfactory love upon myself so that I could make my body feel better.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right, that's great and then the [<i>clears throat</i>] that's also great to hear about polyamourous relationship works, cause I understand that with a lot of people who are in poly relationships, uh if it's kind of you're not sharing all the partners there can be a lot of jealousy and self-resentment so that's a good way to avoid that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Have you had any difficulties with that, with the uh, polyamory, or uh, I understood a lot of people need counselling, go to support groups for that, or have you been fine with it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, we've met- we've gotten along for the most part, and we've adapted- and I mean considering you're in a group, considering we're a group of psychic types pretty much, it's like we...\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Much deeper connection.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> We have a deeper connection yes. And we work to get a little better, you know if you look on Amazon Prime there's a kinda like a psuedo, hang on, okay there's a psuedo softcore porn documentary type of show called Polyamory, and it explores couples in polyamorous relationships, there's two seasons. I believe it aired on Cinemax or HBO but it's on Amazon Prime.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Right, OK, I might check that out, honestly- personally I'm, I suppose my psyche abilities have not developed to the point where I could be ok with the polyamourous relationship, I feel like I have too many insecurities and stuff like that, but I do suspect that once I kind of ascend further I might be able to engage in that sort of thing.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, at least you're interested so that's a good- so that's good.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Yeah, it's uh, I think it's very important for... Um, what's it called, you know kind of strengthening psychic bonds, you know the more love you have in your life the more powerful it becomes. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. I agree.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> Now, I unfortunately... will have to cut it short very soon because I have to schedule something for tomorrow, but um, is there anything else that we wanna talk about before...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well I guess I'm mostly good for now, but yeah, both of y'all keep your, keep opening you know thoughts as much as you both see or feel over the next, over the next week until our, the next time we get together and talk.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Course, yes, that's our bad, we need to, we'll have more prepared for next time.\n</p><p><font color=\"green\"><b>KwaiiSandbag:</b></font> I'm sorry, this was kinda uh, I was not prepared, this was not our A Game.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's alright, it's alright I'm just, I'm somewhat on A game but I'm not totally perfect either. Whoop de doo it's all good.\n</p><p><font color=\"#FF1493\"><b>Lily:</b></font> Yeah cancel that. Well Christine, you have a good night.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah well y'all have a good night too, take care.\n</p><p><br/>\n</p>\n</td></tr></tbody></table>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"60%\">\n<tbody><tr align=\"center\" style=\"background:#ffec1c\">\n<td colspan=\"4\"><b><a class=\"image\" href=\"/cwcki/File:SonoichuIcon.png\"><img alt=\"SonoichuIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/7/73/SonoichuIcon.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/KwaiiSandbag_calls\" title=\"KwaiiSandbag calls\"><span style=\"color:white\">KwaiiSandbag Saga</span></a> <a class=\"image\" href=\"/cwcki/File:SonoichuIcon.png\"><img alt=\"SonoichuIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/7/73/SonoichuIcon.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<th align=\"left\">The Players:\n</th>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a></li>\n<li><a href=\"/cwcki/KwaiiSandbag\" title=\"KwaiiSandbag\">KwaiiSandbag</a></li>\n<li><a href=\"/cwcki/Lily\" title=\"Lily\">Lily</a></li>\n<li><a href=\"/cwcki/Anaxis\" title=\"Anaxis\">Anaxis</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/KwaiiSandbag_Instagram_DMs\" title=\"KwaiiSandbag Instagram DMs\">Claims of being Psychic</a></li>\n<li><a href=\"/cwcki/KwaiiSandbag_Discord_DMs\" title=\"KwaiiSandbag Discord DMs\">Preparing for the Calls</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li>Calls (<a href=\"/cwcki/Chris_Chan_Psychic_Chat_1\" title=\"Chris Chan Psychic Chat 1\">1</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_2\" title=\"Chris Chan Psychic Chat 2\">2</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_3\" title=\"Chris Chan Psychic Chat 3\">3</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_4\" title=\"Chris Chan Psychic Chat 4\">4</a> • <a class=\"mw-selflink selflink\">5</a>)</li>\n<li><a href=\"/cwcki/KwaiiSandbag#Interviews_with_Kwaii\" title=\"KwaiiSandbag\">Interview with Kwaii</a></li>\n<li><a href=\"/cwcki/Lily#Interview_with_Lily\" title=\"Lily\">Interview with Lily</a></li></ul>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250526002307\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.076 seconds\nReal time usage: 0.081 seconds\nPreprocessor visited node count: 244/1000000\nPost‐expand include size: 2372/2097152 bytes\nTemplate argument size: 186/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   10.422      1 -total\n 77.41%    8.068      1 Template:Infobox/Audiofile\n 21.63%    2.255      3 Template:Pipe\n 21.57%    2.248      1 Template:KwaiiSaga\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:39868-0!canonical and timestamp 20250526002306 and revision id 337479. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Chris_Chan_Psychic_Chat_5&amp;oldid=337479\">http://sonichu.com/w/index.php?title=Chris_Chan_Psychic_Chat_5&amp;oldid=337479</a>\"</div></div>",
  "categories": [],
  "links": [
    "Claims of being Psychic",
    "Preparing for the Calls",
    "1",
    "Lily",
    "Anaxis",
    "Chris",
    "KwaiiSandbag",
    "KwaiiSandbag Saga",
    "2",
    "4",
    "3"
  ],
  "scraped_at": "2025-11-26T15:30:46.342909"
}