{
  "url": "https://sonichu.com/cwcki/CWC_Blog",
  "title": "CWC Blog",
  "display_title": "CWC Blog",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>The <b>CWC Blog</b> or <b>Captain's Log</b> (no relation to <a href=\"/cwcki/Captain%27s_Log\" title=\"Captain's Log\">the video logs</a>) section of <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> was where Chris told the world about his goings-on when he was too lazy to fire up his <a href=\"/cwcki/PSEye\" title=\"PSEye\">PSEye</a> and do a proper <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> video, from <a href=\"/cwcki/August_2009\" title=\"August 2009\">August 2009</a> to <a href=\"/cwcki/May_2010\" title=\"May 2010\">May 2010</a>. And given how much time his fat ass was plopped in front of his <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a>, that's extraordinarily lazy.  \n</p><p>Chris hardly used this section of the CWCipedia in its early days. The only message in this section for months was a post about some HONEST TRUTHS regarding trolls, merchandising, and his <a href=\"/cwcki/Homos\" title=\"Homos\">straightness</a>. But usage of this section started heating up after <a href=\"/cwcki/Kacey\" title=\"Kacey\">Kacey</a> left him and his copyright was challenged. He began to post some updates about his copyright situation, about trying to work with <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> to get a cut of the money she earned through her <a href=\"/cwcki/Audiobooks\" title=\"Audiobooks\">Audiobooks</a>, and to give excuses for why he once again hasn't gotten around to scribbling out his <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">shit comic</a>. He's likely using this section in an attempt to show the world that he does such <a href=\"/cwcki/Father_Call\" title=\"Father Call\">HARD WORK</a> on the comic in order to win the <a href=\"/cwcki/China\" title=\"China\">respect</a> of Kacey or possibly other future <a class=\"mw-redirect\" href=\"/cwcki/Sweethearts\" title=\"Sweethearts\">sweethearts</a>.\n</p><p>The headings of the following entries are dated in Chris's time zone, though the times and dates that appear at the end of each blog post are inserted by the wiki and are in <a class=\"mw-redirect\" href=\"/cwcki/Molvania\" title=\"Molvania\">Central European</a> Time, so they may reflect a date different from Chris's viewpoint.\n</p>\n<h2><span class=\"mw-headline\" id=\"August_2009\">August 2009</span></h2>\n<h3><span class=\"mw-headline\" id=\"24_August_2009\">24 August 2009</span></h3>\n<p>I wish to make a few points of <a class=\"mw-redirect\" href=\"/cwcki/Honest_Truth\" title=\"Honest Truth\">Honest Truth</a> here.\n</p><p>1. THERE ARE NO OFFICIAL <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">SONICHU</a> or <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">ROSECHU</a> MERCHANDISE YET. I WAS NEVER AT THE OTAKON. <a class=\"mw-redirect\" href=\"/cwcki/CChanSonichuCWC\" title=\"CChanSonichuCWC\">The guy in the Brown Stripes</a> claiming to be me is <a href=\"/cwcki/Ian_Brandon_Anderson\" title=\"Ian Brandon Anderson\">An Impostor</a> and A Poser. DO NOT BUY ANYTHING UNTIL I GIVE THE WORD ON THE \"CAPTAIN'S LOG\" Personally that it would be Official and Legitimate.\n</p><p>2. Ignore ALL <a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">\"Videos\" portraying me in a Wrong Sense</a>, ESPECIALLY IF IT IS NOT on MY TRUE YouTube Account, <b>ChristianWChandler</b>.\n</p><p>3. I have called myself a <a href=\"/cwcki/Trolls\" title=\"Trolls\">Troll</a>, because I am Trolling my Trolls Back, so in a Sense, I, <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christian Weston Chandler</a>, am a Troll, but I am NOT A TROLL to any and all <a href=\"/cwcki/True_and_Loyal_Fanbase\" title=\"True and Loyal Fanbase\">Honest, True People</a>.\n</p><p>4. \"It Is Okay To Be <a class=\"mw-redirect\" href=\"/cwcki/Naive\" title=\"Naive\">STUPID</a> Sometimes\"; It Is Not Okay To Be <a href=\"/cwcki/Homos\" title=\"Homos\">Homosexual</a> and Boast About it as well. BUT I will personally Not Judge one or Separate any individual People as such; I am cool with being Friends with the homosexuals. BUT LET ME MAKE IT CLEAR, AND I WILL NOT TOLERATE ANY QUESTIONS AFTER I HAVE MADE IT CLEAR SOO MANY TIMES,\n</p><p>5. <b>I, Christopher Christian Weston Chandler <a href=\"/cwcki/Homos#Evidence_that_Chris_is_a_homo\" title=\"Homos\">AM STRAIGHT</a>.</b>\n</p><p>6. I can work faster with <b>Good, Honest <a href=\"/cwcki/Show_RESPECT_to_me,_%22C%22CWC\" title='Show RESPECT to me, \"C\"CWC'>R-E-S-P-E-C-T</a></b>. \"Find out what it means to me.\"\n</p><p><br/>\nHave good faith in me, and the True, Good and Loyal amongst you all shall be rewarded.\n</p><p>I am Working Hard on getting officially Paper-Published, with Official Sonichu, Rosechu and C.W.C. Merchandise that I will personally sign-off on to follow.\n</p><p>Have a good, safe day. Peace, --<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 21:27, 24 August 2009 (CEST)\n</p>\n<h2><span class=\"mw-headline\" id=\"November_2009\">November 2009</span></h2>\n<h3><span class=\"mw-headline\" id=\"19_November_2009\">19 November 2009</span></h3>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:CaptiansLogNov19.JPG\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"339\" src=\"/w/images/thumb/4/4a/CaptiansLogNov19.JPG/300px-CaptiansLogNov19.JPG\" srcset=\"/w/images/4/4a/CaptiansLogNov19.JPG 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:CaptiansLogNov19.JPG\" title=\"Enlarge\"></a></div><a href=\"/cwcki/THAT_IS_MY_HOUSE\" title=\"THAT IS MY HOUSE\">I'M WORKIN' ONNIT</a>!</div></div></div>\n<p>I apologize, but I came up blank on today's page; I am working on it until I have the right idea in my head before I start drawing. But I wanted to make sure I do not leave the Cwcipedia unattended, so I am going to make the \"Captian's Log\" my Blog Spot (a Quote should only be a quote and not a blog entry).\n</p><p>When I have an update, I will post them here, with an archive; link listed below. If <a href=\"/cwcki/Slow-in-the-minds\" title=\"Slow-in-the-minds\">I come up blank</a> one day, I will make an update such as this, or start a new Cwcipedia page for a character or topic, in lieu of a comic page that day; this is a promise.\n</p><p>Other issues on my mind in <a class=\"mw-redirect\" href=\"/cwcki/Cwcville\" title=\"Cwcville\">Cwcville</a> are a video introducing Sonichu to the companies (it may be a two-part video), with advising guidelines provided generously by <a class=\"mw-redirect\" href=\"/cwcki/Vivian\" title=\"Vivian\">Vivian</a>, which I deeply appreciate and will use for the script of the video. Thank you, Vivian.\n</p><p>Trolls have been a pain to me in the past, but I will have them all know that their attacks, be they via hurtful phone calls, e-mail or snail-mail, in no way affect me emotionally or mentally. So they can take that and go Get A Life.\n</p><p>I have brought up the new <a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=Mailbag\" rel=\"nofollow\">Mailbag</a> page to the Portal, because these inputs have been brought to my attention, so I will offer personal individual replies to each new set of messages once a week, although I would prefer e-mails to my personal e-mail address, or you may direct your questions to cwcipedia@virginia.usa.com so they would be added to the <a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=Mailbag\" rel=\"nofollow\">Mailbag</a> alternatively.\n</p><p>Thank you all for your good and honest patience, faith and patronage.\n</p><p>Have a good and safe day\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 01:29, 20 November 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"Audiobooks_and_Videobooks\">Audiobooks and Videobooks</span></h3>\n<ul><li><i>This message was left at the bottom of the Captain's log space on 19 November and remained there until 25 November, at which point it was given its own page.</i></li></ul>\n<p>Attention, for all those who have purchased the <a href=\"/cwcki/Audiobooks#The_DVD\" title=\"Audiobooks\">\"Sonichu Audiobook DVD\"</a>, please Direct ALL questions, comments and complaints to the owner of this youtube account, <a class=\"external free\" href=\"http://www.youtube.com/user/vivitheg#grid/user/4EAA2A54AFDDFBE1\" rel=\"nofollow\">http://www.youtube.com/user/vivitheg#grid/user/4EAA2A54AFDDFBE1</a>, Vivian Gee at her e-mail address, starroadgeno@hotmail.com. \n</p><p><br/>\nI, Christian Weston Chandler, in the past disproved her <a href=\"/cwcki/Parody\" title=\"Parody\">parodic</a> and flawed audiobooks and her DVD creations and sales. But due to the <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Anger\" title=\"Chris and Anger\">Peace of Mind</a> I have finally found, I am in talks with her to make her DVDs an Official Sonichu Merchandise Item with my Approval and a few tweaks, of course.\n</p><p><br/>\nWhile I can honestly relate to the content of her Audiobooks, I am not personally responsible for their original creation. To view <a class=\"mw-redirect\" href=\"/cwcki/Videobooks\" title=\"Videobooks\">MY Audiobook Readings</a>, visit the Videobooks section of this website, CWC's Sonichu Site, A.K.A, Cwcipedia.\n</p><p><br/>\nThank you all for your continued patronage and support. And please encourage Vivian to come in agreement with me not only for better, and Personally Approved, Audiobook DVDs, but for a better chance for Official Sonichu Merchandise to come sooner.\n</p><p><br/>\nAgain, Vivian's e-mail is starroadgeno@hotmail.com.\n</p>\n<h3><span class=\"mw-headline\" id=\"20_November_2009\">20 November 2009</span></h3>\n<p>Page 81 is drawn, colored, edited and up. For the page, let me offer my personal commentary. <a href=\"/cwcki/Autism\" title=\"Autism\">I hit the block</a> yesterday, because I realized that <a href=\"/cwcki/Liquid_Chris#In_the_comic\" title=\"Liquid Chris\">\"Chris\"</a> was originally planned for <a href=\"/cwcki/Giovanni\" title=\"Giovanni\">Giovanni</a>'s blackmail deal; \"Proclaim obedience and control of the city to \"Chris\", or <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a> will die.\" I later remembered <a class=\"mw-redirect\" href=\"/cwcki/Reldnahc\" title=\"Reldnahc\">Reldnahc</a>, so I put him in that situation instead.\n</p><p>Upon reflection, I feel this is a better story plot, because Naitsirhc is of more close connection to Giovanni than \"Chris\" was, plus it gave me the chance to start the link between him and the Devils at \"<a href=\"/cwcki/4-cent_garbage.com\" title=\"4-cent garbage.com\">4-Cent Garbage</a>\".\n</p><p>Also, let me elaborate, without a plan, it takes me longer to think of what I want to draw and how to draw the scenarios and characters onto the page. But when I have the idea, the roll starts, and the page is drawn. Drawing a page at its best takes an hour at the most, then the coloring takes about half an hour, unless I have a new character on the page and have to choose the color-scheme for that character.\n</p><p>With this page-a-day flow, don't be surprised if more than one page shows up on the Cwcipedia in the same day. ;) But I take my time in thinking, drawing, coloring and all that.\n</p><p>Have a good and safe day,\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 02:33, 21 November 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"23_November_2009\">23 November 2009</span></h3>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:292px;\"><a class=\"image\" href=\"/cwcki/File:Gay%26PickleAds.JPG\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"300\" src=\"/w/images/a/aa/Gay%26PickleAds.JPG\" width=\"290\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Gay%26PickleAds.JPG\" title=\"Enlarge\"></a></div>The offending ads in question.</div></div></div>\n<p>I have been busy looking up numbers to get in touch with the people of the videogame, toy, video, and comic industries to make the merchandise come to fruition. Today, I have created and am uploading 4 Videos introducing Sonichu to those people. Firstly, a Personal Presentation, followed by the Powerpoint Presentation. After each fully uploaded video, I will be adding them to the Sonichu Presentations page. Expect all the videos uploaded before midnight tonight and a new page or two tomorrow.\n</p><p>Stay Safe,\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 03:23, 24 November 2009 (CET)\n</p><p>P.S.\n</p><p>The following ads that have been displayed on this website, the <a href=\"/cwcki/Pickle\" title=\"Pickle\">Mexico Contest</a> and the (UGH!!!!) <a href=\"/cwcki/Homos\" title=\"Homos\">gay-rights ads</a>, will be edited (Mexico Contest) or Removed (gay-rights). I have Not approved EITHER ad before their arrival, and I have informed the sysop of this misdeed. GOD!!!\n</p>\n<h3><span class=\"mw-headline\" id=\"25_November_2009\">25 November 2009</span></h3>\n<p>I will be reading and answering the current set of fanmail in the Mailbag shortly after I upload today's page 86.\n</p><p>Considering tomorrow is Thanksgiving, I will make effort to draw 3 or 4 pages and upload them either then or Friday, depending on the time it comes to be upon completion of the goal number.\n</p><p>Also, I have been thinking, although all Sonichu \"Merchandise\" sold online in the past I have labeled false; I did that, because it came as a surprise to me then, I felt outraged appropriately (most everyone can relate to that; it's comparable to if Godzilla or Clover came to YOUR Metropolis and suddenly attacked your city). I realize now that even though it is still considerably Not Official, it all still is an homage to my creation. So I will make it clear to ALL those Vendors.\n</p><p>As long as it is NOT printed copies of my books' pages, or bootlegged copies of <a href=\"/cwcki/Christian_Weston_Chandler...Yep,_I%27m_on_TV_:)\" title=\"Christian Weston Chandler...Yep, I'm on TV :)\">my \"Christian Weston Chandler, Yep, I'm On T.V.\" DVD</a>, AND As Long As I am quoted on ALL websites' and vendors' locations as Original Creator of Sonichu, Rosechu, Cwcville and all of such, I, Christian Weston Chandler, approve of such merchandise from Day Forward. At least to give you all, my patient, loyal Fans and Trolls, something to quell your pallets until Official Merchandise is sold in Official Stores such as Toys 'R' Us, <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a>, Best Buy, <a class=\"mw-redirect\" href=\"/cwcki/Wal-Mart\" title=\"Wal-Mart\">Wal-Mart</a>, etcetera and such.\n</p><p>I have spoken, and I wish everyone a Safe and Happy Thanksgiving.\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 02:17, 26 November 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"29_November_2009\">29 November 2009</span></h3>\n<p>Here's the page for today. I had already explained that I was setting my mind on the mailbox reply yesterday, so that was yesterday's update.\n</p><p>Anyway, a couple of things. Firstly, this morning, I was asked to light the First of the four <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Advent_wreath\" title=\"wikipedia:Advent wreath\">Advent Candles</a> at my <a class=\"mw-redirect\" href=\"/cwcki/Wesley_Methodist_Church\" title=\"Wesley Methodist Church\">Church</a>. I felt delighted and honored, and I gave my best on reading the bible verse with the lighting. Everyone there praised me for my <a href=\"/cwcki/Autism\" title=\"Autism\">good reading</a> and <a href=\"/cwcki/Speech_impediment\" title=\"Speech impediment\">speech quality</a>; I felt good.\n</p><p>Second, a piece of sound advice I had thought of after I drew page 91 of the <a href=\"/cwcki/Sonichu_9\" title=\"Sonichu 9\">9th book</a>. Back when I was in <a href=\"/cwcki/Manchester_High_School\" title=\"Manchester High School\">high school</a> during my Freshman year, during the time I was a Manager of the Varsity <a class=\"mw-redirect\" href=\"/cwcki/Basketball\" title=\"Basketball\">Basketball</a> Team, I had a crush on <a class=\"mw-redirect\" href=\"/cwcki/Laura_Dorazio\" title=\"Laura Dorazio\">one of the cheerleaders</a>. Among the whole group though, they all enjoyed my company and <a href=\"/cwcki/Random-access_humor\" title=\"Random-access humor\">good humor</a>. Anyway, the cheerleader I had the crush on, she asked me if I had a crush on anyone; I answered <a href=\"/cwcki/Honest_Content\" title=\"Honest Content\">honestly</a>. Then she asked who. Blushing, I told her that I was crushing on her. She took some time to think about it, and she told me later that while <a href=\"/cwcki/Friend_zone\" title=\"Friend zone\">she liked me as a friend</a>, <a href=\"/cwcki/Infinitely-High_Boyfriend-Factor\" title=\"Infinitely-High Boyfriend-Factor\">she did not see me as boyfriend material at the time</a>. I later learned that she was Two Grades ahead of me. Live and Learn; at least I tried.\n</p><p>And with that, I encourage EVERYONE to date someone to hopefully make into a <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Sweetheart</a> (with <a href=\"/cwcki/Third_date\" title=\"Third date\">eventual benefits</a>). It is harder when you are a Freshman, so I'd wait until the Sophomore year before setting my sights on nearly every <a href=\"/cwcki/Boyfriend-free_girl\" title=\"Boyfriend-free girl\">girl</a> I <a class=\"mw-redirect\" href=\"/cwcki/Pedo-glasses\" title=\"Pedo-glasses\">saw</a>. But as a Freshman, if you have your sights set on someone, and YOU KNOW that opposite-gender person is a Freshman too, I suggest looking up a role-model. A cool <a href=\"/cwcki/Joseph_Herring\" title=\"Joseph Herring\">Junior</a> or Seinor-Year student, and follow their example on asking others out (but with your own <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_medallion\" title=\"Sonichu medallion\">personal flair and charm</a>; do not totally copy your role-model).\n</p><p>And IF you know someone who is WITHOUT a Sweetheart in High School, Ladies and Gentlemen, HOOK THEM UP. And <a href=\"/cwcki/Hanna\" title=\"Hanna\">DO NOT MAKE IT A JOKE</a>; that is just Plain Mean and Cruel, and being Mean and Cruel is NOT Cool. And if it helps, think of it as Volunteer Work. Most people enjoy volunteering and helping, Even for an Assignment or Extra Credit. Such kindness and concern reflects you as a Better Person; not some random Shallow Loser, because it show that You Truly Care about others AND yourself.\n</p><p>I offer my blessings to every lucky sweetheart couple in High Schools everywhere. IT IS TRUE, you WOULD NEVER find anyone better than the significant other that you are with right now.\n</p><p>Stay Safe, and Stay In School.\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 04:39, 30 November 2009 (CET)\n</p>\n<h2><span class=\"mw-headline\" id=\"December_2009\">December 2009</span></h2>\n<h3><span class=\"mw-headline\" id=\"6_December_2009\">6 December 2009</span></h3>\n<p>Just a note, I have just drawn the Two Final Pages for <a href=\"/cwcki/Sonichu_9\" title=\"Sonichu 9\">Book #9</a>, but I am short on time to color them both in before the night is over, but I will have Both Pages uploaded tomorrow. And to offer a foretaste, the Featured Picture for today is a preview of Page 100, mostly uncolored with my signature on it. And for tonight, I will answer the current set of letters in the Mailbag.\n</p><p>Also, I am certain that y'all have noticed the most UNwelcomed and UNapproved ads on, ugh!, <a href=\"/cwcki/Homos\" title=\"Homos\">homosexual</a> stuff. As Everyone knows, I, Christian Weston Chandler, do not take kindly to such wrongful ads on this website. The one who hath done such a horrid crime was the one who hazes my comics and work, known as <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddius</a>. Apparently, he is of European Citizenship, and donated some Euros and from such, took control over the adspace. He knows of my complaints and disapproval of these ads. To voice your complaints and opinions on this wrongdoing, you may e-mail him at <b>jackthethadius@yahoo.com</b>. As I work hard for my work, I also work towards the undoing of this crime on this, the One Official Sonichu and Rosechu Site, the Cwcipedia.\n</p><p>My advice to cope with this, is to hit F5 or Refresh until the adspace, on your screen, displays another ad that is not of that orientation.\n</p><p><br/>\n--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 03:23, 7 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"7_December_2009\">7 December 2009</span></h3>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:147px;\"><a class=\"image\" href=\"/cwcki/File:VaSinglesHomoAd.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"300\" src=\"/w/images/1/1d/VaSinglesHomoAd.jpg\" width=\"145\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:VaSinglesHomoAd.jpg\" title=\"Enlarge\"></a></div>One of the many GOD DAMN F**IN' homo ads that has Chris begging EU citizens for free money.</div></div></div>\n<p><i>The text of this blog was posted underneath the update from 6 December, instead of replacing it.</i>\n</p><p>Continuing from yesterday, I have just uploaded the final two pages of the 9th Book. I will remain on schedule and draw the True First Page of <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">Book #10</a>, which (spoiler) is the start to full extent of the dialogue which was left out, due to page and time constraint, on Page 99 of Book #9. Followed a few pages later after this by skipping forward to my to-dos me and the others have to do in and around Cwcville. Then a few more pages later, it will sync-up with the preview 8 pages.\n</p><p>Again, to reiterate the issue, THE GOD DAMN F***IN' Homo Ads MUST BE GONE! A good start to this process is to contact the current \"AdMaster\", Jack Thaddius, at <b>jackthethadius@yahoo.com</b>. And for the time being, hit F5 or Refresh to avoid seeing those ads.\n</p><p>And the Biggest and Best Step to remove the ads, I must humbly ask my Good, Kind and Loyal European Fans of.\n</p><p>Firstly, like <a href=\"/cwcki/Transformers\" title=\"Transformers\">Optimus Prime</a>, as a noble leader, I would not ask one to do anything that I am fully capable of doing myself. The main webmaster of the Cwcipdedia, the SysOp, resides in the European Area, and requires donations to keep the webhost space reserved for this one website. I am a citizen of the United States of America alone at this time, and legally, due to international banking laws, he can only accept donations from citizens of the European Union at this time. That S.O.B., Jack, apparently is a citizen of BOTH the U.S. and Europe. I, personally, have inquired upon donating from my funds, but unfortunately, as the SysOp told me, it is not possible with the law.\n</p><p>So, my European Fans, I ask you, to <a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=CWCipedia:Donations\" rel=\"nofollow\">Donate</a>, not only to help keep up this, the Original Official Sonichu Site up, but to remove the horrid homo ads Jack has grossly placed. As my personal thanks to each of you who donate in the European Area, ONLY along with the Valid Donation(s) to the SysOp, if you include your legal name and address, that information will be relayed to me via e-mail from the SysOp, and I will personally snail-mail a hand-written thank you letter and an autographed drawing.\n</p><p>Thank You, and God Bless You, True, Loyal and Kind-Hearted People,\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 01:56, 8 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"13_December_2009\">13 December 2009</span></h3>\n<p>I apologize for the lack of pages today, but I had a number of <a class=\"mw-redirect\" href=\"/cwcki/Chores\" title=\"Chores\">chores</a> to do for my family today, so to make up for it, I will be typing up <a href=\"/cwcki/A_Sonichu_and_Rosechu_Christmas_Story\" title=\"A Sonichu and Rosechu Christmas Story\">a <b>New Sonichu and Rosechu Story</b>, their Christmas Special</a> which I promise to draw up alongside the current pages starting on tomorrow, the 14th. So, I will be typing it up right after I answer today's Mailbag, and I will add the link to it under this C-Log, as well as in the Portal.\n</p><p>Thank you for your Loaylty and Patience.\n</p><p><a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=A_Sonichu_and_Rosechu_Christmas\" rel=\"nofollow\">A Sonichu and Rosechu Christmas</a>\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 04:06, 14 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"16_December_2009\">16 December 2009</span></h3>\n<p>Just a couple of things today, I have to go on a road trip to visit my relatives, so no new pages will be uploaded today only, but instead, I will be creating <a href=\"/cwcki/Chris_chan_(CWCipedia)\" title=\"Chris chan (CWCipedia)\">the page that sorts out Fact from Fiction</a> from that God D*** <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> page that has plagued me since November of <a href=\"/cwcki/2007\" title=\"2007\">2007</a>.\n</p><p>Aside from that, I apologize from lack of other things, aside from the two new pages from the update just before I started typing in this C-Log entry, but my <a class=\"mw-redirect\" href=\"/cwcki/Computer\" title=\"Computer\">computer</a> picked up a virus from a pop-up ad while I was updating. It made me had to restart my PC, and it had trouble restarting, so I had to restore it. Thank God it maintained most of the programs and All my files it had.\n</p><p>Thank you again for your Loyalty and Patience.\n</p><p>Have a Safe and Good Day,\n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 09:01, 16 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"17_December_2009\">17 December 2009</span></h3>\n<p>I have enjoyed the trip to visit my Aunt and Uncle with my family; it was nice and pleasant. Unfortunately, I felt drowzy shortly after returning home, so I turned early. I apologize for that. I got up this morning, had coffee with <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">my dad</a>, did some cleaning around the house, then pop needed me to run a few errands with him; important documents, personal verification of such and all. I went straight to the Cwcipedia to type up <a href=\"/cwcki/Chris_chan_(CWCipedia)\" title=\"Chris chan (CWCipedia)\">the Revised ED Page Text</a> of which I went through during my trip yesterday. I do not have enough time to upload a page today, but I will return shortly later to answer more fanmail.\n</p><p>Again, my apologies.\n</p><p>Stay Safe,\n</p>\n<h3><span class=\"mw-headline\" id=\"ModNation_Addendum\">ModNation Addendum</span></h3>\n<p><i>(The following was added an hour and a half after the original post)</i>\n</p><p>Also, This Just In, I have FINALLY been able to redeem my Voucher code for the <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\"><b>ModNation Racers Beta</b></a> that I got with the G.O.T.Y. <a class=\"mw-redirect\" href=\"/cwcki/LittleBiGPlanet\" title=\"LittleBiGPlanet\">LittleBiGPlanet</a> disc, and it is being downloaded now. This weekend, during my off-time aside from the drawing and Cwcipedia time, I will be learning about its ins-and-outs and eventually (hopefully by the end of the weekend) <b>create the <a href=\"/cwcki/CWCville\" title=\"CWCville\">Cwcville City</a> <a href=\"/cwcki/Mario_Kart_64_Lego_Raceway\" title=\"Mario Kart 64 Lego Raceway\">Racetrack</a>.</b>\n</p><p>Also, I will be receiving a second voucher code for the same Beta, and I am feeling generous. The First PS3 Owner with a Trophy Level of 8 or more to send me a message with \"Cwcville City Track\" in the Subject Line before Friday, December 18 at 6:00 AM, Eastern Standard Time, will receive the code after I get it in my e-mail. My <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> ID IS <b>Sonichu</b>, and the code will be sent over the Playstation Network in reply to the message received. Good Luck!\n</p><p>And Good Luck on beating me on the Online Tracks in the City of Cwcville, VA!\n</p><p>Stay Safe, \n</p><p>--<a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=User:ChrisChanSonichu\" rel=\"nofollow\">ChrisChanSonichu</a> 03:26, 18 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"19_December_2009\">19 December 2009</span></h3>\n<p>Now, I'm back in the swing of drawing pages; I have just uploaded the two pages for today.\n</p><p>Also, I have the Voucher Code for the ModNation Racers Beta (for being a <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Qore\" title=\"wikipedia:Qore\">Qore</a> Subscriber), but unfortunately I had not received any messages on the PSN from anyone, so I will revise the details. AGAIN, <b>send me a message with <i>\"Cwcville City Track\"</i> in the Subject Line before Monday, December 21 at 6:00 AM, Eastern Standard Time,</b> but <b>it is now OPEN TO ALL WITH A PLAYSTATION 3 and a PSN Account; NO Trophy Level required.</b> I will send the code to the <b>10th message received</b> on my PSN, and that individual will receive the code in a reply to their message <b>over the Playstation Network</b>. My PSN ID IS <b>Sonichu</b>. Good Luck!\n</p><p>And Good Luck on beating me on the Online Tracks in the City of Cwcville, VA!\n</p><p>Also, check out the <a class=\"mw-redirect\" href=\"/cwcki/Art\" title=\"Art\">Original CCWC Art</a> page for the first 7 of a number of In-Game Photos from ModNation Racers of my Character(s) and My Car(s) and the Track(s), including the Cwcville Track I am working on. I have the map drawn on paper; all I have to do now is to familiarize myself with all the track creation options and details so I can make this track at its currently available best (Beta-Wise).\n</p><p>Stay Safe,\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 08:07, 19 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"21_December_2009\">21 December 2009</span></h3>\n<p>Firstly, I apologize for not uploading any new pages yesterday or today; I have just been hit with TWO FEET of Snow. While I was drawing a page, I had a 2-second blackout; my PC was on before the blackout. Later, when I went to my PC to turn it back on, it screwed up on me, like the recent event with the found virus software of which I had explained in an earlier C-Log. Anyway, it took me longer to get my PC back up, but now I am back up, and I will upload Six Pages tomorrow.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Clyde_billboard_04.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"225\" src=\"/w/images/thumb/b/b9/Clyde_billboard_04.jpg/300px-Clyde_billboard_04.jpg\" srcset=\"/w/images/thumb/b/b9/Clyde_billboard_04.jpg/450px-Clyde_billboard_04.jpg 1.5x, /w/images/thumb/b/b9/Clyde_billboard_04.jpg/600px-Clyde_billboard_04.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Clyde_billboard_04.jpg\" title=\"Enlarge\"></a></div>I am straight! Everybody hangs out in a gay bar sometimes! It's perfectly normal!</div></div></div>\n<p>Onto another issue that has come to my attention, as I have also stated in my new <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> video along with what I have just explained, The Troll, <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>, apparently has <a href=\"/cwcki/20_December_2009\" title=\"20 December 2009\">uploaded one of his Photoshopped images with my image</a> cropped into some strange situation, where he is trying to smear my good name again, onto this website where the image is being displayed on a billboard in New York City. <b>DO NOT BELIEVE THE BILLBOARD IMAGE; I AM STRAIGHT; THAT IS JUST CLYDE CASH TRYING TO FRAME ME AGAIN.</b>\n</p><p>In any case, tonight, I will be answering Two Mailbag Sets, and responding to ALL current messages regarding the billboard thing (D*** that Son Of A B****, Clyde Cash) as well.\n</p><p>Also, The ModNation Cwcville City Track is still under construction; it will be uploaded before Christmas Day.\n</p><p>Thank you for your support and kindness.\n</p><p>Have a Merry and Safe Christmas and Holidays. \n</p><p>--ChrisChanSonichu 05:36, 21 December 2009 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"28_December_2009\">28 December 2009</span></h3>\n<p>Well, at least I accomplished ONE improvement on the Cwcipedia; no offensive Ads. And To <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddius</a>, who is still being an annoying son of a b****, <b>I have got out of my Closet of <a href=\"/cwcki/Autism\" title=\"Autism\">Autism</a> LONG AGO, and I Stayed Straight. YOU Get Out Of YOUR Closet and Go Into F***ing Scientology.</b> I say that in response to the ad he somehow placed next to the Introduction Icon; NO AD BELONGS THERE, and <b>That Ad is of NO association with me, the Cwcipedia website, and all things Sonichu and Rosechu.</b>\n</p>\n<ul><li><ul><li>Update: I have found the tweak and fixed the problem; <b><a href=\"/cwcki/My_Coke_Rewards\" title=\"My Coke Rewards\">Coca Cola</a> is a Product that <a href=\"/cwcki/Obesity\" title=\"Obesity\">I enjoy</a>, and I am Proud to be Associated With their products with the Ad I replaced Jack's Misdeed with.</b> <b>V-I-C-T-O-R-Y! FOR C-W-C!!!</b></li></ul></li></ul>\n<p>Moving on, since apparently there was a Twitter Feed placed on the Mailbox Zero page, which I have removed and moved to the <a href=\"/cwcki/Twitter\" title=\"Twitter\">Twitter</a> page, I have later decided to go into the Twitter Fad and add a small Feed under the C-Log Box. My Username is <b>CWCSonichu</b>; Do Not Give Attention to ALL Other Usernames in the <b>Sonichu</b> Twitter Feed who claim or pretend to be me, and GIVE NO ATTENTION WHATSOEVER to <b>ClydeCash</b> or <b>Jack Thaddius</b>, who both have their own Twitter accounts (Make Both Jack and Clyde BANNED from Twitter, please).\n</p><p>And let me make it clear again, <b>I</b>, Christian Weston Chandler of Ruckersville, VA, USA, <b>Do Not support the Gay Lifestyle</b>; what they do behind closed doors is their own business alone, and I have no care about it, and they have their own rights as the next person with due respect(s). <b>I am Striaght, PERIOD!</b> And with the Facts that Both of them not Only are Annoying DumbAsses to me, but They Both give their own Gay Men a Worse Name than they already have, <b>Clyde Cash and Jack Thaddius BOTH Should commit Suicide, Die and Rot In Hell.</b> As I have already stated loudly in my <a href=\"/cwcki/To_Clyde_and_Jack\" title=\"To Clyde and Jack\">recent Y.T. video</a>.\n</p><p>I have spoken for now. Shorter updates from me as <b>CWCSonichu</b> will come in on the Sonichu <a href=\"/cwcki/Twitter\" title=\"Twitter\">Twitter</a> Feed.\n</p><p>Thank You for your loyalty to my Sonichu and Rosechu stories and franchise and Positive Encouragement to Ignore the Ill-Mislabeling Trolls.\n</p><p>Stay Safe,\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 18:19, 28 December 2009 (CET)\n</p>\n<h2><span class=\"mw-headline\" id=\"January_2010\">January 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"1_January_2010\">1 January 2010</span></h3>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:CWCsTRUEandHONESTads.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"657\" src=\"/w/images/thumb/9/93/CWCsTRUEandHONESTads.jpg/300px-CWCsTRUEandHONESTads.jpg\" srcset=\"/w/images/9/93/CWCsTRUEandHONESTads.jpg 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:CWCsTRUEandHONESTads.jpg\" title=\"Enlarge\"></a></div>The \"ads\" Chris put up in retaliation to <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a>.</div></div></div>\n<p>Captain's Log, Stardate: January 1, 2010\nI have another pair of pages for today, and I will answer another Mailbag or two after uploading. But I also have another announcement; Jack thinks he can get away with occupying my Introduction Box with ANY Ad, well I have a few items I fully support as well. I will be placing my own Ads around the Cwcipedia, as I assert My Rights to do so as Captain of this website vessel.\n</p><p><b>I DO NOT WANT MY ADS REMOVED OR REPLACED BY ANYONE OTHER THAN MYSELF.</b>\n</p><p>Thank you for your full support; have a good and safe day,\n</p><p>--ChrisChanSonichu 02:06, 2 January 2010 (CET)\n</p><p>See below as these are some functions I fully support and will be placing around the site... \n</p>\n<h3><span class=\"mw-headline\" id=\"7_January_2010\">7 January 2010</span></h3>\n<p>Upon reflection, February 24 SHOULD be a <a href=\"/cwcki/Christian_Love_Day#Christian_Love_Day\" title=\"Christian Love Day\">Holiday of sorts</a> (even a Second Day for Love in addition to Valentine's Day), because the day, to me at least, just FEELS like a Holiday, <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_his_Ego\" title=\"Chris and his Ego\">in addition to it being my Birthday</a>. I have looked it up before, and it is some sort of <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Flag_Day_in_Mexico\" title=\"wikipedia:Flag Day in Mexico\">forgettable (Holi)day in Mexico</a> or somewhere. February 24 Should have More Significance and Recognition like a Holiday.\n</p><p>And that is my thought not only for today, but my thought for Years.\n</p><p>Stay Safe,\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 04:09, 8 January 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"12_January_2010\">12 January 2010</span></h3>\n<p>Having finally logged back in, I am copying and pasting my Twitters into this C-Log.\n</p><p>Firstly, I am decreeing that homosexuals will have equal relationship rights within Cwcville, yet gay marriage is still Illegal and Wrong. And <a href=\"/cwcki/Magi-Chan\" title=\"Magi-Chan\">Magi-Chan</a> will stay out of those people's heads under my request.\n</p><p>Second, I am aware of the reasons of the Trio of individuals who are behind the Hideous Asperpedia of WHY they are tormenting me like this. If they will Read the following, or if anyone will relay, I will make amends towards them.\n</p><p>To <a class=\"mw-redirect\" href=\"/cwcki/Alec\" title=\"Alec\">Alec</a>: You have NO RIGHT in drawing MY characters in your comics, because I have specifically spoke AGAINST IT, and you DARE to copy and paste my response and STRIKE AND ADD IN ONLY WHAT YOU WANT TO HEAR! <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">I admit I have done that</a> in some Mailbag letters, and I apologize for that, but I did that sometimes, because I felt offended by some of their content. I would appreciate it if you would just give up your game, remove all the ads on MY Cwcipedia, and just move on. YOU HAVE your own life in Minnesota at your Amtrak; Quit Messing Up My Life, or I WILL come after you.\n</p><p>To <a class=\"mw-redirect\" href=\"/cwcki/Evan_George\" title=\"Evan George\">Evan George</a>: I offered to make <a class=\"mw-redirect\" href=\"/cwcki/Simonchu\" title=\"Simonchu\">Simonchu</a> and <a class=\"mw-redirect\" href=\"/cwcki/Simonla\" title=\"Simonla\">Simonla</a> Brother and Sister, yet you continue on to give me grief and hateThe offer was reasonable, so the two can be Separate, Individual Characters. I would appreciate it if you quit hating me, accept the brother/sister plan, and Let It Go.\n</p><p>To <a href=\"/cwcki/Sean\" title=\"Sean\">Sean</a>: Your comic strips are only an extension to WHAT YOU THINK are characters who are Underappreciated, when they are not, and I have plans for them in future tales. Firstly, <a class=\"mw-redirect\" href=\"/cwcki/Metal_Sonichu\" title=\"Metal Sonichu\">METAL SONICHU</a> is NOT a secondary character; HE will be making his return as a MAJOR VILLIAN after Book 11 Possessed by the soul of Count Graduon.<a class=\"mw-redirect\" href=\"/cwcki/Bill_the_Scientist\" title=\"Bill the Scientist\">Bill</a> is <a class=\"mw-redirect\" href=\"/cwcki/Simonla#Death\" title=\"Simonla\">still working within Giovanni's Laboratory</a>, I am working on a plan on including him in a future episode around Blake. The <a class=\"mw-redirect\" href=\"/cwcki/Boulder_Dropping_Whale\" title=\"Boulder Dropping Whale\">WAILORD</a> who dropped the rock onto the mother Swampert and the <a href=\"/cwcki/Yawning_Squirtle\" title=\"Yawning Squirtle\">Squirtle who Yawned</a> are ONLY Individual characters who I originally had NO plans on putting into future stories, so ASSUME that the two were BOTH caught by Pok'emon Trainers in Pok'e Balls and now the two are fighting with their trainers in Pok'emon Battles.\n</p><p>And to all those who I offended about the talk with <a href=\"/cwcki/Asperger_syndrome\" title=\"Asperger syndrome\">Aspergers</a>, I apologize. I have nothing AGAINST any individual with Aspergers, and I promise to not be mean, but nice, to them and all other individuals. So, Please, to everyone, let's move on peacefully and live our lives well.\n</p><p>Thank You.\n</p><p>--ChrisChanSonichu 05:07, 13 January 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"14_January_2010\">14 January 2010</span></h3>\n<p>Firstly, <b>I, Christian Weston Chandler, Have NO alliance or anything like that Whatsoever with <a href=\"/cwcki/Alec_Benson_Leary\" title=\"Alec Benson Leary\">Alec Benson Leary</a> or his D***ED <a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a>!!!</b>\n</p><p>Second, HE is DOING ME Wrong by Buying Jack Thaddius out on MY Adspace and posting NOT ONLY Wrongful Ads leading to his C***FEST of a website, but OFFENSIVE PORN ADS like Jack had done before. I ask you, <b>If Alec is so great, WHY WOULD HE DRAG THE CWCIPEDIA THROUGH THE MUD LIKE JACK DID?!</b>\n</p><p>Alec Is A TROLL. To ask to REMOVE the ads from the Cwcipedia, send all inquiries to albasperchu@live.com.\n</p><p>And AGAIN, <b>I have NO association with Alec Whatsoever, He is using MY Characters Wrongfully, and Asperchu is NOT MINE, and <a href=\"/cwcki/Asperchu#Chris_on_Asperchu\" title=\"Asperchu\">I COULD NOT CARE ANY LESS ABOUT THAT RETARDED CHARACTER</a>!!!</b>\n</p><p>Aside from that, Stay Safe, and Have a good day.\n</p><p>--ChrisChanSonichu 06:10, 14 January 2010 (CET) \n</p>\n<h3><span class=\"mw-headline\" id=\"19_January_2010\">19 January 2010</span></h3>\n<p>After careful research and reading, I have felt inspired for ten new pages, plus a few more to wrap up this plot. So today, I present my <b>12-Page Explosion</b>; I have uploaded the total of 12 new pages just now. Also, there is one good explosion on one page. Enjoy that and the following.\n</p><p><b>I still have NO association with Alec Benson Leary OR HIS Asperchu character Whatsoever</b>, but I will forgive Alec for his error if he FOLLOWS from my new plot and <a class=\"mw-redirect\" href=\"/cwcki/Mitch_Sonichu\" title=\"Mitch Sonichu\">Extreme Electric Makeover</a> as a template. <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">He is no longer \"Asperchu\", just call him <b>Mitch Sonichu</b></a>.\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 11:44, 19 January 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"25_January_2010\">25 January 2010</span></h3>\n<p>I apologize for not being online for a few days, but I have just uploaded 8 new pages; I will answer another mailbag shortly after making a few more updates; will be creating satisfactory character pages tonight; also, with the recent number of pages, I took a shot at drawing and coloring 5 pages a day; obviously with <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">real life events</a> and <a href=\"/cwcki/Mass_debating\" title=\"Mass debating\">whatnot</a>, it was too much to ask, so I will get back into the swing of things with 2 or 3 pages a day like before; I appreciate the paitience of the true and loyal; thank you all very much you can take a lesson at being a True Sonichu Fan from Rad and his group I mentioned in a <a href=\"/cwcki/22_January_2010\" title=\"22 January 2010\">recent YouTube video</a>; check out his song he wrote and composed for me; Rad and his group will have their own page on the Cwcipedia as <b>Most Honored and Loyal Sonichu Fan Group</b>. \nStay Safe, and have a good day.\n</p><p>(Copied from my most recent Twitters)\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 21:08, 25 January 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"30_January_2010\">30 January 2010</span></h3>\n<p>Well, last night, I have uploaded 6 more pages, and just now I have added a NEW Mailbag of my own with inputs from True Sonichu Fans on a Forum I've just learned about. This is <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">Mailbag 50</a>; I put this together, so YOU ALL can LEARN how to BETTER PHRASE your letters so I can feel Less Enticed into <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">Stressing</a> Out and having to Reply Derogatory as in the recent bunches of Mailbags beforehand. With that, I promise to improve my behavior on that for the better, but you all have to help me out too.\n</p><p>Also, I have uploaded <a href=\"/cwcki/29_January_2010\" title=\"29 January 2010\">a new video of apology</a>; it is a current featured video below.\n</p><p>You all Stay Safe, and have a good day.\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 18:10, 30 January 2010 (CET)\n</p>\n<h2><span class=\"mw-headline\" id=\"February_2010\">February 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"2_February_2010\">2 February 2010</span></h3>\n<ul><li><ul><li>Also, if you are just as offended as I am for the Ads Asperpedia's <a class=\"external text\" href=\"http://www.hsienko.com/asperchu/index.php?title=User:Mao\" rel=\"nofollow\">Mao \"Bamboo\" Ling</a> has been putting up wrongfully on the <a class=\"mw-redirect\" href=\"/cwcki/Cwcipedia\" title=\"Cwcipedia\">Cwcipedia</a>, Feel Free to e-mail ALL your complaints personally to him at <b>mao@hsienko.com</b>. Give him Hell to Pay.</li></ul></li></ul>\n<p>Stay Safe, and have a good day.\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 19:00, 2 February 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"14_February_2010\">14 February 2010</span></h3>\n<p>Happy Valentines Day, Y'all\n</p><p>It has been crazy with the up and down-times with the <a class=\"mw-redirect\" href=\"/cwcki/Cwcipedia\" title=\"Cwcipedia\">Cwcipedia</a> and whatnot. But no more. Currently, I am still drawing and coloring (mostly drawing though) the pages, and I think y'all will be satisfied with the finished <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">10th Book</a>. I will upload ALL remaining pages of that book, plus some for <a href=\"/cwcki/Sonichu_11\" title=\"Sonichu 11\">Book 11</a> on the 24th (Look Forward to that). Also, to note, I will also be continuing the <a class=\"mw-redirect\" href=\"/cwcki/A_Sonichu_and_Rosechu_Christmas\" title=\"A Sonichu and Rosechu Christmas\">Christmas Special</a> in the second or third part of the 12th book.\n</p><p>In the meantime, I will continue to daily update the Cwcipedia with answering the Mailbags and adding a new Character Bio Page to the site per day. Most of which will be short but sweet.\n</p><p>Also, thanks to Mr. <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddius</a>, I now have a lighter view on <a href=\"/cwcki/Homos\" title=\"Homos\">homosexual people</a>, and with that, I respectfully retract my past reply to one Mailbag letter, and I say, <a href=\"/cwcki/Mailbag_49#Chris_loves_his_country\" title=\"Mailbag 49\">\"<b>Power to the Gays in the Army</b>\"</a>.\n</p><p>And currently, my <a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">girl friend</a> and I are getting along great; the relationship is progressing. I only ask for y'all to leave me with my relationship, and <a href=\"/cwcki/Mailbag_31#In_which_Chris_crosses_yet_another_line\" title=\"Mailbag 31\">not make me feel intruded</a> by inquiring constantly.\n</p><p><b>Keep All Mailbag Questions LIMITED ONLY to topics of the Cwcipedia, <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a> and <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a>, my Comics, Cwcville, and Myself.</b> Any questions not on those topics, although read, will all receive a <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">neutral response</a> or none at all.\n</p><p>Thank you all for your loyalty and patience, and have a good and safe day.\n</p><p>--ChrisChanSonichu 01:44, 15 February 2010 (CET)\n</p>\n<h2><span class=\"mw-headline\" id=\"March_2010\">March 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"10_March_2010\">10 March 2010</span></h3>\n<p>LOOK, Just because I don't update as often as I should, or draw/color as much, does not give any one of you the right to torture the hell out of me. I was Happy. I was At Peace. But NO, <a href=\"/cwcki/Surfshack_Tito_(troll)\" title=\"Surfshack Tito (troll)\">SOMEONE</a> among the Trolls among those of You All would Just Not Let Me Be.\n</p><p>I have been in a number of moments of finding peace and losing it later, because YOU damn trolls won't leave me be. And even the Impatient Fans; Honest, True and Loyal as you all may be, you all are part to blame in this as well. Y'all are mostly immature people who have no lives of your own. Y'all don't want me to have a Life Of My Own; Y'all don't want me to find Long-Term Peace and Happiness for myself. Y'all don't want me to Find and Keep Sweet True Love for myself. You all are just as Terrible as I portrayed <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a> to be; True Love is NOT Illegal in the <a href=\"/cwcki/United_States_of_America\" title=\"United States of America\">United States of America</a>, INCLUDING <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a>. Because you all are so self-absorbed in yourselves, spoiled, and such, YOU ONLY want more story arcs and art MORE QUICKLY than my own Inspiration can come up with. You all are nothing bug greedy, impatient, unloved and corrupted people.\n</p><p>And your misdeeds only lead to Heartbreaks and Heartaches upon Me... They Really Hurt.\n</p><p>I have let you who have dared to do what you wanted to bully and torture me emotionally, but when YOU BULLY THE PEOPLE I CARE ABOUT WITH DAMNED PAGES THAT MAKE THEM LOOK AS STUPID AS ME, LEADING TO PREMATURE DEATHS, <a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">BREAK-UPS FROM BEING EVEN SIMPLY FRIENDS WITH ME</a>, AND JUST PLAIN EMOTIONAL DAMAGE AND EMBARRASSMENTS, <b>YOU HAVE GONE TOO FAR!!!</b>\n</p><p>Leave My Friends and Family Out Of the Online Hazings and Hatred; I, Christian Weston Chandler, Am Your Main Target. BE A HUMAN AND <a href=\"/cwcki/HarassCWCdirectly\" title=\"HarassCWCdirectly\">COME AT ME DIRECTLY</a>!!!\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 01:45, 11 March 2010 (CET)\n</p><p><br/>\nI have been in a number of moments of finding peace and losing it later, because YOU damn trolls won't leave me be. And even the Impatient Fans; Honest, True and Loyal as you all may be, you all are part to blame in this as well. Y'all are mostly immature people who have no lives of your own. Y'all don't want me to have a Life Of My Own; Y'all don't want me to find Long-Term Peace and Happiness for myself. Y'all don't want me to Find and Keep Sweet True Love for myself. You all are just as Terrible as I portrayed Mary Lee Walsh to be; True Love is NOT Illegal in the United States of America, INCLUDING Virginia. Because you all are so self-absorbed in yourselves, spoiled, and such, YOU ONLY want more story arcs and art MORE QUICKLY than my own Inspiration can come up with. You all are nothing bug greedy, impatient, unloved and corrupted people.\n</p><p>And your misdeeds only lead to Heartbreaks and Heartaches upon Me... They Really Hurt.\n</p><p>\t„\n</p><p><br/>\n--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 02:03, 11 March 2010 (CET)\n</p><p>“ \t \nAnd another thing, I have Never been Really Sure on the whole making <a class=\"mw-redirect\" href=\"/cwcki/Money\" title=\"Money\">money</a> thing, or of any other aspirations. I originally started the whole Sonichu thing for fun. NOW it is being pressured onto me like as if it was a Job. I am sick and tired of it feeling like a Job; I want it to go back to being Fun For Me, and for that, I need to do things at my own pace on my own time. I have the right to create other projects or resume past ones on A.D.D.-Like Impulses.\n</p><p>The stories WILL Continue; <a href=\"/cwcki/Book10Replacement\" title=\"Book10Replacement\">I WILL change the final few pages of Book 10 to be more appropriate for most people</a>; I WILL Update this website time and time again.\n</p><p>I understand that I have lost a lot of \"fans\" due to \"lack of new content\", but THOSE PEOPLE are among the People I am most annoyed with in my one-paragraph rant above. I am tired of trying to please MILLIONS; what matters to me is caring and pleasing the local few around me who I truly and deeply care about.\n</p><p>With that, I respectfully ask the webmaster of the Unapproved and Detested <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> to remove ALL PAGES Classified under their \"Christian Weston Chandler's Web Of Life\" and \"<a class=\"mw-redirect\" href=\"/cwcki/Sweethearts\" title=\"Sweethearts\">Sweethearts</a>, heartsweets and <a class=\"mw-redirect\" href=\"/cwcki/Gal-pals\" title=\"Gal-pals\">gal-pals</a>\" Categories. <b>I give him until Midnight of Friday March 12, 2010, Eastern Standard Time, for the <a href=\"/cwcki/Cogsdev\" title=\"Cogsdev\">Webmaster</a> of that CWCki to Remove ALL OF THOSE PAGES, or there will be trouble upon that Person directly from Me.</b>\n</p><p><i>Note: Chris would later amend the bolded portion of the above entry. See the 14 March entry for details.</i>\n</p>\n<h3><span class=\"mw-headline\" id=\"14_March_2010\">14 March 2010</span></h3>\n<p>I have made observation <a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">that One page</a> that was of a current woman friend of mine has been deleted and changed appropriately to a page of a different title and respective keeping-anonymous description.\n</p><p>This is good for a Start, and that main portion has been met.\n</p><p>BUT, there is MORE to be done. I WANT the webmaster of the CWCki to do the same for the other following people I care about:\n</p><p><b>-<a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a></b>\n</p><p><b>-<a href=\"/cwcki/Sarah_Nicole_Hammer\" title=\"Sarah Nicole Hammer\">Sarah Nicole Hammer</a></b>\n</p><p><b>-<a href=\"/cwcki/Anna_McLerran\" title=\"Anna McLerran\">Anna McLerran</a></b>\n</p><p><b>-<a href=\"/cwcki/Joshua_Martinez\" title=\"Joshua Martinez\">Joshua Martinez</a></b>\n</p><p><b>-<a class=\"mw-redirect\" href=\"/cwcki/Laura_Dorazio\" title=\"Laura Dorazio\">Laura Dorazio</a></b>\n</p><p><b>-<a href=\"/cwcki/Kellie_Andes\" title=\"Kellie Andes\">Kellie Andes</a></b>\n</p><p><b>-<a href=\"/cwcki/Tiffany_Gowen\" title=\"Tiffany Gowen\">Tiffany Gowen</a></b>\n</p><p><b>-<a href=\"/cwcki/Joseph_Herring\" title=\"Joseph Herring\">Joseph Herring</a></b>\n</p><p><b>-<a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">Sarah Cassandra McKenzie (PandaHalo)</a></b>\n</p><p><b>-<a href=\"/cwcki/Ivy\" title=\"Ivy\">Ivy O'Neil</a></b>\n</p><p><b>-<a href=\"/cwcki/Kacey\" title=\"Kacey\">Kacey Devoria</a></b>\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:YouDieTodayBitch.PNG\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"107\" src=\"/w/images/thumb/2/21/YouDieTodayBitch.PNG/300px-YouDieTodayBitch.PNG\" srcset=\"/w/images/thumb/2/21/YouDieTodayBitch.PNG/450px-YouDieTodayBitch.PNG 1.5x, /w/images/2/21/YouDieTodayBitch.PNG 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:YouDieTodayBitch.PNG\" title=\"Enlarge\"></a></div>Chris considers Vivian to be a true Gal-Pal.</div></div></div>\n<p><b>-<a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> is a <a class=\"mw-redirect\" href=\"/cwcki/Gal-Pal\" title=\"Gal-Pal\">Gal-Pal</a>; Please Relocate the link(s) to her page as such.</b>\n</p><p><b>-<a href=\"/cwcki/Sarah_Jackson\" title=\"Sarah Jackson\">Sarah Jackson</a></b>\n</p><p><b>-<a class=\"mw-redirect\" href=\"/cwcki/Two%27s_company_snapshots\" title=\"Two's company snapshots\">Faeryn (A.K.A. the \"Hambeast\")</a></b>\n</p><p><b>-**<a href=\"/cwcki/Chandler_Family_Tree\" title=\"Chandler Family Tree\">ALL OF MY RELATIVES AND FAMILY</a>**</b>\n</p><p><b>-<a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a></b>\n</p><p><br/>\nI would like this done before 11:59 PM of March 31, 2010, Eastern Standard Time, or there WILL be trouble personally from me.\n</p>\n<ul><li>To Anna McLerran, I would personally like to extend my humble apologies for offending her, along with a lot of homosexual people, in any form with my past but now dead angst against the gays.</li></ul>\n<p>The Homosexuals are okay people too.\n</p><p>To everyone, I wish you all a safe and good day.\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 08:04, 14 March 2010 (CET)\n</p><p><i>Note: While posting this update, Chris also altered the ending of the 10 March 2010 entry. He replaced the bolded portion at the end of that entry with the following:</i>\n</p><p>As I have updated in the C-Log, a page that has caused chaos the past few days has been deleted and changed to something more anonymous, and that is good, for a start. I have listed the other pages of people I care about on the CWCki I would like to see similar, if not same, treatment. The deadline is March 31, 2010, 11:59 PM, Easter Standard Time. Do it, or <a href=\"/cwcki/Death_threats\" title=\"Death threats\">there WILL be trouble</a>. <a href=\"/cwcki/Pocket_knife\" title=\"Pocket knife\">I am Armed after all</a>.\n</p><p>--<a href=\"/cwcki/User:ChrisChanSonichu\" title=\"User:ChrisChanSonichu\">ChrisChanSonichu</a> 08:09, 14 March 2010 (CET)\n</p>\n<h3><span class=\"mw-headline\" id=\"19_March_2010\">19 March 2010</span></h3>\n<p><i>The following entry was posted by one of the <a class=\"mw-redirect\" href=\"/cwcki/Asperpedia\" title=\"Asperpedia\">Asperpedia</a> Four after the Sysop gave control to the CWCipedia to <a class=\"mw-redirect\" href=\"/cwcki/Mao\" title=\"Mao\">Mao</a>. It was never posted by Chris.</i>\n</p><p>I, Christian Weston \"Ricardo\" Chandler am currently looking for a <a href=\"/cwcki/Homos\" title=\"Homos\">Sweet Joy Boy</a> to make into my heartsweet. If you are male, Gay and interested to be the One Person to Steal my virgintfy, please contact me. I NEED YOU!\n</p><p>--ChrisChanSonichu 18:37, 19 March 2010 (CET), <a href=\"/cwcki/Chris_and_sex\" title=\"Chris and sex\">VERY HORNY</a>\n</p><p><i>The CWC Blog page was also replaced with the following log:</i>\n</p><p>I, Christopher \"Christian\" Weston \"Ricardo\" \"<a href=\"/cwcki/Ian_Brandon_Anderson\" title=\"Ian Brandon Anderson\">Ian Brandon Anderson</a>\" Chandler, am Gay. Don't doubt me.\n</p><p>Have a good, safe day. Peace, --ChrisChanSonichu 21:27, 24 August 2009 (CEST)\n</p>\n<h2><span class=\"mw-headline\" id=\"April_2010\">April 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"9_April_2010\">9 April 2010</span></h3>\n<p>Spacing myself from the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">internet</a> and all online nuisances, I am finding a better sense of peace. I am still drawing my pages, story arcs and all that. Such updates will appear on the Cwcipedia soon. You all have a good and safe day.\n</p><p>--ChrisChanSonichu 02:58, 10 April 2010 (CEST)\n</p>\n<h3><span class=\"mw-headline\" id=\"24_April_2010\">24 April 2010</span></h3>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:SchuComic11P32Troll.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"383\" src=\"/w/images/thumb/2/26/SchuComic11P32Troll.jpg/300px-SchuComic11P32Troll.jpg\" srcset=\"/w/images/thumb/2/26/SchuComic11P32Troll.jpg/450px-SchuComic11P32Troll.jpg 1.5x, /w/images/thumb/2/26/SchuComic11P32Troll.jpg/600px-SchuComic11P32Troll.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:SchuComic11P32Troll.jpg\" title=\"Enlarge\"></a></div><a href=\"/cwcki/Sonichu_11\" title=\"Sonichu 11\">Sonichu 11</a>'s best page.</div></div></div>\n<p>I deeply apologize for the few updates. My <a class=\"mw-redirect\" href=\"/cwcki/Computers\" title=\"Computers\">PC</a> has been on having some virus issues and I currently can not log into my account; however, I have completed <a class=\"mw-redirect\" href=\"/cwcki/Issue_11\" title=\"Issue 11\">Issue 11</a> and I hope y'all are looking forward to the Reboot on Issue 12 that will come very shortly. Thank y'all for your patience.\n</p><p>--ChrisChanSonichu 02:58, 24 April 2010 (CEST)\n</p><p><i>Note: This update was actually added by Chris's sysop's account. The uploaded pages of <a href=\"/cwcki/Sonichu_11\" title=\"Sonichu 11\">Sonichu #11</a> that she put up were all troll-created pages telling the story of the deaths of <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a>'s and <a class=\"mw-redirect\" href=\"/cwcki/Wild\" title=\"Wild\">Wild</a>'s children, Sonichu's divorce and Wild's violent suicide. It is unquestionably the best <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu</a> story ever.</i>\n</p>\n<h3><span class=\"mw-headline\" id=\"26_April_2010\">26 April 2010</span></h3>\n<p>The recent \"update\" and \"new pages\" were NOT of my own personal drawing or approval. It is obvious who has done this, but <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">she</a> has to understand that ONLY I have the Full Understanding of ALL Personality Aspects OR Plot Lines that are and will be put into the future pages of the comic. What she has done unto me recently which I have personally undone, <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_his_Ego\" title=\"Chris and his Ego\">was a traitorous mutiny</a>, and while I DO NOT appreciate it one bit, I will forgive her this time. I only ask for NO SUCH CHANGES to be made in the future AT ALL TIMES WITHOUT MY APPROVAL.\n</p><p>Spacing myself from the internet and all online nuisances, I am finding a better sense of peace. I am still drawing my pages, story arcs and all that. OFFICIAL updates From My Own Hands will appear on the Cwcipedia soon. You all have a good and safe day.\n</p><p>--ChrisChanSonichu 09:02, 26 April 2010 (CEST)\n</p><p><i>Note: Chris replaced the second paragraph about 45 minutes later with the following:</i>\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Schu11Placeholder.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"410\" src=\"/w/images/thumb/2/29/Schu11Placeholder.jpg/300px-Schu11Placeholder.jpg\" srcset=\"/w/images/2/29/Schu11Placeholder.jpg 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Schu11Placeholder.jpg\" title=\"Enlarge\"></a></div>Sadly, Chris hid the awesome pages with these.</div></div></div>\n<ul><li><ul><li>Actually, I have just been informed that the SysOp ONLY uploaded the images; someone else drew them. And in any case, NONE OF THOSE PAGES, which have been tastefully replaced with a temporary image (until when I draw the REAL pages to go in their place).</li></ul></li></ul>\n<p>And to MAKE IT PERFECTLY CLEAR IN THE SCENARIOS OF MY COMICS...\n<br/>-NONE OF THE CHILDREN, Robbie, Cera, Christine or Sandy, are dead; They are ALL Still Alive and will go on to live safely and healthily.\n<br/>-The Drawing Style... REALLY? REALLY? WHO THE F*** CAN NOT SEE THAT DRAWING/COLORING STYLE WAS <a href=\"/cwcki/Chris_and_art\" title=\"Chris and art\">NOT MY OWN IN COMPARISON TO MY PAST HAND-DRAWINGS</a>?\n<br/>-Aside from the <a href=\"/cwcki/ShecameforCWC.JPG\" title=\"ShecameforCWC.JPG\">LEAKED Adult Drawings I did in my past</a> that my Trolls continue to mock me with (and are being IGNORED), I WOULD NEVER ALLOW ANY PRIVATE PARTS TO BE PORTRAYED ANYWHERE ON THE CWCIPEDIA AT ALL TIMES.\n</p><p><br/>\n</p>\n<ul><li><ul><li>SEE, between the INTERNET STRESS I have got between the Trolls and Past Relations AFTER I found that D***ed <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> Page, it really tears me up. Spacing myself from the internet and all online nuisances, I am looking find a better sense of peace and tranquility, AND a GIRLFRIEND to make into my SWEETHEART, Avoiding The \"<a class=\"mw-redirect\" href=\"/cwcki/Friend_Zone\" title=\"Friend Zone\">Friend Zone</a>\", And <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">YES, Even to F***</a>!!!.</li></ul></li></ul>\n<p>I am still drawing my pages, story arcs, Editing most PAST Pages that make only a mockery of me and my Real Friends and Presenting My Side of the True Stories and all. OFFICIAL updates From My Own Hands will appear on the Cwcipedia soon. You all have a good and safe day.\n</p>\n<h2><span class=\"mw-headline\" id=\"May_2010\">May 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"14_May_2010\">14 May 2010</span></h3>\n<p>Hello, my name is Daria Camacho. I am helping Chris out by maintaining the CWCipedia while he is on hiatus. I have noticed that he is very sad and depressed and that he is much too <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stressed</a> to help maintain the CWCipedia. This is why I was sought out to help with the day to day on the CWCipedia. Rest easy, Sonichu Fans as I will make sure when Chris returns, the CWCipedia will be at tip-top shape!\n</p><p><i>Note: As stated, this was added by DariaCamacho, the CWCipedia's new \"Fan Manager\", who had apparently been given access to the site in order to keep it running smoothly until Chris returns. Given that Chris reverted many of her edits, it's likely he was not told of her coming in advance.</i>\n</p>\n<h3><span class=\"mw-headline\" id=\"26_May_2010\">26 May 2010</span></h3>\n<p><i>Note: Chris is talking about <a class=\"external text\" href=\"http://www.gamefaqs.com/boards/960619-modnation-racers/54555151\" rel=\"nofollow\">this GameFAQs thread of his</a> about the \"Mystery Mods\" for <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\">ModNation Racers</a>, freebie codes that unlock random characters in the games.</i>\n</p><p>I have Kratos/Gopher and Nathan Drake/Lil Tinker.\n</p><p>Also, I stand corrected on the past Topic where I tried to predict on the Mystery Mods matching the respective others I posted onto GameFAQs over a month ago.\n</p><p>It sucks that my Self-Mod, Sonichu Kart and Cwcville Tracks were Lost from the ModNation Server sometime after the end of the Beta. I have recreated the Mod and Kart from the Beta photos I took months ago. And I will recreate the Cwcville Track in due time after I've unlocked all of the remaining pieces, so I can make it better and more accurate than it was before.\n</p><p>Anyway, I still need the Ratchet/Clank and Nukular Karts/Mods with Cowboy and Mouse Trap Karts/Mods from Amazon and Game Crazy, respectively.\n</p><p>Send me the codes over the PSN in a message to my PSN, \"Sonichu\". Within Five Days of sending the codes on your half, I will attempt to redeem them. Within the time after successful redemption, I will reward an Activated code for $10 on the <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> fresh from the card for each code. And Please specify which Main Character the code you're sending is for.\n</p><p>Ratchet and Clank Nukular\n</p><p>This offer will be in effect until June 16, 2010, so Please Hurry, and Thank you.\n</p><p>Sincerely, Christian Weston Chandler PSN ID: Sonichu\n</p>\n<h2><span class=\"mw-headline\" id=\"June_2010\">June 2010</span></h2>\n<h3><span class=\"mw-headline\" id=\"4_June_2010\">4 June 2010</span></h3>\n<p><i>Note: This was a trolling attempt.</i>\n</p><p>I am currently in the process of taking back MY CWCipedia from the trolls. Do not believe anything they say. I am currently being stressed out from you obsessive Autistic Fans and you D*** Trolls messing up my life. I will continue when inspiration comes back.\n<br/>Feel free to send me things at: 412 Pollock St, Richmond, VA, United States. (Please do not send things to my old address, I have moved.)\nThe more things I receive, the Stronger I Feel my inspiration will return.<br/>Love and Peace, Christian W. Chandler\n<br/>Also, thank you Iori for sending me the DSi. Another thank you to Claire from Oregon for gifting me a PSPgo. I hope you two lovely ladies are free. &lt;3 &lt;3 &lt;3\n</p>\n<h2><span class=\"mw-headline\" id=\"See_also\">See also</span></h2>\n<ul><li><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a></li>\n<li><a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a></li>\n<li><a href=\"/cwcki/ChrisChanSonichu_and_WikiSysop_correspondence\" title=\"ChrisChanSonichu and WikiSysop correspondence\">ChrisChanSonichu and WikiSysop correspondence</a></li>\n<li>Chris's <a href=\"/cwcki/CWC_Blog_(Cwclight)\" title=\"CWC Blog (Cwclight)\">CWC Blog</a> for <a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a></li></ul>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible autocollapse\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:The_Internet\" title=\"Template:The Internet\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:The_Internet\" title=\"Template talk:The Internet\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:The_Internet&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Chris_and_the_Internet\" title=\"Chris and the Internet\">The Internet</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chris's websites\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/CWC%27s_Pok%C3%A9site_1\" title=\"CWC's Pokésite 1\">CWC's Pokésite 1</a> • <a href=\"/cwcki/CWC%27s_Pok%C3%A9site_2\" title=\"CWC's Pokésite 2\">CWC's Pokésite 2</a> • <a href=\"/cwcki/CWC%27s_Sonichu_Site!\" title=\"CWC's Sonichu Site!\">CWC's Sonichu Site!</a> • <a href=\"/cwcki/CWC%27s_Cool_Profile\" title=\"CWC's Cool Profile\">CWC's Cool Profile</a> • <a href=\"/cwcki/The_OFFICIAL_Sonichu_%26_Rosechu_Blog\" title=\"The OFFICIAL Sonichu &amp; Rosechu Blog\">The OFFICIAL Sonichu &amp; Rosechu Blog</a> • <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> • <a class=\"mw-redirect\" href=\"/cwcki/Cwcvilleshopping.com\" title=\"Cwcvilleshopping.com\">Cwcvilleshopping.com</a> • <a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Social networking\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris%27s_resume\" title=\"Chris's resume\">Chris's resume</a> • <a href=\"/cwcki/Adult_Swim_posts\" title=\"Adult Swim posts\">Adult Swim posts</a> • <a href=\"/cwcki/Bluesky\" title=\"Bluesky\">Bluesky</a> • <a href=\"/cwcki/The_Hook_Cafe\" title=\"The Hook Cafe\"><i>The HooK</i> Café</a> •  <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> • <a href=\"/cwcki/Instagram\" title=\"Instagram\">Instagram</a> • <a href=\"/cwcki/Meetup\" title=\"Meetup\">Meetup</a> • <a href=\"/cwcki/Miiverse\" title=\"Miiverse\">Miiverse</a> • <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a> • <a href=\"/cwcki/Newgrounds\" title=\"Newgrounds\">Newgrounds</a> • <a href=\"/cwcki/PlayStation_blog\" title=\"PlayStation blog\">PlayStation blog</a> • <a href=\"/cwcki/PSN_blogs\" title=\"PSN blogs\">PSN blogs</a> • <a href=\"/cwcki/Reddit\" title=\"Reddit\">Reddit</a> • <a href=\"/cwcki/Twitter\" title=\"Twitter\">Twitter</a> (<a href=\"/cwcki/Night_Star\" title=\"Night Star\">Night Star</a> - <a href=\"/cwcki/NightStar2891_tweets\" title=\"NightStar2891 tweets\">tweets</a> • <a href=\"/cwcki/CWCSonichu-NightStar2891_DMs\" title=\"CWCSonichu-NightStar2891 DMs\">DMs with CWCSonichu</a> • <a href=\"/cwcki/Marvin_DMs#NightStar2891\" title=\"Marvin DMs\">DMs with Marvin</a>) • (<a href=\"/cwcki/TwiSparLicious\" title=\"TwiSparLicious\">TwiSparLicious</a>) (<a class=\"mw-redirect\" href=\"/cwcki/MagiChan111448\" title=\"MagiChan111448\">MagiChan111448</a>) (<a href=\"/cwcki/Creamarina\" title=\"Creamarina\">Creamarina</a>) • <a href=\"/cwcki/Tumblr\" title=\"Tumblr\">Tumblr</a> • <a href=\"/cwcki/Twitch\" title=\"Twitch\">Twitch</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Dating_profiles\" title=\"Dating profiles\">Dating profiles</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Match.com\" title=\"Match.com\">Match.com</a> • <a href=\"/cwcki/OkCupid\" title=\"OkCupid\">OkCupid</a> (<a href=\"/cwcki/List_of_OkCupid_Answers\" title=\"List of OkCupid Answers\">Answers</a>) • <a href=\"/cwcki/BronyMate\" title=\"BronyMate\">BronyMate</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism#Wikis\" title=\"Chris and journalism\">Wikis</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> (<a href=\"/cwcki/List_of_Chris%27s_edits_to_Encyclopedia_Dramatica\" title=\"List of Chris's edits to Encyclopedia Dramatica\">edits</a>) • <a href=\"/cwcki/Wikipedia\" title=\"Wikipedia\">Wikipedia</a> (<a href=\"/cwcki/Chris%27s_Wikipedia_profile\" title=\"Chris's Wikipedia profile\">profile</a> • <a href=\"/cwcki/User:Apostrophe/Chris-Chan_talk\" title=\"User:Apostrophe/Chris-Chan talk\">talk page</a>) • <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> (<a href=\"/cwcki/ChrisChanSonichu_and_WikiSysop_correspondence\" title=\"ChrisChanSonichu and WikiSysop correspondence\">WikiSysop correspondence</a>) • <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> (<a href=\"/cwcki/List_of_Chris%27s_edits_to_the_CWCki\" title=\"List of Chris's edits to the CWCki\">edits</a> • <a href=\"/cwcki/User:GodofThunderGodofWar\" title=\"User:GodofThunderGodofWar\">GodofThunderGodofWar</a> • <a href=\"/cwcki/User:JenkinsJinkies\" title=\"User:JenkinsJinkies\">JenkinsJinkies</a> • <a href=\"/cwcki/User:Christianchandler\" title=\"User:Christianchandler\">Christianchandler</a>)</div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Forums\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Something_Awful\" title=\"Something Awful\">Something Awful</a> • <a href=\"/cwcki/Sonichu_Forum\" title=\"Sonichu Forum\">Sonichu Forum</a> • <a href=\"/cwcki/Sonichu_Girls\" title=\"Sonichu Girls\">Sonichu Girls</a> • <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">Trollin Train</a> • <a href=\"/cwcki/GameFAQs\" title=\"GameFAQs\">GameFAQs</a> • <a href=\"/cwcki/Tomboys_And_Tomgirls_of_Virginia\" title=\"Tomboys And Tomgirls of Virginia\">Tomboys And Tomgirls of Virginia</a> • <a href=\"/cwcki/CWCki_Forums\" title=\"CWCki Forums\">CWCki Forums</a> • <a href=\"/cwcki/Kiwi_Farms\" title=\"Kiwi Farms\">Kiwi Farms</a> • <a class=\"mw-redirect\" href=\"/cwcki/R/ChrisChanSonichu\" title=\"R/ChrisChanSonichu\">r/ChrisChanSonichu</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Documented IRL encounters\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n\"<a href=\"/cwcki/The_Tale_Of_The_Crazy_Pacer\" title=\"The Tale Of The Crazy Pacer\">The Tale Of The Crazy Pacer</a>\" • <a href=\"/cwcki/Mimms_and_Lucas_Q%26A\" title=\"Mimms and Lucas Q&amp;A\">Mimms and Lucas Q&amp;A</a> • <a href=\"/cwcki/Chris%27s_Big_Night_Out\" title=\"Chris's Big Night Out\">Chris's Big Night Out</a> (<a href=\"/cwcki/Chris%27s_Big_Night_Out_II\" title=\"Chris's Big Night Out II\">II</a>) • <a href=\"/cwcki/Fridays_After_Five\" title=\"Fridays After Five\">Fridays After Five</a> • <a href=\"/cwcki/This_is_how_the_Trial_went\" title=\"This is how the Trial went\">This is how the Trial went</a> • <a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a> • <a href=\"/cwcki/Impulse_Gay_Social_Club\" title=\"Impulse Gay Social Club\">Impulse Gay Social Club</a> • <a href=\"/cwcki/Clare_Porter\" title=\"Clare Porter\">Clare Porter</a> • <a href=\"/cwcki/Chris_Chan_Boasting_About_Celebrity_Status\" title=\"Chris Chan Boasting About Celebrity Status\">Chris Chan Boasting About Celebrity Status</a> • <a href=\"/cwcki/A_Wild_Chris-Chan_Attempts_Human_Interaction\" title=\"A Wild Chris-Chan Attempts Human Interaction\">A Wild Chris-Chan Attempts Human Interaction</a> • <a href=\"/cwcki/Debt_hearing_(eyewitness_account)\" title=\"Debt hearing (eyewitness account)\">Debt hearing (eyewitness account)</a> • <a href=\"/cwcki/Incest_Arrest\" title=\"Incest Arrest\">Incest Arrest</a> • Sightings (<a href=\"/cwcki/Pre-jail_sightings\" title=\"Pre-jail sightings\">Pre-2023</a> • <a href=\"/cwcki/Post-jail_sightings_(2023)\" title=\"Post-jail sightings (2023)\">2023‎‎</a> • <a href=\"/cwcki/Sightings_(2024)\" title=\"Sightings (2024)\">2024</a> • <a href=\"/cwcki/Sightings_(2025)\" title=\"Sightings (2025)\">2025</a>)</div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Chris_and_business\" title=\"Chris and business\">Money-making schemes</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/EBay\" title=\"EBay\">eBay</a> • <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a> • <a href=\"/cwcki/Craigslist\" title=\"Craigslist\">Craigslist</a> • <a href=\"/cwcki/Kickstarter\" title=\"Kickstarter\">Kickstarter</a> • <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> • <a href=\"/cwcki/Patreon\" title=\"Patreon\">Patreon</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Google\" title=\"Google\">Google</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> (<a href=\"/cwcki/DEATH_BATTLE!\" title=\"DEATH BATTLE!\">DEATH BATTLE!‎</a> • <a href=\"/cwcki/Planet_Dolan\" title=\"Planet Dolan\">Planet Dolan</a> • <a href=\"/cwcki/Subliminal_Frequency_Hypnosis\" title=\"Subliminal Frequency Hypnosis\">Subliminal Frequency Hypnosis</a> • <a href=\"/cwcki/WatchMojo\" title=\"WatchMojo\">WatchMojo</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Christian%27s_comments_on_YouTube\" title=\"List of Christian's comments on YouTube\">YouTube comments</a>)</div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_oration#Twitter_campaigns\" title=\"Chris and oration\">Twitter campaigns</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/HarassCWCdirectly\" title=\"HarassCWCdirectly\">HarassCWCdirectly</a> • <a href=\"/cwcki/BlockTheTrolls\" title=\"BlockTheTrolls\">BlockTheTrolls</a> • <a href=\"/cwcki/My_Little_Pony_Protests\" title=\"My Little Pony Protests\">My Little Pony Protests</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/2012_Poster_campaign\" title=\"2012 Poster campaign\">2012 Poster campaign</a> • <a href=\"/cwcki/2013_Facebook_leak\" title=\"2013 Facebook leak\">2013 Facebook leak</a> • <a href=\"/cwcki/2018_Twitter_account_compromise\" title=\"2018 Twitter account compromise\">2018 Twitter account compromise</a> • <a href=\"/cwcki/Alex%27s_Lemonade_Stand\" title=\"Alex's Lemonade Stand\">Alex's Lemonade Stand</a> • <a href=\"/cwcki/Amazon\" title=\"Amazon\">Amazon</a> • <a href=\"/cwcki/Mia_Hamm\" title=\"Mia Hamm\">Backpage</a> • <a href=\"/cwcki/3D_printing\" title=\"3D printing\">Cults3D</a> • <a href=\"/cwcki/DeviantART\" title=\"DeviantART\">deviantART</a> • <a href=\"/cwcki/Dox\" title=\"Dox\">Dox</a> • <a href=\"/cwcki/Duolingo\" title=\"Duolingo\">Duolingo</a> • <a href=\"/cwcki/Equestria_Daily\" title=\"Equestria Daily\">Equestria Daily</a>  • <a href=\"/cwcki/Flipnote_Hatena\" title=\"Flipnote Hatena\">Flipnote Hatena</a> • <a href=\"/cwcki/Other_documents\" title=\"Other documents\">Other documents</a>  • <a href=\"/cwcki/Quizzes\" title=\"Quizzes\">Quizzes</a> • <a href=\"/cwcki/ReBrick\" title=\"ReBrick\">ReBrick‎</a> • <a href=\"/cwcki/3D_printing\" title=\"3D printing\">Thingiverse</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"External_links\">External links</span></h2>\n<ul><li><a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=Main_Page\" rel=\"nofollow\">Dead Link of The main page of the archived CWCipedia, where the latest blog post is featured</a> (<a class=\"external text\" href=\"https://web.archive.org/web/20130223082005/http://archive.sonichu.com/cwcipedia/index.php?title=Main_Page\" rel=\"nofollow\">archive</a>)</li>\n<li><a class=\"external text\" href=\"http://archive.sonichu.com/cwcipedia/index.php?title=CWC_Blog\" rel=\"nofollow\">Dead Link of The CWC Blog archive</a>(<a class=\"external text\" href=\"https://web.archive.org/web/20130307200020/http://archive.sonichu.com/cwcipedia/index.php?title=CWC_Blog\" rel=\"nofollow\">archive</a>)</li></ul>\n<div style=\"clear:right; background:#ffffbb; width:300px; padding:3px; border:2px solid #99aaee; float:right; font-size:90%\">\n<div class=\"floatleft\"><a class=\"image\" href=\"/cwcki/File:CWCipedia_logo.png\"><img alt=\"CWCipedia logo.png\" decoding=\"async\" height=\"60\" src=\"/w/images/thumb/5/54/CWCipedia_logo.png/60px-CWCipedia_logo.png\" srcset=\"/w/images/thumb/5/54/CWCipedia_logo.png/90px-CWCipedia_logo.png 1.5x, /w/images/thumb/5/54/CWCipedia_logo.png/120px-CWCipedia_logo.png 2x\" width=\"60\"/></a></div>\nFor <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">Truth</a> and <a href=\"/cwcki/Honest_Content\" title=\"Honest Content\">Honesty</a>, see the archived <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> page on <a class=\"external text\" href=\"https://web.archive.org/web/20160301/http://archive.sonichu.com/cwcipedia/index.php?title=CWC_Blog\" rel=\"nofollow\">CWC Blog</a></div>\n<!-- \nNewPP limit report\nCached time: 20251125035030\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.182 seconds\nReal time usage: 0.207 seconds\nPreprocessor visited node count: 1053/1000000\nPost‐expand include size: 29222/2097152 bytes\nTemplate argument size: 11100/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   54.141      1 -total\n 87.68%   47.473      1 Template:The_Internet\n 78.30%   42.391      1 Template:Navbox\n 12.11%    6.558      1 Template:CWCipedia\n  8.39%    4.545      1 Template:Tnavbar\n  7.91%    4.285     83 Template:•\n  5.62%    3.045      1 Template:CWCipedia_link\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:2538-0!canonical and timestamp 20251125035030 and revision id 331272. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=CWC_Blog&amp;oldid=331272\">http://sonichu.com/w/index.php?title=CWC_Blog&amp;oldid=331272</a>\"</div></div>",
  "categories": [
    "CWCipedia",
    "Journals"
  ],
  "links": [
    "2007",
    "LittleBiGPlanet",
    "May 2010",
    "I hit the block",
    "Cwclight",
    "Church",
    "Sarah Nicole Hammer",
    "ReBrick‎",
    "Jack Thaddius",
    "Extreme Electric Makeover",
    "money",
    "deviantART",
    "Twitter",
    "DMs with CWCSonichu",
    "Mailbag 50",
    "she",
    "she liked me as a friend",
    "Twitch",
    "Amazon",
    "BREAK-UPS FROM BEING EVEN SIMPLY FRIENDS WITH ME",
    "This is how the Trial went",
    "Megan Schroeder",
    "Sonichu Girls",
    "2018 Twitter account compromise",
    "10th Book",
    "Etsy",
    "I enjoy",
    "CWCipedia",
    "sweethearts",
    "MY Audiobook Readings",
    "homosexual people",
    "2013 Facebook leak",
    "Simonchu",
    "the Revised ED Page Text",
    "The OFFICIAL Sonichu & Rosechu Blog",
    "The Tale Of The Crazy Pacer",
    "Simonla",
    "August 2009",
    "Book 11",
    "DO NOT MAKE IT A JOKE",
    "YES, Even to F***",
    "Mailbag",
    "tweets",
    "Peace of Mind",
    "Cwcville City",
    "Aspergers",
    "BronyMate",
    "the page that sorts out Fact from Fiction",
    "Tomboys And Tomgirls of Virginia",
    "Subliminal Frequency Hypnosis",
    "Honest Truth",
    "the video logs",
    "Basketball",
    "uploaded one of his Photoshopped images with my image",
    "Sonichu Forum",
    "parodic",
    "Chris's Big Night Out",
    "He is no longer \"Asperchu\", just call him Mitch Sonichu",
    "Vivian Gee",
    "Faeryn (A.K.A. the \"Hambeast\")",
    "2012 Poster campaign",
    "Catherine",
    "edits",
    "Bluesky",
    "United States of America",
    "r/ChrisChanSonichu",
    "girl",
    "II",
    "2023‎‎",
    "Homosexual",
    "Kellie Andes",
    "CWC's Cool Profile",
    "ModNation Racers Beta",
    "in addition to it being my Birthday",
    "The guy in the Brown Stripes",
    "Anna McLerran",
    "talk page",
    "Coca Cola",
    "Reddit",
    "Money-making schemes",
    "CWCki",
    "Sarah Jackson",
    "I'M WORKIN' ONNIT",
    "TwiSparLicious",
    "CWC Blog",
    "CWC's Pokésite 2",
    "Night Star",
    "gal-pals",
    "4-Cent Garbage",
    "speech quality",
    "ChrisChanSonichu and WikiSysop correspondence",
    "Virginia",
    "Sonichu",
    "that One page",
    "Joshua Martinez",
    "Optimus Prime",
    "Gal-Pal",
    "I admit I have done that",
    "WAILORD",
    "Ivy O'Neil",
    "gay-rights ads",
    "Match.com",
    "Sarah Cassandra McKenzie (PandaHalo)",
    "NOT MY OWN IN COMPARISON TO MY PAST HAND-DRAWINGS",
    "HarassCWCdirectly",
    "Other documents",
    "Rosechu",
    "Kiwi Farms",
    "YouTube",
    "neutral response",
    "Wild",
    "Central European",
    "Kacey Devoria",
    "CWC's Pokésite 1",
    "Book #10",
    "Webmaster",
    "I am Armed after all",
    "Junior",
    "a New Sonichu and Rosechu Story, their Christmas Special",
    "METAL SONICHU",
    "there WILL be trouble",
    "PSEye",
    "Facebook",
    "Squirtle who Yawned",
    "WikiSysop correspondence",
    "A Wild Chris-Chan Attempts Human Interaction",
    "Tiffany Gowen",
    "Giovanni",
    "Mary Lee Walsh",
    "I come up blank",
    "good humor",
    "Clyde Cash",
    "real life events",
    "Kacey",
    "Book #9",
    "Laura Dorazio",
    "computer",
    "Clare Porter",
    "Flipnote Hatena",
    "9th book",
    "a new video of apology",
    "COME AT ME DIRECTLY",
    "Trollin Train",
    "I WILL change the final few pages of Book 10 to be more appropriate for most people",
    "STUPID",
    "PS3",
    "Audiobooks",
    "Something Awful",
    "internet",
    "Magi-Chan",
    "Patreon",
    "Sweethearts",
    "Miiverse",
    "Quizzes",
    "Honesty",
    "Wikipedia",
    "Sean",
    "Alec Benson Leary",
    "Cults3D",
    "Google",
    "ROSECHU",
    "ALL OF MY RELATIVES AND FAMILY",
    "Cwcvilleshopping.com",
    "CWCki Forums",
    "Incest Arrest",
    "high school",
    "Equestria Daily",
    "Impulse Gay Social Club",
    "straightness",
    "profile",
    "DEATH BATTLE!‎",
    "homosexual",
    "chores",
    "was a traitorous mutiny",
    "Friend Zone",
    "MagiChan111448",
    "MySpace",
    "Debt hearing (eyewitness account)",
    "personal flair and charm",
    "recent Y.T. video",
    "Thingiverse",
    "HARD WORK",
    "Autism",
    "Evan George",
    "Encyclopedia Dramatica",
    "Chris's resume",
    "Tumblr",
    "Wal-Mart",
    "Issue 11",
    "Ian Brandon Anderson",
    "good reading",
    "Sonichu #11",
    "Christian Weston Chandler",
    "Creamarina",
    "Mimms and Lucas Q&A",
    "Asperchu",
    "The HooK Café",
    "WatchMojo",
    "Sweet Joy Boy",
    "whatnot",
    "one of the cheerleaders",
    "Cwcipedia",
    "Fridays After Five",
    "Cwcville",
    "SONICHU",
    "Asperpedia",
    "My Little Pony Protests",
    "YouTube comments",
    "Racetrack",
    "CWC's Sonichu Site!",
    "PlayStation blog",
    "Truth",
    "Sweetheart",
    "Vivian",
    "Reldnahc",
    "recent YouTube video",
    "Dating profiles",
    "Answers",
    "Backpage",
    "Honest, True People",
    "saw",
    "Troll",
    "Jack Thaddeus",
    "Sonichu 11",
    "Instagram",
    "Pre-2023",
    "shit comic",
    "2024",
    "Craigslist",
    "stressed",
    "VERY HORNY",
    "PC",
    "Kickstarter",
    "Bill",
    "The Internet",
    "Alec",
    "Christmas Special",
    "Planet Dolan",
    "PSN",
    "2025",
    "Chris Chan Boasting About Celebrity Status",
    "Original CCWC Art",
    "Adult Swim posts",
    "Dox",
    "R-E-S-P-E-C-T",
    "she did not see me as boyfriend material at the time",
    "Mao",
    "Mexico Contest",
    "GameStop",
    "PSN blogs",
    "honestly",
    "eventual benefits",
    "BlockTheTrolls",
    "Stressing",
    "Meetup",
    "OkCupid",
    "An Impostor",
    "Joseph Herring",
    "LEAKED Adult Drawings I did in my past",
    "ModNation Racers",
    "Newgrounds",
    "Alex's Lemonade Stand",
    "Duolingo",
    "\"Videos\" portraying me in a Wrong Sense",
    "girl friend",
    "my dad",
    "GameFAQs",
    "eBay",
    "SOMEONE",
    "respect"
  ],
  "scraped_at": "2025-11-26T14:58:22.904655"
}