{
  "url": "http://sonichu.com/cwcki/CWC%60s_Autism_Tutorial_with_Director_Commentary",
  "title": "CWC`s Autism Tutorial with Director Commentary",
  "display_title": "CWC`s Autism Tutorial with Director Commentary",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>CWC`s Autism Tutorial with Director Commentary</b> is a livestream in three parts that Chris did on 20 <a href=\"/cwcki/March_2016\" title=\"March 2016\">March 2016</a>, in which he plays the <a href=\"/cwcki/Autism_Tutorial\" title=\"Autism Tutorial\">Autism Tutorial</a> (created 2011) and rambles on over it. Chris removed the video two days later and reuploaded with all the parts combined, along with the original version of the Autism Tutorial. It should be noted that despite being uploaded in HD, the first 20 minutes of the video are, in <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_cinematography\" title=\"Chris and cinematography\">CWC-fashion</a>, grainy and low quality.\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<center>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>CWC`s Autism Tutorial with Director Commentary</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/rqTn8bORBt8\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=rqTn8bORBt8\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/rqTn8bORBt8\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>20 <a href=\"/cwcki/March_2016\" title=\"March 2016\">March 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Galpals</span><a href=\"/cwcki/Gal_pals\" title=\"Galpals\"><img alt=\"Galpals\" decoding=\"async\" height=\"32\" src=\"/w/images/8/83/Galpals.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/Gal_pals\" title=\"Gal pals\">Gal Pals</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Business</span><a href=\"/cwcki/Chris_and_business\" title=\"Business\"><img alt=\"Business\" decoding=\"async\" height=\"20\" src=\"/w/images/3/3d/Chris_money_icon.png\" width=\"37\"/></a> <a href=\"/cwcki/Chris_and_business\" title=\"Chris and business\">Business</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td>lilac T-shirt\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Yu-Gi-Oh!#Let's_Play\" title=\"Yu-Gi-Oh!\">Yugichris</a>\n</td>\n<td><b>next</b> <br/><a class=\"mw-redirect\" href=\"/cwcki/CWC%27s_Destiny_start\" title=\"CWC's Destiny start\">CWC's Destiny start</a>\n</td></tr></tbody></table>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">Yep, that's me venting. I'm looking up at the stars when I said that.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr></tbody></table>\n</center>\n<h3><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h3>\n<p>[<i>Video intro begins with Little Big Planet 3 opening. Chris sits in his room. The facecam is in the upper right, similar to how most \"Let's Players\" orient it.</i>]\n</p><p>This is Christine Chandler comin' to you live from Ruckersville once again; we're about to do the director's commentary for my Autism Tutorial in <a class=\"mw-redirect\" href=\"/cwcki/Little_Big_Planet\" title=\"Little Big Planet\">Little Big Planet 3</a> on <a class=\"mw-redirect\" href=\"/cwcki/PlayStation_4\" title=\"PlayStation 4\">PlayStation 4</a>. I just wanna get a few notes out of the way so we don't have to go through this during the actual animation. Yeah... Hmm. \n</p><p>I mean, yeah, originally, this was quite a pains-taking, more painstaking effort than I had planned, originally, especially because A. to view thi- aut- view the tutorial, as originally uploaded from Little Big Planet 2 on PlayStation 3, it ended on the PlayStation 4- it ended up my character being left <a href=\"/cwcki/Muscle_bra\" title=\"Muscle bra\">shirtless</a>. So using the PlayStation 3 version of Little Big Planet 3, I had to, uh, put a new shirt on my character, which is, uh, what the soccer shirt, specifically I picked the one for <a href=\"/cwcki/Tito_Got_No_Luck_Against_We_Brits,_Irish_and_Scots!\" title=\"Tito Got No Luck Against We Brits, Irish and Scots!\">jolly old England</a>, and then I put the sticker- I put the shirt decal over that. \n</p><p>Yeah... And also [<i>unintelligible</i>] wish I could not add these to my PS4 version <i>here</i>... because I was missing the Marvel <i>DLC</i>, that was originally, I believe, released for Little Big Planet 1, if I'm not mistaken, or it was Little Big Planet 2. Anyhow, uh... Yeah, the li- the licenses should have-, needs to be remo-, re-, it needs to be renewed for all that so I can download the DLC for the PS4. Fortunately I had it on PS3. It was just... Nnn... I wish I coulda done it all on this one system, but I had to do it all on the PlayStation 3. I'm glad I did not get rid of it. And also the Chinese New Year DLC, I'm lacking that as well for PS4, so let's get that up there! Lets get that up there, Sony, Media Molecule, whoever... um, listens to all of this anyway. Mmh...\n</p><p>Yeah and also, uh, brought up to-, also mentioned that, sent a complaint to support as well through the uh, forum... Of which, uh, I bought, I bought all this, and I also made a suggestion they should do a remo- they should at least do a remastered version of Little Big Planets 1, 2, and Karting, for PlayStation 4, and allow us to- be able to download <i>all</i> of the DLC, f- originally released for PlayStation 3. \n</p><p>And also I still felt disappointed that the PS4 would not allow me to play the PS3 games that I have in my digital library... Cause I was looking forward to migrating the Little Big Planet data, including save data and backed up profiles, from my PlayStation 3 to PS4. Like I believe to my understanding, with the uh, save data from the PS3 version of Minecraft to the PS4 version which I have heard about before... \n</p><p>And also just to go ahead and quell a few, uh, <a href=\"/cwcki/Trolls\" title=\"Trolls\">haters</a> to comment on this, but I mean uh... <a href=\"/cwcki/Obesity\" title=\"Obesity\">I'm not fat</a>, I'm losing the weight, and also so what if I vent about nearly at the end of each part of the Autism Tutorial? I have my own rights too, I'm human, you're human, we're all human! Alright?  And don't go lying that you're saying you're an alien... alright? Uh, lemme see what else, um...\n</p><p>Oh yeah and just uh, pretty much one minor update to the Autism dob- feel for my own personal experience... <a href=\"/cwcki/Autism\" title=\"Autism\">constant mental blankouts</a>. My mind just blanks out at random from... I mean, typically... from... <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">overzealous</a> amount of <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress and anxiety</a> from life and everything... I mean, it's pretty much typical, most people I have learned... but to my knowl- I would guess, feel free, but not to be insulting, feel free to correct me if I'm mistaken, cause I have  also taken medications that  quell my anxieties and stress so I don't... end up with heart attacks and whatnot... crazy life. [<i>sigh</i>] Anywho, self aware, all that, that's all fair... Hmm...\n</p><p>I wa- I originally wanted to uh, stream this through my... [<i>unintelligible</i>] -Little Big Planet through muplay [?] in my Vita, but unfortunately, to do 'share', while having the remote play enabled, it would not let me do that, cause then I would have the ability to uh, view the tutorial down here, and kept constant eye contact with the camera where I have it located versus originally where it was on top of the monitor, and where the... animation is being made, that I'm playing it on right now. Hmm.\n</p><p>Alright, so with that, let's go online and find the update... Find the Autism Tutorial as updated... in an adventure map. Hmm. [<i>To narrator</i>] I know he has a job to do, but do I have to have him repeating himself... as I go along? Anyway, it was quite a painstaking effort to get all this updated, so I could put it all in an adventure map, and in a clockwise ori- order... so then the parts could be viewed individually later, but more importantly so they could all be streamed through, seamlessly, so I would not have to... click the X pl- button in between parts... Except for, to go from, part six to the extra part, with the mock interview.\n</p><p>Alright, so with all that aside, um, here's the uh, tutorial, and I'm commenting.\n</p><p>[<i>Chris grabs two amiibo</i>] Sonichu and Rosechu available on <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a>. Everything. Books, all that. Ok? Thank You, Just puttin' the plug there. Loading screen.\n</p><p>[<i>Chris begins talking over the video</i>]\nI wonder how some people actually are able to cope with listening to their own voices, ya know?\n</p><p>I think my voice was more high pitched <a href=\"/cwcki/2011\" title=\"2011\">way back then</a>.\n</p><p>Just aaa hint: pretty much the inspiration for where I tilted my head forward made it look like I was whispering back to yall; you might- I think, if I remember correctly that was inspired by Louise in the classic Bob's Burgers episode where she goes like whispering to her mom, \"And she didn't make us wear seatbelts!\" He didn't. Mr. Frond. Hmm.\n</p><p>Oh yeah, and I definitely do believe that- if they haven't done all the research yet since 2009 when I originally did this animation... All the research and discoveries in the <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Corpus_callosum\" title=\"wikipedia:Corpus callosum\"><i>corpus callosum</i></a>... Hmm... Come on, d- are we, are we- [sigh] What's d- progress, what's the status on that cure for autism? Or at least fixing the <i>corpus callosum</i>. And I was unable to fit- fiww... Actually remedy that missing... notepad, that was left in the bottom part of that image there.\n</p><p>[<i>Chris in video talks about parent's age and autism</i>]\nUhh... Not to insult <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Mr. C</a>, my late father, who rests in peace in the Monticello Memory Gardens, but he was literally <i>52</i>, 53... I dunno, 52 going on 53, in 1980... upon my conception. Which that definitely backs up  the theory about the father's age being a factor, and bring on more likely autism in a child, 'cos I am <a href=\"/cwcki/Curse-ye-ha-me-ha\" title=\"Curse-ye-ha-me-ha\">cursed</a> with it.\n</p><p>Well yeah, I tend to switch back and forth from differing... to- voice tones, levels. I gotta end up watching myself if I'm not careful.\n</p><p>Oh yeah, that definitely goes with the constant mental blankness and blankouts that actually happen to me. Literally.\n</p><p>Hmm... [<i>sigh</i>] I haven't watched this in total depth... Umm... Or possibly with the uh... Mental blankouts from watching it again recently... Hm... I can't remember everything, I'm not perfect, who's perfect? <b>Nobody's perfect.</b> So quit hating on everybody, haters. Nobody's perfect. You're not perfect either. \n</p><p>Oh, ritualistic... Oh, my little faux pas.\n</p><p>I- I originally wanted to do the full circfle loop around but the camera did not- the camera, for... this technology did not work so well in my favor there.\n</p><p>Hey- Look at me here and there. Same face but <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl\" title=\"Tomgirl\">I think I look much better now</a> than I did when that photo was taken. [<i>laughs</i>] That's funny.\n</p><p>Hm. You could definitely tell I had to put a new shirt on my sack-person-character because that front pocket... That's co- seems to be common with the uh, badge, the state-country among the soccer shirts, is w- is what I learned. I ha- I had to through the individual shirts to pick out the new one to put on me there.\n</p><p>It's therapeutic, therapeutic building with <a class=\"mw-redirect\" href=\"/cwcki/Legos\" title=\"Legos\">Legos</a>. And... yeah, if you.. pay attention, you can actually learn from... us autistics in their younger age, what goes on in my- our minds, between what we create, <a href=\"/cwcki/Chris_and_art\" title=\"Chris and art\">draw</a>, whatever.\n</p><p>I tend- I realize I have a tended to go off topic... Especially near the end... of each uh, part. I mean, I don't mean to be offensive at all, seriously I don't... but, I just have so much stress in my head, I need- I just felt I need to vent at those times at the end of each video \n</p><p>Very smart, I mean... I definitely did not deserve to be put in an institution at all. <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_psychology\" title=\"Chris and psychology\">They do no good.</a> Seriously, unless the child is actually so low-functioning... Uhh, I mean, I don't, like- I, I'm talkin'... I really need to think my thoughts through sometimes. I can't think everything through, I'm not... my brain goes <a href=\"/cwcki/Slow-in-the-minds\" title=\"Slow-in-the-minds\">slow</a> sometimes and... Yeah, I just have blankout there, but I had to catch my train of thought , as I was just speaking right now.\n</p><p>I definitely like the tools I was able to uh, play with in uh, Little Big Planet 2- They're more diverse and... Compared to the first Little Big Planet game... Especially to make... videos and animations like this. So- Sony, Media Mo- Molecule did a good job.\n</p><p>Behind their mothers skirts, more like behind their... computer monitors. And do you actually see their faces on the other end? No. You know I learned recently that Anomynous [<i>sic</i>] is not a legal name? You cannot na- legally name your child \"Anonymous.\" Except in one state. I learned that from... Danger Dolan and Sheema. I like Sheema. Kitty-cat. Yeah, I like the voice actress that did her, she has a good voice.\n</p><p>[<i>Chris in game talks about his <a href=\"/cwcki/CWC%27s_Sonichu_Site!\" title=\"CWC's Sonichu Site!\">websites</a></i>] <br/>\nThat was not an easy decision for me to make... Havin' a- [<i>unintelligible</i>] sites down... in order for the sake of saving my artwork.\n</p><p>Only if you have it connected through a- Wi-Fi or a 3G connection.\n</p><p>I suck at date- I suck at <a href=\"/cwcki/OkCupid\" title=\"OkCupid\">online dating</a> as well so I don't do that either.\n</p><p>Hmm... [sigh] I miss <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_Room\" title=\"Chris's Room\">my old bedroom</a> the way it was back then... Definitely before my father passed away... but then, even more recently with the <a href=\"/cwcki/2014_house_fire\" title=\"2014 house fire\">house fire,</a> and... Well... I dunno if I wanna call this a bigger room, more area I have down here, but I sure filled it up fairly quick, didn't I?\n</p><p>Oh, you notice I put my <a class=\"mw-redirect\" href=\"/cwcki/1982\" title=\"1982\">birth year</a> on the... stereo set there...\n</p><p>Uhh, I tend to slip off-topic when I- digress-ing... go on and on... But then again, who doesn't? Seriously...\n</p><p>I made good- I had good intentions when I, originally said these things. It's definitely that. I mean, especially, umm... You feel one part at a time, you expect something at the end, at least you got something at the end...but who- It's like- It's not unlike um... I could enable skipping over the parts because that's beyond my knowledge. Awesomeness.\n</p><p>Oh yeah, when I was updating this, I really had to- I had to update the chips in each of the sackbots. Inste- They virtually [<i>stutters</i>] - I uh, slip- from... transitioning, I believe, and uh... two to three... Umm... The uh,  going back and forth for sackbots. I had to go- I had to reprogram them and actually record them going back and forth, so that's another... thing they could fix for bother version of Little Big Planet 3, the uh, looping, reprogramming for the sackbot.  I had to figure that out for myself, ya know.\n</p><p>Computer Graphics lab. In case you haven't figured it out yet, Computer Graphics lab- which in the front of, I actually conceived Sonichu in my head back in March 17, 2000.\n</p><p>Not product placement, if you see <a class=\"mw-redirect\" href=\"/cwcki/McDonalds\" title=\"McDonalds\">the arch.</a>  The tea is good though. And have- have you ever all tried Arnold Palmering it with their lemonade? I found that uh, abou- one quarter to a third full- uh, one-to-four, or one-to-three, wi- actually more preferably one quarter- lemonade versus tea... Yeah, that's definitely best combination to make... And Arnold Palmer it, with any McDonalds, I find their lemonade and tea... to be best for that combination.\n</p><p>Oh yeah, I did for so many years. \n</p><p>Oh, when I originally did the animation back in 2009, I wa- I really wanted to get the rain all over from left to the right side, but unfortunately I had s- too much over the awning or whatnot, the emitters would not allow me to do that. Even to- I wasn't- I hadn't even thought that back then about putting the emitter for the raindrops below... But then again, could you... Then again, how much is a bet, I don't think i would want the uh, raindrops in-between to protrude in front  of the characters there. Just a bunch of randomly selected sackperson characters... Costumes that were available back then.\n</p><p>LAME <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville,</a> L-A-M-E. Definitely compared to Chesterfield County, it was much better for me back then, <a href=\"/cwcki/Manchester_High_School\" title=\"Manchester High School\">high school.</a> Especially regardless of the uh, my backstabbing... later to be backstabbing <a class=\"mw-redirect\" href=\"/cwcki/Gal-pals\" title=\"Gal-pals\">gal-pals</a>. [<i>sigh</i>] I still miss uh, still miss them, I do, I still care about them. but I mean as people. Ya know. <i>I'm not crazy!</i> I'm not totally mentally deranged. Just because, I turn out to actually be a woman in spirit, including way back then that it was definitely apparent back then. I mean, I'm venting right now, but I should not be off-put or seen as weird and whatnot, even way back in high school. Nobody should. [<i>sigh</i>]\n</p><p>Uhh, <a class=\"mw-redirect\" href=\"/cwcki/Slaweel_Ryam\" title=\"Slaweel Ryam\">Slaweeeel!</a> [<i>unintelligible shout</i>] Slaweel Ryam! Oh, that reminds me. In the video, I said... \"It's... not ag...\" I don't like saying the name beca- but anyway, so, it's not me, <a href=\"/cwcki/CHRIS!!!_CHANDLER!!!\" title=\"CHRIS!!! CHANDLER!!!\">my name is not</a> <a href=\"/cwcki/Ian_Brandon_Anderson\" title=\"Ian Brandon Anderson\">Ian Brandon Anderson</a>, never ever. I said- IBA as in I-Be-A. Stop taking things directliterally. It's just... That was- terrible. You don't- make up a name from an- acronym like that. [<i>laughs</i>] That's all the ranting for right now. I'm still ranting off and on today. Uhhhhh, but it's just I have so much on my mind of [<i>mutters</i>] -and thought... Uhm, shoot... That's another blank mind instant right there, I lost my train of thought. Pbbbt. Hm. Inside, outside the box, ins-\n</p><p>[<i>Chris switches to another part</i>]\nHmm, ya know what, yall, I ju- I showed yall where it is on my Earth, let's- I'll just view it from- I'll just go to it from my moon. [<i>sigh</i>] I don't wanna delete, I'm tryin' to play. I didn't wanna edit, I'm trying to play. [<i>sigh</i>] <a href=\"/cwcki/Sonichu_11\" title=\"Sonichu 11\">Delays, delays,</a> details, yadaya, pbbbt. More creases to iron out. Yeah, change to play mode. Hmm...\n</p><p>But yeah, definitely when I tried too do all the editing on the- the PlayStation 4 here... with the- You can see some of the Marvel DLC and the decals in the background; I was unable to... Huh. Well well, I still need the D- the Marvel DLC anyhow. So, renew the license Sony, Media Molecule, all that. \n</p><p>[<i>Long silence as Chris in-game rambles on about trolls</i>]\n</p><p>Hmm...\n</p><p>And that's putting it mildly\n</p><p>That's inspired from <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Heavy_Rain\" title=\"wikipedia:Heavy Rain\">Heavy Rain</a>  Just- the character and this piece of background. That's not on the <a href=\"/cwcki/Charlottesville_Fashion_Square\" title=\"Charlottesville Fashion Square\">downtown mall,</a> but I felt like I wanted to put it in there at the time.\n</p><p>Oh yeah, now I remember. In <a href=\"/cwcki/Calling_Out_%22Julaaaay%22_-_David\" title='Calling Out \"Julaaaay\" - David'>that one video</a>... <a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">JULAY</a>, IT'S IAN BRANDON ANDERSON! I said in the creepy voice to sound like a witch. I said, \"Helloooo, Ian. Why is your last name Brandon Anderson?\" So put- just to put that at rest there.\n</p><p>Listen to me here! Because I am! <a class=\"mw-redirect\" href=\"/cwcki/Death_Threats\" title=\"Death Threats\">I am a good person!</a> I am not the monster you haters- have pushed upon me with your false labels and everything. You people should be more friendly. And likable, 'cos nobody's gonna like you at all for hating on everybody else. \n</p><p>[<i>Chris in-game mentions his heterosexuality</i>]\nAnd now I'm a lesbian transwoman.\n</p><p>Or more like they just have... too much on their minds already between life and tress and everything. They're in their own head. \n</p><p>Uh, I'm better off nowadays, I actually have more friends and... Know good people nowadays, but still. I feel like people should get their heads outta their iPhones and <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a>, I still feel that way. Definitely in agreement with what Harrison said, I made a Facebook about- that earlier. Oh boy, there's narrator [?] that slipped in the transition from Little Big Planet 2 to 3, or PS3 to 4. I shoulda... I did not think to fix that sooner, just- <a class=\"mw-redirect\" href=\"/cwcki/Random_Access_Humor\" title=\"Random Access Humor\">Why are you looking up, Sonichu? What's up in the eh, sky? is a bird gonna poop on you? [<i>fart noise</i>]</a>\n</p><p>Ehh, sackbot, yerr... Slipped programming. \n</p><p>Badum-badum-badum. FABULOUS!\n</p><p>Hm. Yeah, I wonder if those levels are still up and about, I hope they are, because otherwise, the uh, links at the end of f- the final part of the animation would... Be like boot. No. Leave a comment, lemme know if those links still work, if ya actually gone onto... The fi- that part six in the animation and... di- went to those level links.\n</p><p>Ya know, uh, social worker and... people at autism facilities... definitely listen to me there... Actually... Pick a person who's pretty kind, person they're person the aut- Pers the autistic child's age or as close to- That's actually on a normal and... Willing to volunteer, uh, actually be friends, especially in longest run... Yes, I'm gonna say their names, <a href=\"/cwcki/Tiffany_Gowen\" title=\"Tiffany Gowen\">Tiffany</a>, <a class=\"mw-redirect\" href=\"/cwcki/Sarah_Anne_Bevel\" title=\"Sarah Anne Bevel\">Sarah</a>, and... <a href=\"/cwcki/Kellie_Andes\" title=\"Kellie Andes\">Kelly</a>. I wish yall had actually stayed my friends in the longer run... Because I sure coulda used your- yall's.. help... Thef- couple, few years ago when we were talking about the high school reunion in 2013. I KNOW the <a href=\"/cwcki/CWC_Lego_Manchester_High_School_Oct_18_2013\" title=\"CWC Lego Manchester High School Oct 18 2013\">highschool building</a> I build is <i>not</i> actually re- reminiscent of the actual Manchester High School, but actually... Based, actually, based from the Lego friends and the actual high school in that animation, but I dedicated it, the construction of that, towards Manchester High, and puttin' in little hints here and there- of that. Nobody's weird, I mean, you could say the same- I mean, if you want to think somebody- it's, it's spired, it's an inspired piece of artwork, and yet yall insultin' me like that. Don't hate. Do not hate. haters gonna hate, don't be a hater. \n</p><p>Yeah. My <a href=\"/cwcki/Creepy_stare\" title=\"Creepy stare\">eye contact</a> is still reserved for the la- the ladies. I definitely do not give eye contact to the majority of the <a href=\"/cwcki/JERKS\" title=\"JERKS\">males.</a> I mean, it's no offense, but I still have my... <a href=\"/cwcki/Noviophobia\" title=\"Noviophobia\">insecurities</a> and whatnot. [<i>Chris in-game depicts a fight with a troll</i>] Aaand I stand corrected... I... do not no- <a href=\"/cwcki/Emily\" title=\"Emily\">I would not be able to recognize an internet troll offline.</a> But this is still relative right here how I feel about the haters. <a href=\"/cwcki/Don%27t_Mess_With_Me\" title=\"Don't Mess With Me\">Give 'em one, two, wap! Bam!</a> And then I'll do it again! Go on, give it to him again! [<i>gibberish</i>] That's funny. Still funny to watch.\n</p><p>I tend to mirror people, and to- mirror somebody, definitely a low-functioning person... That's not good for me at all. I mean,\nif you were- if you were typically um, if you were typical or likely to mirror anybody else, would you rather- mirror s- a low-functioning person, and...Yeah, I'd rather ne mirroring a normal person. And that's a big reason why in the- And I do not want my <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">sweetheart</a> to be... autistic. And it's definitely also to reduce the risk of autism in my <a href=\"/cwcki/Crystal_Weston_Chandler_(daughter)\" title=\"Crystal Weston Chandler (daughter)\">future children.</a> AND THAT'S REGARDLESS OF WHAT WHAT YOU HATERS ARE GONNA SAY, RIGHT? Yeah, aren't you? Aren't you? Keep your comments to yourselves. <a href=\"/cwcki/Chris_and_remorse\" title=\"Chris and remorse\">Not me. Not my fault.</a> Failed to load level, that's hardly my fault.\n</p><p>[<i>belches</i>]\n</p><p>[<i>Chris in-game talks about sweethearts</i>]\nDon't put mouse ears on her either. \n</p><p>I mean, especially yall to actually do know.\n</p><p>So is everybody and me nowadays.\n</p><p>Hm. Yellow house. Looks straight outta <a href=\"/cwcki/PaRappa_the_Rapper\" title=\"PaRappa the Rapper\">Parapper.</a> Parappa. But no, it's John booga- Burgermen. Oh, in the downtown mall, they actually do have the silhouette- statues of people among which, that's with the uh, thin characters that you see along the downtown mall portions of my tut- of the animations. And it was not an arcade machine there, it was uh, sorta like a hexagonal... Thing, where people posted ads and papers all on it. Hm.\n</p><p>Hm. I still screen my calls today. Or rather hardly answer the phone. I mean, who's who on the other monitor over there? You don't know. Why did you haters have to take the fun... Out of- everything?\n</p><p>[<i>Chris in-game demands the cure for autism</i>]\nOr if not then a few days later... Where the lines- would be short to nill.\n</p><p>Yep, that's me venting. I'm looking up at the stars when I said that. \n</p><p>[<i>sigh</i>] I still think fondly of my gal-pals regardless. Yep. So, yeah, even though the... fwed the sackbots dance I'm programming and whatnot, but essentially, to dance is to actually have a hold of each other and move about, if not in synchronization so... Still fun to watch though. Just two sack- you can still interpret this, interpret this is two sackbots dancing. It's nice, it's fun. Or at least help with theee uh, highschool reunion that we definitely wanted to serve. If you don't wanna hang out with me, Tiffany. Badum-badumbumbum. Wait for the level link. So I'm press triangle.\n</p><p>Yeah, lemme know, the uh- two levels over here and there... Are they still up? Right, I went with the no-crown version of the extra, 'cos I still don't have the crown DLC. Hey Little Big Planet people if yall are watching this, please send me a code for the crown... to my ID. Yep. Yall should have that information, I'm on the LBP.me.\n</p><p>[<i>Mock interview with <a href=\"/cwcki/Aspergers\" title=\"Aspergers\">Aspergers</a> strawman that only responds with \"YAH\", causing Chris to laugh at his own joke several times.</i>]<br/>[<i>laughs</i>] Ahhh, funny. Yay! A Space Ghost Coast-to-Coast parody of... an interview. Heheh, funny. And we're shaking hands. <a href=\"/cwcki/Mass_debating\" title=\"Mass debating\">We're not doing anything,</a> we're shaking hands. And I still feel very ill at him. Cause he's a <a href=\"/cwcki/JERKS\" title=\"JERKS\">male.</a> And pay attention to these subtitles underneath there. Haha. Me-heh, it's still funny to think about a- did not actually put actual thumb bot in the character. I thought it'd be quite valid to just kept it one-liner. And then to make that the running gag, it's still funny, haha. [<i>laughs</i>]\n</p><p>I definitely researched these facts way back then in 2009... Regardless of how they might be updated now. He grammin' me! [?] That was good timing! [<i>cackles</i>] Since I did get, ever since I did get the uh, life jacket for beta... I still need the crown.\n</p><p>Everybody should. We're individual people. [<i>laughs</i>] It's a free country. \n</p><p>I'm not getting on the head, hit on the head with that. It was dropped down to me so I can hit HANS on the head with it! [<i>laughs</i>] We're- defin' eye-contact here. YEAH? YAH! Yah YAH yah! Idiot. Fortunately since then, the, the uh, the autistic community and the uh, scientist era... Actually did remove the assburger name, so... I do not wanna say I take any credit for whatever, for that change. I'm sure somebody else felt the same way as well. Oh. There's another one. Last one. YAH! Haha, still funny. [<i>sigh</i>] But seriously, I do apologize for... All the venting and ranting I have done among the videos here. Don't hate against me period, because people have the right to vent. I'm serious. Everybody's gonna feel it.- among the other pented-up feelings. And now if you'll excuse me, I'm gonna personally... I'm gonna end it personally punching that character again. That sackbot. Haha, here we go! Here we go! What's coming up? What's coming up? Yep! He got squashed, that's funny. Ah, there's your clitch, ah, ending clitch. Funny. You gotta find that amongst funtch- here and there levels, whichever have you. \n</p><p>And yeah, originally for myself intended, I did add on this map, I probably, I may end up uh, making a puzzle or two about autism to emphasize the random blank-nindedness. I got so much of the other obligations right then. Anyway, I'll put down there choice. Punch- beat the hell out of the trolls, or enjoy the dancing between two sackbots. And the, just the- startened is it? There's no goalpost. Anyway, that's on the adventure map... Just south of my... Icon on my Earth. Southwest. Alright; thank yall for watching, and... have a good safe day.\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Autism_Tutorial_Extra\" title=\"Autism Tutorial Extra\">Autism Tutorial Extra</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/Autism_Tutorial\" title=\"Autism Tutorial\">Autism Tutorial Videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">n/a<span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Yu-Gi-Oh!#Let's_Play\" title=\"Yu-Gi-Oh!\">Yugichris</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a class=\"mw-redirect\" href=\"/cwcki/CWC%27s_Destiny_start\" title=\"CWC's Destiny start\">CWC's Destiny start</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250601214748\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.085 seconds\nReal time usage: 0.094 seconds\nPreprocessor visited node count: 278/1000000\nPost‐expand include size: 6708/2097152 bytes\nTemplate argument size: 1591/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   26.757      1 -total\n 80.29%   21.482      1 Template:Infobox/video\n 17.07%    4.568      1 Template:Galpals\n 10.56%    2.826      3 Template:Icon\n 10.48%    2.805      1 Template:Selling_Out\n  9.41%    2.519      2 Template:Succession\n  9.05%    2.422     18 Template:Pipe\n  9.05%    2.421      1 Template:Reason\n  8.98%    2.403      1 Template:Quote\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23226-0!canonical and timestamp 20250601214748 and revision id 328669. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=CWC%60s_Autism_Tutorial_with_Director_Commentary&amp;oldid=328669\">http://sonichu.com/w/index.php?title=CWC%60s_Autism_Tutorial_with_Director_Commentary&amp;oldid=328669</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2016",
    "Videos Christian uploaded to YouTube",
    "LittleBigPlanet"
  ],
  "links": [
    "Slaweeeel!",
    "males.",
    "Ruckersville,",
    "CWC's Destiny start",
    "high school.",
    "I'm not fat",
    "Parapper.",
    "March 2016",
    "haters",
    "Business",
    "overzealous",
    "my name is not",
    "highschool building",
    "house fire,",
    "Why are you looking up, Sonichu? What's up in the eh, sky? is a bird gonna poop on you? [fart noise]",
    "constant mental blankouts",
    "PlayStation 4",
    "the arch.",
    "Not me. Not my fault.",
    "Aspergers",
    "Kelly",
    "stress and anxiety",
    "gal-pals",
    "Tiffany",
    "Autism Tutorial Extra",
    "Facebook",
    "future children.",
    "way back then",
    "They do no good.",
    "birth year",
    "I think I look much better now",
    "draw",
    "downtown mall,",
    "Ian Brandon Anderson",
    "I am a good person!",
    "JULAY",
    "Autism Tutorial",
    "websites",
    "I would not be able to recognize an internet troll offline.",
    "We're not doing anything,",
    "Gal Pals",
    "Give 'em one, two, wap! Bam!",
    "Chris's videos",
    "shirtless",
    "Videos",
    "my old bedroom",
    "Sarah",
    "cursed",
    "Delays, delays,",
    "insecurities",
    "Etsy",
    "CWC-fashion",
    "Legos",
    "jolly old England",
    "online dating",
    "Mr. C",
    "sweetheart",
    "Autism Tutorial Videos",
    "Little Big Planet 3",
    "Reason",
    "that one video",
    "male.",
    "slow",
    "eye contact"
  ],
  "scraped_at": "2025-11-26T21:29:51.579755"
}