{
  "url": "http://sonichu.com/cwcki/Diary",
  "title": "CWC's Diary",
  "display_title": "CWC's Diary",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">My life sucks.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite>Entry for 2 March 2004</cite>\n</td></tr></tbody></table>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:127539439799.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"298\" src=\"/w/images/thumb/d/d9/127539439799.jpg/300px-127539439799.jpg\" srcset=\"/w/images/d/d9/127539439799.jpg 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:127539439799.jpg\" title=\"Enlarge\"></a></div>\"My Dad is blood-thirsty for revenge as well.\"</div></div></div>\n<p><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> has stated that he keeps (or has kept) a <b>diary</b>, although little is known about its format. Chris may be referring to his various blogs on sites like <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a> and <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a>, or he may be referring to a <i>physical</i> book that he actually writes in.\n</p><p>Entries from this diary that he has put on the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">Internet</a> have provided the greatest insight into Chris's world from <a href=\"/cwcki/2004\" title=\"2004\">2004</a>-<a href=\"/cwcki/2007\" title=\"2007\">2007</a>, particularly events involving his <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a> that would inspire the <a href=\"/cwcki/Sub-Episodes\" title=\"Sub-Episodes\">Sub-Episodes</a> in his <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu comics</a>. However, by mid-<a href=\"/cwcki/2008\" title=\"2008\">2008</a> Chris had deleted his MySpace and virtually all references to these diary entries...except the ones he put on <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a>, which never forgets.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Entries\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Entries</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#2004\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">2004</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#2005\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">2005</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#References\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">References</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Entries\">Entries</span></h2>\n<h3><span class=\"mw-headline\" id=\"2004\">2004</span></h3>\n<p>Well, here it is, <a href=\"/cwcki/2004\" title=\"2004\">Y2K4 (2004)</a>! My one resolution is to get myself a matching <a class=\"mw-redirect\" href=\"/cwcki/Girlfriend\" title=\"Girlfriend\">girlfriend</a>. Rather it will happen is something else. I plan to try again at <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">PVCC</a>.\n</p><p><b>6 January:</b> Today, I had an appointment with my optometrist, and big half-brother, Dr. <a class=\"mw-redirect\" href=\"/cwcki/David_Alan_Chandler\" title=\"David Alan Chandler\">David Alan Chandler</a>, for an Eye-Exam. I needed new lenses, but I can keep my <a href=\"/cwcki/Pedo-Glasses\" title=\"Pedo-Glasses\">current frames</a>. But apparently, he has an 8-year-old daughter, <a class=\"mw-redirect\" href=\"/cwcki/Savannah\" title=\"Savannah\">Savannah</a>. So for about 8 years, I’ve been an uncle and didn’t know it. Of course, this also makes my parents into grandparents as well. Needless to say, we were happy to know about that. :D<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup>\n</p><p><b>31 January:</b> Well, it’s the end of another month, and I still don’t have a girlfriend. Maybe my latest idea, the <i><a class=\"mw-redirect\" href=\"/cwcki/Sonichu%27s_News_Dash!\" title=\"Sonichu's News Dash!\">Sonichu's News Dash!</a></i> newsletter, will make the ladies take notice of me. Next stop: my Birthmonth, February (I’ll be 22 on the 24th this year)..\n</p><p><b>9 February:</b> <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a> made it illegal to distribute the News Dash; I AM VERY ANGRY AT THAT <a href=\"/cwcki/Chris_and_censorship\" title=\"Chris and censorship\">XXXXX</a>! In response, <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">I plan to incite the masses</a>, and hope they DEMAND the return of the News Dash so my chances on getting a girlfriend can be restored. I have also declared WAR on them as well!  \n</p><p><b>2 March:</b> That XXXXX, Mary Lee Walsh, got on my, and my parents’, nerves! She played SOCIAL DIRECTOR, and tried to frame me, just to give her an excuse to boot me out of PVCC! All I’d been doing was trying to get a girlfriend… IS THAT SO MUCH TO ASK?! I am very devastated, due to my SHATTERED HEART that XXXXX caused unto me! My life sucks.\n</p><p><b>29 April:</b> Sonichu and I were featured in the PVCC newsletter, the FORUM, but still nothing. Oh, to become popular and to get a girlfriend is very hard. My <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">Mom</a> MAY help me next month… GOOD LUCK.\n</p><p>I did get to rub my <a href=\"/cwcki/Nintendo_Power\" title=\"Nintendo Power\">Nintendo Power</a> FAME in the <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">XXXXX’s</a> face! Heh-heh!<sup class=\"reference\" id=\"cite_ref-2\"><a href=\"#cite_note-2\">[2]</a></sup>\n</p><p><b>1 August:</b> Well, it’s another month; still no girlfriend.  But I have a NEW idea that I am sure will REEL in a girlfriend on a FATEFUL <a href=\"/cwcki/Anime\" title=\"Anime\">RED STRING</a>.\n</p><p><b>5 August:</b> I’ve had my worst trip to the Mall. I was working with my Heart on a <a href=\"/cwcki/Red_String_of_Fate\" title=\"Red String of Fate\">Red String of Fate</a>, when from out of the blue, a <a class=\"mw-redirect\" href=\"/cwcki/MALE\" title=\"MALE\">JERK</a> <a href=\"/cwcki/Jerkop\" title=\"Jerkop\">COP</a> shattered my <a href=\"/cwcki/Heart_level\" title=\"Heart level\">Heart</a> and ripped up the Red String! I am very mad and upset, because that <a class=\"mw-redirect\" href=\"/cwcki/MALE\" title=\"MALE\">JERK</a> <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">took my idea for a fall</a>, just like that XXXXX at PVCC did! &gt;(\n</p><p><b>4 September:</b> While I was at the <a href=\"/cwcki/Charlottesville_Fashion_Square\" title=\"Charlottesville Fashion Square\">mall</a>, for the 8th week today, I realized something: since I have been using a <a class=\"mw-redirect\" href=\"/cwcki/Sign\" title=\"Sign\">sign</a> to state my being single &amp; lonesome towards an 18-22-year-old <a href=\"/cwcki/Boyfriend-free_girl\" title=\"Boyfriend-free girl\">BOYFRIEND-FREE woman</a>, I, in the event, was trying to <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Prostitution\" title=\"wikipedia:Prostitution\">sell myself like a new car</a>. I may be able to <a href=\"/cwcki/Carlos_Chantor\" title=\"Carlos Chantor\">put that idea to good use</a>.\n</p><p><b>6 September:</b> At the mall on this Labor Day, I was taking another go on my <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a>. I told that JERK COP off when I pulled some of my Fun Cards and told my <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">Lonesome Virgin</a> story, intimidated him and shouted “NO” into his face. In short, today was my Independence Day, but I am still alone.\n</p><p><b>11 September:</b> I was not bothering anyone at the mall today while I was trying to “sell myself,” when I got ARRESTED for trying; I fortunately did not go to Jail. But I have been stripped of my right to go to the Mall by myself; I would be required to bring my Mom or <a class=\"mw-redirect\" href=\"/cwcki/Dad\" title=\"Dad\">Dad</a> with me. My independence, and my SOUL, were practically MURDERED. (8(\n</p><p><b>16 September:</b> I got SUSPENDED FROM <a href=\"/cwcki/Private_Villa_of_Corrupted_Citizens\" title=\"Private Villa of Corrupted Citizens\">PVCC</a> by the Board, and I have that meddling XXXXX to thank for this as well. <a class=\"mw-redirect\" href=\"/cwcki/I%27LL_BREAK_YOU_DEAD\" title=\"I'LL BREAK YOU DEAD\">I am SUPER ANGRY! &gt;8(</a> My Dad is blood-thirsty for revenge as well. He’s going to write to US PRESIDENT, <a href=\"/cwcki/George_W._Bush\" title=\"George W. Bush\">George W. Bush Jr.</a>, and Laura Bush, to help me get allowed back to PVCC. <a href=\"/cwcki/Death_threats\" title=\"Death threats\">WE ALL CURSE DEATH</a> upon that XXXXX, Mary Lee Walsh! &gt;8(\n</p><p><b>26 September:</b> It’s been over a week since my SUSPENSION; I am DEPRESSED, LONELY, SAD and BORED! I have nowhere to go to attract a Boyfriend-Free woman. I’ll be writing to <a class=\"mw-redirect\" href=\"/cwcki/Santa_Clause\" title=\"Santa Clause\">Santa Clause</a> this year, hoping that he will bring me one. (8(\n</p>\n<h3><span class=\"mw-headline\" id=\"2005\">2005</span></h3>\n<p><b>29 March:</b> Well, at the mall today, my heart had a extremly fast recovery, then it became Majorly Shattered again. I went to the mall, like normal, I picked up some chicken nuggets and a drink, then I went to my spot. I pulled up a chair to sit and eat my food on. Then, from out of the blue, this cute girl approached me, and she asked me if I was looking for a Girlfriend (Her name was <a href=\"/cwcki/Hanna\" title=\"Hanna\">Hanna</a>, and she was 18-Years Old). I said yes, and we small-talked for a bit. Then she invited me over to Starbucks for coffee. After she left, I became very excited and “Oh My God” all over! After calling Mom, and eatingmy nuggets, <a class=\"mw-redirect\" href=\"/cwcki/English\" title=\"English\">I lefted</a> the chair with such cheer and grace, and spun around with it like a dancer. Then I put it back where itwas. I felt that my <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a> had finally come to an end, and I so elated that my Shattered Heart had a full, fast recovery. I went to Starbucks, and we talked about basic things. I showed her my <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_Scrapbook\" title=\"Sonichu Scrapbook\">Sonichu Scrapbook</a>; she was very impressed. I gaver my E-Mail, and both my Phone Numbers, on a “Sonichu Site” card, and she gave me her E-Mail address. I was very attentive as I took notes about her, and maintained eye-contact. As I left her, I gave a “Double-Take” flirt. That was the rise; now here comes the fall. As I was sitting at my spot, thinking about future steps for later dates, <a href=\"/cwcki/Anna_McLerran\" title=\"Anna McLerran\">Anna</a> and Dana told me that when they talked to Hanna, she told them that she was setting me up in a prank. I could not believe it, so I found and asked Hanna. Sadly, it was true. Then in major shock, my heart <a href=\"/cwcki/Heart_level\" title=\"Heart level\">Shattered again by 85%</a>, and I let out a big “NOOOOOOOO!” \n</p><p>So, my Love Quest has restarted, and as for that date of ours, I’ll always remember it, but as far as I’m concerned, it doesnot count as my First Date. I was not as happy, as I was today, in a long time. I am once again Heart-Shattered and sad, but I will not give up on my Love Quest, because there has to be One True Boyfriend-Free, Datable, Non-Pranking Girl out there somewhere!<sup class=\"reference\" id=\"cite_ref-3\"><a href=\"#cite_note-3\">[3]</a></sup>\n</p><p><b>22 June:</b> Let me begin this entry with what happened two days ago. I had my setup at the McDonald’s at Wal-Mart, and apparently complaints were made. The two <a href=\"/cwcki/Manajerks\" title=\"Manajerks\">manajerks</a>, a <a class=\"mw-redirect\" href=\"/cwcki/Merried_Seinor_Comic\" title=\"Merried Seinor Comic\">Seinor Comic</a>, and a <a class=\"mw-redirect\" href=\"/cwcki/B-Manajerk\" title=\"B-Manajerk\">Black, Fat Jerk</a> (he looked a lot like the leader of the Jerkops at the Mall, whom I refer to now as the <a href=\"/cwcki/Jerkhief\" title=\"Jerkhief\">Jerkhief</a>) approached me and took me for a fall with my trying to find a Boyfriend-Free Girl, like I have been doing for the past over one-year and ten-months. We argued and disputed, until the two of them left to call the police. While they were gone, I had taken off the <a class=\"mw-redirect\" href=\"/cwcki/Sign\" title=\"Sign\">sign</a> from my Nintendo DS and hidden it on the back cover of my diary. When the <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">Jerkops</a> came, they were all like “What seems to be the problem?” And the Merried Seinor Comic was like, “Where’s the Sign?” And I was, “What sign?” And another argument was had between the four of us, in which I NEVER gave any of those JERKS Eye-Contact, because none of them deserved it!. So, I got kicked out from the McDonald’s, not the Wal-Mart, for the rest of the day. Now for what happened today, I was starting to setup my things, and the <a class=\"mw-redirect\" href=\"/cwcki/B-Manajerk\" title=\"B-Manajerk\">B-Manajerk</a> was getting in my face (I feel that he really hates me), and he was like, “Don’t set up your stuff. Don’t push me.” I was not going to use the Nintendo DS sign today, anyway. But he did not want my <a class=\"mw-redirect\" href=\"/cwcki/Pixelblock\" title=\"Pixelblock\">Pixelblock</a> sculptors at all. I stood up against that Manajerk; I continued to build, and I dictated my situation into his face (with a song and dance). He went up to the <a class=\"mw-redirect\" href=\"/cwcki/W-M-Manajerk\" title=\"W-M-Manajerk\">Wal-Mart Manajerk</a>, and he was like, “Hey, Let’s talk.” But I sat silent for a minute, then I said to him, “I do not speek [sic] to any Man other than myself, because they all have taken all the pretty girls leaving me with none.” Verbal Combat had started, and during the fight, I ran off, still giving verbal punishment, as well as da finger, and many “<a href=\"/cwcki/Curse-ye-ha-me-ha\" title=\"Curse-ye-ha-me-ha\">Curse-Ye-Ha-Me-Has</a>.” I nearly backed up onto him with my <a class=\"mw-redirect\" href=\"/cwcki/Car\" title=\"Car\">car</a>, and I gave him another finger. Then I dashed off. I needed someone to talk to, so I went to the mall and talked to <a href=\"/cwcki/Anna_McLerran\" title=\"Anna McLerran\">Anna</a>. She was a positively great help. She listened attentively, and she gave me a terriffic [sic] suggestion, tell my One-Year and Ten-Month Old Story to the Daily Progress. It was such a great idea, because I could bad-mouth those Jerks, as well as the Jerkops, <a class=\"mw-redirect\" href=\"/cwcki/ScotPalazzo\" title=\"ScotPalazzo\">Scott Manajer</a>, and <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>. Also, with my story, I may actually attract an 18-23-Year Old Boyfriend-Free, caring, <a class=\"mw-redirect\" href=\"/cwcki/Tobacky\" title=\"Tobacky\">smoke-free</a>, <a class=\"mw-redirect\" href=\"/cwcki/Alcohol\" title=\"Alcohol\">non-alcoholic</a>, white girl. \n</p><p>So I dashed home and printed a second copy of my diary, and dashed to the office; the Female Reporters were in a meeting, so I left a message on an answering machine, thanks to the secretary who helped me. I’ll go back there tomorrow afternoon and try again, unless she calls me before then. Now, I feel sad, because I have nowhere else to go to attract a Boyfriend-Free Girl, and I feel very furious with those Manajerks and all Men other than myself and my father. Also, the top reason for me detesting those JERKS was that they all have taken all the pretty girls, leaving me with none. That reason is now the numbertwo reason. The new number one reason is they ALL are AGAINST me in finding a Girlfriend of my own. But I will not give up on my long and teidous [sic] Love Quest; I’ll find a new Attraction Spot, somewhere in <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville,_Virginia\" title=\"Charlottesville, Virginia\">Charlottesville, Virginia</a>. There has to be at least one 18-23-Year Old Boyfriend-Free, caring, smoke-free, non-alcoholic, white girl out there somewhere.\n</p><p><b>20 July:</b> … I was at the new <a class=\"mw-redirect\" href=\"/cwcki/Target\" title=\"Target\">Target</a> store, just hanging around, not bothering anyone. And, from out of the blue, these two Manajerks asked me to leave, because they said that I was loitering; I was NOT! I was there hoping to find an 18-23-year old, Boyfriend-Free girl, like I usually do. Then, from out of the blue, after I told them off, they came back with two Jerkops! I was slightly intimidated, but mostly annoyed and ready to strike back on them. They asked me to leave, and never return. I did not want to leave. I would have left peacefully, in fact, I was ready to go, but I had a prepared speech to say to them stupid Jerkops. And, during the middle of my speech, they chased me, pulled my pants, and pinned me to the floor. Five Jerkops dog-piled on me as I struggled to get free. <a class=\"mw-redirect\" href=\"/cwcki/Gay\" title=\"Gay\">A thousand pounds of sausages</a> on <a href=\"/cwcki/Obesity#Denial\" title=\"Obesity\">my 180 pound body</a> was seriously a cut-off for my Breathing Flow. They handcuffed my wrists and legs, and they hog-tied me! Not only did I felt humiliated from being the victim, but I was angry at them! Not only for handcuffing me, but once again thwarting my efforts in trying to find a Boyfriend-Free Girl. They drove me to the county jail, but fortunately, they did not keep me there; I was released to my family. But now I have to go to court on July 29 at 9:00 AM at the Albemarle County Courthouse, close to the Downtown Mall. So now, I feel very miserable, sad, lonely and rejected. And, while I had the handcuffs on me, both my hands, mostly my right, were seriously cut off from blood flow, and they both felt numb. It was terrible. But my mother and I are going to get back at them in court, in fact, I learned that the Jerkop who arrested me was called <a href=\"/cwcki/Bagget\" title=\"Bagget\">Bagget</a> (that was the only thing about the situation that was hilarious; replace the “B” with an “F,” and you can see how <a class=\"mw-redirect\" href=\"/cwcki/Humor\" title=\"Humor\">funny</a> it was).\n</p>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\">In November 2007, Chris accompanies this entry with a picture of him wearing glasses, with the caption \"\"Yes, <i>I WEAR GLASSES</i>; I have been since Groundhog Day, <a class=\"mw-redirect\" href=\"/cwcki/1998\" title=\"1998\">1998</a>, because I am Nearsighted\"</span>\n</li>\n<li id=\"cite_note-2\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-2\">↑</a></span> <span class=\"reference-text\">In November 2007 Chris added: \"Enough OLD angst against the grey-haired witch-devil, THAT I'VE PUT LONG BEHIND ME...\"</span>\n</li>\n<li id=\"cite_note-3\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-3\">↑</a></span> <span class=\"reference-text\">Chris adds in November 2007: \"After that shout, I got kicked out AGAIN, and I'm still without the Fashion Square Shopping Centere that I've grown accustomed to after my whole life.\"</span>\n</li>\n</ol></div>\n<!-- \nNewPP limit report\nCached time: 20251126060033\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.047 seconds\nReal time usage: 0.142 seconds\nPreprocessor visited node count: 138/1000000\nPost‐expand include size: 777/2097152 bytes\nTemplate argument size: 58/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 1220/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    7.478      1 Template:Quote\n100.00%    7.478      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:8264-0!canonical and timestamp 20251126060033 and revision id 350635. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=CWC%27s_Diary&amp;oldid=350635\">http://sonichu.com/w/index.php?title=CWC%27s_Diary&amp;oldid=350635</a>\"</div></div>",
  "categories": [
    "2000s",
    "Journals"
  ],
  "links": [
    "Love Quest",
    "girlfriend",
    "Jerkhief",
    "Curse-Ye-Ha-Me-Has",
    "manajerks",
    "Mary Lee Walsh",
    "COP",
    "Savannah",
    "took my idea for a fall",
    "Sonichu Scrapbook",
    "Charlottesville, Virginia",
    "Lonesome Virgin",
    "WE ALL CURSE DEATH",
    "Sonichu comics",
    "I am SUPER ANGRY! >8(",
    "Internet",
    "BOYFRIEND-FREE woman",
    "Chris",
    "Nintendo Power",
    "Shattered again by 85%",
    "JERK",
    "Encyclopedia Dramatica",
    "2004",
    "Black, Fat Jerk",
    "MySpace",
    "Dad",
    "Seinor Comic",
    "2008",
    "Facebook",
    "Anna",
    "Mom",
    "smoke-free",
    "XXXXX’s",
    "Red String of Fate",
    "funny",
    "mall",
    "Santa Clause",
    "Scott Manajer",
    "2007",
    "sign",
    "Jerkops",
    "B-Manajerk",
    "RED STRING",
    "PVCC",
    "Pixelblock",
    "non-alcoholic",
    "1998",
    "Heart",
    "I plan to incite the masses",
    "Target",
    "Bagget",
    "A thousand pounds of sausages",
    "XXXXX",
    "car",
    "current frames",
    "David Alan Chandler",
    "Sonichu's News Dash!",
    "I lefted",
    "Y2K4 (2004)",
    "Wal-Mart Manajerk",
    "George W. Bush Jr.",
    "put that idea to good use",
    "Hanna",
    "Sub-Episodes"
  ],
  "scraped_at": "2025-11-26T21:25:16.051504"
}