{
  "url": "http://sonichu.com/cwcki/Donation_Options_Reviewed.",
  "title": "Donation Options Reviewed.",
  "display_title": "Donation Options Reviewed.",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Donation Options Reviewed.</b> is a video uploaded by <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> onto his <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> channel on 12 <a href=\"/cwcki/November_2015\" title=\"November 2015\">November 2015</a>. In it, he pledges a great degree of rewards to those who donate towards the continuation of the <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu comic</a>, an offering on his <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a> page. He includes plenty of lucrative <i><a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu</a></i> merch and comic books. He even reveals what happens if someone pledges a thousand dollars or more to him, probably as a result of <a class=\"external text\" href=\"https://www.youtube.com/watch?v=yeoxjOI5IBo\" rel=\"nofollow\">DSteck's particularly generous handout</a>. Chris also shows that he has started coating his newly-produced <a href=\"/cwcki/Medallions\" title=\"Medallions\">medallions</a> in a glossy substance, most likely PVA Glue.\n</p><p>Chris does not appear on camera in this video, which probably influenced his <a href=\"/cwcki/Yes,_it_still_has_been_I,_Christine_Weston_Chandler,_who_has_been_uploading_the_videos_personally.\" title=\"Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.\">next video</a> three days later.\n</p><p>Disgustingly, the three top related YouTube videos are footage of <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Tunga_penetrans\" title=\"wikipedia:Tunga penetrans\">jigger</a> infections, implying Chris may be using some shady tags for his most recent videos. It may also have to do with Chris's mention of his <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">mother's</a> \"holey buttocks.\"\n</p>\n<h2><span class=\"mw-headline\" id=\"Description\">Description</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>I do take donations, and each donation, as low as $10.00 per page in the comic books, is greatly appreciated. The books and figure prototypes, and future projects, including a possible video game on console(s) or animated series, is made possible from the kind support from loyal and new readers and followers like y'all. Thank You. :)\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Donation Options Reviewed</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/lKQ5aB5to7Q\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=lKQ5aB5to7Q\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/lKQ5aB5to7Q\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>12 <a href=\"/cwcki/November_2015\" title=\"November 2015\">November 2015</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Comics</span><a href=\"/cwcki/Comic\" title=\"Comics\"><img alt=\"Comics\" decoding=\"async\" height=\"32\" src=\"/w/images/4/40/Comics.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/Comic\" title=\"Comic\">Comics</a>, <span style=\"display:none\">Cwcville Shopping</span><a href=\"/cwcki/Etsy\" title=\"Cwcville Shopping\"><img alt=\"Cwcville Shopping\" decoding=\"async\" height=\"20\" src=\"/w/images/b/b2/Online-Store-No-Signs.png\" width=\"20\"/></a> <a href=\"/cwcki/Etsy\" title=\"Etsy\">Cwcville Shopping</a>, <span style=\"display:none\">Handouts</span><a href=\"/cwcki/Chris_and_money#Begging\" title=\"Handouts\"><img alt=\"Handouts\" decoding=\"async\" height=\"20\" src=\"/w/images/5/5e/Handout_Template1.png\" width=\"20\"/></a> <a href=\"/cwcki/Chris_and_money#Begging\" title=\"Chris and money\">Handouts</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Business</span><a href=\"/cwcki/Chris_and_business\" title=\"Business\"><img alt=\"Business\" decoding=\"async\" height=\"20\" src=\"/w/images/3/3d/Chris_money_icon.png\" width=\"37\"/></a> <a href=\"/cwcki/Chris_and_business\" title=\"Chris and business\">Business</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td>N/A\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Sonichu_and_Rosechu_figure_collection_toy_battle!\" title=\"Sonichu and Rosechu figure collection toy battle!\">Sonichu and Rosechu figure collection toy battle!</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Yes,_it_still_has_been_I,_Christine_Weston_Chandler,_who_has_been_uploading_the_videos_personally.\" title=\"Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.\">Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.</a>\n</td></tr></tbody></table>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">I offer you the chance to donate as low as $10\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite>Chris, in his boundless generosity</cite>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p>[<i>Chris is filming his complete set of</i> <a class=\"mw-redirect\" href=\"/cwcki/Amiibo\" title=\"Amiibo\">Amiibo</a><i>, neatly organised into a purpose-built stand made out of</i> <a href=\"/cwcki/Lego\" title=\"Lego\">Lego</a> <i>and construction paper.</i>]\n</p><p>Hello once again, and good day. This is Christine Chandler, coming to you once again from my, from <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">home base</a> right here. We're just gonna talk a little, talk a little while about my do-, about the <a href=\"/cwcki/Etsy#Donate_towards_New_Comic_Book_Pages\" title=\"Etsy\">donations page</a>, 'cause I mean, while sales are going good here and there, I could still do better and...this is a household I still have to help pay the bills with. So... Yeah, and the-, and they continue, and the donations come in and out as well. They're, they...very good. And every person who donates gets their name put in the back of, definitely <a href=\"/cwcki/Sonichu_11\" title=\"Sonichu 11\">Book 11</a> this time round. And I'm thinkin' probably, uh... But anyway, among the bigger donators will get their names put into more than Book 11, up, like, into <a href=\"/cwcki/Sonichu_12\" title=\"Sonichu 12\">12</a>, 13, so on, depend on, depending on how much they donated. But lower they donate you only get your name in, uh, one book on the donation amount. But anyway then it becomes variation, but anyway again, that's $10 a page, so. I'm just showing off my figures right here, 'cause they will come into play for among the higher donators, and I have more to show, but anyway. Let me just go ahead and read it to you. \n</p><p>As a devoted fan to Sonichu and Rosechu comic book series, I am certain that you do want to see more pages and eventual animations and whatever else might come to mind, depending on how much help and support I can get. Uh, I mean, especially since I end up with the creator's boss- creator's block forced the hiatus in <a href=\"/cwcki/2011\" title=\"2011\">2011</a>. But I'm getting back into the drawling, writing, color, and working, and trying to work out a schedule that works around the projects, and orders, and whatnot. And then I have my own typical <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stresses</a> in life as we-, as well. Hm. But anyway from my shop, you, I mean, I have all my available materials and whatnot, but you, if you don't feel like buying a <a class=\"mw-redirect\" href=\"/cwcki/Medallion\" title=\"Medallion\">medallion</a>, <a class=\"mw-redirect\" href=\"/cwcki/Commission\" title=\"Commission\">commission</a>, or <a class=\"mw-redirect\" href=\"/cwcki/Amiibo\" title=\"Amiibo\">figure</a> or whatever, I offer you the chance to donate as low as $10. And for $10, uh...not only will you get, uh, a page in that book and the name, and your name in the back of the book, but for each person who donates that there, I, I'll send you the uh, a black-and-white character drawing by default. If uh, you don't make a request, it'll just be uh, Sonichu in a-, in the default. [<i>shows an example drawing</i>] That's not the default, this is a past request I photocopied for myself. Anyway that's a limit of one drawing per person per day. If you would like the uh, character drawing, don't, the character drawing colored, that goes up to the next level of donation of $20.\n</p><p>Anyway, uh, let's see, I'm going down a bit here, but anyway, everybody gets a chance for a character drawing at the least. Everybody gets a character drawing, and the higher they donate, the better the qua-, the better the drawing will be. Alright, at the $50 level, you get your choice of either a recreation of the Sonichu medallion, and you'll note as it says in the description, the strap will be, the neck strap will be leather. And I'll make it long, and I've measure-, premeasured long enough to make sure that it goes around my head at least. Anyway, you'll get your choice of either a medallion, or an autographed photo of me...[<i>trails off</i>] El-, anyway, is that really...? Hm. And also, uh, your choice of one of the comic books that will be made available at the time, as early as <a href=\"/cwcki/Sonichu_0\" title=\"Sonichu 0\">Book Zero</a>, or <a href=\"/cwcki/Sonichu_1\" title=\"Sonichu 1\">Book Number One</a> is also available right now, but if you view this video on the later months you'll see more books to be made available, so that's your choice of a book. Alright...oh, wait a minute, um, so that's at the $50 level again. I'm just repeating this, you'll get your choice of the medallion, or, oh, okay, so you'll get your choice of just the medallion by itself, or an <a href=\"/cwcki/Autographed_Photos\" title=\"Autographed Photos\">autographed photo</a>, and a book.\n</p><p>Okay, I just wanted, just tryin' to make sure I, I have it all printed out right here, so. [<i>blows raspberry</i>] I get a little fumbled up in my words as well. Alright, so anyway, moving on, uh, the $100 donation....Mm...yeah, a $100 donation gets you a choice of any one, any single figure of the individual figures made available on <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a>. [<i>pans camera to display figures</i>] That's a wide range right there, as well as your choice of a printed copy book. Uh....[<i>mumbles</i>] And also, of course, you may request a character drawing--oh, I forgot, you mention you can request your character drawing as well on the $50 donation level. Everybody gets their, everybody gets a character drawing, but $20 and up it becomes colored, but at the $100 level it does better than just one character. You get, you pretty much would get a full-colored drawing, with, complete with a background and everything, but...Mm...yeah, I guess at that point you can call it a color commission, yeah. At that level, I will personally laminate it, and pur-, put a, put a full-sized certificate on the back of it, so $100 level will be a commission as well. You get a great deal! A figure and a color commission for the $100 donation level. As well as a book! That's a pretty good deal right there.\n</p><p>Alright, so anyway we got that out, so anyway, we got all that drawing choices, levels out of the way. Right, at $500, okay, that gets you a medallion--which it doesn't have to be Sonichu, by the way, it can be <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a> or any of the other characters--I also take custom requests on the medallions, as I have done before on <a href=\"/cwcki/EBay\" title=\"EBay\">eBay</a>. And let's see, alright, so you get the medallion, you get your choice of any one of these figures, and then you also get your choice of either three-pack available which currently--the three-packs includes, well there's the Mii version which includes <a href=\"/cwcki/Chris-chan_Sonichu\" title=\"Chris-chan Sonichu\">Chris-chan Sonichu</a>, mm, as well as the past version of me, either short or tall, as well as the current version of me--and by the way, I want to go ahead and bring up that all the three-packs, they will come with the Mii, you know the, as shown in the, as they talked about in the listings, if you put in Smash Bros., yeah, you get my, you get to play against my Mii character, and there's a different one, there's a different version of like, you know, past me and present me. But anyway, in the three-packs, it's, we're set, we're mine (mind? my?) set on the Mii characters, no Link or Toon Link, although of course Chris-chan Sonichu has to be a Sonic character at that point, regardless.\n</p><p>Anyway, you get your choice of the Mii three-pack, or current, or may currently available more recently the family three-pack, which you get Current Version me, as well as my <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">mom</a> and my <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">dad</a>. And again, check the individual listings on Etsy. Anyway, let's see, um, checking the, checking my printout again... Right, you get uh, for $500 you get the medallion, a single figure, and your choice of one of the three-packs...[<i>mumbles</i>] And then you may request an autographed photo as well, and/or you may request a copy of one of my books. [<i>mumbles</i>] And you can still request your character drawings, or at this point, a full-color donati-, a full-color commission page...[<i>mumbles</i>] Right, so then, again you'll have you name put your, put in the back of more than one book. And then the big whopping deal! $1000 will get you the complete main Sonichu and Rosechu Wave One set that includes uh, Sonichu, Rosechu, <a href=\"/cwcki/Blake\" title=\"Blake\">Blake</a>, <a class=\"mw-redirect\" href=\"/cwcki/Wild\" title=\"Wild\">Wild</a>, <a class=\"mw-redirect\" href=\"/cwcki/Bubbles\" title=\"Bubbles\">Bubbles</a>--complete with surfing on the tidal wave--<a href=\"/cwcki/Angelica\" title=\"Angelica\">Angelica</a>, <a class=\"mw-redirect\" href=\"/cwcki/Punchy\" title=\"Punchy\">Punchy</a>, and <a class=\"mw-redirect\" href=\"/cwcki/Magi-chan\" title=\"Magi-chan\">Magi-chan</a>. You get all that, and your choice of one of the three-piece sets...three-piece figure sets...[<i>mumbles</i>] And you'll also get a medallion of your choice of character content or whatev-, or all that...I'm reading the wrong listing, let's see... Right, medallion, and you can still request an autographed photo of me, and a book! And you'll still get your color commission.\n</p><p>So anyway, that's uh, all of the details. You can read about all of this on the donation listing on <a href=\"/cwcki/Etsy\" title=\"Etsy\">Cwcville Shopping</a>. [<i>holds printout in front of the camera, which refuses to focus</i>] Focus, focus! There we go. I'm going to print this out for reference. Anyway, yeah, so that, again, that's uh, $10 for default character drawing, $20 color in the character, $50 gets the medallion, or an autographed photo, and a book. So you get a medallion, just the medallion, or you can have the autographed photo and a book. And you still get colored character drawing. At $100 you get your choice of any single figure currently available, as well as one of my books, and you get fully upgraded to the full-colored commission. Right, and $500 gets you Sonichu medallion, an individual figure, plus either three-pack, as well as a copy of my, copy of one of my books, and you can choose to get an autographed photo, and full-colored, and then a full-colored commission. Or the $1000 gets you the full Wave One set and your choice of one of three-piece sets, the medallion, the book, optional autographed photo, and full-colored commission. And depending on uh, how much I have to create, and the time, hm, take as low as a few days for, few days to a week, depending on mood situations, whatever, for the drawing. And then uh, two to four weeks for a medallion, up to four weeks for a single figure, or either three-pack, or up to eight weeks for multiple, for the multiple individual figures. \n</p><p>And now, go ahead and make ano- [<i>video abruptly ends</i>]\n</p><p><br/>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Sonichu_and_Rosechu_figure_collection_toy_battle!\" title=\"Sonichu and Rosechu figure collection toy battle!\">Sonichu and Rosechu figure collection toy battle!</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Yes,_it_still_has_been_I,_Christine_Weston_Chandler,_who_has_been_uploading_the_videos_personally.\" title=\"Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.\">Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250602000904\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.086 seconds\nReal time usage: 0.097 seconds\nPreprocessor visited node count: 351/1000000\nPost‐expand include size: 8424/2097152 bytes\nTemplate argument size: 2967/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   33.046      1 -total\n 74.36%   24.574      1 Template:Infobox/video\n 14.62%    4.830      1 Template:Comics\n 10.40%    3.437      5 Template:Icon\n  9.31%    3.078      1 Template:Quotebox\n  8.15%    2.693      1 Template:Selling_Out\n  7.89%    2.609      1 Template:Quote\n  7.50%    2.477      1 Template:(Handouts)\n  7.38%    2.440      1 Template:Succession\n  7.36%    2.434     18 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:21883-0!canonical and timestamp 20250602000904 and revision id 266861. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Donation_Options_Reviewed.&amp;oldid=266861\">http://sonichu.com/w/index.php?title=Donation_Options_Reviewed.&amp;oldid=266861</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2015",
    "Videos Christian uploaded to YouTube"
  ],
  "links": [
    "medallions",
    "Magi-chan",
    "next video",
    "Cwcville Shopping",
    "Amiibo",
    "Comics",
    "12",
    "autographed photo",
    "Bubbles",
    "Business",
    "mom",
    "Rosechu",
    "Yes, it still has been I, Christine Weston Chandler, who has been uploading the videos personally.",
    "Book Zero",
    "Chris",
    "Lego",
    "Book 11",
    "eBay",
    "stresses",
    "dad",
    "figure",
    "medallion",
    "Chris's videos",
    "mother's",
    "Sonichu comic",
    "Videos",
    "Angelica",
    "Sonichu",
    "YouTube",
    "home base",
    "Etsy",
    "November 2015",
    "Chris-chan Sonichu",
    "Blake",
    "Sonichu and Rosechu figure collection toy battle!",
    "2011",
    "Book Number One",
    "Wild",
    "commission",
    "Reason",
    "Punchy"
  ],
  "scraped_at": "2025-11-26T21:35:42.443189"
}