{
  "url": "http://sonichu.com/cwcki/Examples_of_Chris%27s_Ego",
  "title": "Examples of Chris's Ego",
  "display_title": "Examples of Chris's Ego",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><table style=\"background:#FFF; border:1px solid #AA0000; border-top:8px solid #AA0000; color:#000; width:100%; max-width:618px; margin:0 auto 16px;\">\n<tbody><tr style=\"vertical-align:top;\">\n<td style=\"padding:5px;\"><a class=\"image\" href=\"/cwcki/File:Barb2025-closeup.jpg\"><img alt=\"Barb2025-closeup.jpg\" decoding=\"async\" height=\"90\" src=\"/w/images/thumb/a/aa/Barb2025-closeup.jpg/90px-Barb2025-closeup.jpg\" srcset=\"/w/images/thumb/a/aa/Barb2025-closeup.jpg/135px-Barb2025-closeup.jpg 1.5x, /w/images/thumb/a/aa/Barb2025-closeup.jpg/180px-Barb2025-closeup.jpg 2x\" width=\"90\"/></a>\n</td>\n<td style=\"padding:0 5px 0 1px; width:100%;\"><div style=\"font-size:1.25em; margin:0\"><b>This article is out of date.</b></div>\n<hr/>\n<div style=\"margin-bottom:0\">We need information on <b>examples of Chris's ego in <i>Sonichu</i> #14, and <i>Sonichu Special</i> #5, #6, and #7.</b>.<br/>We suggest you <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Examples_of_Chris%27s_Ego&amp;action=edit\" rel=\"nofollow\">keep up with the times</a>.</div>\n</td></tr></tbody></table>\n<p>This is an exhaustive list of documented <b>examples of Chris's <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">ego</a></b> in the real world and in the <i>Sonichu</i> comic. It warrants its own page.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#In_the_real_world\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">In the real world</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#School\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">School</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Public_places\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Public places</span></a></li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#With_people\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">With people</span></a></li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#Online\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Online</span></a></li>\n<li class=\"toclevel-2 tocsection-6\"><a href=\"#Contests\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">Contests</span></a></li>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#Other\"><span class=\"tocnumber\">1.6</span> <span class=\"toctext\">Other</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-8\"><a href=\"#In_the_comic\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">In the comic</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-9\"><a href=\"#Instances_of_Chris's_ego_in_the_comics\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Instances of Chris's ego in the comics</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-10\"><a href=\"#References\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">References</span></a></li>\n<li class=\"toclevel-1 tocsection-11\"><a href=\"#See_also\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">See also</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"In_the_real_world\">In the real world</span></h2>\n<h3><span class=\"mw-headline\" id=\"School\">School</span></h3>\n<ul><li><a href=\"/cwcki/Manchester_High_School\" title=\"Manchester High School\">Manchester High School</a> — When Chris graduated from high school, he actually cried because he believed that he deserved a number of <s><a href=\"/cwcki/Autism\" title=\"Autism\">autistic</a></s> artistic awards for his <a href=\"/cwcki/Chris_and_art\" title=\"Chris and art\">artwork</a>. By his own admission, he also made a scene and ran out after getting his diploma, eventually having to be consoled by both his <a class=\"mw-redirect\" href=\"/cwcki/Mother\" title=\"Mother\">mother</a> and gal-pal <a href=\"/cwcki/Tiffany_Gowen\" title=\"Tiffany Gowen\">Tiffany Gowen</a>.</li>\n<li><a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">PVCC</a> — After being expelled for his <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">appalling behavior</a> by the <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Student's Dean</a>, Chris felt the need to write to the then-standing President of the United States, <a href=\"/cwcki/George_W._Bush\" title=\"George W. Bush\">George W. Bush</a>. The idea that a standing President would be willing to use his clout to reverse a local community college's administrative decision is ludicrous at best.</li></ul>\n<h3><span class=\"mw-headline\" id=\"Public_places\">Public places</span></h3>\n<ul><li><a href=\"/cwcki/The_GAMe_PLACe\" title=\"The GAMe PLACe\">The GAMe PLACe</a> — Chris, a regular patron, acted as if he owned the store. He was rude to the other customers and staff, was openly racist and homophobic to others, abused the access to a flat-screen TV, and was an all-around pain for the manager (and later owner), <a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snyder</a>. After many antics, he was banned from the place, first temporarily for going into the back room without permission, then permanently after yelling at a kid. Chris filmed a half-assed <a href=\"/cwcki/Apology_to_Game_%26_Hobby_Place\" title=\"Apology to Game &amp; Hobby Place\">apology</a> nine months later, not because he was sorry for his actions, but because the store was the only place in his area that had <a href=\"/cwcki/The_Eye_of_Judgment\" title=\"The Eye of Judgment\">Eye of Judgment</a> cards. Chris also attempted to incite harassment of employees of the store (using the very fans he had chastised mere weeks earlier), simply because Michael had refused to remove his ban.</li>\n<li><a href=\"/cwcki/Chris_and_the_law\" title=\"Chris and the law\">Jail</a> — During his time in jail following the <a href=\"/cwcki/28_October_2011\" title=\"28 October 2011\">28 October 2011</a> incident, Chris stated he refused to eat the prison food, since he had <a href=\"/cwcki/Autism\" title=\"Autism\">never done it</a> and was not going to start any time soon, and eating the food was beneath him. Later on, after being sent to jail following the <a href=\"/cwcki/Affair_with_Mother\" title=\"Affair with Mother\">incestuous affair</a>, Chris writes a <a href=\"/cwcki/Jail_Letter_-_19_September_2021\" title=\"Jail Letter - 19 September 2021\">letter</a> saying that his \"... life events at present and so far can directly be compared and matched with that which have been chronicled of none other than Jesus Christ of Nazareth himself, in any Holy Bible...\"</li>\n<li><a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a> — Following the incident on <a href=\"/cwcki/26_December_2014\" title=\"26 December 2014\">26 December 2014</a>, where he was ordered to get out of a <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a> he was previously banned from for vandalizing their <i><a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">Sonic Boom</a></i> displays and then maced a <a href=\"/cwcki/JERKS\" title=\"JERKS\">male</a> <a href=\"/cwcki/Manajerks\" title=\"Manajerks\">employee</a> on the way out, he had went onto Facebook to say that <i>he</i> in fact was the victim of the whole situation.</li>\n<li><a href=\"/cwcki/The_End_Games\" title=\"The End Games\">The End Games</a> - Chris's behavior at this card game shop was only slightly better than his behavior at the GAMe PLACe, with him generally acting like he was some sort of important celebrity. He would loudly sing and wail to his own music, pretended his <a href=\"/cwcki/Imaginary_friends\" title=\"Imaginary friends\">imaginary friends</a> were his bodyguards, would allegedly throw outbursts over things like him accidentally dropping his <a class=\"mw-redirect\" href=\"/cwcki/Medallion\" title=\"Medallion\">medallion</a>, and even placed Sonichu on one of the store's signs. Much like before, after many antics, he would be banned from the store, partly for getting into an argument with a game judge, and partly for getting into another argument with the store manager - the aforementioned sign for the store's Pokémon league got thrown away, and when Chris was told that his OC wasn't a real Pokémon character and shouldn't be displayed in the store, he inevitably got angry. Chris would demand several times to be unbanned, saying that he needed help playing <i>Dungeons &amp; Dragons</i> and that it would help bring the <a href=\"/cwcki/Dimensional_Merge\" title=\"Dimensional Merge\">Dimensional Merge</a>, but the store wouldn't budge. Chris then angrily claimed that \"They Sullied their reputation BAD\" when they banned him, and anonymously sent them a letter with a drawing of a <a href=\"/cwcki/Creepy_stare\" title=\"Creepy stare\">creepy stare</a>.</li></ul>\n<h3><span class=\"mw-headline\" id=\"With_people\">With people</span></h3>\n<ul><li><a href=\"/cwcki/Sarah_Nicole_Hammer\" title=\"Sarah Nicole Hammer\">Sarah Nicole Hammer</a> — One of Chris's first crushes. Chris made the small booklet <i><a href=\"/cwcki/Chris_%2B_Sarah%27s_Life-Shares\" title=\"Chris + Sarah's Life-Shares\">Chris + Sarah's Life-Shares</a></i> in an attempt to win her over on her 21st birthday. The booklet was merely a major ego trip, talking more about him and less about her, with the two of them replaced with Sonichu and Rosechu. He later cast her in his <i>Sonichu</i> comic and having her break up with <a href=\"/cwcki/Wes_Iseli\" title=\"Wes Iseli\">Wes Iseli</a> before disposing her when she was married away to <a class=\"mw-redirect\" href=\"/cwcki/William_Spicer\" title=\"William Spicer\">William Spicer</a>.</li>\n<li><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a> — For the longest time, Chris actually believed that he and Megan were going out as boyfriend and girlfriend. He even attacked someone for getting near Megan. When the infamous <a href=\"/cwcki/ShecameforCWC.JPG\" title=\"ShecameforCWC.JPG\">ShecameforCWC.JPG</a> picture was discovered, Chris actually thought that the reason she was upset was because she wasn't used to sexual things, and not the fact that she realised that Chris saw her as <a href=\"/cwcki/Women%27s_rights\" title=\"Women's rights\">nothing more than a</a> <a class=\"mw-redirect\" href=\"/cwcki/Sex_toy\" title=\"Sex toy\">sex toy</a>. He then tried to make Megan believe that the bullying from those amongst <a class=\"mw-redirect\" href=\"/cwcki/ED\" title=\"ED\">ED</a> was MUCH worse than the fact that he did the picture because he was afraid of trying to rape her. He also insisted that he was under much more emotional pain than she was, somehow believing that <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> posting pictures of <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a> with a <a href=\"/cwcki/Pickle\" title=\"Pickle\">pickle</a> on the Internet was worse than a so-called \"friend\" sexually harassing and drawing porn of you. Chris would later blame ED for the fact that he lost her friendship, not caring it was his fault in the first place.</li>\n<li><a href=\"/cwcki/Jerkop\" title=\"Jerkop\">Jerkops</a> — Thanks to Chris's various run-ins with the law, Chris has a very skewed view of law enforcement. After being tossed out of <a href=\"/cwcki/Mal-Wart\" title=\"Mal-Wart\">Walmart</a> and <a href=\"/cwcki/Get-Tar_Region\" title=\"Get-Tar Region\">Target</a>, he deemed that security guards were evil and just trying to play <a href=\"/cwcki/Kick_the_Autistic\" title=\"Kick the Autistic\">Kick the Autistic</a> and prevent him from completing his <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a>. However, following his arrest on <a href=\"/cwcki/28_October_2011\" title=\"28 October 2011\">28 October 2011</a>, Chris has now assumed that <i>all</i> law enforcement is evil and has gone out of his way to make sure they never take him into any sort of custody again. <a href=\"/cwcki/26_December_2014\" title=\"26 December 2014\">That hasn't worked</a> <a href=\"/cwcki/Jail_Saga\" title=\"Jail Saga\">out for him</a>.</li>\n<li><a href=\"/cwcki/Vanessa_Hudgens\" title=\"Vanessa Hudgens\">Vanessa Hudgens</a> - <a href=\"/cwcki/Joshua_Martinez\" title=\"Joshua Martinez\">Joshua Martinez</a> used the identity of the <i>High School Musical</i> star to troll Chris by pretending \"Vanessa\" wanted to ride his <a href=\"/cwcki/Duck\" title=\"Duck\">duck</a>. The fact that Chris actually believed a <i>bona fide</i> celebrity wanted to give him her <a href=\"/cwcki/China\" title=\"China\">china</a> speaks volumes about his hubris.</li>\n<li><a href=\"/cwcki/CWC_Personal_Sonichu_Presentation\" title=\"CWC Personal Sonichu Presentation\">The Sonichu promotional video</a> — In the Part 2 of his video, Chris shows to the camera an elegant drawing of the two main heroes of the comic book made by a fan called Allie. Not only does he proceed to comment \"Rosey's tail was wrong, but I'll forgive her,\" he presents a drawing made by himself as a better version.</li>\n<li><a href=\"/cwcki/Shigeru_Miyamoto\" title=\"Shigeru Miyamoto\">Shigeru Miyamoto</a> — Chris was convinced that Miyamoto, who is a world-famous video game designer and creator of beloved and legendary franchises like <i>Super Mario Bros</i>, <i>Donkey Kong</i>, <i>The Legend of Zelda</i> and <i>Star Fox</i>, would not only be honored to meet him, but in fact even <i>more</i> honored to meet Chris than Chris would be to meet him. Then, even after having his game proposal rejected by Miyamoto, Chris still remained convinced that Miyamoto was only \"holding out on [him]\" and would surely accept his offer in the near future.</li>\n<li><a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a> — In the final e-mail exchanges<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup> between the two, Jackie, quite accurately, pointed out many of Chris's flaws, also taking the time to rationally explain what he was doing wrong and what he could do to fix things. However, Chris took it the wrong way, claiming that she was being mean to him and <a href=\"/cwcki/Kick_the_Autistic\" title=\"Kick the Autistic\">hating</a> him by pointing out his flaws, still believing himself to be flawless and special.</li>\n<li><a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snyder</a> — Chris has long held enmity towards him for rightfully banning him from The GAMe PLACe because of his antics, not caring that it was his fault in the first place, even going on to develop a paranoid delusion that Michael Snyder's the ringleader of a conspiracy hellbent on persecuting him because he's autistic. After the fallout from the <a href=\"/cwcki/Simonla_Rosechu#Simonla_as_the_Lynchpin\" title=\"Simonla Rosechu\">Simonla</a> and <a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">Wallflower</a> incidents, Chris rekindled his efforts to get unbanned from The GAMe PLACe as part of getting back to the real world and failed miserably. This has lead Chris to throw anti-Semitic slurs (e.g., calling him a \"<a href=\"/cwcki/South_Park\" title=\"South Park\">Jew</a>\"), and attempting <a href=\"/cwcki/6_June_2010\" title=\"6 June 2010\">vehicular assault</a> <a href=\"/cwcki/28_October_2011\" title=\"28 October 2011\">at least twice</a>. During the <a href=\"/cwcki/This_is_how_the_Trial_went\" title=\"This is how the Trial went\">July 2012 trial</a>, Chris had the gall to call him a \"thieving liar\" before the judge, even though Snyder was far more lenient as he didn't want him to have a felony on his record, which would have risked a contempt of court and the plea bargain be invalidated. Even as late as <a class=\"mw-redirect\" href=\"/cwcki/Magfest#2018\" title=\"Magfest\">January 2018</a>, years after the store was closed, he still held serious animosity towards him.</li></ul>\n<h3><span class=\"mw-headline\" id=\"Online\">Online</span></h3>\n<ul><li><a href=\"/cwcki/LittleBigPlanet\" title=\"LittleBigPlanet\">LittleBigPlanet</a> — When Chris had shown up on LBP community and posted videos addressed to them, he once again said people \"should know him by now\". He immediately assumed people would praise him for his levels, especially the \"Collector's Case\", which he thought was the most original LBP level idea <i>ever.</i></li>\n<li><a href=\"/cwcki/For_G4s_Web_Soup\" title=\"For G4s Web Soup\">Web Soup</a> — When Chris learned that one of his videos was featured on an episode, he took it as a good thing, not realizing that the show made fun of people on the Internet.</li>\n<li><a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">Downsized SEGA</a> — On Feb 2, 2015, Chris took credit for SEGA's downsizing, stating that him and his 'pale-arm crusaders', with their boycotting, had damaged SEGA enough to force them to close office. This is despite the fact that \"normal market forces\" had been the supposed cause, literally <i>nobody</i> is joining Chris on his fight against blue arms, and SEGA is the publisher of all <i>Sonic</i> games. This gives some nicely- needed recent perspective on the size of his ego.</li>\n<li><a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic Forces</a> — In November 2017, after playing through the newest Sonic game, Chris unlocked customizable options for the avatar section. One of these included eyes with Heterochromia. Chris immediately assumed the unlockable was inspired by him since \"[his] right eye Is green, while [his] left is a shade of blue, like purple: the combo of Blue and red.\"</li></ul>\n<h3><span class=\"mw-headline\" id=\"Contests\">Contests</span></h3>\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Harvey_Birdman_Commercial\" title=\"Harvey Birdman Commercial\">Harvey Birdman Commercial</a> — In an attempt to win a contest involving the animated avian lawyer, Chris went to great lengths to talk about himself, his rivalry with <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>, and <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a>, but very, <i>very</i> little about Birdman himself. He even got the character's name wrong initially and left it in. When he inevitably lost, he whined on the <a href=\"/cwcki/Adult_Swim_posts\" title=\"Adult Swim posts\">Adult Swim forums</a> that his commercial was better than any of the other entries they accepted.</li>\n<li><a href=\"/cwcki/Chop_Chop_Master_Onion%27s_Rap_Showdown\" title=\"Chop Chop Master Onion's Rap Showdown\">Chop Chop Master Onion's Rap Showdown</a> — In his reviews of the top 10 videos, Chris highly praised his entry and claimed it was the best. After losing the contest to <a href=\"/cwcki/Adam_Stackhouse\" title=\"Adam Stackhouse\">Adam Stackhouse</a>, Chris would have a major hissy-fit over the loss, proclaiming even the slightest mistake as cheating, despite the fact that Chris himself had broken numerous rules in the process, including loading the contest with fake votes for him and bribing his <a href=\"/cwcki/Cole_Smithey\" title=\"Cole Smithey\">stepbrother</a> to vote for him. Even worse, he attempted to fabricate the PlayStation webpage to show that he himself had won and not Adam.</li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/GameStop_Be_A_Star_Sweepstakes\" title=\"GameStop Be A Star Sweepstakes\">GameStop Be A Star Sweepstakes</a> - After rumors circulated that whoever won this particular contest would end up becoming a playable character in a <i>Guitar Hero</i> game, trolls voted for Chris's entry en masse in the hopes that he would end up appearing in <i>World Tour</i>. Alas, this was not the case, but Chris did end up winning the contest anyway, which undoubtedly raised his ego. Chris claimed that he would share his prize, a $400 GameStop certificate, with his <a href=\"/cwcki/Wesley_Memorial_United_Methodist_Church\" title=\"Wesley Memorial United Methodist Church\">church congregation</a>,<sup class=\"reference\" id=\"cite_ref-2\"><a href=\"#cite_note-2\">[2]</a></sup>; however, he only gave $180 to his church, with the remaining money being used on himself.</li></ul>\n<h3><span class=\"mw-headline\" id=\"Other\">Other</span></h3>\n<ul><li><a href=\"/cwcki/Greene_County_Conspiracy\" title=\"Greene County Conspiracy\">Greene County School Board</a> — In one video, Chris proclaims that the Greene County School Board, who sought to help Chris when he was younger, initiated a massive conspiracy against him in order to keep him in his \"autistic shell\". This also included paying off a realtor to keep their house from being sold and paying off Michael Snyder to keep him out of the GAMe PLACe.</li>\n<li><a href=\"/cwcki/Unban_contracts\" title=\"Unban contracts\">Unban contracts</a> — Chris demands the likes of GameStop and Best Buy to unban him for his <a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">incidents</a> over there, even though they had every right to ban him for his conduct. Not only that but he also demands that they do not call the <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">police</a> against him (which is illegal since contracts cannot be used to protect from <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_the_Law\" title=\"Chris and the Law\">criminal prosecution</a>, thus making it null and void), and he believes that not signing would prove that that they are \"most uncompassionate and lacking of heart and soul of any person\", and are a bunch of \"unwelcoming immature rat -a**\" b*****\". He even goes as far as to say that his ban from those places is \"outdated\" (similar to how he tried to convince <a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snyder</a> that he needs to \"<a href=\"/cwcki/Chris_and_remorse\" title=\"Chris and remorse\">forgive</a> <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">and</a> <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">forget</a>\"), and that the ban is a human rights violation because he's a lesbian transwoman.</li>\n<li><a href=\"/cwcki/Affirmations_List\" title=\"Affirmations List\">Affirmations List</a> - A three-page-long list Chris wrote in <a href=\"/cwcki/March_2021\" title=\"March 2021\">March 2021</a> of his positive traits, it consists of thoroughly delusional assessments for stroking his own ego.</li>\n<li><a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">His vocabulary</a> - The whole purpose of language is to communicate thoughts and ideas to other people, but Chris has managed to turn his vocabulary into a brick wall by crafting a mutilated lexicon that makes sense only to him, forcing people who want to communicate with him to understand his bastardized vocabulary as opposed to Chris having to talk normally and understand regular speech.</li></ul>\n<h2><span class=\"mw-headline\" id=\"In_the_comic\">In the comic</span></h2>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">I did an AWESOME FUCKIN' JOB.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite>Chris, regarding his \"<a href=\"/cwcki/I_Am_The_TRUE,_Original_CCWC\" title=\"I Am The TRUE, Original CCWC\">first romantic attempt</a>\".</cite>\n</td></tr></tbody></table>\n<p>While <a class=\"mw-redirect\" href=\"/cwcki/Issue_0\" title=\"Issue 0\">Issue 0</a> and <a class=\"mw-redirect\" href=\"/cwcki/Issue_1\" title=\"Issue 1\">Issue 1</a> do focus on Sonichu, <a href=\"/cwcki/Christian_Weston_Chandler_(comic_character)\" title=\"Christian Weston Chandler (comic character)\">Chris-Chan</a> takes over as the main character throughout <a class=\"mw-redirect\" href=\"/cwcki/Issue_2\" title=\"Issue 2\">Issue 2</a>, <a href=\"/cwcki/Sonichu_5\" title=\"Sonichu 5\">Issue 5</a>, <a href=\"/cwcki/Sonichu_6\" title=\"Sonichu 6\">Issue 6</a> and <a href=\"/cwcki/Sonichu_7\" title=\"Sonichu 7\">Issue 7</a>, with <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a> as a supporting character, and in his infrequent appearances he invariably sings Chris's praises. <a href=\"/cwcki/Sonichu_8\" title=\"Sonichu 8\">Issue 8</a> and <a href=\"/cwcki/Sonichu_9\" title=\"Sonichu 9\">Issue 9</a> see Sonichu taking back his major role as the main character, but at this stage he's just a Mary Sue for Chris. The main story arc of <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">Issue 10</a> is the resurgence of Chris and his elimination of every enemy he has so far. He also portrays himself as skinny and handsome, although this doesn't happen till said <i>Issue 2</i>, and throughout the comic series sporadically gives his self-insert character superpowers that are never explained. He even makes several episodes that dramatize events he had in real-life, with the extremely self-indulgent fantasies that are described below.\n</p><p>Chris's ego is in full bloom in the comics. The name of the city in which he and his Electric Hedgehog Pokémon strive to protect is known as <a class=\"mw-redirect\" href=\"/cwcki/CWCVille\" title=\"CWCVille\">CWCVille</a>. The city's currency is C-Quarters and W-Quarters. One of the major drinks in this city is known as <a href=\"/cwcki/CWC_Cola\" title=\"CWC Cola\">CWC Cola</a>. The radio station is called \"<a href=\"/cwcki/KCWC\" title=\"KCWC\">KCWC</a>\"; the hotel is called the \"Double CWC\"; even his <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Hyrule\" title=\"wikipedia:Hyrule\">Hyrule</a> ripoff is called \"<a href=\"/cwcki/RuleCWC\" title=\"RuleCWC\">RuleCWC</a>\". Basically, everything is named after Chris. The Sonichus and Rosechus he created refer to him as \"father\". His self-insert is mayor, but never ever performs any mayoral duties whatsoever and his actual role is more like a god-king than any kind of elected official — as Chris says, there <a class=\"mw-redirect\" href=\"/cwcki/Honor_Roll\" title=\"Honor Roll\">\"is\"</a> no elections.\n</p>\n<h3><span id=\"Instances_of_Chris.27s_ego_in_the_comics\"></span><span class=\"mw-headline\" id=\"Instances_of_Chris's_ego_in_the_comics\">Instances of Chris's ego in the comics</span></h3>\n<ul><li><b><a href=\"/cwcki/Sonichu_3\" title=\"Sonichu 3\"><i>Sonichu</i> #3</a>:</b> This issue has a semi-fictionalized account of an incident Chris had with the managers of a <a href=\"/cwcki/McDonald%27s\" title=\"McDonald's\">McDonald's</a>. He was loitering and soliciting, and, knowing that a 25-year old, <a href=\"/cwcki/Obesity\" title=\"Obesity\">morbidly obese</a> <a class=\"mw-redirect\" href=\"/cwcki/Autistic\" title=\"Autistic\">autistic</a> man-child <a href=\"/cwcki/Creepy_stare\" title=\"Creepy stare\">creepily looking</a> at patrons can't possibly end well, security threw him out. In his comic book, however, Chris exclaims that the Jerkops are conspiring against him, preventing him from finding <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">true love</a>. He turns into <a class=\"mw-redirect\" href=\"/cwcki/Chris-Chan_Sonichu\" title=\"Chris-Chan Sonichu\">Chris-Chan Sonichu</a> and defeats them with the help of <a href=\"/cwcki/Darkbind_Sonichu\" title=\"Darkbind Sonichu\">Darkbind Sonichu</a>, who admits he only helped because Chris was his creator.</li>\n<li><b><a href=\"/cwcki/Sonichu_5\" title=\"Sonichu 5\"><i>Sonichu</i> #5</a>:</b> This issue has Chris write Sarah Hammer out of the comic so he could focus exclusively on <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>, the new object of his desire. While Sarah did marry a man named <a class=\"mw-redirect\" href=\"/cwcki/William_Spicer\" title=\"William Spicer\">William Spicer</a>, Chris was not present at her wedding, and had never met Spicer, as he was represented in the comic by a generic <i><a class=\"mw-redirect\" href=\"/cwcki/Yu-Gi-Oh\" title=\"Yu-Gi-Oh\">Yu-Gi-Oh</a></i> character. The next episode has Chris fawning over Megan, and she over him. In reality, Megan saw Chris only as a friend, and was constantly rebuffing his advances. The episode features two different endings because Megan either did not like the original ending or objected to being featured in the comic at all.</li>\n<li><b><a href=\"/cwcki/Sonichu_7\" title=\"Sonichu 7\"><i>Sonichu</i> #7</a>:</b> Chris is envious of Bionic's ability to screw Megagi until Megan holds his hand, again implying romance where none exists. After Chris gets trapped in the time void, he mixes both fake memories from the comic with real ones, like Megan \"dumping\" him and his denial of having drawn <a class=\"mw-redirect\" href=\"/cwcki/Shecameforcwc.jpg\" title=\"Shecameforcwc.jpg\">Shecameforcwc.jpg</a> (he blames it on <a class=\"mw-redirect\" href=\"/cwcki/ED\" title=\"ED\">ED</a>, even though he was the one that drew it and uploaded it onto that site), Mary Lee Walsh's invasion of CWCville and her defeat at the hands of the Sonichus and Rosechus, and <a href=\"/cwcki/Joshua_Martinez\" title=\"Joshua Martinez\">Joshua Martinez</a> hooking him up with <a href=\"/cwcki/Vanessa_Hudgens\" title=\"Vanessa Hudgens\">Vanessa Hudgens</a>.</li></ul>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:202px;\"><a class=\"image\" href=\"/cwcki/File:Christine_Night_Weston_Star_Chandler.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"129\" src=\"/w/images/thumb/c/c9/Christine_Night_Weston_Star_Chandler.jpg/200px-Christine_Night_Weston_Star_Chandler.jpg\" srcset=\"/w/images/thumb/c/c9/Christine_Night_Weston_Star_Chandler.jpg/300px-Christine_Night_Weston_Star_Chandler.jpg 1.5x, /w/images/thumb/c/c9/Christine_Night_Weston_Star_Chandler.jpg/400px-Christine_Night_Weston_Star_Chandler.jpg 2x\" width=\"200\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Christine_Night_Weston_Star_Chandler.jpg\" title=\"Enlarge\"></a></div>Now with twice the CWC.</div></div></div>\n<ul><li><b><a href=\"/cwcki/Sonichu_12-9\" title=\"Sonichu 12-9\"><i>Sonichu</i> #12-9</a>:</b> The comic features a new self-insert for Chris named <a href=\"/cwcki/Night_Star\" title=\"Night Star\">Night Star</a>, which is a blatant Mary Sue empowered with story-breaking psychic abilities. Night Star meets with Chris's comic incarnation, who is inexplicably colored to resemble <a href=\"/cwcki/Christine_Doll\" title=\"Christine Doll\">yet another depiction of Chris</a>, and helps him transform into a body that looks like herself. The characters' full names are \"Christine Night Weston Star Chandler\", which Chris wrote without a hint of irony. Chris also depicts his real self in the comic as an alicorn, an extremely rare species of pony (that combines the powers of a pegasus and a unicorn) from <i>My Little Pony</i> reserved solely for elite characters.</li>\n<li><b><a href=\"/cwcki/Sonichu_13\" title=\"Sonichu 13\"><i>Sonichu</i> #13</a>:</b> This issue focuses on an incoherent series of plot threads the <a href=\"/cwcki/Idea_Guys\" title=\"Idea Guys\">Idea Guys</a> were brainwashing Chris into believing. When Lowee was attacked by Cloakers, Chris proceeded to send CWCville's entire army division, the CWC Defense, and his team of autobots, led by his own autobot car, <a class=\"mw-redirect\" href=\"/cwcki/Son-chu\" title=\"Son-chu\">Son-chu</a>, to her aid. After Uzume managed to make herself whole again and asked Chris for her powers back, Chris effortlessly transferred the powers within himself back to Uzume while still keeping Uzume's seal. Chris zapped a hotel with lightning because it was full of criminals. (Their crimes are unknown, but Chris's judgment is divine, so who cares?) When someone else had become mayor of CWCville, Chris destroyed the CWCville mall, killing thousands and the non-mayor, showing how he is the true and honest <s>dictator</s> mayor of CWCville. When Monika tried to wipe Chris's memories, it didn't work because Chris was immune. Then CWCville was clear; all the baddies were gone, and everything went back to normal because Chris said so. At some point, all five of the Sailor Scout souls came to Chris and spoke kind words that blessed his heart crystal, which grew his powers. Chris showcases his goddess complex by likening himself to the CPU goddesses of hyperdimension Neptunia. When he was having a conversation with Lowee at a lovely cafe, Chris broke down and cried, claiming that due to his online history, no one would hire him without taking into account that he looks like a middle-aged misanthrope playing <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">dress up</a> with a toddler and smells like <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">the dumpster he lives in</a>. He then continues to cry, screaming that his <a href=\"/cwcki/Chris_and_work\" title=\"Chris and work\">responsibilities</a> are <a href=\"/cwcki/Chris_and_negligence\" title=\"Chris and negligence\">nearly endless</a>. When <a class=\"mw-redirect\" href=\"/cwcki/Jamsta_Sonichu\" title=\"Jamsta Sonichu\">Jamsta Sonichu</a> was tried for sexual harassment, Chris obstructed the law by sending his good vibes towards the courthouse, and the judge declared Jamsta Sonichu not guilty. When the Australatinans attacked CWCville, Chris was able to regroup the CWCville forces with all his level 100 Pokemon that he had <a href=\"/cwcki/Chris_and_video_games\" title=\"Chris and video games\">accumulated over the years</a>. Chris created the CPU Battery-Charge Blue Heart to attempt to pray for the war to end. In an attempt to save Simonla from burning alive, Chris projects himself and sets psychic barriers, magically withstanding the heat and agony of their flamethrowers. Chris claims that with the help of <a href=\"/cwcki/Magi-Chan\" title=\"Magi-Chan\">Magi-Chan</a>, he realized that all the messages from God-Jesus that he had received so far had only been Akan messing with his head, shifting the blame of himself acting on his impulses to God-Jesus, and then to Akan. Chris deepens his Goddess complex by announcing that he no longer believes in God, but rather in the CPU goddesses that he is part of. Chris finds all thousands of his clones and napalms them on an open field. He is also victorious in the CWCville war by making the Nazis retreat. Chris claims to be able to appear in multiple places all at once, not feel pain, and kill everyone he does not like with lightning speed. Moreover, anytime a Nazi <a href=\"/cwcki/Chris_and_gender\" title=\"Chris and gender\">misgenders</a> him, they turn into a liquid paste after being magically doused in Chris's blood, and all the Nazis not liquefied turn into Sonichus. Seven Chris Chan Sonichu statues are erected in CWCville, reminding its citizens of who they have to <a href=\"/cwcki/Messiah_complex\" title=\"Messiah complex\">worship</a>.</li>\n<li><b><a href=\"/cwcki/Sonichu_14\" title=\"Sonichu 14\"><i>Sonichu</i> #14</a>:</b> Chris begins this issue by describing his \"great destiny\" and why he is a unique Sonichu. Sonichu conveys to the reader that Chris has always had special <a href=\"/cwcki/Magical_thinking\" title=\"Magical thinking\">abilities</a>, that his future is predetermined, and how he goes above and beyond to keep him safe. Chris claims that he even personally <a href=\"/cwcki/Chris_and_work\" title=\"Chris and work\">helped to save numerous days</a> in a super-heroic manner. Chris recounts how he utilized the <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">reality stone</a> to undo all the harm the <a class=\"mw-redirect\" href=\"/cwcki/Idea_guys\" title=\"Idea guys\">Idea guys</a> caused to the C-197 dimension before punishing them. Chris reminds us that significant occurrences are all connected to him and that he serves as one of the main deity conduits for the merge. Chris claims that his soul and thoughts are somehow projected everywhere, and that the heavy energy coming from the heart aura makes <a href=\"/cwcki/Chris_and_health\" title=\"Chris and health\">his numb body</a> totally functioning. Chris makes an effort to characterize his uncontrollable \"loud, long thunderous\" belches as a drawback of being a godess, and not his <a href=\"/cwcki/Chris_and_nutrition\" title=\"Chris and nutrition\">poor diet</a>. Chris asserts that his psychic abilities astounded a doctor. Chris displays his sense of self-importance by claiming that when he was unable to lucid dream, Emanuel, Jesus, Buddah, the CPU Godesses, and all the other dieties intervened in his dreams and attempted to assist him by reminding him of his Godess powers and how to use them. Chris rambles on, asserting that he literally shares a subspace and sub-dimension with all of the other deities in the galaxy within his subconcious. Chris asserts that he sang and <a href=\"/cwcki/Freestyle_Dance_With_Me,_For_Our_World!\" title=\"Freestyle Dance With Me, For Our World!\">danced</a> in tandem with the actors on stage during the brony-con Grand Galloping Galla without any prior experience or training. He draws a scene showing that he captivated a few attendants behind him who were surprised by his skills. Chris attributes these events to his magical powers rather than his ego playing tricks on him.</li></ul>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\"><a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">Jackie E-mails 21</a>, <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">Jackie E-mails 22</a> and <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">Jackie E-mails 23</a></span>\n</li>\n<li id=\"cite_note-2\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-2\">↑</a></span> <span class=\"reference-text\"><a href=\"/cwcki/CWC_Update_28_December_2008\" title=\"CWC Update 28 December 2008\">CWC Update 28 December 2008</a></span>\n</li>\n</ol></div>\n<h2><span class=\"mw-headline\" id=\"See_also\">See also</span></h2>\n<ul><li><a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">Chris and his ego</a></li>\n<li><a href=\"/cwcki/Christian_Love_Day\" title=\"Christian Love Day\">Christian Love Day</a></li>\n<li><a href=\"/cwcki/Sub-Episodes\" title=\"Sub-Episodes\">Sub-Episodes</a></li></ul>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible autocollapse\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Lists\" title=\"Template:Lists\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Lists&amp;action=edit&amp;redlink=1\" title=\"Template talk:Lists (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Lists&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Lists</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Original content\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/List_of_Christian%27s_edits_to_the_CWCki\" title=\"List of Christian's edits to the CWCki\">CWCki edits</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Christian%27s_edits_to_Encyclopedia_Dramatica\" title=\"List of Christian's edits to Encyclopedia Dramatica\">ED edits</a> • <a href=\"/cwcki/List_of_Flipnotes\" title=\"List of Flipnotes\">Flipnotes</a> • <a href=\"/cwcki/List_of_OkCupid_Answers\" title=\"List of OkCupid Answers\">OkCupid Answers</a> • <a href=\"/cwcki/Things_Chris_has_ripped_off\" title=\"Things Chris has ripped off\">Plagiarism</a> • <a href=\"/cwcki/List_of_Sonichu_characters\" title=\"List of Sonichu characters\"><i>Sonichu</i> characters</a> (<a href=\"/cwcki/List_of_fictional_characters_guest_appearing_in_Sonichu\" title=\"List of fictional characters guest appearing in Sonichu\">fictional</a>) • <a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Videos</a> • <a href=\"/cwcki/List_of_cards_from_The_Wall_of_Originals\" title=\"List of cards from The Wall of Originals\">The Wall of Originals</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Christian%27s_comments_on_YouTube\" title=\"List of Christian's comments on YouTube\">YouTube comments</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Life\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/List_of_beliefs_brainwashed_into_Chris\" title=\"List of beliefs brainwashed into Chris\">Brainwashed beliefs</a> • <a href=\"/cwcki/List_of_conventions\" title=\"List of conventions\">Conventions attended</a> • <a href=\"/cwcki/CWC-isms\" title=\"CWC-isms\">CWC-isms</a> • <a href=\"/cwcki/Disguises\" title=\"Disguises\">Disguises</a> • <a class=\"mw-selflink selflink\">Ego</a> • <a href=\"/cwcki/Fandoms\" title=\"Fandoms\">Fandoms</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Chris%27s_financial_enablers\" title=\"List of Chris's financial enablers\">Financial enablers</a> • <a href=\"/cwcki/Gal_pal\" title=\"Gal pal\">Gal pals</a> • <a href=\"/cwcki/List_of_geographic_areas\" title=\"List of geographic areas\">Geographic areas</a> • <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">Lies</a> • <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_mathematics\" title=\"Chris and mathematics\">Mathematical errors</a>  • <a href=\"/cwcki/OC\" title=\"OC\">OCs</a> • <a href=\"/cwcki/List_of_phrases_Chris_copied_from_media\" title=\"List of phrases Chris copied from media\">Phrases copied</a> • <a href=\"/cwcki/List_of_places_that_have_banned_Chris\" title=\"List of places that have banned Chris\">Places banned from</a> • <a href=\"/cwcki/List_of_restaurants\" title=\"List of restaurants\">Restaurants</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Chris%27s_sweethearts\" title=\"List of Chris's sweethearts\">Sweethearts</a> • <a href=\"/cwcki/List_of_things_Chris_has_shoved_up_his_ass\" title=\"List of things Chris has shoved up his ass\">Things shoved up his ass</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Purchases\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/List_of_Chris%27s_Adam_%26_Eve_purchases\" title=\"List of Chris's Adam &amp; Eve purchases\">Adam &amp; Eve</a> • <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">Best Buy</a> • <a href=\"/cwcki/Club_Nintendo\" title=\"Club Nintendo\">Club Nintendo</a> • <a href=\"/cwcki/List_of_Chris%27s_eBay_purchases\" title=\"List of Chris's eBay purchases\">eBay</a> • <a href=\"/cwcki/McDonald%27s#McDonald's_Monopoly\" title=\"McDonald's\">McDonald's Monopoly</a> • <a href=\"/cwcki/My_Coke_Rewards\" title=\"My Coke Rewards\">My Coke Rewards</a> • <a href=\"/cwcki/Netflix\" title=\"Netflix\">Netflix</a> • <a href=\"/cwcki/List_of_Chris%27s_Rhapsody.com_downloads\" title=\"List of Chris's Rhapsody.com downloads\">Rhapsody</a> • <a href=\"/cwcki/List_of_toys\" title=\"List of toys\">Toys</a> • <a class=\"mw-redirect\" href=\"/cwcki/List_of_Chris%27s_games\" title=\"List of Chris's games\">Video games</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Sony\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/List_of_Chris%27s_Blu-ray_discs\" title=\"List of Chris's Blu-ray discs\">Blu-rays</a> • <a href=\"/cwcki/PlayStation_3\" title=\"PlayStation 3\">PlayStation 3</a> • <a class=\"mw-redirect\" href=\"/cwcki/PlayStation_4\" title=\"PlayStation 4\">PlayStation 4</a> • <a href=\"/cwcki/List_of_Chris%27s_PSN_game_downloads\" title=\"List of Chris's PSN game downloads\">PSN Games</a> • <a href=\"/cwcki/List_of_Chris%27s_PSN_video_downloads\" title=\"List of Chris's PSN video downloads\">PSN Videos</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251031045044\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.129 seconds\nReal time usage: 0.141 seconds\nPreprocessor visited node count: 686/1000000\nPost‐expand include size: 19089/2097152 bytes\nTemplate argument size: 6964/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 572/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   51.429      1 -total\n 58.15%   29.904      1 Template:Lists\n 50.65%   26.048      1 Template:Navbox\n 15.81%    8.130      1 Template:Dated\n  9.47%    4.868      1 Template:Box\n  7.13%    3.667      1 Template:Tnavbar\n  5.23%    2.690      1 Template:Quote\n  5.19%    2.671     37 Template:•\n  5.09%    2.620      1 Template:Articleofthenow\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:8681-0!canonical and timestamp 20251031045044 and revision id 332893. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Examples_of_Chris%27s_Ego&amp;oldid=332893\">http://sonichu.com/w/index.php?title=Examples_of_Chris%27s_Ego&amp;oldid=332893</a>\"</div></div>",
  "categories": [
    "Articles of the Now",
    "Lists"
  ],
  "links": [
    "Issue 7",
    "Dimensional Merge",
    "and",
    "Issue 5",
    "reality stone",
    "Sonichu characters",
    "March 2021",
    "Jackie E-mails 23",
    "Idea Guys",
    "Affirmations List",
    "Shigeru Miyamoto",
    "Financial enablers",
    "Chop Chop Master Onion's Rap Showdown",
    "Unban contracts",
    "Jew",
    "Issue 1",
    "worship",
    "CWC Update 28 December 2008",
    "Chris and his ego",
    "forgive",
    "Gal pals",
    "Vanessa Hudgens",
    "forget",
    "imaginary friends",
    "Harvey Birdman Commercial",
    "sex toy",
    "Video games",
    "accumulated over the years",
    "The Sonichu promotional video",
    "Chris + Sarah's Life-Shares",
    "Jail",
    "his numb body",
    "Issue 9",
    "at least twice",
    "CWCVille",
    "dress up",
    "OkCupid Answers",
    "Issue 8",
    "LittleBigPlanet",
    "Plagiarism",
    "ED",
    "Joshua Martinez",
    "medallion",
    "Sonichu #13",
    "Love Quest",
    "Conventions attended",
    "incestuous affair",
    "Walmart",
    "Sonichu #12-9",
    "Mary Lee Walsh",
    "CWCki edits",
    "Wes Iseli",
    "misgenders",
    "Sonichu #3",
    "male",
    "GameStop Be A Star Sweepstakes",
    "Mathematical errors",
    "Magi-Chan",
    "PlayStation 4",
    "the dumpster he lives in",
    "mother",
    "Son-chu",
    "pickle",
    "Night Star",
    "church congregation",
    "Things shoved up his ass",
    "nearly endless",
    "responsibilities",
    "never done it",
    "hating",
    "July 2012 trial",
    "ego",
    "Student's Dean",
    "trolls",
    "YouTube comments",
    "RuleCWC",
    "Issue 0",
    "incidents",
    "creepy stare",
    "Web Soup",
    "Sarah Nicole Hammer",
    "Sonic Forces",
    "Disguises",
    "PSN Videos",
    "Flipnotes",
    "Chris-Chan",
    "His vocabulary",
    "Fandoms",
    "\"is\"",
    "Michael Snyder",
    "Darkbind Sonichu",
    "Rosechu",
    "Sonic Boom",
    "Adult Swim forums",
    "Sonichu #14",
    "duck",
    "Shecameforcwc.jpg",
    "KCWC",
    "employee",
    "danced",
    "ED edits",
    "yet another depiction of Chris",
    "That hasn't worked",
    "first romantic attempt",
    "Lies",
    "Tiffany Gowen",
    "Jackie E-mails 22",
    "helped to save numerous days",
    "creepily looking",
    "Toys",
    "abilities",
    "Chris-Chan Sonichu",
    "Issue 2",
    "Sonichu",
    "Christian Love Day",
    "Adam & Eve",
    "artwork",
    "PVCC",
    "Netflix",
    "William Spicer",
    "autistic",
    "Jackie",
    "Target",
    "Issue 6",
    "Jamsta Sonichu",
    "poor diet",
    "Phrases copied",
    "The Wall of Originals",
    "Downsized SEGA",
    "McDonald's",
    "OCs",
    "vehicular assault",
    "Sonichu #5",
    "police",
    "ShecameforCWC.JPG",
    "The GAMe PLACe",
    "criminal prosecution",
    "apology",
    "GameStop",
    "china",
    "CWC-isms",
    "28 October 2011",
    "fictional",
    "Megan Schroeder",
    "letter",
    "Manchester High School",
    "stepbrother",
    "Wallflower",
    "Brainwashed beliefs",
    "Yu-Gi-Oh",
    "Greene County School Board",
    "The End Games",
    "morbidly obese",
    "true love",
    "Idea guys",
    "eBay",
    "My Coke Rewards",
    "Places banned from",
    "PlayStation 3",
    "CWC Cola",
    "Geographic areas",
    "Sweethearts",
    "Kick the Autistic",
    "Restaurants",
    "PSN Games",
    "nothing more than a",
    "Jerkops",
    "Videos",
    "George W. Bush",
    "Sonichu #7",
    "26 December 2014",
    "out for him",
    "Adam Stackhouse",
    "appalling behavior",
    "Jackie E-mails 21",
    "Best Buy",
    "Eye of Judgment",
    "Blu-rays",
    "Issue 10",
    "Rhapsody",
    "Club Nintendo",
    "Sub-Episodes"
  ],
  "scraped_at": "2025-11-26T21:24:22.094534"
}