{
  "url": "https://sonichu.com/cwcki/Facebook_statuses",
  "title": "Facebook statuses",
  "display_title": "Facebook statuses",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>Chris had funny <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> statuses on his old profile, and continues to have them on his current profile.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Cwcfacebookwordcloud.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"202\" src=\"/w/images/thumb/4/48/Cwcfacebookwordcloud.jpg/300px-Cwcfacebookwordcloud.jpg\" srcset=\"/w/images/thumb/4/48/Cwcfacebookwordcloud.jpg/450px-Cwcfacebookwordcloud.jpg 1.5x, /w/images/thumb/4/48/Cwcfacebookwordcloud.jpg/600px-Cwcfacebookwordcloud.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Cwcfacebookwordcloud.jpg\" title=\"Enlarge\"></a></div>A wordcloud of Chris's statuses.</div></div></div>\n<table class=\"wikitable\">\n<tbody><tr>\n<th>Text\n</th>\n<th>Time\n</th></tr>\n<tr>\n<td>Christian Weston Chandler is <a href=\"/cwcki/Feel_So_Lonesome\" title=\"Feel So Lonesome\">lonesome</a> and playin' his <a class=\"mw-redirect\" href=\"/cwcki/Video_games\" title=\"Video games\">videogame</a>.\n</td>\n<td>January 10, <a href=\"/cwcki/2008\" title=\"2008\">2008</a> at 12:37am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is lonesome and playin' his videogame.\n</td>\n<td>January 10, 2008 at 12:39am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is lonesome and waitin' at the <a href=\"/cwcki/University_of_Virginia\" title=\"University of Virginia\">Alderman Library</a>\n</td>\n<td>January 16, 2008 at 3:00am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is lonesome at <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">home</a>.\n</td>\n<td>January 18, 2008 at 8:45pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is lonesome at home and tired of the snow.\n</td>\n<td>January 22, 2008 at 3:37am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is lonesome at home\n</td>\n<td>January 23, 2008 at 8:17pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at the UVA's Alderman Library Lounge This Afternoon.\n</td>\n<td>January 23, 2008 at 8:20pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at the UVA's Alderman Library's Lounge This Afternoon.\n</td>\n<td>January 24, 2008 at 2:23am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is at home\n</td>\n<td>January 24, 2008 at 4:59pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at <a href=\"/cwcki/The_GAMe_PLACe\" title=\"The GAMe PLACe\">The Game Place</a> this evening for <a href=\"/cwcki/Pok%C3%A9mon\" title=\"Pokémon\">Pokemon</a> League.\n</td>\n<td>January 24, 2008 at 11:52pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is at home\n</td>\n<td>January 25, 2008 at 5:36pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be attending the early service at his <a href=\"/cwcki/Wesley_Memorial_United_Methodist_Church\" title=\"Wesley Memorial United Methodist Church\">church</a>\n</td>\n<td>January 26, 2008 at 10:18pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is at home\n</td>\n<td>January 27, 2008 at 6:01pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at the UVA's Alderman Library's Lounge this Afternoon\n</td>\n<td>January 28, 2008 at 7:27pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at the UVA's Alderman Library's Lounge this Afternoon, <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">and I am real lonely.</a>\n</td>\n<td>January 28, 2008 at 9:11pm\n</td></tr>\n<tr>\n<td>I'm not seeing any NEW posts on my wall, please write something pleasant, some <a class=\"mw-redirect\" href=\"/cwcki/Gal-pal\" title=\"Gal-pal\">gal</a>.\n</td>\n<td>January 29, 2008 at 3:13am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at The Game Place this evening for Pokemon League.\n</td>\n<td>January 31, 2008 at 10:17pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be attending the early service at his church\n</td>\n<td>February 2, 2008 at 7:14pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is at home\n</td>\n<td>February 7, 2008 at 9:23am\n</td></tr>\n<tr>\n<td>Christian Weston Chandler will be at The Game Place this evening for Pokemon League.\n</td>\n<td>February 7, 2008 at 4:56pm\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is at home\n</td>\n<td>February 12, 2008 at 3:44pm\n</td></tr>\n<tr>\n<td>Open Question; Please Answer. Am I Good Looking or handsome?\n</td>\n<td>January 29, 2012\n</td></tr>\n<tr>\n<td>Here is a suggestion, and it would greatly be appreciated. Download (To your phone or handheld), or\n<p>Perferably (color) Print, my Profile Photo. Share with me as many of y'all's female friends. Ask them each if they think I look cute, good, attractive or not. And if they ask, tell them I am single. And if they ask How I am still single; DO NOT HESITATE to inform them, \"He is very shy and high-functionally autistic.\" TELL THEM NOT TO GOOGLE MY NAME, or just leave my name out of the conversation.\n</p>\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>Well, still an open question, do I look attractive in my most current photograph, featured Profile Photo?\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>During a time of which, <a href=\"/cwcki/The_Tale_Of_The_Crazy_Pacer\" title=\"The Tale Of The Crazy Pacer\">\"Pacing\"</a> with said sign stuck onto original DS played the role. I was considered \"Crazy\", but my actions were greatly misunderstood by the people. \"Soliciting?\"?!! I had no understanding or awareness of that term until after I was handcuffed Twice; Recorded on file once. I had little respect to the <a href=\"/cwcki/Jerkop\" title=\"Jerkop\">Jerkops</a> in colors other then blue or black. After October 28, 2011; I know have TOTAL Disrespect and Miscontent of the soo-called \"Officers of the Badge.\"\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>At the capital <a href=\"/cwcki/Charlottesville_Fashion_Square\" title=\"Charlottesville Fashion Square\"> F.Sq Mall</a>; Population: Mild to medium.\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>It really makes me feel soo sad, lonely and disappointed to feel soo INVISIBLE IN PUBLIC. I could just Stand in Walking Traffic, and I would ONLY be overlooked and walked through like a ghost of sad, lonely pasts\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>I mean, ANYONE can feel sorry for somebody who is worse off, but do THEY actually do ANYTHING for that person? The answer is No. Another thing that makes me sad.\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>This Charlottesville \"Community\" is FULL of Ignorant, Uncaring, Snooty, Snobish Corrupted People.\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>Time and Time again, I saw Very Little Success in Attracion. If \"Good Looks\" attract the opposite gender, and if I have such a good-looking, kind face that may be even considered Remotely Attractive, I would have attracted my woman right away and I would not feel soo crappy and miserable today.\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>I am Not looking forward to turning 30. [:_(\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>It reminds me of countless times I hung out here from '05 to '07 in the enduring days of my Sweetheart Search. During most of which, I resorted to a method of attraction that I learned later \"made me look retarded\"; having a sign by my side stating, \"##- Year Old, Single Male, searching for an 18 - ## year old Single Woman.\"\n</td>\n<td>January 30, 2012\n</td></tr>\n<tr>\n<td>February is coming up... My birthday's on the 24th... I'll be 30... Still a Virgin. I mean, MOST people lose their Virgin Marys BEFORE 21. My mother lost hers in her High School years. My Father lost his at the age of 27. \"THE 40 YEAR OLD VIRGIN\"!!! DAMN IT! Abstinence is a Very Crappy Joke! It only leads to Growing, GROWing, GROWING EMOTIONAL PAIN over the extended time.\n</td>\n<td>Janurary 30, 2012\n</td></tr>\n<tr>\n<td>I miss hanging out with my friends too.\n</td>\n<td>January 31, 2012\n</td></tr>\n<tr>\n<td>Chobits. The storybooks Chi reads; they describe me. Chobits available for instant streaming on <a href=\"/cwcki/Netflix\" title=\"Netflix\">Netflix</a>. The anime is very good in its story.\n</td>\n<td>January 31, 2012\n</td></tr>\n<tr>\n<td><a href=\"/cwcki/File:GAMe_PLACe_Cyber-Bully_Hang-Out_Ad.png\" title=\"File:GAMe PLACe Cyber-Bully Hang-Out Ad.png\">Please tell EVERYONE to Stay the HELL Away from that PLACe!!!</a> <i>[Note: Ad is placed underneath the status update.]</i>\n</td>\n<td>January 31, 2012\n</td></tr>\n<tr>\n<td>The best possible solution for my emotions is to ACTUALLY hang out IN PERSON. IF y'all can get away from your own businesses, romances and work to ACTUALLY Be Better Friends.\n</td>\n<td>February 1, 2012\n</td></tr>\n<tr>\n<td>People of <a href=\"/cwcki/Charlottesville,_VA\" title=\"Charlottesville, VA\">Charlottesville, VA</a> are Insensitive of others, including those of us who are Socially Worse Off than they Snobbishly are.\n</td>\n<td>February 1, 2012\n</td></tr>\n<tr>\n<td>Bitch left w.out a reply from me. Confirmed departure; relocated self to Starbucks kiosk leaving chair as-is; Symbolic Middle-Finger to <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">Jerkops</a>. BTW, <a class=\"mw-redirect\" href=\"/cwcki/Janekop\" title=\"Janekop\">Janekop</a> \"threatened\" to get the <a class=\"mw-redirect\" href=\"/cwcki/Manajerk\" title=\"Manajerk\">Manajerk</a>. LOL.\n</td>\n<td>February 1, 2012\n</td></tr>\n<tr>\n<td>I am still feeling heartache; including empty-but-few-drops feeling in heart; continuing to wait for Caring, Pretty, White Female Peer.\n</td>\n<td>February 1, 2012\n</td></tr>\n<tr>\n<td>Currenty at <a class=\"mw-redirect\" href=\"/cwcki/Fashion_Square_Mall\" title=\"Fashion Square Mall\">F.Sq. Pop</a>: mild to med. Approached by B.Male Jerkop in white; asked me to re-rotate comfy chair I'm sitting in; I Ignored the S.O.B. ;j Now being approached by W. Janekop; ignoring bitch.\n</td>\n<td>February 1, 2012\n</td></tr>\n<tr>\n<td><a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">Heartache</a>. heartache... <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">helaerttttttttacheewi</a>.....\n</td>\n<td>February 2, 2012\n</td></tr>\n<tr>\n<td>I feel a little better, but the heartaches are still here. Doctor Perscribes Hanging out and having fun with some Friends, Face to Face, Three Times A Week.\n</td>\n<td>February 2, 2012\n</td></tr>\n<tr>\n<td>Earlier, at Toys 'R' Us, I put together a <a href=\"/cwcki/Alex%27s_Lemonade_Stand\" title=\"Alex's Lemonade Stand\">Lego (Friends) Lemonade Stand</a> for Alex's cause. Each Free stand built would give a dollar to support ending child cancer.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Anyhoo, after T.R.U., I went to the mall, with my normal plan in my head to sit, hang and wait for a <a href=\"/cwcki/Sweetheart_from_the_Ground-Up\" title=\"Sweetheart from the Ground-Up\">Ms. Right</a>.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Back to today, I took my normal once-around the mall before settling down to hang. But I impulsively decided to leave a few photos as I walked. Eventually, I settled for my hand at a table of the S.Bucks kiosk. I called my mother to check in. While ringing, a Jerkop wandered into my space; I saw one to a handful of my warning photos in his right hand. I felt shocked with surprise.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Mom answered; I played it cool with her, while I started to get up and walk away. We finished the chat; she hung up; I hung up as I walked. Then I looked back; the Jerkop following me said something. I start running to the JCP. I hid in the back for a moment to catch myself. I thought it best to leave and return another day.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Set to exit via the one with the salon, HE and an accomplice intercepted me. \"You're not in any trouble\", the Jerkop said; the hell I was not, or Why would the son of a bitch be chasing after me. I exited via the South exit instead. I veered my way around eastward to the Mitsu I was driving, far east from the east Belk entrance. I started along the outter edge of the parking lot. I was spotted by the accomplice, but I was too fast for him, and I was tactful hiding and weaving around the parked cars to get to mine.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>I see the acc catching up as I was close to my car. Those dumbasses probably thought to search for my <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">Escort</a>; not a Mitsubishi. The Jerkop called out to me by name once during the mess; I was Not going to associate with ANYONE who knew me by name without my own familiarity of him/her. Cheap Internet Fame is JUST NOT WORTH A SHIT. I got into my car and escaped swiftly, leaving behind a confused accomplice.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Now I rest at an <a href=\"/cwcki/McDonald%27s\" title=\"McDonald's\">McD</a> with an Arnold Palmer Tea and Apple Slices, rehydrating myself and resting while typing my story up. My Mother does NOT need to know of what happened.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Sorry, but another important point needs to be typed. The edited .jpg of Snyder's 10% coupon from NBC 29's flyer I had posted earlier on my wall, well I have recently printed 50 copies at a photo-print station at <a class=\"mw-redirect\" href=\"/cwcki/Wal-Mart\" title=\"Wal-Mart\">Wal-Mart</a> a few days ago, Destined to be distributed as I went. Placed like on the table I wpuld be sitting at, or for the Mall, placed like advertising things near other ad things. Their purpose, obviously, is to Inform The Public and Masses to Stay Far Away from that PLACe, because Cyber-Bullies DO meet, hand and breed there under Snyder's approval. That PLACe WILL go down, by my will, or by someone else's fire-on-a-stick and bombs.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>On another topic, I just got hit by my horoscope today. It warned me to keep my business only to myself and associates, otherwise I'd run risk of...\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>(keep my goals to myself or risk)... \"Being encouraged Ad Nauseam\"\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>I took the horoscope to mean that I should keep my resumed Sweetheart Search quiet at the Mall today. I had planned on wearing a sign around my neck, stating non-offensively, \"IF YOU LIKE ME, PLEASE TELL ME\". I had also thought of playing music from my 3DS loudly through bomb-shaped mini speakers with fun faces I had purchased at Wal-Mart.\n</td>\n<td>February 4, 2012\n</td></tr>\n<tr>\n<td>Found first two seasons of \"Laguna Beach\" on DVD at Goodwill with ALL matching discs included. Checking out series now; I like it so far.\n</td>\n<td>February 5, 2012\n</td></tr>\n<tr>\n<td>Recently, after being corrected of homo Andy Dick DID NOT star in the movie, \"Napoleon Dynamite\", I rented the movie from PSN. It was a fun, okay movie. Additionally, I actually watched the first two episodes of the new Animated Series on FOX before I watched the movie.\n</td>\n<td>February 5, 2012\n</td></tr>\n<tr>\n<td>Recently watched Graduation episode of L.B. S-1; I reflected on High School again, as well as my Graduation. I cried again.\n</td>\n<td>February 6, 2012\n</td></tr>\n<tr>\n<td>I Don't Know. I've observed that I felt like more often than usual. I'm still feeling lost. I'm lonely. I need face-to-face woman/friends. I'm slow on the take sometimes to often. I wish I could go back to 1999. I wish my family and I had not moved back here. My heart still aches. My soul feels broken, beaten and scarred. I dunno what to think. I Don't Know.\n</td>\n<td>February 7, 2012\n</td></tr>\n<tr>\n<td>Hey, Everyone! Say hello to my friend who has been offline for a while; she finally got back on and started an f.b. page for herself from my invitation, <a href=\"/cwcki/Jackie\" title=\"Jackie\">Jacklyn Romy</a>. **(:D**\n</td>\n<td>February 8, 2012\n</td></tr>\n<tr>\n<td>Here, <a href=\"/cwcki/File:Chris_and_Jackie_Lego_Friends.png\" title=\"File:Chris and Jackie Lego Friends.png\">my Lego Minifig counterpart is lucky with a Lego Friend</a>; hopefully Jackie and I can get together and renew our relationship. :) '[Note: Picture is placed underneath the status update.]<i></i>\n</td>\n<td>February 9, 2012\n</td></tr>\n<tr>\n<td><a href=\"/cwcki/File:Christian_3DS_Wii_QR_Code.png\" title=\"File:Christian 3DS Wii QR Code.png\">My 3DS Mii QR Code</a>. <i>[Note: Code is placed underneath the status update.]</i>\n</td>\n<td>February 9, 2012\n</td></tr>\n<tr>\n<td>I've just finished watching the <a href=\"/cwcki/My_Little_Pony\" title=\"My Little Pony\">M.L.P.</a> We &lt;3 Ponies Mare-a-thon countdown. I'm pleased \"Green Isn't Your Color\" made #2; I feel confused why \"Luna Eclipsed\" was voted #1. I liked \"Look Before You Sleep\" better, but considering the choices on HubWorld.com, \"The Cutie-Mark Chronicles\" should HAVE been the #1 episode.\n</td>\n<td>February 11, 2012\n</td></tr>\n<tr>\n<td>I'm just (re)informing y'all that I still feel little looking forward to my 30th <a href=\"/cwcki/Christian_Love_Day\" title=\"Christian Love Day\">Birthday</a>, and I have NO plans on or around the date. Everyone on my Friends List, you all are welcome to extend you wishes to me by U.S. Post Mail or Telephone on my cell's Voice Mail. You all are also welcome to visit me at my house (yard-visit); please call my cell and leave a message with your name and phone number, so I can return your call.\n</td>\n<td>February 11, 2012\n</td></tr>\n<tr>\n<td>Also, I still wait for a response from Jackie here; with her hopping a plane for a vacay suddenly, I feel concerned and worry rather or not she still longs for me (mutually) or not.\n</td>\n<td>February 11, 2012\n</td></tr>\n<tr>\n<td>Mom got upset with me after I got caught flipping off a Jerkop. She told me how she felt in a conflict-resolution. It hurt me. She recovered after some rest, but I still feel very sad. I feel like I deserve to be beaten up, and I do not want Michael Snyder's blood on my mother's hands.\n</td>\n<td>February 13, 2012\n</td></tr>\n<tr>\n<td>I'm feeling sad and lonely again. Just hang in' at McD in <a href=\"/cwcki/Ruckersville,_VA\" title=\"Ruckersville, VA\">Ruckers</a>. *sigh* ...\n</td>\n<td>February 13, 2012\n</td></tr>\n</tbody></table>\n<h2><span class=\"mw-headline\" id=\"Application_statuses\">Application statuses</span></h2>\n<table class=\"wikitable\">\n<tbody><tr>\n<th>Text\n</th></tr>\n<tr>\n<td>Christian Weston Chandler was reviewing friends' friends for <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">dating</a>, using Spark\n</td></tr>\n<tr>\n<td>Christian Weston Chandler wants to know if you would <a class=\"mw-redirect\" href=\"/cwcki/Hanky-panky\" title=\"Hanky-panky\">do him</a>? Yes? No?\n</td></tr>\n<tr>\n<td><a class=\"mw-redirect\" href=\"/cwcki/Troll\" title=\"Troll\">Someone</a> is checking out Christian Weston Chandler on Zoosk.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is in MOOD for a <a class=\"mw-redirect\" href=\"/cwcki/Rape\" title=\"Rape\">SWEET KISS</a> from someone really special Is that YOU?\n</td></tr>\n<tr>\n<td>Christian Weston Chandler gave a sweet ANONYMOUS kiss to a Secret Someone special Rachel Davis Isnt this exciting?\n</td></tr>\n<tr>\n<td>Someone rated Christian Weston Chandler on Are YOU Sexy.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has added FunWall.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is being viewed on 'Meet New People'.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler added the iLike application.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler added <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">music</a> to their profile\n</td></tr>\n<tr>\n<td>Christian Weston Chandler took the <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Ideal Mate</a> quiz\n</td></tr>\n<tr>\n<td>Christian Weston Chandler says: I feel Lonely\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is being viewed on MNF\n</td></tr>\n<tr>\n<td>Christian Weston Chandler just added the <a href=\"/cwcki/Cherokian_Clan\" title=\"Cherokian Clan\">Heritage</a> app.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler , New Stickers are waiting for you!\n</td></tr>\n<tr>\n<td>Someone Yes'd Christian Weston Chandler on MNF\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has added a new <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">bumper sticker</a>\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is checking out Are You Interested?!\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has created a playlist called <a href=\"/cwcki/Christian%27s_Favorite_Hits!\" title=\"Christian's Favorite Hits!\">CWC\\'s Jams</a>.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler voted for his favorite version of a song\n</td></tr>\n<tr>\n<td>Christian Weston Chandler listened to the song\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is being flirted with on 'Meet New People'.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is checking out Meet New People!\n</td></tr>\n<tr>\n<td>Update! Top Friends News from Christian Weston Chandler!\n</td></tr>\n<tr>\n<td>Christian Weston Chandler found someone interesting on Mesmo <a href=\"/cwcki/Chris_and_television\" title=\"Chris and television\">TV</a> Match\n</td></tr>\n<tr>\n<td>Christian Weston Chandler took a quiz\n</td></tr>\n<tr>\n<td>Christian Weston Chandler added <a href=\"/cwcki/Family_Guy\" title=\"Family Guy\">TV favorites</a> to their profile using Mesmo TV\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is passing teammates in TV Show Trivia\n</td></tr>\n<tr>\n<td>Christian Weston Chandler found out which <a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">sexual position</a> is best for him\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is a <a href=\"/cwcki/Song_for_Jackie.MOV\" title=\"Song for Jackie.MOV\">Naughty Genie</a> and is granting naughty wishes to friends\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has made a naughty <a href=\"/cwcki/China\" title=\"China\">wish</a> to Linda DeLorme. Linda DeLorme must now fulfill it.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler granted a naughty wish back to Linda DeLorme\n</td></tr>\n<tr>\n<td>Christian Weston Chandler joined the Compare HOTNESS Tournament!\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has just sent a new post.\n</td></tr>\n<tr>\n<td>Someone flirted with Christian Weston Chandler!\n</td></tr>\n<tr>\n<td>Christian Weston Chandler found a lucky Facebook <a href=\"/cwcki/Homos\" title=\"Homos\">Fairy</a>!\n</td></tr>\n<tr>\n<td>Naughty Genie granted Christian Weston Chandler a Wish\n</td></tr>\n<tr>\n<td>Christian Weston Chandler is playing the Sex Appeal game.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler sent Frog playing banjo gift to Jessica Gombert\n</td></tr>\n<tr>\n<td>Christian Weston Chandler accepted a Smiley from Jessica Gombert.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler sent Rachel Reynolds a Juno Movie Message.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler voted for Melissa Williams for FB Models.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has a Blue heart !\n</td></tr>\n<tr>\n<td>Christian Weston Chandler accepted a Nosey from Jessica Gombert.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler accepted a Bluey from Jessica Gombert.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler accepted a Spotty from Jessica Gombert.\n</td></tr>\n<tr>\n<td>Christian Weston Chandler gained a Scratch And Win title\n</td></tr>\n<tr>\n<td>Christian Weston Chandler has been loved\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20230122021301\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.066 seconds\nReal time usage: 0.073 seconds\nPreprocessor visited node count: 38/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14478-0!canonical and timestamp 20230122021301 and revision id 226378. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Facebook_statuses&amp;oldid=226378\">http://sonichu.com/w/index.php?title=Facebook_statuses&amp;oldid=226378</a>\"</div></div>",
  "categories": [
    "Facebook",
    "Historical Documents"
  ],
  "links": [
    "Naughty Genie",
    "Fairy",
    "Ms. Right",
    "The Game Place",
    "and I am real lonely.",
    "Netflix",
    "Alderman Library",
    "home",
    "church",
    "Ruckers",
    "Ideal Mate",
    "McD",
    "bumper sticker",
    "Janekop",
    "CWC\\'s Jams",
    "Someone",
    "do him",
    "helaerttttttttacheewi",
    "Lego (Friends) Lemonade Stand",
    "sexual position",
    "Birthday",
    "F.Sq Mall",
    "2008",
    "Jacklyn Romy",
    "Heritage",
    "gal",
    "\"Pacing\"",
    "Charlottesville, VA",
    "Manajerk",
    "F.Sq. Pop",
    "Jerkops",
    "Wal-Mart",
    "music",
    "wish",
    "TV favorites",
    "dating",
    "Facebook",
    "lonesome",
    "videogame",
    "Escort",
    "Pokemon",
    "TV",
    "M.L.P.",
    "SWEET KISS",
    "Heartache"
  ],
  "scraped_at": "2025-11-26T14:58:47.528954"
}