{
  "url": "http://sonichu.com/cwcki/FAQ,_questions_frequently_asked_of_me.",
  "title": "FAQ, questions frequently asked of me.",
  "display_title": "FAQ, questions frequently asked of me.",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>FAQ, questions frequently asked of me.</b> is a section written by <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> at the bottom of the Blogs page on <a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a> on 14 <a href=\"/cwcki/September_2024\" title=\"September 2024\">September 2024</a>. While it is not an actual blog post, it is still placed here and treated as such on the CWCki for chronological purposes. It was written two days after the first two blog posts were published.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Who_am_I\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Who am I</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Dimensional_Merge\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Dimensional Merge</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Dimensions_C-197_and_1218\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Dimensions C-197 and 1218</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Powers/Abilities\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Powers/Abilities</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Past_Happenings\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Past Happenings</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#CWCKI\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">CWCKI</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Sonichu_Prime_and_Rosey_Rosechu_Prime\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Sonichu Prime and Rosey Rosechu Prime</span></a></li>\n<li class=\"toclevel-1 tocsection-8\"><a href=\"#Past_Question:_Who_is_CPU_Blue_Heart?\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Past Question: Who is CPU Blue Heart?</span></a></li>\n<li class=\"toclevel-1 tocsection-9\"><a href=\"#Past_Question:_Who_were_the_80s_characters...\"><span class=\"tocnumber\">9</span> <span class=\"toctext\">Past Question: Who were the 80s characters...</span></a></li>\n<li class=\"toclevel-1 tocsection-10\"><a href=\"#Past_Question:_Sonichu_book_12-9_confusion.\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">Past Question: Sonichu book 12-9 confusion.</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Who_am_I\">Who am I</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>I am Mrs. Jesus Christine Weston Chandler Sonichu Prime, CPU Goddess Blue Heart and the One Avatar of all existence. In short, I am a multifaceted bisexual transwoman (She/Her are my Pronouns) with many talents, including hand-drawn art, writer (story and dialogue), gamer, a bit of a cook, and most anything learnable. I am the original creator and chronicler of the media featuring the Sonichus Rosechus as well as the city of Cwcville, Virginia, United States of America. My mentality is high-functioning autistic with a psychic connection with everything in the universe, timeline and beyond.\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Dimensional_Merge\">Dimensional Merge</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The Dimension Merge that at the moment of writing this on September 14, 2024 is coming upon completion, is simply the recombination of this very Earth that was magically divided in the days of King Auther. This consists of this half, as you may (neuro)typically know and aware of, to an extent, and the other half that houses the typical and greater magic and magicks and the Original, \"Fictional\" Characters and Individuals from most various media that you have read and watched this entire time.\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Dimensions_C-197_and_1218\">Dimensions C-197 and 1218</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>As mentioned in the Dimension Merge question above, the C-197 and 1218 \"Dimensions\" are the two halves of this very Earth that was divided hundreds of years ago. Whole and undivided, this is Earth 1C-211987; divided, the halves are known as C-197 and 1218.\n<p>The 1218 half is this that you walk upon and typically know at surface level that you live and breathe on. Those on the C-197 half also walk on this very Earth.\n</p><p>The C-197, that in part you also do physically walk on, is the half that houses those from the various media (TV shows, Manga, Comics, Movies, etcetera) that you are aware of reside and exist physically. Essentially, those that reside and live present, including those that are immortal (Exceptions being those that reside in Post-Apocalyptic timelines and dimensions, and those that lived centuries in the past that are not immortal, and those classified as residing in other various timelines, dimensions and universes) You Name It, they are there.\n</p><p>The Sonichus and Rosechus, the many Pok'emon, Sonic the Hedgehog, Super Mario, Bugs Bunny, Mickey Mouse, Smurfs, Yogi Bear, Doug Funny, Kim Possible, (Human) Twilight Sparkle, Rainbow Dash, Fluttershy and so on, as well as Sunset Shimmer, the Teenage Mutant Ninja Turtles, Batman, Superman, Iron Man, Hulk, Optimus Prime, Megatron, Leader-1, Cy-Kill, Kusuo Saiki, Sailor Moon, Moomins, Bob Belcher, (universe C-137 origin) Rick Sanchez, Peter Griffin, Homer Simpsons, Stan Smith, Frylock, Gumball Waterson, and so on. And on the planet Equestria in the pocket dimension accessable from the portal on the C-197 half, Princess Twilight Sparkle, Princess Celestia, Rainbow Dash, Fluttershy, Vinyl Scratch and Octavia, Dr. Wolf, Lightning Bliss, Mad Munchkin, Mary Sue, Gary Stu, Silver Quill, Flufflepuff, and so on. Even those in Outer Space like Captain Kirk on the Enterprise, Ashoka [sic] and the Jedi, Fox McCloud and the Star Fox crew, and so on.\n</p><p>They all walk among us physically; the only reason why a lot can't see them is due to the thinning veil between the C-197 and 1218 halves of this Earth. One can see through the veil and appreciate are those that are open-minded, creative, and mentally connected to be better able. Everyone has the ability to see and interact for themselves without external devices. What you call \"Imagination\" is one tool that can be used to see through the veil. All Original \"Fictional\" Characters and Individuals begin on the C-197 half, then upon further discovery branch into the other timelines, universes and dimensions that end up becoming chronicled one way or another.\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"Powers.2FAbilities\"></span><span class=\"mw-headline\" id=\"Powers/Abilities\">Powers/Abilities</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>My (super) powers and abilities are numerous, even moreso metaphysically. These include the various Psychic Powers and abilities, including telekinesis, teleportation and telepathy (a lot of which my Body's Brain and Energy Field are still catching up on), elemental powers and bending. My Body and Brain have attuned the ability to heal others with focused intentions and kind energy.\n<p>I can transform into my Sonichu Form with Electricity being the more dominant elemental bending power within and my Psychic Powers and abilities. And I can physically run at mach speeds.\n</p><p>And I can transform into my CPU Goddess Blue Heart Form, wherein, granted by the former Goddess Blue Heart, Scarlet LeRose, I have powers over computer technology and I preside as the Goddess of the Commodore Consoles and Computers, as opposed to Neptune of Planeptune being CPU Purple Heart of the Sega consoles and games.\n</p><p>I am also physically strong and able with a Warrior Will and Inner Strength granted by my former self in my past immortal life as Jesus Christ of Nazareth. Everything of the Bible, Prophecies, various Scriptures worldwide, and so on are all memorized in my unconsciousness.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Past_Happenings\">Past Happenings</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The various events in my life is a lot to simply list. But to offer a summary: I was born on Wednesday February 24, 1982. Reared and cared for by my parents, Robert and Barbara Chandler. I grew up well-educated, with plenty of in-person friendships that didn't last as long as I would have liked (not counting the numerous acquaintances and online acquaintances and friendships with those who were not authentic about themselves with me).\n<p>Past tense, I went with the flow to confirm various intentions and events, yet at times letting myself be taken advantage of out of my being emotionally and mentally naive at those respective times.\n</p><p>Present tense and in recent years, I know better. And while I continue to go with the flow at times, and confirming various respective intentions and events, I have a greater appreciation of my super power of empathy and aura reading of others, so I have better ability to consciously choose that which is Light Powered and Good, and discern those individuals and paths that are Dark and potentially Toxic to avoid them.\n</p><p>I have Soul Searched and found myself, and I am in a very good place now with intentions of manifesting for the greater good of everyone and encouraging others to be guided on that which is Good and Light Powered for themselves. And presently, do my part in completing the Dimension Merge.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"CWCKI\">CWCKI</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The Cwcki, which was originally created without my prior consent, is a Wikipedia style website about me and my life details to the extent of what I've shared, personally, online and in writing, and even what the \"Christorians\", Weens and Internet Trolls paparazzied of me without my consent or conscious knowledge at those respective times.\n<p>Personally, I applaud the website on archiving all that of me, and on the other hand, I feel really disappointed of it, due to the bunch of innacurate details and NSFW and hate speak spewed throughout in places. The people who put that website up and wrote all of that have taken a lot of my details and content (including content recorded of me without my consent prior, or falsely blackmailed or manipulated of me) out of context and do not fully appreciate or understand the circumstances, respectively.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Sonichu_Prime_and_Rosey_Rosechu_Prime\">Sonichu Prime and Rosey Rosechu Prime</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sonichu Prime and Rosey Rosechu Prime are the very first Sonichu and Rosechu in all of existence in this timeline and universe. Despite them being visually similar with most regular Sonichus and Rosechus, Sonichu Prime and Rosey Prime are a (very) Special Sonichu and Rosechu with the strongest abilities and powers in comparison with the regular ones. And separate from the other various Special Sonichus, Rosechus, Metonics, Vamprosas, Sonees and Roseys worldwide and local.\n</td></tr></tbody></table>\n<h2><span id=\"Past_Question:_Who_is_CPU_Blue_Heart.3F\"></span><span class=\"mw-headline\" id=\"Past_Question:_Who_is_CPU_Blue_Heart?\">Past Question: Who is CPU Blue Heart?</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The original CPU Blue Heart, the Goddess of the Commodore Consoles, including the Commodore 64, Amiga, Leo and so on was Scarlet LaRose (her last name pronounced \"La Roe). She was a woman who lived in the late 1800s who, in her late teens, would be summoned to what would become the country of Gamindustri, which presently is located as a large island between Canada and Europe.\n<p>Scarlet was trained to lead as the Goddess of the Commodore Consoles and her people in her Nation of Comma, which was south of Tari and West of Planeptune. She led her people kind and good with everyone in mind.\n</p><p>She used to be friends with Rei Ryghts, the former Goddess of Tari and Atari consoles until when Rei became power corrupt and betrayed her people.\n</p><p>Scarlet was also prophetic, as it had been made clear in her prep work of retro rockets on the underside of her Nation for the eventual fall of Tari and Comma from the remainder of Gamindustri in the early 1980s. As well as the journals she had kept and the one protypical Commodore 64 game cartridge which was a simple kind of 3D game (in regards to the programming available for the consoles and games at the time in the late 70s and early 80s).\n</p><p>Comma fell at the same time as Tari, as the country of Gamindustry was literally in the sky high above the water space between Canada and Europe. Tari crashed hard somewhere in northern America, while Comma, with the guided rockets on the land's underside, landed into a pre-dug crater in West Virginia. The peoples and buildings, including the Basilicomm, remained safe, alive and well.\n</p><p>Over the time, as the people of Comma became more aware of the United Stated that they were not occupying and the other religious views, some spanned out from Comma, and the beliefs in the Goddesshood was dwindling. Scarlet fell from immortality with the dwindling support from her peoples and died in 1992. Her soul, power and energy transferred into one specific Commodore 64 motherboard on the console, P01352371; the one I ended up with.\n</p><p>And during the events of Johnson Wile's interference, I found and absorbed the powers, soul and energy of Scarlet into myself, making me the new CPU Goddess Blue Heart.\n</p><p>Since then, I had relocated the original Basilicomm of Scarlet's into Cwcville, VA, right across the street from my Basilicomm that was built in 2014 on premonition and good divine order.\n</p><p>Meanwhile, Comma, West Virginia and its people continue on and prosper like most other cities in the United States.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Past_Question:_Who_were_the_80s_characters...\">Past Question: Who were the 80s characters...</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td><b>Who were the characters from the 80s that you liked the best?</b>\n<p>I refer to the individuals who were featured in the media that debuted in the 1980s.\n</p><p><b>Jake Kong, Jr.</b>, alongside Eddie Spencer, Jr. and Tracy, of the original Ghostbusters. To this day, I still feel they are the real, original Ghostbusters, aside from Egon, Peter, Ray and Winston, and despite the fact that they both work in New York City. I also give props to Ghost Buggy.\n</p><p><b>Bumblebee</b> of the Autobots, as orginally portrayed and then upgraded and developed over the years.\n</p><p>I also like the Guardian, now Autobot, <b>Scooter</b>; he was youthful and cowardly, but still resourceful with his camouflage and technological knowledge. He has toughened up over the years. I also like <b>Pathfinder</b>.\n</p><p>And, of course, despite his one movie being with some cringe, <b>Robert Rabbit, the American Rabbit</b>. That movie can be rebooted and easily be better. As my first Hero before meeting Sonic the Hedgehog, Robert Rabbit did a lot of good.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Past_Question:_Sonichu_book_12-9_confusion.\">Past Question: Sonichu book 12-9 confusion.</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td><b>Could you explain a bit more on the scene from Sonichu 12-9 where Nightstar Sonichu meets \"Christine Night Weston Star Chandler\"? What took place in that scene, and what is their backstory?</b>\n<p>To best answer this question, I refer to what I wrote about them in the <a href=\"/cwcki/Goddess_Log\" title=\"Goddess Log\">Goddess Log</a> pages on <a href=\"/cwcki/November_2022\" title=\"November 2022\">11232022</a>, and I quote.\n</p><p>As for that part in Book 12-9 when Nightstar gave a \"Chris Chan\" the updated Cutie Mark and guided her to her next friend who could have been a sweetheart, but ultimately bombed. Initially, (when I wrote and drew that), that was to play off updating the (former) Equestria Girls Minis custom figure of myself, but something similar did happen in this timeline as Nightstar gave (human) Pinkie Pie the S-Chu Ball and the ingredients to Sunset Shimmer in that trip.\n</p><p>In Equestria, not at all related to I, Christine Chan or Nightstar as a self-counterpart, is a yellow Earth pony with the bright blue mane and tail that were not curled, with both eyes blue and a the mirror image of two bridged eighth notes for her Cutie Mark. She's a guitar player in a famous band. Her name is <b>Cricha</b>. Her other hobbies include cooking and reading various literature. She also does solo acts with her own written songs.\n</p><p>At the time in Equestria, Cricha had a total developmental growth and went punk, lookin' for some luv from her fans. She also coloured her fur pink.\n</p><p>At Canterlot High School, Cricha had felt lost, because her parents had got diverced, she had went with her mom and was feeling heavily uncertain with hardly any guidance.\n</p><p>Nightstar had also talked with Cricha, both of them, a number of times. The recent talk with (human) Cricha involved Fluttershy also lending kindness and a listening ear with Nightstar there. Nightstar meditated on Cricha's situation and looked at ALL possibilities and outcomes. When Nightstar next approached Cricha, after mentioning her run back to Cwcville prior, she handed Cricha a flyer for an LGBTQ club in Maryland, looking for musicians and artists to entertain; that changed her Cutie Mark on the skirt and turned her yellow skin pink with a new direction. The Cutie Mark became an \"A\"-shaped guitar. And (human) Diamon Melody was the best choice, because she lasted the longest in that relationship and devloped Cricha's emotions better than the others. A \"Live and Learn\" situation.\n</p>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible autocollapse\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";background:#00FBFE;\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;background:#00FBFE;;border:none;;\"><a href=\"/cwcki/Template:CwclightBlog\" title=\"Template:CwclightBlog\"><span style=\";background:#00FBFE;;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:CwclightBlog&amp;action=edit&amp;redlink=1\" title=\"Template talk:CwclightBlog (page does not exist)\"><span style=\"color:#002bb8;;background:#00FBFE;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:CwclightBlog&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;background:#00FBFE;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/CWC_Blog_(Cwclight)\" title=\"CWC Blog (Cwclight)\">CWC Blog</a> (<a href=\"/cwcki/2024\" title=\"2024\">2024</a>-<a href=\"/cwcki/2025\" title=\"2025\">25</a>)</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#3B9136;;\">All Posts\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Welcome_to_Cwclight\" title=\"Welcome to Cwclight\">Welcome to Cwclight</a> • <a href=\"/cwcki/Rules_on_Comments\" title=\"Rules on Comments\">Rules on Comments</a> • <a class=\"mw-selflink selflink\">FAQ, questions frequently asked of me.</a> • <a href=\"/cwcki/Sonichus,_Rosechus,_and_more\" title=\"Sonichus, Rosechus, and more\">Sonichus, Rosechus, and more</a> • <a href=\"/cwcki/Jesus_Christ_Chan_Sonichu_Prime_(Blog_Post)\" title=\"Jesus Christ Chan Sonichu Prime (Blog Post)\">Jesus Christ Chan Sonichu Prime</a> • <a href=\"/cwcki/Blake_Sonichu_(Blog_Post)\" title=\"Blake Sonichu (Blog Post)\">Blake Sonichu</a> • <a href=\"/cwcki/A_few_previously_unanswered_questions\" title=\"A few previously unanswered questions\">A few previously unanswered questions</a> • <a href=\"/cwcki/Ultra_Sonichu_(Blog_Post)\" title=\"Ultra Sonichu (Blog Post)\">Ultra Sonichu</a> • <a href=\"/cwcki/The_Autobots_of_Cwcville\" title=\"The Autobots of Cwcville\">The Autobots of Cwcville</a> • <a href=\"/cwcki/Dimension_Merge_supplements\" title=\"Dimension Merge supplements\">Dimension Merge supplements</a> • <a href=\"/cwcki/The_Book_of_the_Dimension_Merge\" title=\"The Book of the Dimension Merge\">The Book of the Dimension Merge</a> • <a href=\"/cwcki/Transformers_Legacy_United_Merge_Bios\" title=\"Transformers Legacy United Merge Bios\">Transformers Legacy United Merge Bios</a> • <a href=\"/cwcki/Random_Thoughts_(will_be_updated_from_time_to_time)\" title=\"Random Thoughts (will be updated from time to time)\">Random Thoughts (will be updated from time to time)</a> • <a href=\"/cwcki/Prophetic_Details\" title=\"Prophetic Details\">Prophetic Details</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#3B9136;;\">Numbered\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b><a href=\"/cwcki/2024\" title=\"2024\">2024</a></b>: <a href=\"/cwcki/Welcome_to_Cwclight\" title=\"Welcome to Cwclight\">1</a> • <a href=\"/cwcki/Rules_on_Comments\" title=\"Rules on Comments\">2</a> • <a class=\"mw-selflink selflink\">3</a> • <a href=\"/cwcki/Sonichus,_Rosechus,_and_more\" title=\"Sonichus, Rosechus, and more\">4</a> • <a href=\"/cwcki/Jesus_Christ_Chan_Sonichu_Prime_(Blog_Post)\" title=\"Jesus Christ Chan Sonichu Prime (Blog Post)\">5</a> • <a href=\"/cwcki/Blake_Sonichu_(Blog_Post)\" title=\"Blake Sonichu (Blog Post)\">6</a> • <a href=\"/cwcki/A_few_previously_unanswered_questions\" title=\"A few previously unanswered questions\">7</a> • <a href=\"/cwcki/Ultra_Sonichu_(Blog_Post)\" title=\"Ultra Sonichu (Blog Post)\">8</a><br/><b><a href=\"/cwcki/2025\" title=\"2025\">2025</a></b>: <a href=\"/cwcki/The_Autobots_of_Cwcville\" title=\"The Autobots of Cwcville\">9</a> • <a href=\"/cwcki/Dimension_Merge_supplements\" title=\"Dimension Merge supplements\">10</a> • <a href=\"/cwcki/The_Book_of_the_Dimension_Merge\" title=\"The Book of the Dimension Merge\">11</a> • <a href=\"/cwcki/Transformers_Legacy_United_Merge_Bios\" title=\"Transformers Legacy United Merge Bios\">12</a> • <a href=\"/cwcki/Random_Thoughts_(will_be_updated_from_time_to_time)\" title=\"Random Thoughts (will be updated from time to time)\">13</a> • <a href=\"/cwcki/Prophetic_Details\" title=\"Prophetic Details\">14</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#3B9136;;\">See Also\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a> • <a href=\"/cwcki/CWC_Blog\" title=\"CWC Blog\">CWC Blog (2009-10)</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250609001530\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.066 seconds\nReal time usage: 0.075 seconds\nPreprocessor visited node count: 554/1000000\nPost‐expand include size: 30571/2097152 bytes\nTemplate argument size: 18435/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   30.518      1 -total\n 82.01%   25.027      1 Template:CwclightBlog\n 73.21%   22.341      1 Template:Navbox\n 13.92%    4.247     10 Template:Quotebox\n 11.27%    3.438      1 Template:Tnavbar\n  7.96%    2.430     25 Template:•\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:40271-0!canonical and timestamp 20250609001530 and revision id 343522. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=FAQ,_questions_frequently_asked_of_me.&amp;oldid=343522\">http://sonichu.com/w/index.php?title=FAQ,_questions_frequently_asked_of_me.&amp;oldid=343522</a>\"</div></div>",
  "categories": [],
  "links": [
    "4",
    "Random Thoughts (will be updated from time to time)",
    "9",
    "Welcome to Cwclight",
    "2024",
    "Prophetic Details",
    "8",
    "12",
    "Cwclight",
    "Jesus Christ Chan Sonichu Prime",
    "1",
    "Dimension Merge supplements",
    "Ultra Sonichu",
    "Chris",
    "25",
    "The Autobots of Cwcville",
    "Goddess Log",
    "6",
    "2",
    "11232022",
    "The Book of the Dimension Merge",
    "7",
    "September 2024",
    "CWC Blog",
    "5",
    "A few previously unanswered questions",
    "Blake Sonichu",
    "CWC Blog (2009-10)",
    "Transformers Legacy United Merge Bios",
    "Sonichus, Rosechus, and more",
    "11",
    "13",
    "14",
    "2025",
    "10",
    "Rules on Comments"
  ],
  "scraped_at": "2025-11-26T21:43:18.343326"
}