{
  "url": "http://sonichu.com/cwcki/Group_Embargo_on_GameStop,_Best_Buy,_and_Simon_Shopping_Centers",
  "title": "Group Embargo on GameStop, Best Buy, and Simon Shopping Centers",
  "display_title": "Group Embargo on GameStop, Best Buy, and Simon Shopping Centers",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Group Embargo on GameStop, Best Buy, and Simon Shopping Centers</b> is the third and final video uploaded to Chris's <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> channel on 29 <a href=\"/cwcki/November_2015\" title=\"November 2015\">November 2015</a>. While it did not include a description, Chris shortly provided a link to it on his <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> page with the notice:\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Until I am no longer banned from All Four Charlottesville, VA GameStop stores, as well as the Best Buy store and ‪#‎FashionSquare‬ Shopping Center, I hereby am on an Embargo against ‪#‎GamsStop‬, ‪#‎BestBuy‬, and ‪#‎SIMON‬ Malls. And I Encourage ALL of my friends and fans to Stand With Me and not go to any GameStops, Best Buys and SIMON Malls Anywhere.\n<p>Thank you all for your support in resolving this problem for a better tomorrow!\n</p>\n</td></tr></tbody></table>\n<p>In this video, even more of old Chris returns, but he seems to have tamed his <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">anger</a> to some extent. Instead of jumping and shouting at the camera, he puts an emphasis on his claims in the typical <a href=\"/cwcki/Chris%27s_mannerisms\" title=\"Chris's mannerisms\">way Chris does</a>. He certainly feels <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">a great deal of power</a> in the situation, stating that if he is <a class=\"mw-redirect\" href=\"/cwcki/Kick_the_autistic\" title=\"Kick the autistic\">hurt and bullied</a>, all autistic people and <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl_Saga\" title=\"Tomgirl Saga\">LBGT</a> people are as well. He also encourages his \"thousands to millions of fans worldwide\" to follow him on his endeavors, even though the only videos he post that break over ten thousand views are the ones that are <a href=\"/cwcki/HelloLadyFans\" title=\"HelloLadyFans\">batshit crazy</a>.\n</p><p>His victim complex is quite interesting in this one, as he believes the <a href=\"/cwcki/Yellow-Shirted_Foe\" title=\"Yellow-Shirted Foe\">employee he maced</a> has family at <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">Best Buy</a> that are banning him for no reason, and tries to blame his sexuality, gender and autism for acting like a tard. In true Chris fashion, he makes an insincere apology, then attacks the guy he maced. He also stressed that banning him would make it bad for everyone, and unbanning him would give them all good karma. He also believes wars could be prevented by <a href=\"/cwcki/My_Little_Pony\" title=\"My Little Pony\">My Little Pony</a> and the <a href=\"/cwcki/Care_Bears\" title=\"Care Bears\">Care Bears</a>. \n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Group Embargo on GameStop, Best Buy, and Simon Shopping Centers</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/ZhM1rDTwvY8\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=ZhM1rDTwvY8\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/ZhM1rDTwvY8\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>29 <a href=\"/cwcki/November_2015\" title=\"November 2015\">November 2015</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Video games</span><a href=\"/cwcki/Video_games\" title=\"Video games\"><img alt=\"Video games\" decoding=\"async\" height=\"32\" src=\"/w/images/d/db/Video_games.png\" width=\"32\"/></a> Gamestop\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Rage</span><a href=\"/cwcki/Chris_and_anger\" title=\"Rage\"><img alt=\"Rage\" decoding=\"async\" height=\"32\" src=\"/w/images/2/27/Rage.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">Rage</a>, <span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_negotiation\" title=\"Chris and negotiation\">Negotiation</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Sonic Boom</span><a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom\"><img alt=\"Sonic Boom\" decoding=\"async\" height=\"32\" src=\"/w/images/9/96/Boomsaga.png\" width=\"32\"/></a> <i><a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">Sonic Boom</a></i>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">Mighty Lesbian</span><a href=\"/cwcki/File:Mighty_Lesbian.png\" title=\"Mighty Lesbian\"><img alt=\"Mighty Lesbian\" decoding=\"async\" height=\"32\" src=\"/w/images/a/a0/Mighty_Lesbian.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">Mighty Lesbian</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Family_and_Couples_Figures_Available_for_collecting_and_purchase._Also_Sandy_and_Zapina_Rosechu.\" title=\"Family and Couples Figures Available for collecting and purchase. Also Sandy and Zapina Rosechu.\">Family and Couples Figures Available for collecting and purchase.</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Embargo_Update_12/2/2015\" title=\"Embargo Update 12/2/2015\">Embargo Update 12/2/2015</a>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">Every one of my thousands to millions of fans worldwide, I encourage you all to follow me in this embargo! Never con-, never go to or conduct any business at any GameStop location anywhere\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcription\">Transcription</span></h2>\n<p>Hello to all my loyal fans over the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">Internet</a>. This is Christine Chandler coming to you live once again from <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">my house</a> here. And uh, because I have not received a response I have a letter that I had, had written on November 12th, 2015, which that was a Thursday. And I believe I sent it um, either that same day or the day after on Friday. But anyway, uh, I’m going to read this letter and if you, and it’s addressing definitely to the local <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStops</a> in <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a>, <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a>, all four of them, as well as <a class=\"mw-redirect\" href=\"/cwcki/Fashion_Square_Mall\" title=\"Fashion Square Mall\">Fashion Square Mall</a> and, believe it or not, even the <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">Best Buy</a>. So without furder ado, I’m going to read this letter.\n</p><p>Yeah, and unfortunately I did not know his name, so he’s referred to as sir and what-, and similar pronouns. So anyway, I wrote, uh, “Dear <a href=\"/cwcki/Yellow-Shirted_Foe\" title=\"Yellow-Shirted Foe\">Yellow-Shirt Assistant Manager</a> of the Fashion Square GameStop. I never got your name, I’m sorry. To preface this letter, I most humbly apologize for everything I have done as of the release date of the Sonic Boom video games, around November 11th, 2014, in regards to the <a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">protest</a> of <a class=\"mw-redirect\" href=\"/cwcki/SEGA\" title=\"SEGA\">SEGA</a> changing <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a>’s arm color to blue from tan. More recently I have learned that the next console Sonic the Hedgehog game, his arm cumber will be back to tan, and therefore I have concluded the protest against SEGA and made the official statement on my <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> group page, <a href=\"/cwcki/FIX_SONIC%27S_ARMS_IMMEDIATELY,_SEGA!!!\" title=\"FIX SONIC'S ARMS IMMEDIATELY, SEGA!!!\">FIX SONIC'S ARMS IMMEDIATELY, SEGA!!!</a> To recap and make the story short, in the, in Sonic Boom, SEGA had changed Sonic’s arm color. I felt most upset about it. I protested by discouraging the purchase of said games and related Sonic Boom merchandise, and encouraging sending everything Sonic Boom back to SEGA. I had contacted SEGA of America. I received not good responses on the topic. I caused male, I caused malcontent against me and my peaceful protest.” I ended up <a class=\"mw-redirect\" href=\"/cwcki/Banned\" title=\"Banned\">banned</a> from the four local above GameStops, and aside from handing the udder three locals, where I sent a carbon copy as well. \n</p><p>[<i>loses place</i>] Ah, da da da da da da da....Alright, um, “And upon the final major shock to my fear, paranoia, and nervous system at the Fashion Square location, I retaliated with a show of pepper spray container and left with a show of what was originally meant to be a warning to not ban me ever, scaring the <a href=\"/cwcki/DIRTY,_CRAPPED_BRIEFS\" title=\"DIRTY, CRAPPED BRIEFS\">living crap out of me</a>, or just plain giving me a bad day. It turned out to be <a href=\"/cwcki/26_December_2014\" title=\"26 December 2014\">a more worse day for everyone</a>. And since then, the jail time kept me from getting very important and detailed packing done for moving back to my renovated house on the following December 31st, 2014. Also, I had emptied the thing of pepper spray, downward into a nearby hole—big hole—outside, and disposed of said canister into the hole. I did not have any pepper spray on me since, court dates were had and maintained, along with respective <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_psychology#Past_instances_of_professional_help_(or_lack_thereof)\" title=\"Chris and psychology\">mental therapy and analysis</a> towards the fact that I had felt most overwhelmed, paranoid, and wanting to defend myself from such being banned and personal attacks to me. And upon the court’s conclusion, the whole mess has become over with, and all should be resolved, as I am praying to achieve today.\n</p><p>“Upon the recent conclusion of reversing the arm-color change among the udder details, while related, had little to do with the protest, including game glitches, story content, whatever, I understand and realize that the protest was not only a waste of time and energy, ultimately, but that it was among the worst mistakes I have ever done in my life, not counting what the Internet <a href=\"/cwcki/Trolls\" title=\"Trolls\">haters</a> had blackmailed me into performing and video-recording since <a href=\"/cwcki/2007\" title=\"2007\">2007</a>. And I most deeply and seriously regret having begun the useless protest in the first place, and I more regret ultimately feeling need to defend myself and spritzing pepper spray at you, the Yellow-Shirt Assistant Manager. [<i>looks at camera</i>] <a href=\"/cwcki/Chris_and_remorse\" title=\"Chris and remorse\">I am really, very sorry.</a>\n</p><p>“And with all that, I most humbly request to be unbanned from all of the local GameStops in Charlottesville, Virginia. I will be most appreciative of not being forced to waste gas money to go out of town and most distance, as far as the one GameStop within the US military housing...of Fort Lee! Here in Virginia. Fort Lee! And, appreciating the soldiers who helped defend the United States after my father, <a class=\"mw-redirect\" href=\"/cwcki/Robert_Franklin_Chandler,_Jr.\" title=\"Robert Franklin Chandler, Jr.\">Robert Franklin Chandler, Jr.</a>, having served around World War Two, stationed in Seoul, Korea, in the Signal Corps. I am serious. I did do that. I had required pre-owned Pikachu <a class=\"mw-redirect\" href=\"/cwcki/Amiibo\" title=\"Amiibo\">Amiibo</a> figures for materials for my <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a> figures that I make and sell on <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a>, on my shop, Cwcville Shopping. \n</p><p>“But I digress. Not only will I be most appreciative, but I will bring good karma to you and all the other employees of your GameStop, and the other three GameStops as well. And we can all be forgiven and forget the whole mess in good strides of the future. [<i>hand flourish</i>] Everyone wins. But if I am left banned, then everyone loses, with the most heavy symbolic <a href=\"/cwcki/HippoOnYourHead\" title=\"HippoOnYourHead\">hippopotamus of guilt, shame, and loathing</a> upon yourselves, because [<i>clenches fist</i>] not only are you most discriminating against one person, but a high-functioning <a href=\"/cwcki/Autism\" title=\"Autism\">autistic</a>, <a href=\"/cwcki/Homos\" title=\"Homos\">lesbian</a> <a class=\"new\" href=\"/w/index.php?title=Ctranswoman&amp;action=edit&amp;redlink=1\" title=\"Ctranswoman (page does not exist)\">Ctranswoman</a>, famous author, with headache-inducing mental handicaps, who would never intentionally or unintentionally <a href=\"/cwcki/Death_threats\" title=\"Death threats\">harm</a> any living thing without any reason whatsoever. Again, everyone loses if I am left banned from errywhere! \n</p><p>“And speaking of yellow-shirted friend, I believe you either have a secret family within or are moon-, moonlighting at the Best Buy in Charlottesville as well. To make this, to make that story short, a few days after I got out of jail on December 28th, 2014, and I had absolutely no pepper spray on my person whatsoever, because as I had mentioned earlier, I had emptied the canister and disposed of the can-, canister. <a href=\"/cwcki/Best_Buy#Attempted_shoplifting\" title=\"Best Buy\">I had done nothing at the Best Buy</a> prior to that day. And a certain <a class=\"mw-redirect\" href=\"/cwcki/Manajerk\" title=\"Manajerk\">manager</a> spokes the living crap outta me, tellin’ me I was not welcome there, that I was banned from there. I had asked why. He did not give me any answer. Then I reached into my bag to get some money out, little funds to see if I could pay my way out of this. I had not said anything about the pepper spray whatsoever, but I put my hand in the bag, and his subordinate shouts, ‘He’s going for the pepper spray!’ I stopped in surprise after hearing that. Ultimately, I left the store. I had gone there again months later to be met with the same shpiel, and no answer to why. I even went over dere head, on the telephone, to try to resolve it. Nothing. \n</p><p>\"Then last Tuesday, November 10th, I went there once again to buy <a class=\"mw-redirect\" href=\"/cwcki/LEGO\" title=\"LEGO\">LEGO</a> Dimensions Pack with a ten-dollar certificate. I got met in the back of the store with the shpiel once again, and this time I asked why and I finally got the answer. They said that I, quote, threatened them with pepper spray, and we have video footage, unquote. But again, that first time they said anything about me not being welcome there, I had not, nor ever, threatened anyone at that store. Nor had I any pepper spray on any of my visits there, then, and prior. \n</p><p>“Therefore, I faff, I feel I have to pin the blame onto you, sir, for that, my yellow-shirted friend. Either of having family there, or giving me more of a difficult time--[<i>misreads</i>] and giving me more of a difficult time, then I was already going under. Or, you do have a second job between the GameStop and the Best Buy. Hmm! And I would expect, that might be something the Better Business Bureau might like to hear, perhaps? So once again, you can eff, give everyone good karma by forgiving me and forgetting the whole mess, and unbanning me from these four GameStops, as well as the one Best Buy, and thus allowing me to be welcomed back to Fashion Square Mall as well. Everyone wins. Good peace of mind. Or leave me banned from everywhere, and nobody wins with the hippopotamus weights upon each of our heads forever!\n</p><p>“And I reiterate, I am really very sorry for pepper-spraying you. I am really very sorry for making the protest against SEGA in the first place. I have no pepper spray, and I promise never to cause anyone harm or trouble ever again. All that needs to be done for full peaceful resolutions is to unban me from everywhere. And I have stated in this later. Please, do the positive thing, and bring good karma upon us all. I’m looking towards, I’m looking forward to a written, detailed response from you and everyone who gets this letter, documenting that I am no longer banned from the Charlottesville, Virginia GameStops, and Best Buy, and Fashion Square. Thank you and have a very good and safe day. Sincerely, Christine Weston Chandler.”\n</p><p>But, right now, it’s November 29th, more than two weeks since I mailed the letter to all f-, four said locations at the GameStops, and I have not heard anything. Therefore, I am making this video. I [<i>shakes fist</i>], Christine Weston Chandler, am quite upset by not receiving any response whatsoever. No-, as well as still being banned from not only the four GameStops, but the two other places as well, Best Buy here, and Fashion Square. And, I am it-, I am issuing an embargo on all GameStops, as well as GameStop.com. And every one of my <a href=\"/cwcki/True_and_Loyal_Fanbase\" title=\"True and Loyal Fanbase\">thousands to millions of fans worldwide</a>, I encourage you all to follow me in this embargo! Never con-, never go to or conduct any business at any GameStop location anywhere. Do not even go to GameStop.com. US, UK, anywhere in the four websites. None of them. Do not go to any of those places. As well as, I am not, I am banning Best Buy as well. No Best Buy, no BestBuy.com, no Best Buy UK, whatever. As well as all Simon shopping malls! [<i>removes <a class=\"mw-redirect\" href=\"/cwcki/Dramatic_glasses_removal\" title=\"Dramatic glasses removal\">glasses</a> dramatically</i>] I’m very serious in this. Your lack of response has left me most upset! My yellow-shirted foe! [<i>pounds knee</i>] Mm! And you will lose business because of this! And if you do not have me unbanned from all four of the local GameStops, as well as the Best Buy, and Fashion Square...[<i>pounds knee again</i>] this multi-person ban from you all will still continue on. So you think about that. Bring back good karma to us all, or pretty much be damned. [<i>shouting now</i>] You’re discriminating against the LGBT community as well as the autism community! You decided to hate against us, when you hate against me. And we all know that love and friendship conquers hatred, and does a lot better. It could prevent a lot of wars, if we take to the l-, lessons learned from the positive friendship TV shows that are made available, including <i><a href=\"/cwcki/My_Little_Pony:_Friendship_is_Magic\" title=\"My Little Pony: Friendship is Magic\">My Little Pony: Friendship is Magic</a></i> and <i><a href=\"/cwcki/Care_Bears\" title=\"Care Bears\">The Care Bears</a></i>.\n</p><p>So anyway, embargo on the GameStops, the Best Buy, and Simon shopping malls, begins right now! [<i>points at camera</i>] Game over, GameStop. [<i>deep voice</i>] Gaaaame over! <a class=\"mw-redirect\" href=\"/cwcki/Spanish\" title=\"Spanish\">El juego se acabado!</a>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Family_and_Couples_Figures_Available_for_collecting_and_purchase._Also_Sandy_and_Zapina_Rosechu.\" title=\"Family and Couples Figures Available for collecting and purchase. Also Sandy and Zapina Rosechu.\">Family and Couples Figures Available for collecting and purchase. Also Sandy and Zapina Rosechu.</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Embargo_Update_12/2/2015\" title=\"Embargo Update 12/2/2015\">Embargo Update 12/2/2015</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"50%\">\n<tbody><tr align=\"center\" style=\"background:#000080\">\n<td colspan=\"3\"><b><a class=\"image\" href=\"/cwcki/File:Boomsaga.png\"><img alt=\"Boomsaga.png\" decoding=\"async\" height=\"32\" src=\"/w/images/9/96/Boomsaga.png\" width=\"32\"/></a> <a class=\"mw-redirect\" href=\"/cwcki/Sonic_Boom\" title=\"Sonic Boom\"><span style=\"color:white;\">Sonic Boom Saga</span></a> <a class=\"image\" href=\"/cwcki/File:Boomsaga.png\"><img alt=\"Boomsaga.png\" decoding=\"async\" height=\"32\" src=\"/w/images/9/96/Boomsaga.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<th align=\"left\">The Players:\n</th>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Chris</a></li>\n<li><a href=\"/cwcki/Yellow-Shirted_Foe\" title=\"Yellow-Shirted Foe\">Yellow-Shirted Foe</a></li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/Kenneth_Engelhardt\" title=\"Kenneth Engelhardt\">Kenneth Engelhardt</a></li>\n<li><a href=\"/cwcki/26_December_2014#monozettai's_Account\" title=\"26 December 2014\">Monozettai</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Sonic_Boom_Protests\" title=\"Sonic Boom Protests\">Sonic Boom Protests</a></li>\n<li><a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a></li>\n<li><a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a></li>\n<li><a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a></li>\n<li><a href=\"/cwcki/Keep_Sonic_Original\" title=\"Keep Sonic Original\">Keep Sonic Original</a></li>\n<li><a href=\"/cwcki/FIX_SONIC%27S_ARMS_IMMEDIATELY,_SEGA!!!\" title=\"FIX SONIC'S ARMS IMMEDIATELY, SEGA!!!\">FIX SONIC'S ARMS IMMEDIATELY, SEGA!!!</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/26_December_2014\" title=\"26 December 2014\">26 December 2014</a></li>\n<li><a href=\"/cwcki/2014_Jail_calls\" title=\"2014 Jail calls\">2014 Jail Calls</a></li>\n<li><a class=\"mw-selflink selflink\">Apology for Mace Incident</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"3\"><b>Coinciding Sagas</b>: <a href=\"/cwcki/Template:CatherineSaga\" title=\"Template:CatherineSaga\"><span style=\"color:#4b0082\"><b>Catherine</b></span></a>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251112125810\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.167 seconds\nReal time usage: 0.190 seconds\nPreprocessor visited node count: 564/1000000\nPost‐expand include size: 9797/2097152 bytes\nTemplate argument size: 3613/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   76.038      1 -total\n 51.45%   39.123      1 Template:Infobox/video\n 30.39%   23.107      1 Template:SonicBoomSaga\n 25.10%   19.087      1 Template:Saga\n 13.26%   10.082      4 Template:Saga/core\n  9.44%    7.181      1 Template:Video_games\n  6.96%    5.295      5 Template:Icon\n  6.81%    5.176      1 Template:Color\n  6.77%    5.145      1 Template:Quotebox\n  5.46%    4.152      1 Template:Reason\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:21979-0!canonical and timestamp 20251112125810 and revision id 353146. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Group_Embargo_on_GameStop,_Best_Buy,_and_Simon_Shopping_Centers&amp;oldid=353146\">http://sonichu.com/w/index.php?title=Group_Embargo_on_GameStop,_Best_Buy,_and_Simon_Shopping_Centers&amp;oldid=353146</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2015",
    "Videos Christian uploaded to YouTube"
  ],
  "links": [
    "FIX SONIC'S ARMS IMMEDIATELY, SEGA!!!",
    "Family and Couples Figures Available for collecting and purchase.",
    "batshit crazy",
    "Robert Franklin Chandler, Jr.",
    "Charlottesville",
    "Mighty Lesbian",
    "Family and Couples Figures Available for collecting and purchase. Also Sandy and Zapina Rosechu.",
    "Sonic Boom Saga",
    "Sonic Boom Protests",
    "Amiibo",
    "Care Bears",
    "Rage",
    "haters",
    "GameStop",
    "LBGT",
    "hurt and bullied",
    "anger",
    "SEGA",
    "Sonic Boom",
    "Yellow-Shirt Assistant Manager",
    "a more worse day for everyone",
    "Internet",
    "Chris",
    "a great deal of power",
    "banned",
    "Fashion Square Mall",
    "Keep Sonic Original",
    "lesbian",
    "Negotiation",
    "Facebook",
    "employee he maced",
    "Sonic the Hedgehog",
    "way Chris does",
    "hippopotamus of guilt, shame, and loathing",
    "My Little Pony",
    "Chris's videos",
    "GameStops",
    "harm",
    "2007",
    "Kenneth Engelhardt",
    "Videos",
    "my house",
    "YouTube",
    "Sonichu",
    "Embargo Update 12/2/2015",
    "thousands to millions of fans worldwide",
    "El juego se acabado!",
    "glasses",
    "Etsy",
    "November 2015",
    "living crap out of me",
    "26 December 2014",
    "protest",
    "autistic",
    "The Care Bears",
    "I am really, very sorry.",
    "2014 Jail Calls",
    "manager",
    "Yellow-Shirted Foe",
    "Best Buy",
    "Virginia",
    "LEGO"
  ],
  "scraped_at": "2025-11-26T21:24:47.594721"
}