{
  "url": "https://sonichu.com/cwcki/Jackie_E-mails_10",
  "title": "Jackie E-mails 10",
  "display_title": "Jackie E-mails 10",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>These e-mails between Chris and <a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a> cover the period 24 August to 28 August 2010. Following Jackie's advice, Chris agrees that talking about Sonichu for his <a class=\"mw-redirect\" href=\"/cwcki/High_school\" title=\"High school\">high school</a> reunion <a href=\"/cwcki/EXCLUSIVE_Manchester_High_School_2000_Reunion_Required_NOW\" title=\"EXCLUSIVE Manchester High School 2000 Reunion Required NOW\">video</a> will discourage trolls. Chris speaks of his happy times in high school, sounding like he is talking about recent history. The e-mail is several times the length of others.\n</p><p>In a bizarre counter-troll effort, Chris makes a ghost story about his eight-year-old self and <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">Patti</a>'s ghost giving a troll <a href=\"/cwcki/Autism\" title=\"Autism\">autism</a> and a rash.\n</p><p>Forgetting that, weeks earlier, they had been discussing his <a class=\"mw-redirect\" href=\"/cwcki/Video_games\" title=\"Video games\">video game</a> addiction, Chris tables all other discussions to bemoan the loss of all purchased downloadable content, and plans to get them back by replaying the games. It won't fuel his addiction because he'll be too busy playing to buy anything new. Chris compares losing save data to losing a relative, the one whose grave he swore on earlier. Chris says he can change his negative addiction into a positive addiction with Jackie's love. He <i>demands</i> respect from Jackie, as this is self-improvement.\n</p>\n<h3><span class=\"mw-headline\" id=\"Emails\">Emails</span></h3>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 24, 2010 - 10:04pm\n<p>Hey Chris! I got <a href=\"/cwcki/EXCLUSIVE_Manchester_High_School_2000_Reunion_Required_NOW\" title=\"EXCLUSIVE Manchester High School 2000 Reunion Required NOW\">the video</a>, so you can take it down from MegaUploader. Thanks for making it so quickly!!\n</p><p>Were you really on the news that night? That's wacky, I watch a lot of news but I never see high school graduations covered on the news, even local news; there's hundreds of schools in any city that have a graduation every year so I don't know why the news would cover them. Why do you think they were recording your graduation specifically? Can you find me a clip of yourself from that night? I'd love to see your graduation.\n</p><p>As for the <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">trolling forum</a>, I told you last time Chris, whoever those people are they have been around a long time, they can obviously hide themselves so <a href=\"/cwcki/Sony\" title=\"Sony\">Sony</a> doesn't find them. You've mailed Sony before, and guess what? They're still there! Ugh, Chris, did you just email Sony and expect the problem to go away? I told you that you need to solve this problem on your own! And I also told you that you need to start things on the forum, too. You know these trolls way better than I do - how am I supposed to just think of something to say if you can't even think of something to say? I can't post on the forum for you, Chris. And Sony can't post on the forum for you, either. How much thought have you really put into trying to come up with something? Any?\n</p><p>sigh... well, anyway, I don't want to sound like a ninny. Let's talk about the video, which I really liked! I think you did a pretty good job with it, there isn't a whole lot I would change. I do think you should try to be a little more emphatic and emotional - you told them how much you care about this, but you should also show them with your body language. Use sweeping hand gestures, that sort of thing. And also make sure to use strong facial expressions, put your heart into it. That will really hook their attention. Hmm... also, one more thing. You say in the video that you are trying to avoid getting trolls' attention with the video. While that's true, the fact is, there probably will be some trolls trying to comment on it anyway, and whether you want their attention or not they'll be there. That's why you should take a slightly different route: Even though it probably sounds odd, I think it would be okay to directly address the trolls briefly. Say something like \"Hey trolls, I know you're watching this. Well, I don't care, so go pin a rose on your nose.\" Do it really smug and happy to show them how you just laugh off their attempts to get to you. That, if anything, is better than just trying not to call attention to them, because they already know you are trying not to. Gotta be one step ahead of them.\n</p><p>Ooh, one more thing: you mention briefly that you are the creator of <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a>. I think you should go on a little bit more about Sonichu, because it is a huge thing that you've done. I'm sure your old classmates know about Sonichu, maybe you can recall some of your favorite moments of the comic, and maybe ask them to tell you their favorite moments of the <a class=\"mw-redirect\" href=\"/cwcki/Comic\" title=\"Comic\">comic</a>, or who their favorite characters are. That will remind them of how much of an artist you are, the good memories will flood back for them!\n</p><p>Ooh, Chris, I can't wait for the drawing! You're my hero right now!! &lt;3 &lt;3 &lt;3\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 25, 2010 - 6:44pm\n<p>I will rerecord the video with more emotions a little later (and maybe with a better shirt).\n</p><p>I sense a misunderstanding; I was talking Theoretically on the Graduation being recorded for television; I did not say that it was televised for Certain. Although I am certain there were a number of people in the audience with camcorders, including the families of at least the \"C\"-named students neighboring me in the lineup. However if I should find a clip of that night and my error, I will let you know about it.\n</p><p>Speaking of which, last night on NBC News @ 11, they talked about Mary Baldwin College and their Military Troop. You may have covered that a bit in your Journalism. ;) They also talked a bit of the grass of the grounds; not sure what specifically.\n</p><p>Talking about Sonichu and my favorite memories is a good idea, especially to shut the trolls up a bit, and give <a href=\"/cwcki/True_and_Loyal_Fanbase\" title=\"True and Loyal Fanbase\">the fans</a> some good service. I should inform you that I created Sonichu on March 17, 2000; within my Seinor Year at <a class=\"mw-redirect\" href=\"/cwcki/Manchester_High\" title=\"Manchester High\">Manchester High</a>, and even then he was just getting started on the CD-Cover of \"<a class=\"mw-redirect\" href=\"/cwcki/Christian%27s_Favorite_Hits\" title=\"Christian's Favorite Hits\">Christian's Favorite Hits</a>\" that I created in my Computer Graphics Class and Homemade <a class=\"mw-redirect\" href=\"/cwcki/Pok%27emon\" title=\"Pok'emon\">Pok'emon</a> <a class=\"mw-redirect\" href=\"/cwcki/Trading_Cards\" title=\"Trading Cards\">Trading Cards</a>. The comics didn't start really until about <a href=\"/cwcki/2004\" title=\"2004\">2004</a>, and the <a href=\"/cwcki/Sub-Episodes\" title=\"Sub-Episodes\">Story Formations</a> and <a href=\"/cwcki/Things_Chris_has_ripped_off\" title=\"Things Chris has ripped off\">other Character Creations</a> happened within the Four years. Granted my classmates may or may not have found my comic pages online beyond 2004... Point is the Stories were only Starting Up my Seinor Year, and there was Nothing before then.\n</p><p>Fun Stories, though, my C.O.Y2K, and Computer Graphics Class, classmate, and one of my close friends, <a href=\"/cwcki/Gal_pal#Miranda_Joyce_Mitchell\" title=\"Gal pal\">Miranda Mitchell</a>, redesigned the \"<a class=\"mw-redirect\" href=\"/cwcki/CWC%27s_Pok%27eSite_2!\" title=\"CWC's Pok'eSite 2!\">CWC's Pok'eSite 2!</a>\" Logo to the better-looking shiny one that came about later. *See attached Logo JPGs; the \"pklg2\" was the Original; \"cwcpktwo\" was Miranda's work. It was an assignment, in partners, of designing Logos for Companies; I did one for Miranda of two Chicks (young chickens) and a Strawberry (fruit) (file not found at the moment, but is printed on a big poster I designed for a later C.G. project). So at least Miranda is (or was at least) aware of Sonichu.\n</p><p>Plus, <a href=\"/cwcki/Bionic_the_Hedgehog\" title=\"Bionic the Hedgehog\">Bionic the Hedgehog</a> (attached gif), was Born also in Manchester High (or created in imagination), but during my Freshman Year back in 1996 Litterally while I was reading a \"Fear Street\" Novel during a Basketball Practice Session while I was a Manager of the Varsity Team. So, in a way, Sonichu and Bionic are like brothers; being born in the same school building. That would be an interesting idea; Bionic the Hedgehog, <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a>'s Lost-and-later-found <a class=\"mw-redirect\" href=\"/cwcki/Cole\" title=\"Cole\">Older Brother</a> who became a well-experienced mechanic and Basketball All-Star for Manchester High, Vs Sonichu, the <a class=\"mw-redirect\" href=\"/cwcki/Electric-Hedgehog_Pok%27emon\" title=\"Electric-Hedgehog Pok'emon\">Electric-Hedgehog Pok'emon</a> with incredible speeds and Zapping Powers, in an One-on-One Basketball Game.\n</p><p>Lastly, the <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">Troll Forum</a>. I think I misspoke on not knowing what to say or do on the Forum; I was on there last night checking out new stuff, then I suddenly got the ideas in response to what I was reading. \"Miranda Cosgrove\" on there now fears me, <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christian</a>, knowing about the Forum after sending a link to Sony. As <a href=\"/cwcki/JenkinsJinkies\" title=\"JenkinsJinkies\">\"Junior\"</a>, I played along and replied about Chris boycotting downloading anything new from within <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\">ModNation Racers</a> or <a class=\"mw-redirect\" href=\"/cwcki/LittleBiGPlanet\" title=\"LittleBiGPlanet\">LittleBiGPlanet</a>, in response to reading about their plan of planting a spyware virus in a Published Creation of theirs. Plus telling them that Chris may come out of hiding and create a new video, ruining their trite \"Christian is Dead\" rumor (repeated acts are LAME). Also telling them about me disconnecting my WiFi to keep them from spying on me at random times. And in another post reply, I told them <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">Patti</a>'s body was buried under cement blocks with the heavy dog house on top of them. And counting all of the surrounding plants, and telling them the fable of pouring cement into the hole as well, it was like \"Fort fuckin' Knox\". LOL\n</p><p>After that last night (this morning), I formulated more counter-details I can tell them, and I even made up a scary ghost story that happens to Junior.\n</p><p>Junior goes over to my house from the house across from mine (there are literally Five houses across the streets from mine, so if you look at them, you take your pick of which one Junior lives in) with a flashlight one night. He is trekking through the daylilly garden aisles, searching for more bad he can do about the house. When suddenly, he hears a voice, \"Hello\". He looks around and sees nobody. Then suddenly, he is paralyzed; his ankles and wrists are pulled in his left and right directions, feeling like there were hands holding them down on a floor, and he feels a pair of hands on his Neck too; strangling him, yet he can still breathe. Then the voice comes back, \"Hello, Mr. Troll.\" It is the voice of a child, about 8 years old. Junior struggles to look around, yet sees nobody. The voice continues, \"Do not be afraid of me, like the teachers of the <a href=\"/cwcki/Nathanael_Greene_Elementary_School\" title=\"Nathanael Greene Elementary School\">Elementary School</a> were; they did not understand me and my <a href=\"/cwcki/Autism\" title=\"Autism\">mind</a>. I want you to understand my mind...\" Right after, Junior sees a lot of strange images going through his mind. Including which were the images of an <a href=\"/cwcki/Abusive_babysitter\" title=\"Abusive babysitter\">abusive babysitter</a> called \"Roache\" locking him alone in a static room; a therapy session at James Madison University; the teachers, guidance counsoler and principal of Nathanel Greene Elementary School holding him down and taping his screams and more. Junior tried to scream, but Nothing came out; it was a Scream of Silence.\n</p><p>Next thing he knows, he is knocked back onto the cement block trail of the garden aisle, by the weight of a big dog, yet there was no dog body. Wrists, Ankles and Neck still being hand-held, the child ghost leaves his mind, and then he hears a deep womanly voice, Growling at him as he smells the stench of a dog's breath surrounding his nostrils. The voice says, \"Do not mess with my master, my family or me, <a class=\"mw-redirect\" href=\"/cwcki/Terrorist\" title=\"Terrorist\">you infidel!</a>\" Next, he feels the sting of the dog biting into both his ankles, one after the other. At that moment, Junior struggles back, leaving behind the lit flashlight he dropped earlier when his arms were being stretched out. And he limps as fast as he can back to his house, closing and locking his door back in, gasping for breath and dripping with sweat. He limps to the bathroom with the shower and looks in the mirror; what a gross mess he looked like. And he noticed a Red Rash on the right side of his neck, and rashes on both his wrists, from the hands that held them in place. And his pant legs were ripped, and he saw on both his ankles rashes and Teeth Marks of a Dog. He tried to scream again, but it was another silent scream. And Junior was unable to speak at all for Four Hours. For he has encountered the Spirits of Young Christopher Weston Chandler and Patti, protecting the Chandler Household.\n</p><p>The End.\n</p><p>The hands pinning him down I got from the time I was held down by the same school faculty members of N.G.E.S., and I literally came home with a rash on the right side of my neck; my mom took a photograph of it. I also took speech therapy sessions at J.M.U. during my childhood. I get my horror tale telling from the book works of <a href=\"/cwcki/R.L._Stine\" title=\"R.L. Stine\">Mr. R.L. Stein</a>; author of the \"Goosebumps\" and \"Fear Street\" Novel Series.\n</p><p>I'm thinking of adding Junior's story to the Forum, as a tactic of scaring the Trolls to stay away and stop messing with me and my family and our household.\n</p><p>I'll TTYL, <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Sweetheart</a>.<br/>\nStay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 25, 2010 - 8:52pm\n<p>Hey Chris!\n</p><p>Oh, I misunderstood about the news thing, I thought you meant you knew for sure it was. You might be right though, maybe there is news footage of it somewhere. It'd still be kind of cool to see it.\n</p><p>I really look forward to seeing the final video! You know, you should probably just release it directly on youtube, you don't need to send it to me again. You did such a good job with the first version, once you incorporate the new features I'm sure it will be good to go. And since you got the first version so quickly, I think you can still make the final version by tomorrow at 9:00pm. Remember, the sooner it's up, the sooner your old classmates can see it. I have confidence in your abilities! :)\n</p><p>I like your ideas for feeding misinformation to the trolls, it sounds like you're really coming up with quite a few good ones. Your ghost story is really well thought out, just reading it I could feel the suspense and fear you are trying to put into it - it made me shiver! :) :) I was also looking at a couple more threads today and saw some interesting ones: Here's one about juggalos. http://trollingtrain.10.forumer.com/viewtopic.php?t=87\nDid you really wear juggalo make-up? That sounds cute! Maybe you could do it again sometime. It sounds like that got to them when you did it.\n</p><p>Here's another one about rewards they are offering for various stuff: http://trollingtrain.10.forumer.com/viewtopic.php?t=86\nOne of them is that they are offering $4,000 for a <a class=\"mw-redirect\" href=\"/cwcki/Gay\" title=\"Gay\">gay</a> sex video with you in it - they actually want Junior Jenkins to be the one to do it to Chris! They said it wouldn't be a problem for you because of the gay experimentation \"jinkies\" did in his youth. I don't know how you would be able to fake that one, but maybe we could think of something; maybe use dim lighting and pretend there's two people on the video, some camera tricks or something. Another thing is they are offering a LOT of money for your <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a> to be destroyed. That one would be easier to do , obviously - either one would get you that reward money. Wouldn't it be hilarious if you fooled them and then got money for it? If you destroyed your PS3 you'd probably have to wait a bit to get the money and replace it. Well, either one gets you a lot of <a class=\"mw-redirect\" href=\"/cwcki/Money\" title=\"Money\">money</a>. What do you think you'd rather do, destroy the PS3 or fake a gay sex video?\n</p><p>Hmm, they also would be willing to pay reward for proof of your straightness, although they don't say how much. Hmm, I'm not sure how you could do that... well, we can think of something.\n</p><p>Anyway, I had another idea after I read your ghost story. A lot of people will probably be skeptical upon reading it. But what if you made another video after your current one where you tell a similar scary story and somehow incorporated it? Tell a story about some time when you encountered eerie stuff like what Jenkins is talking about. Like, do a close-up of your face with the lights out and a flashlight shining up from under your face, and somehow reference the ghost story. My idea is, you tell the story from Jenkins Jinkies perspective, and the trolls will think \"yeah, sure, whatever...\" but then CHRIS, instead of JINKIES, releases a video that is about the haunting. Suddenly, the trolls see two different people talking about the same supernatural elements... and suddenly they can't just dismiss it. Gets under their skin.\n</p><p>I gotta go now, but your Sonichu stuff sounds interesting too; when I get more time to write I have some more questions to ask about it. I can't wait to see the video up! Talk to you tomorrow sweetie!!\n</p><p>XOXOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 26, 2010 - 8:57pm\n<p>Hey Chris, I was kind of hoping you'd write me tonight! I was looking forward to seeing your video online. Or did you get it up? I actually don't remember the link for your <a class=\"mw-redirect\" href=\"/cwcki/Youtube\" title=\"Youtube\">youtube</a> account. But I kind of was hoping you'd write me to let me know it was up, I thought you'd be excited to do so. Oh well, guess maybe I'll have to go to bed without seeing it...\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 27, 2010 - 2:53am\n<p>I apologize for being late in replying; the video is uploading right now, and I'll have the link pasted on the bottom of this e-mail after it's been uploaded.\n</p><p>Thank you for your support in my ghost story; in the Forum, they took it lightly. Although, after <a class=\"mw-redirect\" href=\"/cwcki/Robert_Chandler\" title=\"Robert Chandler\">my father</a>'s reading of the print-outs of their words, he states, \"We've got them going 'round in circles.\" I think the video I did with the face paint is still on my Y.T. Account, and I think I have a photo saved somewhere; uncertain at the moment.\n</p><p>I saw their \"Rewards\" topic. Firstly, let me inform you that considering MOST of the trolls are immature, underage, demented, twisted, sick, evil and such; the \"rewards\" would obviously be False. If a troll actually comes up with such \"footage\" and gives it to someone like <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>, Clyde would NOT give out any money. So, with that considered, I would never make such a <a href=\"/cwcki/Chris_Comes_Out_of_the_Closet\" title=\"Chris Comes Out of the Closet\">gay video</a>, or <a href=\"/cwcki/The_MovingFoward_videos\" title=\"The MovingFoward videos\">PS3-wrecking video</a>, for even a Billion Dollars. And with that, I would appreciate it if you would not even think of me making any footage for the Trolls' \"Money\" ever again, please.\n</p><p><a href=\"/cwcki/Homos#Why_Chris_appears_to_be_gay\" title=\"Homos\">Proof of my straightness</a> would be a no-brainer. ;) You and Me kissing, cuddling, yada, yada, yada. LOL :)\n</p><p>Right after recording the video, and before re-hooking my router to get back online, I typed a list of my M.H.S. C.O. 2000 Classmates' names, with two blank columns for current phone number(s) and address. In the video, I encourage them to snail-mail or telephone my house phone. My father will handle the sorting out the phonies from the real deals with name verification and such. So the list is for him to fill in the blanks of contact info from the calls and letters incoming from my classmates.\n</p><p>I also make a Public Announcement for <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">Internet</a> Safety and <a href=\"/cwcki/TrollBusters\" title=\"TrollBusters\">TrollBusting</a> as a second topic in the video.\n</p><p>I have not forgotten the drawing of you and me and the circle-bangers; I'm having trouble getting a good picture in my head of the scenario to be able to draw it. I have some idea, but it's not complete to me yet. <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Art\" title=\"Chris and Art\">I am an artist</a>, and for my Sweetheart, I want to be able to do my best on the work. But I will try to have a good picture in my head as quickly as possible, and have the drawing ready by Sunday.\n</p><p><a href=\"/cwcki/EXCLUSIVE_Manchester_High_School_2000_Reunion_Required_NOW\" title=\"EXCLUSIVE Manchester High School 2000 Reunion Required NOW\">The video</a> is uploaded. http://www.youtube.com/watch?v=gQ-dpgxZruI\n</p><p>I'll TTYL.<br/>\nStay Safe and Sweetest, Sweetheart.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 27, 2010 - 8:54am\n<p>Ooh, Chris, I'm so excited to see it!!! I just watched it, I think you did perfectly.\n</p><p>I have some more ideas, like I think you should make a video telling a ghost story, to reinforce Jinkie's story on the forum. I have to rush out the door right now but I'll write more detail when I get home later today.\n</p><p>I'm so happy!!\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 27, 2010 - 4:17pm\n<p>Okay, I have some more time to write now. Long day.\n</p><p>So, I guess maybe it is a long shot to get money out of the trolls, although I still think it would be fun to mess with them. But I fully encourage you to do the ghost story video. Like I said, shine a flashlight up from under your face and have all the lights out, and tell a story about the ghosts like Jinkies did. Obviously don't mention Jinkies or the forum or anything - it has to look like a complete coincidence that you are bringing this up. When they see similar stories coming from two independent sources, they won't be able to dismiss it so lightly.\n</p><p>So your father is going to help you sort out all the stuff from your classmates? Oh, I thought you were going to have me help you, I said I'd like to. The reason I wonder about your father is just that he's from a time before the internet, so he might not be as capable of spotting phonies... You know, a lot of people communicate primarily through the internet these days, so I wouldn't be surprised if that's how your classmates try to get in touch with you. A lot of people I know prefer to use email because they don't want to send their addresses or phone numbers out where they might not be secure. I know that trolls might - or rather, will probably - try to send false leads to you but that's why I'm here, to help you sort stuff out. If you refuse to accept any email contact, it will severely limit who gets in touch with you.\n</p><p>So you won't have my drawing until Sunday? sigh... well, I want you to do your best with it, so I guess I understand. I'm still looking forward to seeing it.\n</p><p>Hey, you uploaded a new video? <a href=\"/cwcki/Stardate,_August_27,_2010\" title=\"Stardate, August 27, 2010\">Your playstation hard drive was formatted and erased</a>? How exactly did that happen? Ouch, I know you had tons of stuff saved on it. So what all did you lose, I'm not clear? Did you lose your saved games and trophies and stuff? What about all that expensive DLC you had for little big planet? You know, this might be actually a blessing in disguise, though. If you've lost all your save data for your games, maybe now you won't be as tempted to keep playing all that stuff. You know that phrase \"God works in mysterious ways\"? Maybe God saw you were hesitant to walk away from little big planet, and He gave you a little push. Maybe this was all God's doing. Regardless, I suggest you try to take the best out of the situation. Maybe step away from the games for a bit, like we've talked about. (Or maybe now that your games are gone, you'll have extra time to put into getting my drawing done and sending it to me? :) :) :)\n</p><p>Well anyway, I hope you do the ghost story video soon. You can be a really good storyteller when you try to be, I'm excited to see what you come up with!\n</p><p>XOXOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 27, 2010 - 9:18pm\n<p>Jackie, I will address the other topics of your e-mail in my next one, and I promise to have the drawing for you by Sunday.\n</p><p>But to elaborate, for a few weeks, I have been getting error codes and being disabled from downloading video and digital comic contents from the Playstation Store; I've called them a week or two ago to address it for the first time. Yet even up to today, I still have the problem, and it seems only to affect my Main account; not my secondary account. Anyway, in a troubleshooting attempt that was new to me when I called Sony today to possibly kill a corrupt file that may be causing the trouble. I followed the woman's instructions to Restore the System Files. In Miscommunications (with some faulty headphones on her end, and even though trying to make Sure I was taking the right steps, I had a bit difficulty understanding her on my end as well). Anyway, there was an error in the System File Recovery, and the console recommended Formating the Hard Drive, and this is where the misunderstandings come in; I wanted to make sure this was only affecting the System's Hard Drive, not the removable notebook HDD, and that my music, videos, games, saves and all would be safe. She heard \"System File Recovery\" when I read \"Formatting the Hard Drive\"; I was thinking \"System's Hard Drive\" over \"Removable HDD\". And I clicked \"Yes\" on the Format, and when the XMB came back up, ALL of my <a class=\"mw-redirect\" href=\"/cwcki/Comics\" title=\"Comics\">Photos</a>, <a class=\"mw-redirect\" href=\"/cwcki/Christian_and_the_Hedgehog_Boys_(band)\" title=\"Christian and the Hedgehog Boys (band)\">Music</a>, <a href=\"/cwcki/List_of_Chris%27s_PSN_video_downloads\" title=\"List of Chris's PSN video downloads\">Videos</a>, <a class=\"mw-redirect\" href=\"/cwcki/Games\" title=\"Games\">Games</a>, Saves, <a href=\"/cwcki/List_of_Chris%27s_PSN_game_downloads\" title=\"List of Chris's PSN game downloads\">Downloaded DLC</a>... GONE! I was in Major Shock, but she, Michelle, was kind enough to stay on the line for me while I collected myself. I think it took about 10 minutes to make a bit of sense and retain calm and coolness.\n</p><p>I'm currently still a bit shook up, but I see it as a fresh start again. I will redownload my Game Contents, and I've requested Michelle to see if she can give me credit for the Purchased Videos I've downloaded, so I can redownload them again. I should have gotten a second 500GB External HDD sooner for backing the videos up; can't think of everything (or afford everything soon enough; the new <a class=\"mw-redirect\" href=\"/cwcki/Wal-Mart\" title=\"Wal-Mart\">Wal-Mart</a> has my ideal 500GB WD External HDD at a Rollback of $55, which currently is a bargain for the item.\n</p><p>I'm starting on redownloading all of the Add-Ons, Music and Themes previously purchased, followed afterwards with the Game Software, in order from first item purchased to last (bottom to top). And I've restarted and reestablished my <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\">ModNation Racers</a> Profile, and I recollected my Trophies from the Online Server. Plus, I've redownload my MNR creations from Published, and I'll have to replay the whole Carrer to unlock everything again. As for <a class=\"mw-redirect\" href=\"/cwcki/LittleBiGPlanet\" title=\"LittleBiGPlanet\">LittleBiGPlanet</a>, I've backed up my profile a few months back, about last April, so all I'll should need to do for that is replay the Marvel Levels to recollect the bits and pieces there.\n</p><p>And I'll replay my <a href=\"/cwcki/Guitar_Hero\" title=\"Guitar Hero\">Guitar Hero</a> Games later on, as well as my other Disc games, especially my <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a> Titles.\n</p><p>Also, I'd like to be able to put this towards you, Jackie, with a Fresher Start on my PS3, you and I, we can make our own music on it together from scratch, in addition to our outings, movie nights and romantic encounters (including <a class=\"mw-redirect\" href=\"/cwcki/Hanky-panky\" title=\"Hanky-panky\">Fooly Cooly</a>). ;)\n</p><p>With the events of the day, I feel less constricted by my PS3, and I am able to regain control. With my reconstructing my Game Saves over time, I'll likely be least inclined to purchase any new games, discs or downloadable for a good amount of time.\n</p><p>And I can still spend my sweet time in real life with my Sweetheart, Jackie. ;)\n</p><p>It's good now, and I am recovering well.\n</p><p>I'll TTYL.<br/>\nStay Safe and Sweet.<br/>\nChristian. &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 27, 2010 - 10:17pm\n<p>Hey Chris.\n</p><p>Wow, I'm really sorry that this happened. I've had computers crash before, it's a pain in the ass.\n</p><p>But you know, I think it's a bad sign that this seems to be consuming all of your thoughts right now. I mean, yeah, it sucks when a computer crashes and you lose your data. But come on, it's just video games and movies. You're going to get all that stuff back anyway because the <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> saves records of all your downloads, so what's the big deal? This is barely a hiccup to you. Ever had a computer crash and delete your term paper the day before its due, and if you can't turn it in you'll fail your class? That's a REAL computer problem. I mean, you say you're \"shook up\" as if you've been in a car crash or something. This is just a temporary inconvenience.\n</p><p>I don't really understand how you say you're less constricted by your PS3 now. You've just written me a giant email that talks about nothing but how dismayed you are by an inconvenient computer error, and explaining in detail how you intend to devote yourself to downloading and replaying all your old games just to get old save files back. Chris, not buying new games is a good thing. But not buying new games simply because you enslave yourself to playing your old games, because you can't stand the thought of not having all your old save files at the ready, is the wrong reason to do it. It all says what I've been telling you: that you're just addicted to video games.\n</p><p>And I understand that you were trying to be romantic by suggesting we make songs on guitar hero together, but considering your addiction problems hearing you say that really just makes me feel kind of sad because you're trying to pull me into that world of darkness, all the while I'm trying to pull you out into the light.\n</p><p>Maybe you should use this time to be constructive. As I say, maybe God is trying to tell you something. Step away from the video games for now. I mean, while you're redownloading a bunch of games that you've already played hundreds of hours in, I'm sitting here waiting for a drawing that you promised to have to me by tonight. :( You should also be spending time doing things like making that ghost story video. I'm not just saying this because these are things you should be doing, but because focusing your mind on other tasks will be helpful in drawing you away from thinking about your little video game hiccup.\n</p><p>Another thing you can do to keep yourself occupied is keep working on the troll forum. I looked back on that thread about the reward money, here: http://trollingtrain.10.forumer.com/viewtopic.php?t=86\nThere's that girl who was talking about the pink shirted girls, remember? She posted a picture of the cash reward that Clyde sent her. Chris, I think Clyde might be REAL here. He might be insane, but he's actually PAYING these trolls just like he said he would. I know it seemed impossible but he's actually paying people rewards. You can use this, Chris. Make a video that fulfills one of those requirements, like the fake gay sex video or something. Or frankly, I would actually endorse you destroying your PS3 on camera for him, because it would kill two birds with one stone - get reward money from them, and sever a giant chain to your addiction. Chris, this is a perfect avenue you can take to get your mind of your video games. Get some of that reward money! That way you can pay off what you owe your dad, have some spending cash, and show up those morons.\n</p><p>Have you received any contacts from old classmates yet? Remember like I said, just show any you get to me and I'll help you sort the real from the fakes. These are all things you can do to take your mind off of your PS3 glitch. I believe in you, Chris!!\n</p><p>&lt;3 &lt;3 &lt;3\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 28, 2010 - 12:51pm\n<p>Within the majority of the Save Data that was created with my gameplay from within the past about 3 years, such as within the Guitar Hero games that allowed me to create a game version of myself, while I was playing and creating myself, they were more reflecting of myself during my lonely years of life, and even worse during the years I was having to deal and be tortured by those Trolls.\n</p><p>When I lost all of the Save Data in the Format, I lost the me that was enduring those lonely, hard times; <a href=\"/cwcki/Aunt_Corrina\" title=\"Aunt Corrina\">it was like I lost a relative</a>, but what was lost was the Lonely, Considerably Pathetic Me. And behind those emotions, were the Darker reasons behind the gameplay. I have awakened anew, with the anguish of the past three years washed away.\n</p><p>But NOW, I have a more positive turn in my life; my Future with You, Jackie. And from this point on, my gameplay on my PS3, which was tainted in the darkness of loneliness, can now be gameplay of the Light of Happiness from the Romance between you and me.\n</p><p>Yet, you are right, Jackie, during the immediate Post-Death of the Lonliness and Anguish, I can and will use my Refreshed Energy to focus on the immediate, more important needs and details of life, including the Take Down of the Trolls, while the Software Data is being redownloaded.\n</p><p>Granted, I may be inclining, or have inclined, speak of new gameplay to recover game data that HAD my old self in them, that is NOT the case. I am moving forward towards a brighter future, and I will not be tied down again by self-pity and anguish that once was there and which will NOT be emotionally recreated.\n</p><p>Jacklyn, I had spent my money on the store and new games, because I did not have a Sweetheart to spend on and shop for. But now that you are in my life, and our future is certain, I will better dedicate my funds to US and Our future together. With the Emotional Anguishes GONE in the wind For Real now, Gaming has once again been reduced to a Hobby for me. I promise you, Sweetheart, from this day forward, the Main Topic will always be about You And Me.\n</p><p>I have read and looked over the reward topic page you have linked me to. I have come to a decision, I Will Destroy my PS3 Console with a Brick, and I will have it video-recorded. I have another friend who can pretend to be Junior Jenkins to record it in action, in my own backyard. I have backed up my MNR and LBP Data, plus I've found I've backed up a LOT of the game data last February on a Flash Drive, NOT including Guitar Hero World Tour and beyond, with the Custom Player features. The console was old anyway, and with the reward, I can get the newer, slimmer version and begin anew on IT instead. But out of respect, I am going to keep the removable cover I've decorated with my <a href=\"/cwcki/Christian_Weston_Chandler%27s_Adult_Chronicles\" title=\"Christian Weston Chandler's Adult Chronicles\">self-game cover</a> printed decals as a momento, and I have removed the 500GB HDD, which I understand and accept will be reformatted when installed into the new PS3. And I can still access my PSN accounts, with Three Less Out-of-US accounts I've lost the passwords for long ago; I've been relogging into them, because the passwords were saved onto the console. Give Me Respect; I AM going to do this, and I will use the majority of the 9K to pay back my father. I am trusting you to keep this information confidential, less the Removable Cover with the Decals; I will reveal in the Video that I will be keeping that as a momento.\n</p><p>*sigh*\n</p><p>I will make the call to my friend shortly after this e-mail, and I'll have to be leaving soon for lunch with my father. But let me address the remaining topics in your previous e-mails briefly before I wrap this up.\n</p><p>I have the idea for the drawing, and I am Ready to draw it; you will have it in an e-mail tonight around 9 or 10:00. My father has declined aiding me in taking the phone calls from my classmates; we've been getting mostly <a href=\"/cwcki/Prank_calls\" title=\"Prank calls\">the Jokers</a> anyway, so no classmates yet. I will add a comment to the video to send me e-mails in addition to calling and snail-mailing me. I will give great consideration to me telling the Ghost Story.\n</p><p>I have to go now. I'll TTYL.\n</p><p>Stay Safe and Sweet, Jacklyn.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 28, 2010 - 2:53pm\n<p>Hey Chris!\n</p><p>Well, I can kind of understand where you're coming from. In fact, I think maybe I kind of misunderstood what you were saying before. You see me as the light in your life Chris? Oh my goodness, that is so incredibly sweet of you. I feel the same way about you, Chris! I'm so happy you are able to express yourself to me like this. I feel so close to you. I am so glad that I've given you this hope and happiness Chris. I was worried for a bit that my message about your video games wasn't getting through, but I see now I was wrong to doubt you. I can understand why your lonely video game times have provoke such strong memories for you. But the fact that you are strong enough to recognize that you have a new outlook on life is so amazing and inspiring.\n</p><p>Oh Chris, you've made me feel like the most special girl in the world... ;) ;) ;)\n</p><p>Oh my god, you're going to destroy your PS3?? That is amazing, Chris!! So you're going to smash it with a brick? Here's how I suggest you do the video: First, you're going to need to be in costume and with a mask on (remember, since \"Jinkies\" is the one smashing it, not Chris). Then, on the video, do a close-up of the PS3 intact, and say that you're going to remove the custom cover and hard drive as trophies of your victory over Chris. Video tape yourself removing those parts and putting them aside. Then, take your brick, and bring it down hard on the console. Have the camera show clearly you smashing it, over and over and over. Don't stop until every last part of the console has been ground into shards or plastic and metal. Remember, they're offering a lot of money, so they'll want to see the job done thoroughly and perfectly; make sure it's clearly shown that NOTHING from the console survived (aside from the cover and hard drive, obviously). Then, hold the cover up next to your masked face and give a thumbs up and say something like \"you got trolled, Chris.\" The reason I want you to be so meticulous and thorough about this is because we want them to be so completely ecstatic over this... that after you've received their money, when you make a new video showing how you fooled them all, it will DEVASTATE them.\n</p><p>Who is your friend that you're going to get to help you? Do you mean Samantha? I hope she's able to help you. Although if she can't, maybe you can just set the camera on a stationary surface while you do it. Do you have a tripod for it? That might actually be better than having a person hold the camera, because the video will be much clearer if the view is stationary.\n</p><p>So anyway, I'm glad that you're going to be responsible with your reward money. Paying off your dad and putting much of it in savings is definitely the right thing to do. If you want to get the new PS3, that's definitely cool, you'll certainly have earned the right to splurge a bit on yourself. I never wanted to cut out your video games completely, video games are perfectly fine if you can manage them. But the fact that you're willing to destroy your current one and be without it for a couple days until you get your money shows that YOU are the one in control of them, not the other way around. YOU are the one choosing what to do. I'm so proud of you, Chris.\n</p><p>So your father doesn't really want to help with fishing out your old classmates? Well, like I said, I can help you instead. If you get any phone messages, just give me the phone numbers and tell me what they say and I can help you spot the fakes, look them up to see if they are who they say they are. Same thing with emails - just forward me any emails you get and I can look them over. Your father is probably busy, but I certainly have some time to help, and I'd love to do it for you too. You've been making so many sweet gestures for me recently, it's the least I can do ;)\n</p><p>I can't wait to see my drawing!!! I'm excited to see what you make it out to be. Oh, I feel so happy right now, Chris!!\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #ff00ff; background: #ffdddd; vertical-align: centered; color:#000000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\">⇐ <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">Jackie E-mails 9</a><span style=\"color: #000000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><span style=\"color: #000000\"><strong><a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">Jackie E-mails</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">Jackie E-mails 11</a><span style=\"color: #000000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a class=\"mw-selflink selflink\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240713035648\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.110 seconds\nReal time usage: 0.117 seconds\nPreprocessor visited node count: 829/1000000\nPost‐expand include size: 71042/2097152 bytes\nTemplate argument size: 49621/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 204/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   40.261      1 -total\n 77.77%   31.310      1 Template:Emails\n 68.97%   27.769      1 Template:Navbox\n  8.89%    3.580      1 Template:Tnavbar\n  8.05%    3.241      7 Template:Email\n  5.98%    2.406      1 Template:Succession\n  5.70%    2.296      4 Template:EmailReply\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14321-0!canonical and timestamp 20240713035648 and revision id 192098. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jackie_E-mails_10&amp;oldid=192098\">http://sonichu.com/w/index.php?title=Jackie_E-mails_10&amp;oldid=192098</a>\"</div></div>",
  "categories": [
    "Category",
    "Jackie E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "LittleBiGPlanet",
    "2007",
    "57",
    "MHS classmate E-mails",
    "money",
    "abusive babysitter",
    "Sydney Contacts",
    "Games",
    "\"Junior\"",
    "White knight E-mails",
    "43",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "44",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "40",
    "56",
    "Elementary School",
    "Fooly Cooly",
    "39",
    "Mailbag",
    "video game",
    "21",
    "the fans",
    "Mr. R.L. Stein",
    "9",
    "Vivian Gee",
    "Common Questions",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "2004",
    "25",
    "15",
    "Jackie",
    "Music",
    "59",
    "Trading Cards",
    "49",
    "53",
    "2010",
    "Jackie Romy",
    "Pok'emon",
    "Regina e-mails",
    "52",
    "Blanca Weiss",
    "TrollBusting",
    "42",
    "Jackie E-mails 11",
    "2011-2012",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "Sonichu",
    "Troll Forum",
    "17",
    "trolling forum",
    "35",
    "Older Brother",
    "47",
    "Guitar Hero",
    "BABSCon E-mails‎",
    "it was like I lost a relative",
    "LoveYouLongTime",
    "31",
    "18",
    "Aug",
    "CWC's Pok'eSite 2!",
    "Gregg Mays",
    "Clyde Cash",
    "Jackie E-mails",
    "4",
    "36",
    "Bionic the Hedgehog",
    "Catherine E-mails",
    "PS3",
    "48",
    "19",
    "2004‒06",
    "the Jokers",
    "Letter",
    "50",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "Sony",
    "8",
    "high school",
    "10",
    "2",
    "self-game cover",
    "2008",
    "2013-2014‎",
    "Your playstation hard drive was formatted and erased",
    "Clyde E-mails",
    "the video",
    "The video",
    "Wal-Mart",
    "gay",
    "Patti",
    "Tito",
    "Uri Geller E-mails",
    "3",
    "46",
    "autism",
    "7",
    "Misc E-mails",
    "2007‒08",
    "37",
    "Manchester High",
    "gay video",
    "11",
    "Photos",
    "23",
    "26",
    "I am an artist",
    "Thetan",
    "Christian",
    "2009",
    "13",
    "61",
    "youtube",
    "45",
    "you infidel!",
    "Electric-Hedgehog Pok'emon",
    "Videos",
    "29",
    "Sweetheart",
    "24",
    "32",
    "Open Relationship E-mails",
    "Jack Thaddeus",
    "30",
    "58",
    "Samantha Thaddeus",
    "The Wallflower",
    "1",
    "Downloaded DLC",
    "my father",
    "28",
    "PS3-wrecking video",
    "34",
    "comic",
    "PSN",
    "video",
    "Miyamoto Saga",
    "38",
    "41",
    "Christian's Favorite Hits",
    "20",
    "mind",
    "Jan‒July 2007",
    "Story Formations",
    "Evan E-mails",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "ModNation Racers",
    "16",
    "other Character Creations",
    "Internet",
    "6",
    "Sonic the Hedgehog",
    "Jackie E-mails 9",
    "Sept"
  ],
  "scraped_at": "2025-11-26T15:50:28.708230"
}