{
  "url": "https://sonichu.com/cwcki/Jackie_E-mails_7",
  "title": "Jackie E-mails 7",
  "display_title": "Jackie E-mails 7",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>These emails cover the period 31 July to 4 August 2010. Jackie gives Chris advice on how not to be a welfare leech/lazy fuck. Chris refuses to get off welfare entirely, and changes the subject to meeting her for <a class=\"mw-redirect\" href=\"/cwcki/Hanky-panky\" title=\"Hanky-panky\">hanky-panky</a>. Chris sold nine games, but only for store credit, which he immediately applied to a reservation for <a href=\"/cwcki/LittleBigPlanet\" title=\"LittleBigPlanet\">LBP2: Collector's Edition</a>. He also buys a $50 PSN card, also monthly, leaving him with $80 to his name, which, he claims, he plans to keep until the end of August.\n</p><p>Jackie calls him out on his bullshit, saying what we already know: He acts like mommy and daddy will clean up all his messes, revolves his life around his addictions, and is too lazy to go out of his way to make actual art for \"his woman,\" Chris thinks that selling some games is \"allowance\" to buy another game, and totally not perpetuating the problem. Jackie makes a good point that he's using <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">Rocky</a> and not <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">Bob</a> to manage his debt. Chris admits that he would crash into slumber from the stress of Bob getting (justifiably) angry. Bob is checking Chris's bank account <i>twice a day</i>, and Chris is traumatized at the idea of his <a href=\"/cwcki/PlayStation_3\" title=\"PlayStation 3\">PS3</a> access being restricted. Chris pledges on a family member's grave to never get another credit card ever; rolling earthquakes with epicenters in Virginia graveyards have not yet been confirmed.\n</p>\n<h3><span class=\"mw-headline\" id=\"Emails\">Emails</span></h3>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>July 31, 2010 - 2:21pm\n<p>Hey Chris! \n</p><p>Ah, I did misunderstand some things, it seems. I wasn't aware that you paid your father rent. Okay, so you pay him $480 a month for rent, plus you currently pay him $100 in repayment for him settling your credit cards, so that's $580 a month total you give him, right? So out of $820 a month, you actually keep $240 after expenses, correct? I think I can maybe offer some help in this regard. I apologize if this letter is pretty long, but I want to make sure I have everything clear.\n</p><p>Let me try to figure this out out loud for myself. What position exactly did you apply for at <a class=\"mw-redirect\" href=\"/cwcki/Wal-Mart\" title=\"Wal-Mart\">Wal-Mart</a>, like a greeter or cashier? Or did you just make a general application? I know some stores don't let you apply for specific positions, they just take your application and then look for a place they can put you as it becomes available. Do you know what the hourly rate is you would be starting at? Assuming it's $7.25 per hour, which is <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a> minimum wage, if you worked 40 hours a week you'd get $290 a week, or about $1160 a month. But that's assuming you stay at minimum wage, you could get a raise to more than that. If I remember right, their cashiers are actually supposed to start at a higher amount. So if you kept your SSI, you could make theoretically up to $1800 a month. Granted, that is a lot more. But to make up to that amount of $980 on the job at minimum wage, you'd need to have like 32 or 33 hours a week. Unless an employee is guaranteed full time, retailers are typically very erratic and unreliable in how many hours they give their employees; they give you however many hours they need you to be there that week and no more. I used to work retail, one week I'd get 25 hours, the next week I'd get maybe 10. And 25 was pushing it, retailers usually keep their employees at as few hours as possible, it saves a lot of money for them to do so. So don't be disappointed, but I wouldn't count on being able to get that full $1800 a month even under the best circumstances.\n</p><p>In answer to your question of what I would rather you do, I'd honestly (no criticism or harshness intended here, I'm just trying to be honest) rather that you go for a full-time job and get off the social security entirely. That wouldn't be easy to do in a short amount of time, starting at full-time right away is probably not possible, but as time goes on and you are with a company for longer, you should be able to get your employers to give you more time and promotions until you get there, at which point you could give up your SSI. My reason for saying this is because life isn't all about money, and just because you CAN get more money by staying on SSI doesn't mean you SHOULD. Remember Chris, like I said, SSI is meant for people who are unable to take care of themselves, you are able to take care of yourself if you apply yourself and work hard. And as you work toward having more hours and a better position, you would be able to gradually lessen your dependence on the SSI until you can do away with it entirely.\n</p><p>So wait, you have a new credit card that you're paying $50 a month on? May I ask, when exactly did you get this card? And also if I may ask, what is the limit on the card, and how close are you to that limit? And is it just the one card you have right now, or do you have more cards apart from the ones your father settled for you? I know these are kind of private questions, but I think it would help me be able to help you if you tell me. (Don't worry, I'll keep quiet about all of this, your secrets are safe with me.) So between the $580 to your parents, $50 on this card, and I'm guessing around $15 each a month for netflix and gamefly... wow, I guess you don't have much left over at the end, only like $150 after bills, is that about right?\n</p><p>Here's my advice to you, in several parts: One, I think you should cancel netflix and gamefly immediately. Aside from the <a class=\"mw-redirect\" href=\"/cwcki/Money\" title=\"Money\">money</a> cost, they are both enabling your <a class=\"mw-redirect\" href=\"/cwcki/Video_game\" title=\"Video game\">video game</a> and <a class=\"mw-redirect\" href=\"/cwcki/TV\" title=\"TV\">tv</a> habit. Two, I think you should take an inventory of all the video games you own, figure out the ones you haven't played in a while, and sell those. I know you have a lot of older games, right? There are probably some retro game stores around town, they pay good money for any old games they can get their hands on because they're hard to find. Right now those games are just taking up space and feeding your habit. I know you've had impulsive weakness in the past, but trust me, getting rid of the thing that's tempting you is the best way to grow out of it. I know it seems grim sometimes, but trust me, your impulsive shopping habits aren't related to your autism at all, you can beat them. The first step is always hard like ripping off a bandaid, but it's necessary to move forward, you just have to step up and do it.\n</p><p>In fact, maybe I can help you with figuring out which games to get rid of and which ones are valuable and you can make good money on. I have a request: Would you be willing to take inventory of all your video games and send it to me? I mean literally every game you own, every system, every console, whether you've owned it for a month or for twenty years. Everything from your <a class=\"mw-redirect\" href=\"/cwcki/Playstation_3\" title=\"Playstation 3\">playstation 3</a> down to your old sega genesis. I won't ask you to dump all of it, going cold turkey isn't easy to do. But if I know exactly what you have it will help me help you. I bet it wouldn't take more than a few hours to do. Would you do that for me? Please? ;)\n</p><p>Now, on to other stuff. You say your parents would call the <a class=\"mw-redirect\" href=\"/cwcki/Police\" title=\"Police\">police</a> on you if you went to Otakon? I just don't get how they would do so. I guess if your <a class=\"mw-redirect\" href=\"/cwcki/Car\" title=\"Car\">car</a> is in their name, they could legally punish you for taking it without their permission, but couldn't you have gotten on a greyhound bus to otakon? From <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> to Baltimore, a bus ride wouldn't be very expensive. And like I said, if you told them you were going, they wouldn't be able to file a missing person report. And as for them taking your money, isn't the SSI your money, not theirs? They don't have a legal right to it, do they? I'm glad that they are supportive of you having a <a class=\"mw-redirect\" href=\"/cwcki/Girlfriend\" title=\"Girlfriend\">girlfriend</a>, but it just worries me a little that you don't seem willing to challenge them when you have a different opinion from them. It's sweet that you think they'll like me, but the truth is, sometimes parents don't like their child's significant other.\n</p><p>Aww, I'm glad we started talking together again too, Chris :) It's so sweet to know that I bring this much joy to someone I care about. I look forward to finally meeting you in person.\n</p><p>XOXOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 1, 2010 - 3:00pm\n<p>Well, on the application, I applied for stocker, cashier or greeter; probably a few others, but I don't recall at the moment, and at Part Time (with plans for 28 to 30 hour Work Weeks). It's only the ONE credit card, it's a Reward Zone Master Card (from <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">Best Buy</a>); the limit currently is 750, with probability of increase (don't quote me on that); it's currently 20 over. I intend to practice heavy self-control, and I do not wish to increase the monthly payment at this time.\n</p><p>I will cancel my GameFly, but I wish to keep my <a href=\"/cwcki/Netflix\" title=\"Netflix\">Netflix</a>; I have BOTH myPS3 and <a class=\"mw-redirect\" href=\"/cwcki/Wii\" title=\"Wii\">Wii</a> Linked to the account for Instant Streaming with their respective discs. A spot of an update is required with it in the PS3and <a class=\"mw-redirect\" href=\"/cwcki/PSP\" title=\"PSP\">PSP</a> area, but I have previously created an inventory and kept it up to date for a good while; I'll attach the Microsoft Excel File for your consideration. I am willing to concentrate in the Vintage Console Games, but DEFINITELY NOT any from my Game Boy, SNES, N64, Sega Saturn, Sega CD, and 32X collections. And I wish to keep ALL of the consoles.\n</p><p><a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">My car</a> is under my parents' name, and my S.S.I. is linked to my <a class=\"mw-redirect\" href=\"/cwcki/Father\" title=\"Father\">Father</a>'s S.S.#, so they do currently have the power to take away one or both from me.\n</p><p>Also, another note, I live in Ruckersville; 10-15 minutes North of Charlottesville, so in order for me to take a Greyhound Bus, I would have had to drive to Charlottesville before getting on that bus at all.\n</p><p>Where are you now (or how far from home are you currently)? Please tell me in your reply.\n</p><p>Stay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 1, 2010 - 6:12pm\n<p>Hey Chris,\n</p><p>So you're only paying $50 a month on the Best Buy card? Chris, you'll never pay it off at that rate. Those store cards have ridiculous interest rates just to take advantage of people who don't pay them off right away. Big businesses like Best Buy really aren't even stores, they're banks - they literally make money only off their credit card interest, the merchandise they sell doesn't earn them anything. You need to pay that card off immediately. And unfortunately, I know you don't have the money on hand to do that yourself, so I think you're going to have to go to your father again and ask him to relieve it for you. Because otherwise you'll just be pouring $50 a month into a black hole, because the interest will swallow that up and keep getting bigger.\n</p><p>Now you're not even going to hear me out on getting rid of your games? This just makes me so frustrated Chris, because you shoot me down and REFUSE to even CONSIDER getting rid of your precious video games for the consoles you listed - Chris, those ARE vintage consoles! Why do you need all those games? Chris, I counted from the list you sent me, for all those consoles combined you have a total of 193 GAMES. WHY do you need 193 GAMES?? And that's just for those consoles, you have more than 225 GAMES for all the OTHER consoles, and I doubt you mean to get rid of all of those. Why would you want to hold on to all of these games, Chris? Why? What do they do for you? Is it about nostalgic memories? I hate to be harsh, but the fact is that if that's the case, then those nostalgic memories are the ONLY thing you're going to have left, because these games are consuming your life!\n</p><p>Face it Chris, there are only two types of people who would have that many games: Collectors, and Addicts. The difference between the two is that a collector can manage the other parts of his life just fine, whereas an addict's life is overrun by his possessions and they are the only thing he thinks about. You are the latter. YOU are an addict. Chris, you say that you talk to a pastoral counselor about your problems like the <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a>, correct? Have you even brought this issue up to her at all? I bet you haven't, because I REFUSE TO BELIEVE that she would consider trolls taking pictures of you to be a greater problem than the THOUSANDS OF DOLLARS YOU WASTE ON SOMETHING THAT IS DESTROYING YOUR LIFE. If you really expect this woman to help you you need to be HONEST with her.\n</p><p>You keep saying that you are trying to curb your impulses and make up for your past mistakes, but all I see is that you repeat them over and over. And you say that you do not wish to increase your current monthly payment, well, like I said, what you do pay is just going into a black hole, then. When did you get this card, Chris? Was it after your father relieved your previous cards? Have you ever thought that maybe you shouldn't have any cards? Maybe you shouldn't be managing your own money, period. Especially if you're at risk of getting another card as soon as this current one is taken care of.\n</p><p>*UGH* I'm sorry if I sound mad, but I was just stressed and needed to vent about that, plus I think you needed to hear it bluntly. Because you have a serious problem and I think you don't listen to anyone about it unless they force you to. I want you to get better Chris, and I also want us to have a chance, but you just seem so unwilling to change your habits even when they're ruining your life and that saddens me.\n</p><p>On to other stuff... I hope you get the job at Wal-Mart. When does the store open? Remember what I said, they most likely won't give you 28-30 hours every week; usually retail stores are pretty erratic in the hours they give part-time employees, some weeks they may ask you to work 35, other weeks you may only get 10. It all depends on how much they need you, they won't give employees one hour more than they have a need to. I would recommend trying to get your foot in the door to full-time work, because then it would be guaranteed, and you'd have a greater possibility of promotions down the road.\n</p><p>How are things going on the troll forum, have you posted any more stuff there or found anything out? I'm embarrassed to say I kind of forgot about it so I haven't gone there since the last time we talked about it. I'm in Delaware currently, I'll probably be home around the 17th or 18th, things got pushed back a little, I may be going to western Pennsylvania for a little bit.\n</p><p>Don't feel too sad or anything about what I wrote here, okay? Like I said, I only am trying to shock you a little bit because I think you need to be shocked. Write back and let me know how things are going, okay?\n</p><p>XOXOXO\n</p><p>Jackie\n</p><p>August 1, 2010 - 6:15pm\n</p><p>Also, I forgot to thank you for putting together that list for me, I'm glad you did that :)\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 2, 2010 - 10:21am\n<p>Well, you're right for the most part of the games, but I'd still like to keep some of them for, yes, the nostalgia and such. The few console-type games I listed, except for the Game Boy, I counted around 10 or less of those for that console upon recollection. Still, there are among the majority of the rest I'd be willing to part with. BTW, I do not know who you were referring to who would buy the vintage games (the only place I can think of, and I'm sure wouldn't give much is <a class=\"mw-redirect\" href=\"/cwcki/Snooky%27s_Pawn_Shop\" title=\"Snooky's Pawn Shop\">Snooky's Pawn Shop</a> in the <a class=\"mw-redirect\" href=\"/cwcki/C-Ville\" title=\"C-Ville\">C-Ville</a> Downtown Mall), so please fill me in on who this person is. Perhaps you may have been thinking of someone in Staunton.\n</p><p>I've had the credit card for months now (I don't recollect when specifically), and I do not wish to bring it up with my father. Not only would he be pissed at me, he would shout Very Loudly, and considering how old he is, he does not need any more <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a> to worry about. I will increase my monthly payment to 75 to help, and if I get the job at Wal-Mart, it will most certainly pay the whole thing off from the first month. Also, FYI, GameFly was More expensive than Netflix at a rate of 17 a month versus 11 a month, respectively, so obviously the cancellation of GameFly will be a big help.\n</p><p>I do listen to all the advice and input I get to help me recover, it just takes me a while to fully process the ideas sometimes towards the action. At least I got started with selling some of my <a class=\"mw-redirect\" href=\"/cwcki/DVD\" title=\"DVD\">DVDs</a> the other day. I am Not refusing to consider getting rid of the latter of my games; I'm getting used to the idea and starting at an easier pace for myself; concentrating first on the vintage, leaving some out and such. Likely, after a start on selling the games to the person you've talked about and feeling more comfortable about it, I feel I'll expand further into the stuff left out and all.\n</p><p>I understand what you are saying, and while the shock is uncomfortable to me, after recovery from the shock I am most appreciated for being told the truth from a trusted outside perspective. It takes time for me, so your understanding and patience in all of this is most appreciated. :)\n</p><p>For future reference, though, I would feel better when in person upon sharing the thoughts with me that you not go into shouting, and keep it on an inside voice level. I get enough shouting in my lifetime from my own father, and sometimes my mother.\n</p><p>As for the <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">Troll Forum</a>, I haven't posted in a while; I need to get back into that groove. \n</p><p>So the 18th is the estimated date; I'll plan around that, but I would feel it better if it was sooner; I really want you here to talk and to hold. You bring out a lot of good feelings in me I didn't feel as much of before we met through <a class=\"mw-redirect\" href=\"/cwcki/OKCupid\" title=\"OKCupid\">OKCupid</a>. I long to look into your pretty eyes, hold your hand, hear your voice. I rearranged the letters in your name, Jacklyn Romy, and I ended up spelling, \"Mor Jacky Lyn\". To me that reads \"More Jacky for Lovin'\"; talking to you now is very good, and it will be better when we meet. And every following moments and days I get to be with and talk to you, I will always get my fill of you as my cup overfloweth with your sweetness and radiance, and I will never cease to be most appreciative and thankful. So when I read \"Mor Jacky Lyn\", I'm thinking I want more of you every moment.\n</p><p>I'll TTYL; please also keep me posted of the state you're currently in as we count down the days.\n</p><p>Stay Sweet and Safe.<br/>\nXOXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 2, 2010 - 1:47pm\n<p>I'm not sure myself what store you would go to to sell your vintage games, I don't know any specific person or store, but I'm sure there's at least one or two somewhere in Charlottesville. Do a google search for it, I'm sure it will come up.\n</p><p>Like I said, I didn't mean to seem like I was shouting or anything. In person I don't really shout ever. When I type in all caps like that, that would be the equivalent of me talking sternly in-person, but I'd still be calm and civil. I don't like to yell, it makes things worse for everyone. I'm glad you understand, I didn't want to hurt your feelings, I was kind of worried that maybe I had.\n</p><p>How much money do you have leftover after everything you give your dad each month? Wasn't it like $240 or something? The only expenses you really have are food and the best buy card, correct? If you budget yourself out well, cut out the fast food and restaurants, you should be able to feed yourself for a month on not much money at all. I've been in tight spots before where I had to cut back on everything, if I'm careful and frugal I can feed myself for a month on no more than maybe $60 or $70, and some people get by on even less. That leaves like $150 you could put toward your Best Buy card per month, which would actually make a dent in it. I really think you should pay as much as you possibly can on the card. I know you don't want your dad to find out because he'll get mad at you, but don't you think he has a right to be mad? I mean, he had to relieve your debts for you and probably made it clear that he didn't want you having cards again, but you've lied to him and gotten another card - and as things are going, you may very well not be able to take care of this card on your own. I mean, he's taken care of you all your life, I think he deserves for you to be honest with him and not betray his trust. And keep in mind what I said, the chances of you actually getting the 30 hours a week you want is pretty low...\n</p><p>I hope you're serious that you're considering getting rid of all your games; in your previous email you did say \"I am willing to concentrate in the Vintage Console Games, but DEFINITELY NOT any from my Game Boy, SNES, N64, Sega Saturn,Sega CD, and 32X collections\". That's a quote direct from you, so I feel my response was justified. But I understand if you were shocked by the thought initially, addicts often are when confronted with their problem. I think it would help to give yourself something of a rigid timetable. For example, I think you should pick ten games from your collection - any ten, from any consoles you want - and sell them by this Friday the 6th. Do you think you can do that for me? Like I said, do a google search for vintage game retailers around Charlottesville for your older games. If they don't want them, or they don't offer a decent price because they're not worth much or whatever, you can take them to Goodwill or something - Goodwill, Salvation Army, they always take games so they can give them to the less fortunate children, I'm sure. Newer games like your PS2, PS3, gamecube, and so on I'm sure Gamestop would take. I'm pretty sure Gamestop will give you better prices if you bring in a bulk amount of games at once. But regardless, I want your goal to be to get rid of 10 games by Friday, so if you aren't offered a satisfactory price for a game or no one wants it, then replace it with another game from your list and try to sell THAT. Will you do this for me?\n</p><p>You really should go back on the troll forum, I thought you were really excited to get on there? You know, another good point of getting rid of your video game addiction is that you'll have more time for other pursuits and interests. Check the email you used for jenkinsjinkies, I'll bet they've been writing you, I know they were eager to have you there.\n</p><p>Whoops, I didn't realize what time it was, I need to get going. I'll be on later, so I hope to hear from you soon!\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 3, 2010 - 2:45pm\n<p>Actually, you've read my mind, or my actions; I've picked out about 9 PS3, 2 PS2, 3 PSP and 4 DS games and traded them in at GameStop earlier this afternoon. I got about over 50 dollars store credit, which I put in the reservation of <a href=\"/cwcki/LittleBigPlanet\" title=\"LittleBigPlanet\">LittleBiGPlanet</a> 2 Collector's Edition.\n</p><p>I will do a Google for people/places in C-Ville who would take vintage games, and let you know what I find.\n</p><p>Also, FYI, each month I get myself one 50 dollar <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> Card, so I can at least catch up on some of the add-ons I couldn't afford the past month, such as a bunch of the Track Packs for <a href=\"/cwcki/Guitar_Hero\" title=\"Guitar Hero\">Guitar Hero</a>. I have closed my GameFly Account and mailed back the current game I had from them. Plus, this month, I had to pay my mom back 30 I owed her, so she and I are now even. So, currently, I have around 80 in the bank after my father cashes his check and after this payment on my credit card, and I intend to keep it in there the rest of the month.\n</p><p>On another topic, I checked the calender; the 18th is on a Wedensday; we can plan for our day out on the 20th. We'll meet at the Starbucks by the China King Buffet, across from <a class=\"mw-redirect\" href=\"/cwcki/Fashion_Square\" title=\"Fashion Square\">Fashion Square</a> in the early afternoon, let's say 1:00. We'll hang out together, talk and all the fun stuff. We can walk about the mall (I'm open for your suggestions as well), and later we can go to the Downtown Mall's Pavillion <i>[sic]</i> for that week's <a class=\"mw-redirect\" href=\"/cwcki/Fridays_After_5\" title=\"Fridays After 5\">Fridays After 5</a> Concert. Come after the fun, we'll see how you and I feel. My car is reliable, and I would like to be able to drive you around, so if you feel cool with that, you can have a friend or relative drop you off, and I will drive you back to your place at the end of our day. Please let me know your thoughts.\n</p><p>Also, from your photograph I still had saved on my PSP, I created a Mod of you in <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\">ModNation Racers</a> (it is NOT Published, and I do not intend to publish it; it will remain ours alone). I'm attaching an in-game photo of it; please tell me how accurate I was of you (note, body shape is not changable, I took a guess at Jeans and Sneakers for your lower-wear, and I was uncertain of your eye-color (I guessed brown)). But all things considered, I think I nailed your T-Shirt to a \"T\" with the sticker placements, as well as the tattoo on your right arm.\n</p><p>Please also let me know if you appreciate the gestures and things of you that I have shared with you.\n</p><p>I'll TTYL.\n</p><p>Stay Safe and Sweet.<br/>\nXOXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 3, 2010 - 3:16pm\n<p>Hi Chris.\n</p><p>Uh, I'm not really sure where to start... I'm not sure you've really understood anything I've said.\n</p><p>Why are you spending $50 on PSN cards every month? You said that you have learned from the mistakes of your spending habits, but clearly you haven't if you are still dropping $50 a month on video games. How can you claim to have learned from your mistakes when you are choosing to spend all this money on games while you know you have a debt of HUNDREDS OF DOLLARS on a credit card that you know you shouldn't have? Honestly, I feel kind of bad for your parents, I think the fact that they relieved you of your debts previously taught you that it was okay for you to spend all you want because they'll clean up the mess when it all comes crashing down. If you really cared about them you wouldn't force them to do that repeatedly - yet you're choosing to ignore your debts while you still have a chance of taking care of them without your parents' help.\n</p><p>I guess I didn't spell it out exactly, but when I wanted you to sell ten games, I meant so you could get cash for them. Selling them for store credit so you can buy another video game isn't doing yourself any good at all. A regular game costs $60 these days, so what is the collector's edition going to cost? At least $80? Or more, maybe? I'm sorry sweetie, but for the purposes of my assignment that won't count. I want you to sell ten MORE video games, for cash this time. And that money is not to go to the purchase of any new video games.\n</p><p>Chris, you do understand the purpose of our talking about your video game addiction, right? The purpose is to end it. When I wanted you to sell ten games, I thought I was helping you transition slowly; I was thinking to myself \"well, he has to get rid of ten games for now but he still has hundreds more he can play, we'll get to those in time as he becomes adjusted to the idea of getting rid of his games\". I honestly didn't even consider the idea that you were still buying NEW video games, because given your situation that seemed so absurd that even though I know you're an addict, I thought you still understood better. You honestly had me fooled.\n</p><p>Thank you for the modnation character you made of me. Although honestly, it's just kind of a reminder of your addiction that even when you want to make a sweet gesture for me, you can't do it outside of video games. Aren't you an artist? Didn't you think of maybe drawing a picture of me? That would be much sweeter, if you did that for me.\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 4, 2010 - 11:10am\n<p>I've been looking forward to <a class=\"mw-redirect\" href=\"/cwcki/LBP\" title=\"LBP\">LBP</a> 2 for a while now, and the 50 dollars is just an allowance for me. More importantly, though, apparently the Trolls made an attempt at their Credit Fraud plan. They scheduled an early payment of the WHOLE THING from my checking account (Thank God it was rejected), but I was hit with an Insufficient Funds fee for a \"Returned Item\", yet I still had over 40 in the bank even after that 35. I had to go to the bank to sort it out, but it's getting straightened up for right now. Firstly, since I've found a good confession from them on their Forum, http://trollingtrain.10.forumer.com/viewtopic.php?t=58, I'm going to relay this to <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">Rocky</a> and Elizabeth, and I'm going to take this to my bank, and I'll tell my father about this credit card. He had to take it out of the Family Savings to pay off the past credit cards, and he says \"were deep\" in something there.\n</p><p>Anyway, while I'm digging myself out of this mess, I think we're in a good position to rat out the Trolls here, plus they are getting suspicious of a \"Traitor\" in their midst, but Thank God they do not suspect <a href=\"/cwcki/JenkinsJinkies\" title=\"JenkinsJinkies\">Junior</a> yet.\n</p><p>I will Sell 10 games for money later, but right now, this is more important, and I promise to hand-draw a rendition of you later. But I need to confirm for my reference, what color are your eyes, do you wear pants (what kind if applicable) or a skirt or dress (and what color in general), and tell me about your shoes as well (sneakers, slippers, boots or what and color), please.\n</p><p>I'll TTYL.<br/>\nStay Safe and Sweet,<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 4, 2010 - 12:31pm\n<p>Well, I just went to my bank to tell the manager of the information. She and I called the credit card company. Sadly, even though the first trial of the 770 dollar payment failed and was returned, which cost me the bank's fee of 35 dollars, a Second Trial of the payment collection from my bank is in process. So, even though THAT will fail too, I will be charged another 35 dollars for the Return Fee. On the bright side, the Trolls' plan of getting my PS3 Repoed WILL FAIL (Thank God), they have remotely stolen $70 from me. It's a small price to pay in comparison, but at least there is a chance the two Fees will be refunded to me in a week (less or so).\n</p><p>Meantime, I will try to look up a local Vintage Game Vendor who I can sell a bunch of my games off to, and Plan \"B\" is to sell Ten current-ish games for Cash.\n</p><p>*sigh*\n</p><p>Our day together around the 20th will continue as planned, and you and I will share a good time being together. I still need the info I requested in the last e-mail to make a great drawing of you for you. I need to rest a while. I'll TTYL.\n</p><p>Stay Safe and Sweet.<br/>\nXOXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 4, 2010 - 1:42pm\n<p>Chris, I'm so sorry that happened... At least the payment won't go through, right? Sounds like you can get the fees reversed, though?\n</p><p>I read that forum post you linked me to. It says that they couldn't go through with it because their guy on the inside turned out not to be on the inside, he was fucking with the trolls? Like, he was trolling the trolls themselves. But something still happened... I wonder if it was just a freak coincidence that an error happened? Or maybe someone else not from that forum did it? I don't know Chris, it's freaky. But at least they haven't done any real damage.\n</p><p>So you're telling your dad about the card? The circumstances that caused this suck but at least you're coming clean to him, which was going to happen anyway. So he has to pay off the card? How does he feel about it? Is he really mad?\n</p><p>I hope you won't get another card again, Chris. This behavior really does have to stop. Not because of some hacker troll, but because you were digging yourself into a grave with your addiction. Maybe you should talk to your dad about managing all your spending from now on. Actually, I'd ask him if he would specifically keep an eye on your video game spending. Like, ask him to keep note of all your receipts and stuff. In fact, it might be a good idea if you ask him to hold onto your PS3 for a while. I think you probably spend more time on that system than any other, right? Maybe you should ask him to lock it away for a week or something, give you a chance to see what you can do with yourself when you don't have access to it.\n</p><p>I know things suck right now and you're probably feeling pretty down. But maybe forcing yourself to get up and go outside to do stuff will help you feel better. I think you should definitely try to go sell some video games this week like you originally planned. Maybe your dad would be touched if you sold some stuff and then gave him the cash you got as a partial repayment for his relieving you. You know, a little sign that you're trying to make up for your mistakes.\n</p><p>I'm kind of curious why you're talking to your <a class=\"mw-redirect\" href=\"/cwcki/Church\" title=\"Church\">church</a> counselors about all this? I mean, isn't your dad already dealing with it with you? Like I've been saying, I think you should be talking to your counselors about your addiction problems. I mean, they're there to help you with your problems and imperfections, right? I don't get how they can help you deal with this bank thing. Besides, if they had known previously about your card that you couldn't pay off, they probably would have told you to come clean with your dad in the first place.\n</p><p>Well, anyway, my eyes are green. I usually wear jeans and flipflops, I have a bunch in different colors, nothing fancy. I'd love to see you do a drawing of me, but get to it when you can, I know you have other stuff to deal with.\n</p><p>Take care, and let me know what's going on.\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 4, 2010 - 6:28pm\n<p>Green Eyes and FlipFlops; at least I was right on the Jeans. I got it now.\n</p><p>Getting the fees reFunded is a problem, it requires approval from not only the local bank manager, but also major edits/tweaks in the computers. I am in, though, on the ID Fraud Protection Plus Plan (Free for me, Thank God), and also I am in on the \"Opt Out\" Plan, which if a Transaction, Online or Real Life, Would put me into the Red, the charge would be automatically Declined. The Opt Out goes into effect starting on the 16th of this month.\n</p><p>I have informed my mother about the Credit Card first (she is more calm than dad is); I have asked her to relay the news to him. I feel if I do it myself right-off, he'll not only get super angry and raise his voice to Loud Shouts, but it would just put me into a state where I may as well be lying cowardly on the floor in the fetal position. This way, he gets his anger out into the air only (mom would leave the room during the time), and he'll have time to recover and calm down before confronting me about it (not as loudly).\n</p><p>My father is currently monitoring my bank account; he asks for a bi-daily printout of the current online statement information and any pending transactions. Your suggestions of having him lock up my console for a week and such have been noted into my memory; I am not saying it is a bad idea, I'm just not comfortable with it.\n</p><p>Sweetheart, after this whole experience, I Swear on my <a class=\"mw-redirect\" href=\"/cwcki/Aunt_Corina\" title=\"Aunt Corina\">Aunt Corina</a> Weston Inge's Grave that I will NEVER apply for a Credit Card EVER again.\n</p><p>Giving dad the money I get from the game sales is a good idea, yet I would like to wait until this whole mess clears up, and I am fully certain I have over 50 dollars in the bank after the clear-up beforehand. I will sell the number of games shortly enough, at least by Friday of next week.\n</p><p>I'll TTYL.<br/>\nStay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 4, 2010 - 7:06pm\n<p>Hi Chris.\n</p><p>That's okay, you can wait til next week if you want to sell some games. You've got enough going on right now.\n</p><p>I know you aren't comfortable with the idea of him taking your console, but I think it might be a good idea for you. Sometimes we can't grow unless we force ourselves to endure a situation where we aren't as comfortable as we would like, it makes us stronger through adversity. I think you should really consider it. Even maybe just to be prepared for it, because it's possible your dad might decide on his own to take it away for a bit, if he feels you can't be trusted with the PSN purchases. But try not to worry about it for now. I'm glad you're sworn off credit cards. They can be death traps for even the most resolute and strong-willed of people.\n</p><p>I can't remember if I asked, but when does the new Wal-Mart open? Have you been able to talk to anyone over there about it yet? I'm excited to see what you find out about it.\n</p><p>Chris, overall, I'm actually pretty impressed with you and how you have been handling this situation. Even though this is a very tough time for you, you seem like you're staying pretty calm and keeping a cool head about how to deal with it. I just want to let you know that I am proud of that and you deserve some recognition for it. ;)\n</p><p>I'll write more later (and can't wait to see your drawing of me :),\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #ff00ff; background: #ffdddd; vertical-align: centered; color:#000000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\">⇐ <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">Jackie E-mails 6</a><span style=\"color: #000000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><span style=\"color: #000000\"><strong><a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">Jackie E-mails</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">Jackie E-mails 8</a><span style=\"color: #000000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a class=\"mw-selflink selflink\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240713051845\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.101 seconds\nReal time usage: 0.108 seconds\nPreprocessor visited node count: 825/1000000\nPost‐expand include size: 69094/2097152 bytes\nTemplate argument size: 47571/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 54/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   36.769      1 -total\n 75.03%   27.589      1 Template:Emails\n 65.27%   23.998      1 Template:Navbox\n 10.38%    3.815      1 Template:Tnavbar\n  8.39%    3.084      6 Template:Email\n  6.70%    2.463      6 Template:EmailReply\n  6.66%    2.450      1 Template:Succession\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14316-0!canonical and timestamp 20240713051845 and revision id 197773. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jackie_E-mails_7&amp;oldid=197773\">http://sonichu.com/w/index.php?title=Jackie_E-mails_7&amp;oldid=197773</a>\"</div></div>",
  "categories": [
    "Category",
    "Jackie E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "LittleBiGPlanet",
    "2007",
    "57",
    "MHS classmate E-mails",
    "money",
    "Sydney Contacts",
    "Jackie E-mails 8",
    "White knight E-mails",
    "43",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "44",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "40",
    "56",
    "39",
    "Mailbag",
    "video game",
    "Aunt Corina",
    "21",
    "9",
    "OKCupid",
    "Fridays After 5",
    "Vivian Gee",
    "Common Questions",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "25",
    "15",
    "59",
    "girlfriend",
    "Wii",
    "PSP",
    "My car",
    "2010",
    "49",
    "53",
    "Jackie Romy",
    "Fashion Square",
    "Snooky's Pawn Shop",
    "Regina e-mails",
    "52",
    "Blanca Weiss",
    "42",
    "2011-2012",
    "Virginia",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "Troll Forum",
    "17",
    "LBP",
    "35",
    "Father",
    "47",
    "Junior",
    "Guitar Hero",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "stress",
    "31",
    "18",
    "Aug",
    "Gregg Mays",
    "Clyde Cash",
    "Jackie E-mails",
    "4",
    "36",
    "Bob",
    "Catherine E-mails",
    "PS3",
    "48",
    "playstation 3",
    "19",
    "2004‒06",
    "Letter",
    "50",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "8",
    "10",
    "2",
    "DVDs",
    "hanky-panky",
    "Rocky",
    "2008",
    "2013-2014‎",
    "C-Ville",
    "Charlottesville",
    "Clyde E-mails",
    "Wal-Mart",
    "Uri Geller E-mails",
    "Tito",
    "3",
    "46",
    "7",
    "Misc E-mails",
    "2007‒08",
    "37",
    "11",
    "23",
    "26",
    "Thetan",
    "2009",
    "13",
    "61",
    "45",
    "29",
    "32",
    "24",
    "LBP2: Collector's Edition",
    "Open Relationship E-mails",
    "Netflix",
    "church",
    "Jack Thaddeus",
    "30",
    "58",
    "Samantha Thaddeus",
    "The Wallflower",
    "trolls",
    "1",
    "28",
    "Best Buy",
    "34",
    "PSN",
    "Miyamoto Saga",
    "38",
    "41",
    "20",
    "Jan‒July 2007",
    "car",
    "Jackie E-mails 6",
    "Evan E-mails",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "ModNation Racers",
    "16",
    "police",
    "6",
    "tv",
    "Sept"
  ],
  "scraped_at": "2025-11-26T15:15:25.410541"
}