{
  "url": "https://sonichu.com/cwcki/Jackie_E-mails_11",
  "title": "Jackie E-mails 11",
  "display_title": "Jackie E-mails 11",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>This page covers emails exchanged between <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> and <a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a> from 28 August to 31 <a href=\"/cwcki/August_2010\" title=\"August 2010\">August 2010</a>. Chris smashes his PS3, but is traumatized by the loss of his beloved HONEST and TRUE love. He is in a panic to replace it at first opportunity, and cheats on its still-warm corpse with that slut, Nintendo Wii. His stupidity makes <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">his mother</a> cry, but she still buys him a new console.\n</p><p>To fulfill Jackie's request that he draw a \"circlejerk,\" Chris honors his Cherokee heritage by drawing a picture of Indians masturbating around Jackie and himself. Jackie is not satisfied by this \"cheat,\" and requests a replacement drawing. He again fails by drawing a mixed scene of men and women; he is very reluctant to draw the <a class=\"mw-redirect\" href=\"/cwcki/Pickles\" title=\"Pickles\">pickles</a>.\n</p><p>Chris also has a confusing \"Prince and the Pauper\" <a class=\"mw-redirect\" href=\"/cwcki/Dream\" title=\"Dream\">dream</a>.\n</p><p><br/>\n</p>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 28, 2010 - 4:41pm\n<p>I have already <a href=\"/cwcki/The_MovingFoward_videos\" title=\"The MovingFoward videos\">created the video</a> myself before I read your e-mail; I decided to do it myself anyway; no mask or anything; just total full-force and personal actions. I am uploading the video now, and the Mega Upload will send the link to <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde</a> right after full Upload, and I have sent him a message informing him of the video, with 3 Post Damage photos; I will forward you the e-mail shortly. And the link is below.\n</p><p>I'm trusting Clyde to come through on the deal, and if not, I can buy another <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a> in a couple of months myself. I've checked a local <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a>; the 60GB, 4 USB, PS2-Backward-Compatible, Memory Card Slotted, Wi-Fi, Thick PS3 I had just smashed is priced Highest of the USED PS3s at 349.99. And I can get a used 80GB, 4 USB, PS2-Backward-Compatible, Memory Card Slotted, Wi-Fi, Thick PS3 for 299.99, granted on them having one in stock. A couple of days? I can go for months if I have to. I gave Clyde a week to snail-mail me the Cash.\n</p><p>I will get right to work on the drawing for you.\n</p><p>Let me just go ahead and check in, are you and I set to meet on Friday, September 3, 2010 as I have estimated, or are you planning on visiting your friend for longer? The location and time is still set for the Starbucks next to the China King Buffet at 1:00 PM; please feel free to be early. I will recognize your face from the one in the photo I still have on my <a class=\"mw-redirect\" href=\"/cwcki/PSP\" title=\"PSP\">PSP</a>. If I fail to recognize you possibly in the crowd, I'm sure you'll recognize my face. Or, I can meet you outside in front of the Starbucks, waiting by the gate there, or hanging by either you by your drop-off vehicle, or me by <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">my Escort</a>.\n</p><p>Please let me know in your reply.\n</p><p>I'll e-mail you the drawing tonight; right now, I'm going to take a shower.\n</p><p>TTYL.<br/>\nStay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 28, 2010 - 5:33pm\n<p>Hey, Chris.\n</p><p>Hey, you know, it looked like you weren't hitting the PS3 as hard as you could in the video. I think you need to do a much better job if you want that reward money.\n</p><p>I found this video of a girl destroying her PS3: <a class=\"external free\" href=\"http://www.youtube.com/watch?v=DJVBsUX-zCM\" rel=\"nofollow\">http://www.youtube.com/watch?v=DJVBsUX-zCM</a>\nLook at how she does it and take notes. She's like one third your size but she manages to put some effort into it.\n</p><p>Take it outside again, but this time, really smash it up. Take apart all of the components and smash them individually. The <a class=\"mw-redirect\" href=\"/cwcki/Troll\" title=\"Troll\">trolls</a> aren't going to believe it's truly destroyed, so they might not pay you until you actually destroy it. So here's what you do: make another video wherein you put it on your driveway, and run it over with you car. Run it over a few times, back and forth, just to ensure. And then, you know what you could do? Tie it to the back of your car, and then set your camera onto your back seat so that as you drive along, they can see the ruined remains of the PS3 being dragged on the road. I mean, this is a lot of money, you can afford to put some effort in it.\n</p><p>Oh crap, I was just going to talk about some other stuff but I forgot what time it was, I have to go out. But hey, get the new video done as soon as you can. I look forward to seeing it!\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 28, 2010 - 6:33pm\n<p>The Topic page specifically stated, \"With a Brick\". I'll add more damage tomorrow; there goes Plan \"c\"; selling it for parts.\n</p><p>Anyway, here are some Native American <a href=\"/cwcki/Cherokian_Clan\" title=\"Cherokian Clan\">Cerokees</a> dancing and banging around us.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 28, 2010 - 11:04pm\n<p>Taken Care Of, <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Sweetheart</a>.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 29, 2010 - 4:16pm\n<p>Wow Chris, that's a neat drawing! I'm curious, what inspired you to draw native americans around us in a forest? Well, now that you've given me this little teaser, I'm looking forward even more to seeing my drawing of us in the pool with the circle jerk. You know just how to get my motor going! ;) Are you still planning to have that to me by 9pm tonight?\n</p><p>So I really like the job you did on smashing up the PS3. Looks like you really came through. Thanks for forwarding me all your correspondences with the trolls. I'm curious, what made you decide to send the video to them as yourself? I thought the point of having <a href=\"/cwcki/JenkinsJinkies\" title=\"JenkinsJinkies\">Jenkins Jinkies</a> was that you could do it as him, instead of as yourself. I hope they still send you the money now. I mean, their whole purpose is to troll you, so why would they send you money? Wasn't the purpose of this whole thing to reverse-troll them by getting their money and THEN revealing yourself? I'm confused.\n</p><p>Also, I notice you gave them an ultimatum of one week to get the money to you, or else you won't endorse the video? I don't get what you mean, you sent them the video, they have it, right? You say the troll will be labeled \"a man of no word\" if you don't back it up, but I don't see why they need you to admit its real when the video itself is proof. If you don't get the money within a week, what exactly will you do? You know, you could make a video of yourself to reinforce your ultimatum, I guess. It might sound stronger if they see and hear your resolution, then if they only read the words in an email. Because I was kind of confused when I read it, and I think they might be too, but we all know how strong you can look when you put your full force into it. I'd sure love to see you flex your might for them, sweetie. ;)\n</p><p>Speaking of reward money, I looked at the thread again to see if they mention it. I didn't see anything about your PS3, but I saw this guy got like $1500 for drawing <a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a>, here: http://trollingtrain.10.forumer.com/viewtopic.php?t=86&amp;postdays=0&amp;postorder=asc&amp;start=15\nIsn't that the guy whose drawings I confused to be yours a while back? Wow, <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">these trolls</a> must really love his comics. Did you ever try to get payment from them for your <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu</a> comic? I thought the reward money was all about trolling, but I guess they pay artists, too.\n</p><p>Well, anyway... How does it feel to not have your PS3 anymore?? It must be kind of exciting to have that monkey off your back. What have you been doing with your time? Going outside more? I know it's only been not even a day since you did it but I bet the world just feels cleaner and brighter for you now. What are you going to do with yourself now that you don't have the PS3? Ooh, have you thought more about doing that ghost story video? But probably better do the ultimatum video too, that's probably more important now. I can't wait to see it!\n</p><p>XOXOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 29, 2010 - 9:01pm\n<p>Actually, that drawing of the Native Americans WAS the Circle-Jerking drawing; did you not see them jerking off while you and I were having intercourse? I just could not get the Circle-Jerking to happen in my head at the Pool, but I felt more able to with a different public setting. Also, I thought I had mentioned that I am 1/16th Chrokee, but anyway that was an inspiration behind the Native Americans.\n</p><p>I did not want Junior to get the credit for the footage, so I went ahead and did the whole thing myself and went straight to Clyde Cash with the known e-mail address I still had.\n</p><p>At least the battle with Clyde is won; but now his sword is handed to \"<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Surfshack Tito</a>\", as it is detailed <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">in an e-mail from Him</a>. I may have to reveal that I was Junior Jenkins the whole time. *sigh* But then again, Clyde's order is Above Tito's, so there's a chance. I will reply to him and see how he replies.\n</p><p>Right now, getting the cash for You, Me and my family is more important, and I wish to concentrate on that before I troll them any further. Although, I swore to <a class=\"mw-redirect\" href=\"/cwcki/God\" title=\"God\">God</a> that if I get the Cash from them for real, I would Forgive ALL of the Trolls and <a href=\"/cwcki/Light_His_Mind%27s_Darkest_Hour\" title=\"Light His Mind's Darkest Hour\">remove my curses from them</a> (likely in another video). So with that, I feel uncertain of continuing to troll them back after since I would finally see compensation for the pains and anguish from the past three years. I know I could get more, but in this situation, it is \"<a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Money\" title=\"Chris and Money\">Take what I can get</a>\" in this \"Dog Eat Dog\" world.\n</p><p>Let me get back with you on the Trolling Topics later on.\n</p><p>Post-Destruction, I still feel shook up, but <a class=\"mw-redirect\" href=\"/cwcki/High-Functioning_Autistic\" title=\"High-Functioning Autistic\">functional</a>. I am finding side-comfort in my <a class=\"mw-redirect\" href=\"/cwcki/Wii\" title=\"Wii\">Wii</a> for the moment, and I've been watching <a class=\"mw-redirect\" href=\"/cwcki/Television\" title=\"Television\">television</a> and DVDs from my DVD Burner instead. Outside Social activities were low as far as I know, but I'll go out for a while tomorrow. And I went out to <a class=\"mw-redirect\" href=\"/cwcki/Church\" title=\"Church\">church</a> this morning. I did not get any sleep last night. I had a crazy mental moment of the loss energized by coffee on the way to Church. When changing DVDs earlier, I looked up to put the DVD into my PS3, only to find it was not there, while my Burner was below with its tray open. I fell asleep after the earlier communication with Clyde at about 1 or 1:30; would have fallen asleep sooner, but Clyde got me keyed up with his disbelief. I had some sort of a <a class=\"mw-redirect\" href=\"/cwcki/Dream\" title=\"Dream\">dream</a> where it was a <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/The_Prince_and_the_Pauper\" title=\"wikipedia:The Prince and the Pauper\">Prince and Pauper</a> situation with me replacing the Prince; it was confusing and <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>-filled as I surrounded with people who had VERY Little Understanding of me as I talked good of <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Yoshi\" title=\"wikipedia:Yoshi\">Yoshi the Dragon</a> when the Prince's <a class=\"mw-redirect\" href=\"/cwcki/Babysitter\" title=\"Babysitter\">babysitter</a> referred to <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Mario\" title=\"wikipedia:Mario\">Mario</a>'s dragon friend as a damned <a href=\"/cwcki/Homos\" title=\"Homos\">homosexual</a> icon. I do not believe that, but the subtext is clear to me. I am disguised as the Prince of the non-existent \"Junior Jenkins\" in the Kingdom of Trolls, and the <a href=\"/cwcki/Anne_Boleyn\" title=\"Anne Boleyn\">Royalty of the Kingdom</a> will be finding out eventually or soon that their <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">Crowned Prince is a Fake</a>.\n</p>\n<ul><li>sigh*</li></ul>\n<p>Anyway, PLEASE Inform me of the Confirmation of our Date on Friday in your reply. And thank you for your continued support throughout this ordeal. It means a Lot to me. :)\n</p><p>TTYL.<br/>\nStay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 29, 2010 - 10:16pm\n<p>I was also curious, why did you name the picture \"Unga Bunga\"? I'm not really sure what that means, is that Cherokee for something? And I was hoping you would draw MY fantasy though, not your Cherokee one. Wasn't that kind of what you promised? To draw my fantasy? I'm kind of sad, I've been waiting all this time for the drawing of my fantasy that you promised, and then you delivered something else entirely. I'm kind of disappointed.\n</p><p>So how come you didn't want to credit Jenkies, though? Wasn't the point to convince them that a troll had finally destroyed your PS3, and then dash their triumph and show them up? I mean, if they had sent the money to a person they thought was a troll and then it turned out you hoodwinked them out of their money, that would have been the greatest victory ever. But now that you sent it to them as yourself, well, I just don't get why they would willingly send money to the person they mean to troll in the first place. I mean, the point behind tricking them was because they presumably wouldn't send money to Chris. I just don't really get your reasoning, but I guess if they end up paying you, it all works out.\n</p><p>Your prince and the pauper story sounds really interesting, but I don't really understand what you mean about it? Could you be more specific? Tell me how the story relates to what's going on in your dream. Like, what were the people talking to you about when they didn't understand you? And who is Yoshi the dragon, I don't remember him from that story? And what about this babysitter? I don't remember a babysitter from the story either. Could you explain a bit more about what you mean?\n</p><p>Anyway, you know I never actually specified that I would be available for next Friday for our meeting. I said that I would be home around this time, but I never confirmed which day, you just kind of assumed that yourself. You seem to have a habit of just making plans for the both of us without really confirming it with me Chris, even though I've only ever really given a rough date of my return. I'm unfortunately still not sure which exact date and time I will be back. But I'll keep you informed. In the meantime, when are you going to get my drawing to me?\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 30, 2010 - 12:38am\n<p>Well, perhaps I misunderstood on the Circle Jerking having to happen at a pool, but I will draw it for you, and I will get to you by tomorrow night. \"Unga Bunga\" was just an expression I <a class=\"mw-redirect\" href=\"/cwcki/Random_Access_Humor\" title=\"Random Access Humor\">randomly</a> picked for the natives to chant as they jerked off. In all fairness, though, you did say Circle Jerking, and I delivered. But I will do it over for you in the pool, Sweetheart.\n</p><p>The original point was having a Troll Be Witness to the Smashings; not having the Troll do it themselves and get the credit. But I had a change of heart and decided to take the credit for myself; it also gives off the true impressions that you're proud of me for. ;) \n</p><p>You're right, I was assuming the date, but I did not make it concrete for myself yet. Which was why I kept checking in with you on the details from your end to confirm the assumptions and make them fact or not. I've been waiting for the details of your return date, so we can set the final details of When we're going to plan to meet. I will continue to wait patiently for you, as well as the details straight from you.\n</p><p><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Yoshi\" title=\"wikipedia:Yoshi\">Yoshi</a> is the Dragon that Super Mario has rode on since the Super Nintendo game, \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Super_Mario_World\" title=\"wikipedia:Super Mario World\">Super Mario World</a>\".\n</p><p>For the dream, I don't remember verbatim what the royal servants of the Prince said (Babysitter; Nanny; the Woman who looks after the Prince and/or Princess for the King and Queen in the castle or such); In this case, the prince was about somewhere between 8 and 14 years old. To relate it to the Troll situation, think of Junior as the Prince with Clyde as King (and optionally Tito for the advisory), and everyone else the remaining servants; take your pick who fills in for the Queen and the Nanny. Like in the \"Prince &amp; the Pauper\" story, I switch roles with Junior and pretend to be him, and with my mental state being different, everyone OF the Prince communicates with me like I was He and not Myself. Eventually the error catches on in the Court, I am exposed as a Fraudulent Prince, and the truth is all out there. Eventually, I will have to inform the Trolls I've been pretending to be one of them under the Fabrication of the character, Junior Jenkins.\n</p><p>I don't think I can explain it better than that.\n</p><p>Also, and I'll forward you the e-mail shortly, but I'm to meet one of the Trolls in <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> tomorrow and receive the Cash in person.\n</p><p><a class=\"mw-redirect\" href=\"/cwcki/Slow_in_the_mind\" title=\"Slow in the mind\">I'm mentally blanking out at the moment</a>.\n</p><p>I'll offer more thoughts for you later. (TTYL)\n</p><p>Stay Safe and Sweet.<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 30, 2010 - 2:42pm\n<p>Chris, I was very specific in my fantasy when I described it to you. Look, here's what I wrote, quoting myself:\n</p><p>\"Can you show me a preview by drawing us together in a pool? We would just be tearing at each other; but then we get caught! A bunch of guys come in surrounding the pool and just stare at us, but we're so enamored with each other, making such passionate love, that we just don't care and we keep going! And then all the guys get turned on by watching us, and they start jacking themselves off into the pool...\"\n</p><p>So yeah, I'm wondering if you could re-do the drawing for me? You did deliver the circle jerking but not the pool part. The guys don't have to be native american or anything, but that was a nice touch that you did, I like that you think of those kind of details :) A lot of artists who don't care about their work tend to just put the minimum detail they can, poor proportions, coloring outside the lines, blank white backgrounds, things like that. It's nice to see you care enough to do a good job and make it look nice. &lt;3\n</p><p>I guess maybe I missed something when I was reading the correspondences between you and the trolls; I was going off of what that forum thread said. The title was \"Reward for Trolling\", and the $9,001 was for your PS3 being destroyed, so I assumed that meant it had to be an act of trolling, I didn't see where it said that it could just be a troll bearing witness to you doing it. But it doesn't matter, sounds like they're paying you anyway. Whoo, I was worried they were going to renege. (Then you could call them <a href=\"/cwcki/Man_in_the_Pickle_Suit\" title=\"Man in the Pickle Suit\">pickle-suited</a> reneggers ;) But I guess you're off to the mall right about now to collect the money? Awesome! Let me know how it goes!\n</p><p>I noticed in one of the emails to them that you said you would curse them if they didn't come through? That's another thing that probably would be best reinforced by more than writing. You said you met Jinkins Jinkies too? Lol.\n</p><p>Well anyway, let me know how the meeting goes!\n</p><p>XOXO\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 30, 2010 - 3:40pm\n<p><a href=\"/cwcki/Charlottesville_Fashion_Square#Chris_captured_on_video\" title=\"Charlottesville Fashion Square\">I went to the mall</a>; I got there right before 1:30 PM, had a chicken sandwich and some water. I waited until 2:10, and nobody showed up. I just got back home; Tito has sent me <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">his reply</a>, being an arrogant son of a bitch (I'll forward the two e-mails to you shortly). It looks like they're Not going to pay me.\n</p><p>And the bastard even makes a claim saying that he Talked to Junior and got a Reply out of him that he did not make an alliance with me (something like that). How could he get a reply from a Non-Existent Troll? The Bastard is Lying right through his Teeth just to NOT pay me at all. &gt;:(\n</p><p>I have formulated an idea; I'll make an Audio recording file of a conversation between me and Junior. In this case, I'll add that he has NOT received communication from Tito at all, and disagree with what he said. I'll also state that because I did not receive my \"reward\"/compensation, I will call Clyde a Cheap, Lying Bastard with FALSE Reward Posts. And also state that aside from Junior, ALL Trolls are still Cursed. I'll work on the audio recording later (after I rest for an hour, then redraw our pooling circle jerk).\n</p><p>Fresh Idea: I'll forward Tito's messages to Clyde and see how he responds.\n</p><p>I'll replace my PS3 as soon as possible, but Smashing it for this venture that has emotionally tortured me the past weekend was a Big Mistake. I'll start by seeing what else I can pawn off. And I understand my neighborhood will be having a community yard sale (individual yard sales from each house within the subdivision) this coming weekend; I'll host one in my yard and see if I can make some green selling the majority of <a href=\"/cwcki/My_Little_Pony\" title=\"My Little Pony\">my Little Pony</a> collection, including the pricey castle, Butterfly Island playset, etc. I REALLY did not need the huge playsets. :( At least I kept all of the parts and pieces for each of them. And I'm sure I can add a bunch of other stuff to my lot.\n</p><p>I'm feeling crestfallen, but I'll recover again and move forward.\n</p><p>I'll tell you something else, Jackie, I even had the thoughts of, after getting the 9 Grand in my hands, traveling to Tennessee and meeting you there. I really would have set things up between you and me to do that if I had the money. But you will be returning to <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a> soon, and our date location is still set; it's the When that is still in question.\n</p><p>I long for you to be here for me to share sweet emotions with. You warm my heart up. :)\n</p><p>Stay Safe and Sweet,<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 30, 2010 - 4:43pm\n<p>Hey Sweetie!!\n</p><p>You only waited ten minutes past the meeting time? What if the guy was just running late? For nine thousand dollars I could think you would wait a little longer. It's not like you had some pressing appointment to get to afterward.\n</p><p>Uh... this Tito guy said he talked to Jinkies? How is that possible? I don't like the sound of that Chris. I mean, why would he bother making up a lie about talking to Jinkies when he could just decide to withhold the money? Obviously it couldn't be exactly what he says, because YOU'RE Jinkies, but this sounds really weird. It sounds like Tito talked to someone, at any rate.\n</p><p>I like your idea about the recording between you and Jinkies, but I think it should be a video. Have you ever seen those interviews like on <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/60_Minutes\" title=\"wikipedia:60 Minutes\">60 Minutes</a> where the person being interviewed wants to be anonymous, so they have them in a dark silhouette and alter their voice so they can't be identified? You should do a video like that, where YOU (Chris) are \"offscreen\", talking to JINKIES, who is sitting in the shadow onscreen. Like, you would be talking to him in your normal voice, asking him questions about his recent activity, whether he met with Tito, and how you've buried the hatchet with him, and then \"he\" responds in a deeper voice or something. Make sure that when you (Chris) are talking, try to keep your jaw still, as even if you're silhouetted in darkness you don't want people to see \"Jinkies'\" jaw moving, it would look weird. Maybe you could even have Jinkies perform the curse on the trolls, just to cement it all. I do hope you get the money, use the interview video to sway them and let me know what you and Tito decide on.\n</p><p>Why do you think smashing the PS3 was a mistake? I mean, it would be great to get that reward money, but I thought your main purpose was to do it as a symbol of severing your enslavement to <a class=\"mw-redirect\" href=\"/cwcki/Video_games\" title=\"Video games\">video games</a>? I think this was a major step forward for you, whether or not you got money for it. But one thing I'm confused about is, how do you intend to replace the PS3 right now? They cost like $300, right? You said you have like $40 saved for a date with me, correct? And your father takes most of your welfare check now, so you only take away like $100 for yourself every month, right? So it would take like three months to save enough money to be able to get a new console, and that's only if you spend absolutely nothing on anything else in that time. (Or I guess maybe less time, depending on how much of your other stuff you sell off.) I mean, I know I said I wouldn't be bothered if you got a new PS3, but that was assuming that you got this $9,000, which would be more than enough to spend some on your games. I'm just confused why your only goal now is to replace the PS3 when at the immediate moment you have pretty much no money. I mean, you weren't nearly this eager to sell stuff when the goal was to pay for a ticket to Otakon. And besides, just a couple emails ago you told me that you could easily go for months before getting another console, so why the rush now? Didn't you mean what you said?\n</p><p>You know sweetie, I would LOVE if you came to Tennessee to see me!! I'm still going to be here for a few more days, but you know what? If you were to come visit me, maybe we could extend our stay there a couple more days and you could stay with me, and I could show you around, and we could have some \"alone\" time together? &lt;3 &lt;3 &lt;3 If you don't want to drive your car for so far, I'm sure you could get a fairly cheap deal on a greyhound bus ride. You'd be staying with me when you get here, so the only real cost is travel. For a bus ride, that'd be definitely a LOT less than a new PS3. (At least if you were going to get a new console, I'd recommend an <a class=\"mw-redirect\" href=\"/cwcki/Xbox_360\" title=\"Xbox 360\">Xbox 360</a>. Say what you will about Microsoft, but the fact is, they don't have nearly as many software glitches like the ones you were having in your PS3.)\n</p><p>So which would you rather spend money on, Chris? Replacing an old video game console that you destroyed because you didn't need it in the first place, or coming to spend a weekend alone with me? What's more important to you, sweetie? :) :)\n</p><p>I know you'll make the right decision, honey. &lt;3 &lt;3 &lt;3\n</p><p>Jackie\n</p><p>P.S. Hey, when can I expect my pool drawing delivered to me? I've been waiting for ages.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 30, 2010 - 11:45pm\n<p>As it was made clear in Tito's latest e-mail, which I've just forwarded to you. I'll still wait until I have the cash in my hands before going through with plans.\n</p><p>You are more important; I would make the trip over a new PS3. But all things considered, until confirmation of details, I'll continue to wait until you return to Charlottesville. However, if I do get the cash this time, I'll ask you to telephone and talk to me and my parents before driving my car there.\n</p><p>I've informed <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">my mother</a> of the past weekend's events, but I <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">softened the blow</a> for her elder mind by telling her the console <a href=\"/cwcki/Chris_and_death\" title=\"Chris and death\">died</a> before I destroyed (in a way, it is still true; I had killed the majority of the data, so it was equally dead). And I added that I tried to restore it back from the dead, including with surgery, and a check-up with a Geek Squad person at <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">Best Buy</a>. I felt their respect for me would be worse if I had told them of the fact that it was still operational, and considerably murdered it in cold blood (even though it was more with spirit, since I have come to terms with the loss of my Lonely, Anguished self contained within that shell).\n</p><p>I crashed myself at about 7:00 last night and fell asleep. I awoke three hours later, finding my mother sitting in my chair in my view. She was emotionally torn up over me destroying the console for the Trolls' entertainment; she and dad are under an impression that the Trolls were controlling me. I understand and helped her through her emotions and tears. I drove her to <a class=\"mw-redirect\" href=\"/cwcki/Wal-Mart\" title=\"Wal-Mart\">Wal-Mart</a> and walked with her by her side to relieve her pain. I was just doing what a good child would do for their parent.\n</p><p>Also, on the side, she said she was willing to loan me $50 towards a replacement PS3 (I'm not going to get an <a class=\"mw-redirect\" href=\"/cwcki/XBox\" title=\"XBox\">XBox</a>; I would not get one even if I did Not hate it. It has a LOT of its own troubles, including the constant \"Red Ring of Deaths\", plus it is not as Hi-Definition capable as the PS3, and it does not play DVDs or Blu-Rays by Default; an expensive accessory is required for the DVDs). And I went to VA Blood Services this afternoon to check on me winning that $50 GameStop Gift Card; it turns out, as told to me by a woman who was there the day of the tournament a couple of weeks ago, I Did win it. Then she told me to check with the F.Square GameStop on claiming it. The recognizable employee who was there Tournament Day too informed me that it's all still going under Red Tape, and I will be contacted to claim my prize soon. I gave him my Cell Number to contact me with when he learns more on that. So, that's another relief; the variable is WHEN I get the card.\n</p><p>I am more awake, and it'll be a short while before I'll feel sleepy again and crash, so I will get to work on that drawing for you right after I finish this message. And I will send you the drawing either later this morning or during the night at the latest. And I will inform you of tomorrow's happenings if applicable.\n</p><p>The Shadow-Interview is a great idea. I'll record my voice to ask the questions, and I'll respond as Junior. But I'll wait further until the money status is confirmed. If I get the money, I'll be more kind to the trolls.\n</p><p>I'll TTYL.<br/>\nStay Safe and Sweet,<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p><p>P.S.<br/>\nA phone call from you to my cell phone soon, so I can talk to you and hear your voice would be appreciated. Are you still on the Pay-As-You-Go plan?\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 31, 2010 - 1:04am\n<p>I just could not figure out how to do it with a big pool, so I thought of using a Hot Tub for you and me. It is still good; you and I are in a Pool of Water. And there are the men and women jerking off at us, including an <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Race#Asians\" title=\"Chris and Race\">asian</a> woman, and one dude came and left. Enjoy.\n</p><p>I'm feeling sleepy again, so I'm going to try for some more needed sleep. I did not get any sleep Sunday night.\n</p><p>Stay Safe and Sweet,<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 31, 2010 - 5:22pm\n<p>Hey Chris! Thanks for another preview drawing. You're enticing me so much with all these little teasers. But I'm still looking forward to the final product, with all the guys jerking off around us in a pool, just like I said. (You know, it might even be sexy if a few of the guys are uncut! Make sure you put enough detail into the penises so it's clearly made out :)\n</p><p>But, on a sadder note, let's talk a little more about this PS3 thing.\n</p><p>I'm not sure I understand why you lied to your mother about what you did. I thought it was a gesture of freeing yourself from addiction to video games. I notice that when I made that comment in my last email, you didn't really respond to it. Was it about overcoming video games? Or did you only do it for the money? Because a few emails ago you wrote me a very (seemingly) heartfelt paragraph explaining in detail how you no longer needed video games because you had seen how much better life could be. When I said it might be a few days before you got the money, you told me confidently that you could \"go for months\" before getting a new console. When I read these things from you I believed them, Chris. So I ask again, what has changed? Were you lying to me when you said you didn't need the PS3? Please respond to these questions of mine this time, as I think this is important to talk about.\n</p><p>Another thing I am concerned about, and this is much more disturbing, is the attachment you show to your console in this latest email. You say you tried to \"restore it back from the dead\", including with \"surgery\". You say that you \"murdered your PS3 in cold blood\". Chris, a PS3 cannot die because it is not alive. Surgery cannot be performed on it because it is not alive. And it especially cannot be MURDERED, because murder is when you kill a HUMAN BEING. Frankly Chris, how messed up is it that you show such an appalling amount of regret at having lost your little video games?\n</p><p>You showed no regret when your old girlfriends like <a href=\"/cwcki/Ivy\" title=\"Ivy\">Ivy</a> or <a class=\"mw-redirect\" href=\"/cwcki/Panda\" title=\"Panda\">Panda</a> died, you hopped right to other girls in far less time than you've now spent mourning a broken computer. What gives? How can you have so much love for a computer? If it's the memories and nostalgia - which I suspect will be your answer to me - then why be so focused on buying a new PS3, when all the old \"memories\" are gone with the old one? (and for the record, why are you saying Xbox is the console that has problems? Wasn't some software glitches in your SONY PS3 the thing that started you on this in the first place?)\n</p><p>I don't get how the trolls could be \"controlling\" you considering you did this before even talking to them about it. You even did it before I knew about it. But I must also question your parents' ability to form a valid conclusion as to what's going on in this situation, because as you admit, you are LYING to them. You told your mom that your PS3 completely died, when in reality it was functioning perfectly fine (the hard drive was wiped, but the system still worked just fine). And frankly, I wouldn't care that you were lying to them, except for one thing: You got your mom to give you money toward the purchase of a new system. So basically, you TRICKED YOUR MOM with LIES and DECEIT. Because I think you KNOW she would NOT be willing to help you get a new system if she thought it was all entirely your doing.\n</p><p>Oh, you know what? That just made me think. I bet you lied to her about how much influence the trolls had over it, too, didn't you? You WANTED your parents to believe that the trolls \"made\" you do this. You don't want them to find out that you decided to do it all on your own. I bet you're just whining \"the trolls made me do it\" to get sympathy from them, and to get out of accepting responsibility for something YOU chose to do. Isn't that it, Chris? How many other occasions have YOU been at fault for something and conveniently scapegoated \"the trolls\" as if they control every event in the universe?\n</p><p>As for calling you, I can understand why a person might be old-fashioned and want his significant other to speak to his parents. But I don't get why you want me to have their approval, while at the same time you are content to lie to and disrespect them to get other things you want.\n</p><p>But what bothers me the most, Chris, is that you are saying that given the choice, you will sell your stuff and borrow money from your parents to buy a new video game console. But you will not sell stuff and borrow money from your parents for the purpose of coming to see me. So basically, having a PS3 is more important than having a girl who wants to be with you.\n</p><p>Chris, I'm going to list out some questions, and when you respond to this email I want you to answer all of them clearly. I don't care if you have an answer that you think I won't like, but what I want from you is the truth, not more dodging.\n</p><p>1. Were you lying to me when you said you didn't need your console anymore?<br/>\n2. How will getting a new PS3 make up for the old memories you lost when it won't actually have them on its hard drive?<br/>\n3. Have you been deliberately lying to your parents about what happened to the PS3 just because you knew they wouldn't help you get a new one if they knew the truth?<br/>\n4. Have you been deliberately lying to your parents about the level of influence the trolls have over you just to get out of taking responsibility for your OWN actions? (This means for as long as the trolls have been around, not just since the PS3 thing)<br/>\n5. Why is replacing an old video game console that you've already dumped thousands of hours into more important than coming to see me?\n</p><p>Chris, I expect you to give me truthful, honest, and complete answers to those questions when you respond to me.\n</p><p>Sigh... anyway, yes, please go ahead and do the shadow-interview video. If only to get your mind off of wallowing over the dead friend you \"murdered\", your PS3. I think anything that draws your mind away would be good at this point. Maybe once you've shown me some maturity, then I'll consider calling you. Because I'd love to call you Chris, but it kind of sounds like you'd prefer a video game to call you instead. Your devotion to this machine is creepy, to say the least. I don't like the idea of being in a relationship where I'll always have to worry about competing with a machine.\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #ff00ff; background: #ffdddd; vertical-align: centered; color:#000000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\">⇐ <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">Jackie E-mails 10</a><span style=\"color: #000000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><span style=\"color: #000000\"><strong><a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">Jackie E-mails</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">Jackie E-mails 12</a><span style=\"color: #000000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a class=\"mw-selflink selflink\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240713215923\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.118 seconds\nReal time usage: 0.127 seconds\nPreprocessor visited node count: 829/1000000\nPost‐expand include size: 68736/2097152 bytes\nTemplate argument size: 47015/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 88/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   43.629      1 -total\n 76.68%   33.456      1 Template:Emails\n 68.15%   29.732      1 Template:Navbox\n  8.48%    3.700      1 Template:Tnavbar\n  8.13%    3.549      8 Template:EmailReply\n  6.18%    2.697      6 Template:Email\n  5.95%    2.596      1 Template:Succession\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14334-0!canonical and timestamp 20240713215923 and revision id 280025. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jackie_E-mails_11&amp;oldid=280025\">http://sonichu.com/w/index.php?title=Jackie_E-mails_11&amp;oldid=280025</a>\"</div></div>",
  "categories": [
    "Category",
    "Jackie E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "2007",
    "57",
    "MHS classmate E-mails",
    "dream",
    "Take what I can get",
    "Sydney Contacts",
    "White knight E-mails",
    "43",
    "Autism Awareness E-mails",
    "my Little Pony",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "44",
    "remove my curses from them",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "Cerokees",
    "40",
    "56",
    "39",
    "Clyde",
    "Mailbag",
    "21",
    "Surfshack Tito",
    "9",
    "pickles",
    "softened the blow",
    "Vivian Gee",
    "Common Questions",
    "God",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "his mother",
    "25",
    "15",
    "Jackie",
    "59",
    "these trolls",
    "Wii",
    "49",
    "PSP",
    "2010",
    "53",
    "Jackie E-mails 10",
    "Jackie Romy",
    "Royalty of the Kingdom",
    "Regina e-mails",
    "52",
    "Blanca Weiss",
    "42",
    "died",
    "2011-2012",
    "Virginia",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "Sonichu",
    "17",
    "35",
    "47",
    "pickle-suited",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "stress",
    "31",
    "18",
    "Aug",
    "my Escort",
    "Jackie E-mails 12",
    "Gregg Mays",
    "Clyde Cash",
    "Jackie E-mails",
    "4",
    "36",
    "Panda",
    "Catherine E-mails",
    "PS3",
    "48",
    "19",
    "Ivy",
    "Jenkins Jinkies",
    "2004‒06",
    "my mother",
    "Letter",
    "50",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "8",
    "randomly",
    "10",
    "2",
    "homosexual",
    "Crowned Prince is a Fake",
    "I'm mentally blanking out at the moment",
    "2008",
    "his reply",
    "2013-2014‎",
    "Charlottesville",
    "Clyde E-mails",
    "Wal-Mart",
    "Uri Geller E-mails",
    "Tito",
    "August 2010",
    "3",
    "Xbox 360",
    "46",
    "7",
    "Asperchu",
    "Misc E-mails",
    "2007‒08",
    "37",
    "11",
    "23",
    "26",
    "babysitter",
    "Thetan",
    "2009",
    "13",
    "61",
    "45",
    "video games",
    "29",
    "Sweetheart",
    "24",
    "32",
    "XBox",
    "Open Relationship E-mails",
    "Chris",
    "functional",
    "church",
    "Jack Thaddeus",
    "30",
    "58",
    "Samantha Thaddeus",
    "The Wallflower",
    "trolls",
    "1",
    "in an e-mail from Him",
    "28",
    "Best Buy",
    "created the video",
    "34",
    "Miyamoto Saga",
    "38",
    "41",
    "20",
    "Jan‒July 2007",
    "Evan E-mails",
    "GameStop",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "television",
    "16",
    "6",
    "Sept"
  ],
  "scraped_at": "2025-11-26T15:50:30.344461"
}