{
  "url": "https://sonichu.com/cwcki/Jackie_E-mails_12",
  "title": "Jackie E-mails 12",
  "display_title": "Jackie E-mails 12",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>This page covers e-mails exchanged between Chris and <a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a> from 31 <a href=\"/cwcki/August_2010\" title=\"August 2010\">August 2010</a> to 2 <a href=\"/cwcki/September_2010\" title=\"September 2010\">September 2010</a>. Chris reports that <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a> and <a href=\"/cwcki/Surfshack_Tito_(troll)\" title=\"Surfshack Tito (troll)\">Surfshack Tito</a> have still failed to come through with the $9,001 for destroying his <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a>. Chris makes up excuses for not drawing the <a class=\"mw-redirect\" href=\"/cwcki/Pickles\" title=\"Pickles\">pickles</a> Jackie wanted, answers a series of questions that Jackie demanded answers to in the previous e-mail. Jackie repeats that Chris drew his fantasy, not hers. Chris gives his plan for raising money for <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Otakon\" title=\"wikipedia:Otakon\">Otakon</a>, consisting of selling games for store credit, scamming his parents, and buying a new <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a>. He offers to make a laughable bet with Jackie to prove he's not addicted to <a class=\"mw-redirect\" href=\"/cwcki/Video_games\" title=\"Video games\">video games</a>. Jackie calls bullshit and gives a heartfelt speech about how Chris's lack of effort is bad for their relationship. Chris ignores this, worrying momentarily about <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">Patti</a>'s remains. \n</p><p>Chris also states that his habitual purchases include lottery tickets, which he thinks is an investment (and not a form of gambling in reality). These things are important.\n</p>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>August 31, 2010 - 6:29pm\n<p>The Drawing; I've just told you; that one with you and me in a Pool of water in the Hot Tub with Men and Women Jerking around us in a Circle IS the final version. You can barely see anyone <a class=\"mw-redirect\" href=\"/cwcki/Mass_Debating\" title=\"Mass Debating\">jerking off</a> IN COMFORT while they're in the water; it is better done, and drawn, OUT of the water. And it is <a href=\"/cwcki/Chris_and_censorship\" title=\"Chris and censorship\">Uncensored</a>; I can't help it if sometimes men cover the Tip of their <a href=\"/cwcki/Pickle\" title=\"Pickle\">dicks</a> with their own hands while masturbating.\n</p><p>*<a class=\"mw-redirect\" href=\"/cwcki/Sigh\" title=\"Sigh\">sigh</a>*\n</p><p>I'm just tired after a long day out. No <a href=\"/cwcki/Pickle\" title=\"Pickle\">pickle</a>-breasted woman showed up during the whole Hour I was there; from 1:30 to 2:30. I've just <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">e-mailed</a> <a class=\"mw-redirect\" href=\"/cwcki/Tito\" title=\"Tito\">Tito</a> to be more direct; send the agent with the Cash directly to my house; I wait for his response.\n</p><p>I Meant what I had said in the Freedom from the addictions, AND the loneliness put into the Data that was in the <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a> before the Memory Wipeout. And I meant it when my actions in destroying the console were releasing that same past Me from my life.\n</p><p>On the other hand, between <a class=\"mw-redirect\" href=\"/cwcki/Clyde\" title=\"Clyde\">Clyde</a> and Tito asking for MORE evidence above SOLID evidence that I've destroyed that console in <a class=\"mw-redirect\" href=\"/cwcki/Moving_Forward\" title=\"Moving Forward\">Moving Forward</a> with my life, and Frustrating me in doing More and More Destruction after the release of the Past Me, and the sense of Moving Forward in the past destruction... I detest NOT being believed in for the God Blessed <a class=\"mw-redirect\" href=\"/cwcki/Honest\" title=\"Honest\">Honest</a> Truth and Emotions I've been going through the past weekend.\n</p><p>And now, with the chase I'm going through to get the Reward Money for You And Me in Our Future and paying off my debt to <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">my father</a>, the emotions that remain True, I Swear to <a class=\"mw-redirect\" href=\"/cwcki/God\" title=\"God\">God</a>, as from the past weekend, it just frustrates me that I'm not getting the compensation that I have earned from Showing Them I Am and Have Moved Forward from the Addiction...\n</p><p>*sigh*\n</p><p>My mind is <a href=\"/cwcki/Autism\" title=\"Autism\">befuddled</a>.\n</p><p>To answer your questions.\n</p><p>1. I was not lying to you; I can live without <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">the console</a>. The only influence that has made an impression of a change is the chase for the cash reward, making me seek the \"Plan B\" to make even an inkling of that reward for myself.\n</p><p>2. As I have told you, a lot of the data is recoverable (more or less), and I did not say getting a new one would make up for the old memories; I meant that getting the replacement will create NEW memories of <a href=\"/cwcki/XBox_is_OK.MOV\" title=\"XBox is OK.MOV\">the more positive Me</a> that has come around since you returned to me. Another way I can put it; the Old data was lonely from not having someone to share it with; now I have you and our future to create the new memories with on there. I may or may not be making sense, but it is the honest truth from my <a class=\"mw-redirect\" href=\"/cwcki/Heart\" title=\"Heart\">heart</a>.\n</p><p>3. No, I did not deliberately lie to my parents to get a new PS3 from them. <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">I lied to them</a>, because if they knew the PS3 was still functional Before I destroyed it, they would feel MORE devastated and distrustful of me. I would rather they think it was a Lost Cause before the destruction.\n</p><p>Think of it this way, Hypothetically, let's say you had a dress that still looked great on you (maybe a Favorite Dress), but it was something from Last Decade and out of current fashion. Your friends tell you to burn the dress. Then you burn the dress from your friends' suggestion. You end up telling your parents of the event, but you lie about it by saying that the dress did not fit anymore; it was torn up in more ways than one and you could not fix it after trying vigorously again and again; you burn it for the views and opinions of your friends, leaving your parents thinking it was a Lost Cause anyway.\n</p><p>4. No, I have not been lying to my parents of <a class=\"mw-redirect\" href=\"/cwcki/Troll\" title=\"Troll\">Troll</a> influence. <a class=\"mw-redirect\" href=\"/cwcki/Naive\" title=\"Naive\">I honestly feel that I have more control over myself than the trolls would</a>. It is the ideas my mother and father have had in opinion of me after my Past mistakes of making the <a href=\"/cwcki/List_of_videos\" title=\"List of videos\">terrible videos of myself</a>, <a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">the house tour</a>, <a href=\"/cwcki/Nudes\" title=\"Nudes\">self-nudity</a>, <a href=\"/cwcki/For_My_Sweetest_Ivy\" title=\"For My Sweetest Ivy\">etc</a>. from either <a href=\"/cwcki/Chris_humps_his_PS3\" title=\"Chris humps his PS3\">blackmail</a>, <a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">requests from my ex-girlfriends</a>, <a href=\"/cwcki/Chris_Drops_the_N-Bomb\" title=\"Chris Drops the N-Bomb\">etc</a>.\n</p><p>And with that, I was very distraught after the deaths of my <a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">past</a> <a href=\"/cwcki/Ivy\" title=\"Ivy\">girlfriends</a>; <a href=\"/cwcki/Chris_and_remorse\" title=\"Chris and remorse\">it would haunt me for Weeks to Months before I would move forward.</a> This also includes after <a href=\"/cwcki/Julie_Reveals_Herself\" title=\"Julie Reveals Herself\">learning</a> that the \"Girlfriend\" was actually a Troll the whole time, such as \"<a class=\"mw-redirect\" href=\"/cwcki/Julie\" title=\"Julie\">Julie</a>\", but with those individuals, <a href=\"/cwcki/Red_Letter_CWC_Certified_Day\" title=\"Red Letter CWC Certified Day\">I recover more quickly</a>, because Liars and Fakes don't get as much sympathy or sadness as the <a href=\"/cwcki/Gal-Pals_and_Past_Sweethearts_(CWCipedia_page)\" title=\"Gal-Pals and Past Sweethearts (CWCipedia page)\">Real, Honest People who actually have died or left me</a>.\n</p><p>5. I did not say that; Seeing you is more important to me than any video game, regardless of time or money spent on it.\n</p><p>And I did not mean to imply that the PS3 was an \"old friend\" that I've \"murdered\"; when I said all that, I was speaking Metaphorically.\n</p><p>Also, earlier today, out of frustration, and further moving forward from the addiction, I pawned off my <a href=\"/cwcki/Nintendo\" title=\"Nintendo\">Nintendo</a> 64 AND all of the <a class=\"mw-redirect\" href=\"/cwcki/Games\" title=\"Games\">games</a> and accessories. I would have also pawned off my Genesis/Sega CD/32X, but the color output was wonkey; the pawner passed on it and all of the software with it. Anyway, I got $40 for the N64 and its stuff. I'm thinking of going onto Craigslist with my Upgraded Genesis with the software bunch, or seeing if I can find someone who's hosting a yard sale in the Community Yard Sale to sell it all for me (no haggling; the price would be set for $80).\n</p><p>I got to go eat something for dinner, but I'll TTYL.\n</p><p>Stay Safe and Sweet,<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>August 31, 2010 - 7:08pm\n<p>Chris, I asked for my drawing to be of us in a pool with a bunch of guys jerking off all around us. You drew one guy and a bunch of women. So you didn't draw my drawing, you drew something you wanted to draw instead. And begging your pardon, but I don't see why you \"can't help\" what the people in the drawing look like when you are the one drawing it.\n</p><p>Sigh...\n</p><p>You say you meant it when you said you were moving forward with your life. I don't care if you lie to the trolls, they haven't earned honesty from you. But I think I have. If you think you can live without the console, then why don't you try it?\n</p><p>Thank you for answering my questions. Let me try to respond to your answers individually:\n</p><p>1. So you just had a momentary influence of wanting to get the new PS3, even though getting the money is currently a problem? Does that mean you're rethinking it now, and after you get over the shock of the current situation you would rather not pursue a new PS3?\n</p><p>2. I think I understand what you're saying here. Although in fairness I should let you know that I'm just not really that into video games in general. When I settle down with the person I'm going to be with for the rest of my life, I certainly plan to create memories... but I hadn't planned on that being with video games. Don't get me wrong, we can play video games together. I just don't think a video game is that significant. There's a whole wide world of richer experiences that two people can share. (We certainly won't be playing video games for our first several dates, at least.)\n</p><p>3. This is one I still have a problem with. You're saying that you lied to your parents so you wouldn't have to deal with the consequences of them knowing a truth that they deserve to hear. Don't you see something wrong with that? If you're telling lies before your parents, you're telling lies before God. Remember the Fourth Commandment: Honor <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">Thy Father</a> and <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">Mother</a>. You are mad that the trolls don't respect the \"God Blessed\" truth in what you tell them, but you don't seem concerned that you are making God sad by disrespecting your parents.\n</p><p>Your hypothetical example is one I can understand. In fact, I've had very similar situations in my life (I usually threw out or gave away the clothes, not burned them). When I was a teenager, I was pretty flighty with my clothes; I collected way too many that I didn't need, and a lot of them just sat in my closet. My parents knew about it, because I didn't hide it from them. And eventually they started getting mad about it and lecturing me. And at the time I didn't like being lectured, but you know what? It wasn't the end of the world. And I learned a lesson: Don't throw away so much money on clothes I don't need, be more respectful of my possessions. And I'm better off for it now. Maybe if you actually owned up to your parents once in a while instead of trying to spin the truth every time you knew they would get mad, you would have learned some lessons about courage and temperance like I did.\n</p><p>4. Well, I guess I can understand why they're so worried about the idea of trolls influencing you. But I do think that their fears are much worse than they would be if you told them the truth and didn't leave out important facts. See, Chris? Lying to your parents to stop them from getting mad doesn't just prevent all problems - You never own up to your own actions like you should, so what choice do your parents have but to believe that you're being manipulated? You've caused them to underestimate you all by yourself.\n</p><p>5. I know you didn't say the words exactly, but that was the impression I was getting. Because things like going to Otakon, coming to see me, and so forth never seemed to inspire you to want to get rid of any of your video games. But now you're willing to sell off all your Nintendo 64 and other games, for the sole purpose of... obtaining another video game. Getting a PS3 inspires you to move mountains but when it comes to me, you just want to wait for me to come to you so you don't have to spend anything.\n</p><p>Well, anyway... I'm looking forward to seeing the shadow-interview video. You can send me a prototype again if you want so I can look it over and offer advice, before you release a final version. It might be cool if you did like a cut-away sort of thing, so the camera would be on you (Chris) while you talk, and then shift to Jinkies for his answers. Or something like that would be cool.\n</p><p>Also, I found this thread: http://trollingtrain.10.forumer.com/viewtopic.php?p=1242<br/>\nDid they dig something up in your yard? I didn't read it very closely, I didn't have a whole lot of time.\n</p><p>Talk to you later,\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>September 1, 2010 - 11:47am\n<p>Well I've just took a look out back; Nothing has changed with the <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">doghouse</a>, and no holes were made and no ground uprooted. That dude is just blowing smoke.\n</p><p>I did give you a bunch of men; Four of them, Plus ONE who Came then left. It was an alternating sequence; man, woman, man, woman, etc.\n</p><p>Firstly, I appreciate your understanding and response to my answers to your questions. But for #5, I may have misworded it, but I literally did try to raise the money for Otakon that week; I sold a bunch of DVDs and CDs to Plan9; I ended up with a total of $40. I was still in the phase of learning to get along without the background of games and older consoles collecting dust and selling them later. And I made the money from the N64 for my saving; I still have it.\n</p><p>And later, I learned that <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a> was still accepting Game Boy Advance and GameCube titles, so I later rushed out with a hefty handful of them, including my secondary <a href=\"/cwcki/Pok%C3%A9mon\" title=\"Pokémon\">Pok'emon</a> games I realized I did not require; Sapphire, LeafGreen and Pearl, and my Nintendogs game along with the GBA and GameCube titles selected to move on from. I made $100 Store Credit. And with that credit, my family and I did sit down and discuss a loan for the remaining 200 towards the replacement PS3. They loaned it to me with the term of 100 a month for the next two months. But the point is, <a href=\"/cwcki/Scale_of_Respect\" title=\"Scale of Respect\">I earned a Huge Chunk of Respect</a> from both my mom and dad from the effort.\n</p><p>I understand that counters and coincides with my past truth of getting along without it for a month. But <a href=\"/cwcki/Chris_and_negotiation\" title=\"Chris and negotiation\">I'll make you a deal</a>, Jackie. Starting on the day you and I meet, I promise to go a whole month without using any of my game consoles, including Handhelds, with you as my eye-witness. If I win, nothing will change, and we will continue towards our happy future together. But if I lose, I will give you $50 cash, and we will still continue towards our happy future together. <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">Either way, we both win</a>.\n</p><p>I have to do some <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_cinematography\" title=\"Chris and cinematography\">light-re-situating</a>, but I will have the shadow interview video recorded this week.\n</p><p>I'm not surprised that between Tito AND Clyde, they would Not come through at all with the reward. I'll forward you new e-mails I've received recently. Tito is making up a Fictional meeting between him and me happening, when IT DID NOT. Their Agent recorded me <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails#Waiting_for_$9001\" title=\"Clyde and Tito PS3 E-mails\">sitting there waiting</a> and posted it onto <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> with a damn rumor attached to it. Now they want me to Beg. I've played their Goose-Chase for long enough, and I do not want anything of this anymore. They are NOT going to give me the \"reward\" regardless of what I do at all. They're all bastards. I'll also have <a href=\"/cwcki/JenkinsJinkies\" title=\"JenkinsJinkies\">\"Junior\"</a> speak ill of Tito and Clyde after what I've told him what happened. I'll even blow the lid on the recent \"Bone Excavating\" too.\n</p><p>*sigh*\n</p><p>You are more important to me than any video game; I WOULD move mountains to get to you, but I have my <a href=\"/cwcki/List_of_Chris%27s_PSN_game_downloads\" title=\"List of Chris's PSN game downloads\">financial situation</a> that puts me on a fixed where affording to Immediately travel is not doable, even WITHOUT buying Anything New throughout the month. I have to eat and get gas for <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\">my car</a> too. But Locally, I am still able to <a href=\"/cwcki/Best_Buy\" title=\"Best Buy\">go out</a>, afford to treat you to <a class=\"mw-redirect\" href=\"/cwcki/McDonalds\" title=\"McDonalds\">good things</a> on our dates, and put all of my heart and <a href=\"/cwcki/Semen\" title=\"Semen\">soul</a> into it and into you. Do not ever doubt my solid emotions for you, Jacklyn. I Want You by my side As Soon As Possible and Forever after that more than any material thing in the whole world.\n</p><p>I gtg eat lunch, but I'll TTYL.\n</p><p>Stay Safe and Sweet, Sweetheart,<br/>\nXOXOXOXOXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>September 1, 2010 - 1:09pm\n<p>The drawing was not what I asked for, pure and simple. I'm looking at it right now, there is only ONE guy in the picture, not four. Over and over you drew what you wanted to, not what I wanted. And why would I want to stare at a bunch of naked women? I'm straight, not a <a class=\"mw-redirect\" href=\"/cwcki/Gaybian\" title=\"Gaybian\">lesbian</a>. And now you're just arguing about it instead of redrawing it. I thought you liked drawing. I thought you liked drawing for ME.\n</p><p>Am I supposed to be proud of you for lying to me? For claiming you could go without your precious PS3 for months when you had no intention of doing so? Am I supposed to be proud that you sold some pokemon games you don't \"require\" for the sole purpose of buying a new console you also don't require? I don't think the \"huge chunk of respect\" your parents have given you is really worth anything, because it's based on lies. The lie that your PS3 died before you destroyed it, as well a the lie by omission that the trolls are manipulating you. I believe that that was their own idea, but you are conveniently letting them continue to believe it instead of owning up and explaining that destroying it was all your idea. I wouldn't be proud of earning their respect if I were you. I would be ashamed of having tricked them out of it.\n</p><p>I have several problems with your \"deal\". Firstly, please don't propose it to me as if I have already accepted it, or assuming that I will accept it. I do not accept it. \n</p><p>Secondly, it is not at all a deal. It is quite insulting. You are going back on your claim that you could go without your PS3 for months. <a href=\"/cwcki/EXCLUSIVE_Manchester_High_School_2000_Reunion_Required_NOW\" title=\"EXCLUSIVE Manchester High School 2000 Reunion Required NOW\">That was basically like a promise.</a> You PROMISED me, and you are reneging on it. You talk about how the trolls are renegers for not paying you the money, but why should I care about them? YOU are the reneger, Chris. YOU are the reneger.\n</p><p>Thirdly, you have lied to me numerous times, your claim that you can go without the PS3 being the most recent one. But it gets worse when you couple your lies to ME with your rationalization for lying to your PARENTS. You said that you lie to your parents to \"protect\" them from feeling bad about what you've done. So it's perfectly reasonable to assume that you will lie to me and claim you haven't been playing video games even though you have, isn't it? Because you will rationalize it by saying you need to \"protect\" me from feeling ashamed. Given that you are bargaining like an addict to get out of your promise to me to let the PS3 go, I think it's fair to assume you will continue down that path and play video games anyway, despite what your little deal promises. You know full well it is not possible for me to be your eye-witness for an entire month, Chris. I can't babysit you 24/7. You offered that specifically because you wanted to look good, you knew I would have to turn down being your eye-witness. So when I'm busy at school or out or whatever, you'll play your games carefree, then lie to me and say you haven't played them because you want to make me think I should be proud of you. Right? You know, if you've wronged someone (like your parents or me), they have a right to be mad at you. By hiding the truth from them, you are further wronging them, not protecting them.\n</p><p>And Fourthly, and most sadly... you're offering to bribe me with $50? I have $50 in my purse right now. I don't need your $50. I don't want your $50. What I want is a boyfriend who is willing to actually TRY to improve himself and who will hold <a class=\"mw-redirect\" href=\"/cwcki/True_and_honest\" title=\"True and honest\">true and honest</a> to his promises, not abandon them when they get difficult and offer me a bribe to get out of them. How do I \"win\" by getting $50? Do you really think that's just as good as seeing you fight your pathetic addiction? You'd be the only one who would win, because you'd get out of Honestly Chris, you're making me cry right now.\n</p><p>Don't tell me your \"financial situation\" makes traveling impossible while at the same time you've quickly acquired $300 in order to buy your precious little video game console. Clearly your PS3 is more important to you than me. It took you weeks to get me my drawing, and even after several tries none of them were the drawing I wanted, but I bet you were still playing your PS3 for hours every day. And once your PS3 was gone, all your efforts became devoted to obtaining a replacement, while I sit here in Tennessee alone. By the way, take a look at this site: <a class=\"external free\" href=\"https://www.greyhound.com/farefinder/step2.aspx?Redirect=Y&amp;Version=1.0&amp;OriginID=330319&amp;OriginCity=Charlottesville&amp;OriginState=VA&amp;DestinationID=400610&amp;DestinationCity=Nashville&amp;DestinationState=TN&amp;Children=0&amp;Legs=1&amp;Adults=1&amp;Seniors=0&amp;DYear=110&amp;DMonth=9&amp;DDay=4&amp;DHr=\" rel=\"nofollow\">https://www.greyhound.com/farefinder/step2.aspx?Redirect=Y&amp;Version=1.0&amp;OriginID=330319&amp;OriginCity=Charlottesville&amp;OriginState=VA&amp;DestinationID=400610&amp;DestinationCity=Nashville&amp;DestinationState=TN&amp;Children=0&amp;Legs=1&amp;Adults=1&amp;Seniors=0&amp;DYear=110&amp;DMonth=9&amp;DDay=4&amp;DHr=</a>\nA bus ticket from your place to where I am would only cost $118, much less than a $300 computer. And I told you you'd be staying with me and we could split even on food, and you'd be riding back with me so you wouldn't need to pay for a return bus ticket. Since a PS3 costs nearly triple a bus ticket, I guess you want a PS3 nearly three times more than you want to see me.\n</p><p>Since it seems to work when I make a bullet-list of specific items I want you to address, let me again write out a list of questions and comments I want you to answer:\n</p><p>1. I want you to tell your parents that you lied about the PS3 dying, and tell them that your PS3 was working perfectly fine when you decided to destroy it.<br/>\n2. I want you to explain how you think I am supposed to feel about the fact that you never intended to keep your promise to me of going without the PS3 for months.<br/>\n3. I want you to explain to me how you think God feels about your lies to me and to your parents.<br/>\n4. I want you to explain to me how you think God feels about your gluttonous addiction problem, and your unwillingness to treat it.<br/>\n5. I want you to explain how your devotion to obtaining a new PS3 and your total unwillingness to consider coming to see me are not clear signs that you prefer video games over me.<br/>\n6. Most importantly... I want you to go til New Years before getting a new PS3. That's January 1, 2011. That's four months away. You promised you could go for months, so show it.\n</p><p>Notice how that list doesn't have anything about me wanting you to come to visit me in Tennessee? That's because I don't want a guy to come visit me when it's obvious he doesn't really want to see me. It's sad, it really is. I thought you cared about me. But you aren't willing to actually pay anything to do see me. Not like you're willing to pay for your PS3. I'd love to have you here with me, I thought we could maybe have our first time together even. But if you don't want to be with me, there's nothing to be gained by trying to coerce you.\n</p><p>I want so much for this to work, Chris. I've been trying so hard. But what signs have you given me? What work have you done for me? Why are you not willing to show me anything but empty promises that you immediately back out on when they become inconvenient? Do you think a girlfriend is something you can just shut out when she becomes inconvenient? I guess I'll be sitting here alone til the end of my trip then, unless you care to prove me wrong. I promise I'll call you when I get home. Although given how little promises mean to you, maybe you won't mind if they start to mean as little to me, too. If you want me to feel differently, you'll have to actually do something to show me.\n</p><p>Talk to you later,\n</p><p>Jackie\n</p><p>P.S. You complain about the trolls blowing smoke to you, but it seems like you've been blowing a lot of smoke to me this whole time.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>September 1, 2010 - 3:38pm\n<p>By the way, I suggest you look harder where they said they dug up your <a href=\"/cwcki/Patti_Chandler\" title=\"Patti Chandler\">dog</a>. You say you took one glance and then ignored it, but they specifically said they were careful to leave no trace. Doesn't your deceased dog deserve at least as much time as your deceased PS3? http://trollingtrain.10.forumer.com/viewtopic.php?t=95\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>September 2, 2010 - 11:06am\n<p>Chris, where have you been? I didn't hear from you at all yesterday, is everything alright? I'm starting to get a little worried.\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>September 2, 2010 - 3:35pm\n<p>I'm sorry for not replying yesterday. In the morning, I had to hang with my mother while she went in for her liver checkup (I think that's what it was about), and she gave a bit of blood shortly before as well. We had some breakfast (she ate later), and met my father at the usual gas station where he buys his weekly lottery tickets. <a href=\"/cwcki/Chris_and_money\" title=\"Chris and money\">I invest $4 weekly</a> between Win For Life and Mega Millions; two plays each.\n</p><p>And in the afternoon, I hung with my father for lunch. And redownloaded all of the update data for my PS3 disc games (<a class=\"mw-redirect\" href=\"/cwcki/Eye_of_Judgment\" title=\"Eye of Judgment\">Eye of Judgment</a> was the longest to update, so I watched Disc 8 of the \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Daria\" title=\"wikipedia:Daria\">Daria</a>\" DVD set; it included the final two episodes and both movies during that update. I felt sleepiest during the 7:00 PM hour while Motorsorm was updating, and I was given the option to restart my PS3, so I shut it down for the night and crashed.\n</p><p>Today so far, I went with my father for <a href=\"/cwcki/Burger_King\" title=\"Burger King\">morning coffee</a>, and just got back from sharing a baked potato with him at <a class=\"mw-redirect\" href=\"/cwcki/Wendys\" title=\"Wendys\">Wendys</a> and walking around Food Lion for a bit. I finished the Disc Game Updates, now I'm working on the Download Games and Add-Ons; I had redownloaded all of the <a href=\"/cwcki/LittleBigPlanet\" title=\"LittleBigPlanet\">LBP</a> and <a href=\"/cwcki/ModNation_Racers\" title=\"ModNation Racers\">MNR</a> DLC, Premium and Dynamic Themes and Avatars First Items right after booting up the new PS3 and reformatting the 500GB HDD.\n</p><p>Aside from that, in response to your concerns about <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">Patti</a>, and they go greatly appreciated. Thank you. :) But I did not just glance over the area, I went over it extensively; I saw NO difference from past times at all. So, you have no need to worry. And I've read the <a href=\"/cwcki/Trollin_Train\" title=\"Trollin Train\">Forum</a> topic more; they're just blowing smoke, making up crap. Besides which, for your information and Confidential, Patti was buried in the cardboard box the vet put her in, encased with a re-enforced Solid Wooden Crate my father and I put together with screws and nails, and was buried with the two Towels we had to use the day she died to clean her with. And with all that, A) they would NOT be able to \"polish\" the bones, because the flesh and fur would still be plentiful on the body. B) The bones would NOT be covered in Dirt and Soil, because of the body being in a cardboard box, encased in a Nailed and Screwed Wooden Crate with No Holes. And C) there are a LOT of Trees and Branches surrounding the Doghouse and Cement Blocks that rest over her buried, enclosed, secured body, so there is Very Little Chance of ANYONE getting to the doghouse and moving it. Plus, there are some Poison Ivy in that area. So, ANY photos they would have taken would have Flesh and Fur on those Bones, and the Crate, Nails, Screws and Box the body was in. Their photograph is of some other damn sack of bones from some other dirt site. Plus they do not mention Anything of the Crate and the Trees, OR even the Gazebo.\n</p><p>I still yearn for you by my side, Jacklyn. Is there any update on When you'll be returning to <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a>, so we can schedule the Date? I want you here Badly. You give me the shine in my days that make them better with your sweetness and understandings. You are SOO Cool, <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Sweetheart</a>.\n</p><p>Please let me know in your reply.\n</p><p>Stay Safe and Sweet,<br/>\nXOXOXOXO &lt;3&lt;3&lt;3&lt;3&lt;3&lt;3&lt;3<br/>\nChristian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>September 2, 2010 - 3:55pm\n<p>So you got a new PS3 afterall?\n</p><p>Actually, I decided to come home early. I got in early this morning. I was thinking about calling you, but since you decided that re-downloading the same baby games you've already played hundreds of hours in was so important that you couldn't spare ten minutes to write me an email yesterday, I'm not sure when I'll call you. When I didn't hear from you I thought that maybe my email was too \"stressful\" for you to read and you decided to simply ignore me. I have stuff I can do that's more important than a guy who doesn't care about me.\n</p><p>Clearly, since you had a choice between writing to me and playing your PS3, and you chose the PS3, that means the PS3 is the \"shine in your days\". I am obviously not. I'm not a hamster, Chris. You can't trick me just by repeating words that you think sound romantic. If you ever want me \"at your side\", you will answer every item on the list I just sent you for the second time. You will DO SOMETHING to show me that you care rather than just repeating EMPTY WORDS. How many times must I tell you that it is SOO OBVIOUS that your words don't mean anything alone?\n</p><p>Please don't talk to me about your father or what cartoons you watch when you completely ignored the serious letter that I spent over an hour writing to you. I'll repost it below, and if you actually care about me at all, you'll actually read the whole thing and respond to it this time.\n</p><p>The drawing was not what I asked for, pure and simple. I'm looking at it right now, there is only ONE guy in the picture, not four. Over and over you drew what you wanted to, not what I wanted. And why would I want to stare at a bunch of naked women? I'm straight, not a lesbian. And now you're just arguing about it instead of redrawing it. I thought you liked drawing. I thought you liked drawing for ME.\n</p><p>Am I supposed to be proud of you for lying to me? For claiming you could go without your precious PS3 for months when you had no intention of doing so? Am I supposed to be proud that you sold some pokemon games you don't \"require\" for the sole purpose of buying a new console you also don't require? I don't think the \"huge chunk of respect\" your parents have given you is really worth anything, because it's based on lies. The lie that your PS3 died before you destroyed it, as well a the lie by omission that the trolls are manipulating you. I believe that that was their own idea, but you are conveniently letting them continue to believe it instead of owning up and explaining that destroying it was all your idea. I wouldn't be proud of earning their respect if I were you. I would be ashamed of having tricked them out of it.\n</p><p>I have several problems with your \"deal\". Firstly, please don't propose it to me as if I have already accepted it, or assuming that I will accept it. I do not accept it. \n</p><p>Secondly, it is not at all a deal. It is quite insulting. You are going back on your claim that you could go without your PS3 for months. That was basically like a promise. You PROMISED me, and you are reneging on it. You talk about how the trolls are renegers for not paying you the money, but why should I care about them? YOU are the reneger, Chris. YOU are the reneger.\n</p><p>Thirdly, you have lied to me numerous times, your claim that you can go without the PS3 being the most recent one. But it gets worse when you couple your lies to ME with your rationalization for lying to your PARENTS. You said that you lie to your parents to \"protect\" them from feeling bad about what you've done. So it's perfectly reasonable to assume that you will lie to me and claim you haven't been playing video games even though you have, isn't it? Because you will rationalize it by saying you need to \"protect\" me from feeling ashamed. Given that you are bargaining like an addict to get out of your promise to me to let the PS3 go, I think it's fair to assume you will continue down that path and play video games anyway, despite what your little deal promises. You know full well it is not possible for me to be your eye-witness for an entire month, Chris. I can't babysit you 24/7. You offered that specifically because you wanted to look good, you knew I would have to turn down being your eye-witness. So when I'm busy at school or out or whatever, you'll play your games carefree, then lie to me and say you haven't played them because you want to make me think I should be proud of you. Right? You know, if you've wronged someone (like your parents or me), they have a right to be mad at you. By hiding the truth from them, you are further wronging them, not protecting them.\n</p><p>And Fourthly, and most sadly... you're offering to bribe me with $50? I have $50 in my purse right now. I don't need your $50. I don't want your $50. What I want is a boyfriend who is willing to actually TRY to improve himself and who will hold true and honest to his promises, not abandon them when they get difficult and offer me a bribe to get out of them. How do I \"win\" by getting $50? Do you really think that's just as good as seeing you fight your pathetic addiction? You'd be the only one who would win, because you'd get out of Honestly Chris, you're making me cry right now.\n</p><p>Don't tell me your \"financial situation\" makes traveling impossible while at the same time you've quickly acquired $300 in order to buy your precious little video game console. Clearly your PS3 is more important to you than me. It took you weeks to get me my drawing, and even after several tries none of them were the drawing I wanted, but I bet you were still playing your PS3 for hours every day. And once your PS3 was gone, all your efforts became devoted to obtaining a replacement, while I sit here in Tennessee alone. By the way, take a look at this site: <a class=\"external free\" href=\"https://www.greyhound.com/farefinder/step2.aspx?Redirect=Y&amp;Version=1.0&amp;OriginID=330319&amp;OriginCity=Charlottesville&amp;OriginState=VA&amp;DestinationID=400610&amp;DestinationCity=Nashville&amp;DestinationState=TN&amp;Children=0&amp;Legs=1&amp;Adults=1&amp;Seniors=0&amp;DYear=110&amp;DMonth=9&amp;DDay=4&amp;DHr=\" rel=\"nofollow\">https://www.greyhound.com/farefinder/step2.aspx?Redirect=Y&amp;Version=1.0&amp;OriginID=330319&amp;OriginCity=Charlottesville&amp;OriginState=VA&amp;DestinationID=400610&amp;DestinationCity=Nashville&amp;DestinationState=TN&amp;Children=0&amp;Legs=1&amp;Adults=1&amp;Seniors=0&amp;DYear=110&amp;DMonth=9&amp;DDay=4&amp;DHr=</a>\nA bus ticket from your place to where I am would only cost $118, much less than a $300 computer. And I told you you'd be staying with me and we could split even on food, and you'd be riding back with me so you wouldn't need to pay for a return bus ticket. Since a PS3 costs nearly triple a bus ticket, I guess you want a PS3 nearly three times more than you want to see me.\n</p><p>Since it seems to work when I make a bullet-list of specific items I want you to address, let me again write out a list of questions and comments I want you to answer:\n</p><p>1. I want you to tell your parents that you lied about the PS3 dying, and tell them that your PS3 was working perfectly fine when you decided to destroy it.<br/>\n2. I want you to explain how you think I am supposed to feel about the fact that you never intended to keep your promise to me of going without the PS3 for months.<br/>\n3. I want you to explain to me how you think <a class=\"mw-redirect\" href=\"/cwcki/God\" title=\"God\">God</a> feels about your lies to me and to your parents.<br/>\n4. I want you to explain to me how you think God feels about your gluttonous addiction problem, and your unwillingness to treat it.<br/>\n5. I want you to explain how your devotion to obtaining a new PS3 and your total unwillingness to consider coming to see me are not clear signs that you prefer video games over me.<br/>\n6. Most importantly... I want you to go til New Years before playing your PS3. That's January 1, <a href=\"/cwcki/2011\" title=\"2011\">2011</a>. That's four months away. You promised you could go for months, so show it.\n</p><p>Notice how that list doesn't have anything about me wanting you to come to visit me in Tennessee? That's because I don't want a guy to come visit me when it's obvious he doesn't really want to see me. It's sad, it really is. I thought you cared about me. But you aren't willing to actually pay anything to do see me. Not like you're willing to pay for your PS3. I'd love to have you here with me, I thought we could maybe have our first time together even. But if you don't want to be with me, there's nothing to be gained by trying to coerce you.\n</p><p>I want so much for this to work, Chris. I've been trying so hard. But what signs have you given me? What work have you done for me? Why are you not willing to show me anything but empty promises that you immediately back out on when they become inconvenient? Do you think a girlfriend is something you can just shut out when she becomes inconvenient? I guess I'll be sitting here alone til the end of my trip then, unless you care to prove me wrong. I promise I'll call you when I get home. Although given how little promises mean to you, maybe you won't mind if they start to mean as little to me, too. If you want me to feel differently, you'll have to actually do something to show me.\n</p><p>Talk to you later,\n</p><p>Jackie\n</p><p>P.S. You complain about the trolls blowing smoke to you, but it seems like you've been blowing a lot of smoke to me this whole time.\n</p><p>P.P.S. Dogs decompose when they die. If you loved your dog, you wouldn't just assume it was all safe and go play your little video games.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>September 2, 2010 - 3:57pm\n<p>Chris, I just sent you a very long email, but honestly I have a feeling you'll just ignore it because it takes too many minutes to read, so I'm sending you this short one to make sure you understand me: Read the entirety of that long email, think about it, and respond to EVERY ONE of my questions and concerns. I don't care if it takes you two hours to do this, you do it. Or I'm through with you.\n</p><p>Jackie\n</p>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #ff00ff; background: #ffdddd; vertical-align: centered; color:#000000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\">⇐ <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">Jackie E-mails 11</a><span style=\"color: #000000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><span style=\"color: #000000\"><strong><a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">Jackie E-mails</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000000;\"><a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">Jackie E-mails 13</a><span style=\"color: #000000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a class=\"mw-selflink selflink\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240714045238\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.109 seconds\nReal time usage: 0.120 seconds\nPreprocessor visited node count: 809/1000000\nPost‐expand include size: 69352/2097152 bytes\nTemplate argument size: 48126/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 110/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   37.763      1 -total\n 76.49%   28.883      1 Template:Emails\n 67.25%   25.396      1 Template:Navbox\n  8.73%    3.297      3 Template:EmailReply\n  8.72%    3.292      1 Template:Tnavbar\n  6.39%    2.414      6 Template:Email\n  6.14%    2.319      1 Template:Succession\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14340-0!canonical and timestamp 20240714045238 and revision id 308632. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jackie_E-mails_12&amp;oldid=308632\">http://sonichu.com/w/index.php?title=Jackie_E-mails_12&amp;oldid=308632</a>\"</div></div>",
  "categories": [
    "Category",
    "Jackie E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "2007",
    "57",
    "MHS classmate E-mails",
    "Either way, we both win",
    "I recover more quickly",
    "light-re-situating",
    "morning coffee",
    "Sydney Contacts",
    "That was basically like a promise.",
    "\"Junior\"",
    "White knight E-mails",
    "43",
    "Moving Forward",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "terrible videos of myself",
    "44",
    "Eye of Judgment",
    "September 2010",
    "befuddled",
    "Julie",
    "14",
    "CWCipedia",
    "Oct 2008",
    "Surfshack Tito E-mails",
    "2005‒06",
    "40",
    "56",
    "Jackie E-mails 13",
    "self-nudity",
    "39",
    "Clyde",
    "MNR",
    "Mailbag",
    "21",
    "Nintendo",
    "Surfshack Tito",
    "heart",
    "9",
    "pickles",
    "Forum",
    "my car",
    "Vivian Gee",
    "Common Questions",
    "God",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "25",
    "Honest",
    "15",
    "Jackie",
    "59",
    "49",
    "53",
    "2010",
    "Jackie Romy",
    "etc",
    "Pok'emon",
    "Regina e-mails",
    "Mother",
    "52",
    "Blanca Weiss",
    "42",
    "2011-2012",
    "Jackie E-mails 11",
    "Virginia",
    "true and honest",
    "54",
    "Katie Bay",
    "Doopie E-mails",
    "17",
    "LBP",
    "go out",
    "blackmail",
    "it would haunt me for Weeks to Months before I would move forward.",
    "35",
    "YouTube",
    "Real, Honest People who actually have died or left me",
    "Uncensored",
    "dicks",
    "the console",
    "47",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "31",
    "I honestly feel that I have more control over myself than the trolls would",
    "18",
    "Aug",
    "games",
    "Gregg Mays",
    "Clyde Cash",
    "Jackie E-mails",
    "4",
    "36",
    "Catherine E-mails",
    "PS3",
    "48",
    "19",
    "2004‒06",
    "Letter",
    "50",
    "Aug‒Dec 2007",
    "requests from my ex-girlfriends",
    "PSN Hacking",
    "51",
    "8",
    "2011",
    "jerking off",
    "10",
    "2",
    "past",
    "Wendys",
    "2008",
    "financial situation",
    "2013-2014‎",
    "Clyde E-mails",
    "Patti",
    "Tito",
    "August 2010",
    "Uri Geller E-mails",
    "3",
    "46",
    "7",
    "Misc E-mails",
    "2007‒08",
    "37",
    "girlfriends",
    "11",
    "23",
    "26",
    "Thetan",
    "2009",
    "13",
    "61",
    "45",
    "video games",
    "29",
    "Sweetheart",
    "24",
    "32",
    "learning",
    "Open Relationship E-mails",
    "lesbian",
    "Jack Thaddeus",
    "Troll",
    "30",
    "58",
    "the more positive Me",
    "Samantha Thaddeus",
    "e-mailed",
    "the house tour",
    "doghouse",
    "1",
    "The Wallflower",
    "good things",
    "my father",
    "28",
    "Thy Father",
    "I lied to them",
    "34",
    "Miyamoto Saga",
    "38",
    "pickle",
    "41",
    "20",
    "Jan‒July 2007",
    "Evan E-mails",
    "GameStop",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "I'll make you a deal",
    "I invest $4 weekly",
    "16",
    "6",
    "sigh",
    "dog",
    "I earned a Huge Chunk of Respect",
    "Sept",
    "soul"
  ],
  "scraped_at": "2025-11-26T15:50:32.004359"
}