{
  "url": "https://sonichu.com/cwcki/Jail_Call_-_10_January_2022",
  "title": "Jail Call - 10 January 2022",
  "display_title": "Jail Call - 10 January 2022",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><table style=\"background:#FFF; border:1px solid #DEA743; border-top:8px solid #DEA743; color:#000; width:100%; max-width:618px; margin:0 auto 16px;\">\n<tbody><tr style=\"vertical-align:top;\">\n<td style=\"padding:5px;\"><a class=\"image\" href=\"/cwcki/File:Protip.jpg\"><img alt=\"Protip.jpg\" decoding=\"async\" height=\"90\" src=\"/w/images/thumb/6/6a/Protip.jpg/90px-Protip.jpg\" srcset=\"/w/images/thumb/6/6a/Protip.jpg/135px-Protip.jpg 1.5x, /w/images/6/6a/Protip.jpg 2x\" width=\"90\"/></a>\n</td>\n<td style=\"padding:0 5px 0 1px; width:100%;\"><div style=\"font-size:1.25em; margin:0\"><b>PROTIP:</b></div>\n<hr/>\n<div style=\"margin-bottom:0\"><b>The caller of this phone call is attempting to give money to Chris in jail. No matter how good your intentions may be, <i>do not do this for any reason</i>.</b></div>\n</td></tr></tbody></table>\n<p>On 10 January 2022, Chris made a <b>call from jail</b> to the Onion Farms user <b>Zombo</b>.\n</p><p>Some highlights of this call include:\n</p>\n<ul><li>Chris briefly talks about how global warming is a sign of the end times.</li>\n<li>Chris attempts to give parenting advice for the caller regarding how he can help his son during the <a href=\"/cwcki/COVID-19\" title=\"COVID-19\">COVID-19</a> pandemic, with reference to <a href=\"/cwcki/My_Little_Pony\" title=\"My Little Pony\">My Little Pony</a>.</li>\n<li>The caller talks about plans to send Chris money.</li>\n<li>In addition, Chris tells him to contact <a class=\"mw-redirect\" href=\"/cwcki/Kenneth_Engelhardt\" title=\"Kenneth Engelhardt\">Kenneth Engelhardt</a> by making an account on the Onion Farms.</li></ul>\n<p>This is the only one of Chris's recorded jail calls which was released to the public in full without any cuts, although Chris's voice is inaudible for the first 90 seconds.\n</p>\n<h2><span class=\"mw-headline\" id=\"The_Call\">The Call</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Chris's third jail call</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/J2t22jjSq5s\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>10 January 2022\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Jail</span><a href=\"/cwcki/Jail_Saga\" title=\"Jail\"><img alt=\"Jail\" decoding=\"async\" height=\"32\" src=\"/w/images/4/46/Incest_saga_icon.png\" width=\"32\"/></a> <a href=\"/cwcki/Jail_Saga\" title=\"Jail Saga\">Jail</a>\n</td></tr>\n</tbody></table>\n<h3><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h3>\n<p><font color=\"#000000\"><b>Recording:</b></font> Press 1 to receive incoming call.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Mm.\n</p><p><font color=\"#000000\"><b>Recording:</b></font> Press 2...\n</p><p><font color=\"#000000\"><b>Recording:</b></font> If you would like to...\n</p><p><font color=\"#000000\"><b>Recording:</b></font> Thank you for using Securus. You may start the conversation now.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> [<i>coughs</i>] Hey, good afternoon Christine. How you doin' today?\n</p><p>[<i>Chris is inaudible.</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Oh yeah, goin' through it?\n</p><p>[<i>Chris is inaudible.</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Good. I'm doin' okay, um, December was a bit of a rough month. Um... had a few deaths, people I know, just- in rapid succession, so I've kind of been depressed, but... um, y'know I'm just tryin' to, tryin to stay positive.\n</p><p>[<i>Chris is inaudible at first but gradually becomes louder starting around the 1:30 mark.</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> ...C-197 on that earth... or otherwise, if that was unavailable, your souls get reincarnated and you're somebody else on... part of the C-197 earth at this point, because we don't have much time left on this one. I mean, I even heard on the radio about more and more <a href=\"/cwcki/COVID-19\" title=\"COVID-19\">children getting inf- infected</a>, so that's an obvious sign right there. And another one-\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I also heard this on the radio recently, that, apparently, uh, it got so warm <a href=\"/cwcki/Honor_roll\" title=\"Honor roll\">up in the Antarctic</a>, not only are the ice caps and bodies of ice melting, but, for the very first time, they recorded regular, not freezing, REGULAR RAIN.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> You know, I've heard that too, and I'm, um, I've been hearing that for years, there's actually, in like the North Pole there's like warm spots where it's like green grass and stuff.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, that- that does not surprise me too much.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> It's kinda crazy, ain't it? Everyone knows what's going on, but nobody's willing to, you know, give it any attention.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, it makes a lot more- to just, quote, \"global warning\" is the divine event. Of course, with, uh, Judgment Day on those left behind, and the collective shift and all that. [<i>Inaudible</i>] Uhm. You'll have to tell me about your son. How's he doing?\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Uhm, he's doing good. He's currently in the other room doing some schoolwork.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, well that's good. Uhm. Virtual, or is he allowed to attend school?\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> It's- it's in person. Yeah, they- they stopped doing the virtual. They're startin' to kind of get more relaxed with all the Covid restrictions, it's kind of interesting. They just- I just got an email yesterday saying instead of, y'know, ten days of quarentine now it's only five. So I don't know what the difference- why it changed but they're starting to, I don't know, not care as much I guess.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.. Uh.. On the one hand, yeah but on another, things are becoming more lax. But it's also, I have heard about on the radio, other schools just- y'know they were flip-flopping between the-\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> The in-person and going back or being virtual [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> So, yeah, we did that I- I sent, for all of fourth grade my son did virtual and he didn't learn a thing. It didn't- he's only in fourth grade, you can imagine they're just on YouTube. Kids aren't- And I'm one of the few, rare people who are able to work from home so my son was actually schooling from home right next to me and I was able to watch him. And he still got off task so much that his grades just absolutely plummeted. So, they need to figure out a better way other than just Zoom meetings. But, y'know, right now we don't really have much of a choice, I can't have him school from home so I have to send him, y'know, to the physical school. But if there was a way for him to school from home with it being affective still, I would probably do that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Well, one thing I can definitely offer, since you were able to observe your son, and that's actually a good advantage point on your part. You can actually talk with him and- and figure out how does best learn for himself. \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Right.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean- To just to offer comparison, look at the episode of \"My Little Pony: Friendship is Magic\" Testing Testing, 1, 2, 3, where Rainbow Dash was about to get tested to be to be entered into The Wonderbolts. But she was- but she just had no knowledge. They had to figure it out through the, uh, the various learning and teaching methods, and then they found that Rainbow Dash can learn for herself by being up in the sky, looking down on Earth- on everything.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah, that's actually a great. Uhm. That's a great point that's absolutely true. My son ,uhm, didn't respond well to video learning. Uhm, I think most kids kinda struggled with it but he in particular was too distracted, so.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, that makes sense. \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Uhm, more- yeah, more of a physical thing is probably the best for now. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Physical things, yeah. \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> But I was actually just getting ready to send out a letter to you because I missed your last couple of phone calls and I wanted to make sure that you didn't think I was blowin' ya off.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, I appreciate that. Oh, but let me back- let me backtrack a moment. Well, I did want to check in with you and help you do better but, uh, but the big reason why I'm calling is because, presently, my inmate account is LOW on money. And I just checked it [<i>Unintelligible</i>] has eleven cents in it.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Uh oh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And my phone account has less than ten dollars in it right now so I got to be careful with, uh, how long I stick on the phone. [<i>Unintelligible</i>] Well, I need to get more money in and I saw on recent days that they weren't able not access the CVRJ website here so that's that on the [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright, so what you can do for me, uh, in addition to you going on the website and then you donate on like twenty or fifty bucks from your own card and help me out a little. And another thing is-\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Sure. Yeah, I can do that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Is that you can also go onto OnionFarms. Contact <a href=\"/cwcki/Other_enablers\" title=\"Other enablers\">Kenneth Engelhardt</a>, send him the link. After you've confirmed it for yourself just tell him [<i>Unintelligible</i>] site's back up. You can go there, you can donate money to Christine again.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Sorry, give me one second here. What was the name you just said?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. Alright, well I said that you can tell Kenneth.  Engelhardt.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Can you spell that for me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh. K, E, N, N, E, T, H, E, N, G, L, E, H, A, R, D, T.    \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Alright, and what was the website you said?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Onion. Farms.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Onion Farm? Is that OnionFarm.com?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhm. You might want to Google that 'cause I don't know a way to backtrack, it's literally OnionFarms.com\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because, I'm sure that KiwiFarms in comparison is not OnionFarms.com. \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> M'kay. I've never heard of that site but I'll certainly see what I can figure out to help you out. And I can absolutely give you some money for your books.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, I appreciate that. Alright, then yeah, go on the CVRJ website, maybe Google that first make sure you have the right link.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> So, yeah, I'll definitely do that. Let me see if I can bring it on here. CVRJ.com just to test it out while we're on the phone here. So I was tryna do this before and of course this site wasn't working but, uhm. So do I just look you up by name and- and will it show up? Is that how it works?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Y'know I don't know how it is because I don't have a computer in front of me, obviously.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah, yeah. Okay, well I can always- I can always maybe just call up there and have them tell me the specifics. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, they- yeah that's an idea but I feel that it's more common sense th- they got a like, oh, a link where you can donate to an inmate. You can look up the inmate by their name, obviously.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> M'kay. Yeah, and I wasn't sure- Yeah, so, yeah okay. I was trying to do that before but the site was down, so that's- yeah that clears it up. It looks like the site- if it's CBRJ it looks like it might still be down I just tried it while we were sit-in' here. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hm.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Let me try this again, let me put my phone down here.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep. Try Googling it.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah that's what I'm gonna do here. (typing noises) CBRJ, is that it? \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Or, y'know, the full terminology is Central Virginia Regional Jail. \n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Oh, C -V- RJ. Duh, I'm a dork. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Why? Did you think I said C -B-?\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> I did, yeah. Ohh okay, yeah. Wait, hang on here. \"CVRG is for sale\"? Uh, Oh. Alright, I'm doing a classic search here. I just want to make sure I'm lookin' up the right place to make sure I'm not sending the wrong person the money.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Type the word. Type in there Central. Virginia. Regional. Jail.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Alright I just typed that in here. Let me see here... CVRJ...Hm.. They're not making this easy. There's the link...But it's not working. It looks like it's- it's just a white page, it's not doing anything. It-it might. Well if it comes back up, I'll keep trying it and I'll put some money on your books, I'll give you like fifty bucks. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I appreciate that- [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> And- and if I can't get on this website you said money orders are also accepted? Can I send a money order in your name? \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh yes. You can send me via US sail- US mail- Uh, postal money orders or a cashier's check from your bank account.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Okay. So yeah, I'll absolutely help you out and, uhm, if I don't get on the site t-, uh, tomorrow I'll send it in the mail and you'll get it either way. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahkay. And yeah, definitely recommend that you get in contact with Kenneth Engelhardt on Onion Farms. He's a decent guy- he's a decent guy, a good person for the most part. Even though he may have qualms at times, he's more of a neutral good.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> M'kay well I mean if he's doin' alright by ya, I trust him. I mean, I don't know- you've, you've kind of befriended some of the people who, y'know used to run the websites and stuff so.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Yeah, it didn't work out so well or they didn't- they slowly betrayed me obviously.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Pieces of shit, yeah. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Pardon my French.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> *Laughs* M'kay, um, so funnily enough, you wanna know something weird? Um, right after we started talking, your videos started getting recommended to me on youtube. It's so weird, it's like after we had our first phone call, y- like, that was the only time, even though I had already watched a metric shitton of videos about you on that other channel. Like, now your videos are starting to get on my recommended *laughs*.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Yeah, that algorithm's got me pegged, haha.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Unintelligible</i>]\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> So how's everything else been going for you, other than, y'know, the troubles of, obviously being stuck in there?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, well everything th- everything metaphysically and inter-dimensionally and all that's working out, and, just- I've been- My body and I, we've been working it out...\n</p><p><font color=\"#8A0808\"><b>Zombo:</b></font> Mmkay, that's good. Do you know, um, when your next court date is or anything like that? Are you, um, are you pretty hopeful about all that stuff or do you, um, you have help with that kind of stuff?\n</p><p><br/>\n</p>\n<center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:3px outset #bb2222\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:CWCism-IllBreakYouDead.png\"><img alt=\"CWCism-IllBreakYouDead.png\" decoding=\"async\" height=\"113\" src=\"/w/images/0/05/CWCism-IllBreakYouDead.png\" width=\"150\"/></a>\n</td>\n<td><i> This media needs a <a href=\"/cwcki/CWCki:Transcription_Style\" title=\"CWCki:Transcription Style\">transcript</a>. Help CWCki by <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Jail_Call_-_10_January_2022&amp;action=edit\" rel=\"nofollow\">transcribing the content</a>. If the media is too long, transcribe select portions which are funny or informative.</i>\n</td></tr>\n</tbody></table></center>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";background:#BFBFBF;\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;background:#BFBFBF;;border:none;;\"><a href=\"/cwcki/Template:JailLetter\" title=\"Template:JailLetter\"><span style=\";background:#BFBFBF;;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:JailLetter&amp;action=edit&amp;redlink=1\" title=\"Template talk:JailLetter (page does not exist)\"><span style=\"color:#002bb8;;background:#BFBFBF;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:JailLetter&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;background:#BFBFBF;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Jail_Communications\" title=\"Jail Communications\">Jail Communications</a> (2021–22)</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#F2F2F2;;\">Letters\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<table cellspacing=\"0\" class=\"nowraplinks navbox-subgroup\" style=\"width:100%;;margin: 0 -0.25em;;;\">\n<tbody><tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">All Letters</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_9_August_2021\" title=\"Jail Letter - 9 August 2021\">1</a> • <a href=\"/cwcki/Jail_Letter_-_20_August_2021\" title=\"Jail Letter - 20 August 2021\">2</a> • <a href=\"/cwcki/Jail_Letter_-_19_September_2021\" title=\"Jail Letter - 19 September 2021\">3</a> • <a href=\"/cwcki/Jail_Letter_-_3_October_2021\" title=\"Jail Letter - 3 October 2021\">4</a> • <a href=\"/cwcki/Jail_Letter_-_4_October_2021\" title=\"Jail Letter - 4 October 2021\">5</a> • <a href=\"/cwcki/Jail_Letter_-_20_October_2021\" title=\"Jail Letter - 20 October 2021\">6</a> • <a href=\"/cwcki/Jail_Letter_-_21_October_2021\" title=\"Jail Letter - 21 October 2021\">7</a> • <a href=\"/cwcki/Jail_Letter_-_25_October_2021_(Virginia_fan)\" title=\"Jail Letter - 25 October 2021 (Virginia fan)\">8</a> • <a href=\"/cwcki/Jail_Letter_-_25_October_2021_(Kengle)\" title=\"Jail Letter - 25 October 2021 (Kengle)\">9</a> • <a href=\"/cwcki/Jail_Letter_-_30_October_2021\" title=\"Jail Letter - 30 October 2021\">10</a> • <a href=\"/cwcki/Jail_Letter_-_8_November_2021_(Stories_from_the_Penitentiary)\" title=\"Jail Letter - 8 November 2021 (Stories from the Penitentiary)\">11</a> • <a href=\"/cwcki/Jail_Letter_-_8_November_2021_(Eels_and_the_Eggman)\" title=\"Jail Letter - 8 November 2021 (Eels and the Eggman)\">12</a> • <a href=\"/cwcki/Jail_Letter_-_16_November_2021\" title=\"Jail Letter - 16 November 2021\">13</a> • <a href=\"/cwcki/Jail_Letter_-_20_November_2021\" title=\"Jail Letter - 20 November 2021\">14</a> • <a href=\"/cwcki/Jail_Letter_-_27_November_2021\" title=\"Jail Letter - 27 November 2021\">15</a> • <a href=\"/cwcki/Jail_Letter_-_30_November_2021_(Celestia)\" title=\"Jail Letter - 30 November 2021 (Celestia)\">16</a> • <a href=\"/cwcki/Jail_Letter_-_30_November_2021_(Eels_and_the_Egg-man)\" title=\"Jail Letter - 30 November 2021 (Eels and the Egg-man)\">17</a> • <a href=\"/cwcki/Jail_Letter_-_6_December_2021\" title=\"Jail Letter - 6 December 2021\">18</a> • <a href=\"/cwcki/Jail_Letter_-_9_December_2021\" title=\"Jail Letter - 9 December 2021\">19</a> • <a href=\"/cwcki/Jail_Letter_-_10_December_2021\" title=\"Jail Letter - 10 December 2021\">20</a> • <a href=\"/cwcki/Jail_Letter_-_13_December_2021\" title=\"Jail Letter - 13 December 2021\">21</a> • <a href=\"/cwcki/Jail_Letter_-_14_December_2021\" title=\"Jail Letter - 14 December 2021\">22</a> • <a href=\"/cwcki/Jail_Letter_-_22_December_2021\" title=\"Jail Letter - 22 December 2021\">23</a> • <a href=\"/cwcki/Jail_Letter_-_4_January_2022\" title=\"Jail Letter - 4 January 2022\">24</a> • <a href=\"/cwcki/Jail_Letter_-_8_January_2022\" title=\"Jail Letter - 8 January 2022\">25</a> • <a href=\"/cwcki/Jail_Letter_-_11_January_2022\" title=\"Jail Letter - 11 January 2022\">26</a> • <a href=\"/cwcki/Jail_Letter_-_18_January_2022\" title=\"Jail Letter - 18 January 2022\">27</a> • <a href=\"/cwcki/Jail_Letter_-_19_January_2022\" title=\"Jail Letter - 19 January 2022\">28</a> • <a href=\"/cwcki/Jail_Letter_-_28_January_2022\" title=\"Jail Letter - 28 January 2022\">29</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Kengle\" title=\"Jail Letter - Prayer to Kengle\">30</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Spamton\" title=\"Jail Letter - Prayer to Spamton\">31</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Bazaar\" title=\"Jail Letter - Prayer to Bazaar\">32</a> • <a href=\"/cwcki/Jail_Letter_-_9_May_2022\" title=\"Jail Letter - 9 May 2022\">33</a> • <a href=\"/cwcki/Jail_Letter_-_11_May_2022\" title=\"Jail Letter - 11 May 2022\">34</a> • <a href=\"/cwcki/Jail_Letter_-_25_May_2022\" title=\"Jail Letter - 25 May 2022\">35</a> • <a href=\"/cwcki/Jail_Letter_-_1_June_2022\" title=\"Jail Letter - 1 June 2022\">36</a> • <a href=\"/cwcki/Jail_Letter_-_4_June_2022\" title=\"Jail Letter - 4 June 2022\">37</a> • <a href=\"/cwcki/Jail_Letter_-_13_June_2022\" title=\"Jail Letter - 13 June 2022\">38</a> • <a href=\"/cwcki/Jail_Letter_-_25_June_2022\" title=\"Jail Letter - 25 June 2022\">39</a> • <a href=\"/cwcki/Jail_Letter_-_27_June_2022\" title=\"Jail Letter - 27 June 2022\">40</a> • <a href=\"/cwcki/Jail_Letter_-_4_July_2022\" title=\"Jail Letter - 4 July 2022\">41</a> • <a href=\"/cwcki/Jail_Letter_-_14_July_2022\" title=\"Jail Letter - 14 July 2022\">42</a> • <a href=\"/cwcki/Jail_Letter_-_21_July_2022\" title=\"Jail Letter - 21 July 2022\">43</a> • <a href=\"/cwcki/Jail_Letter_-_22_July_2022_(1)\" title=\"Jail Letter - 22 July 2022 (1)\">44</a> • <a href=\"/cwcki/Jail_Letter_-_22_July_2022_(2)\" title=\"Jail Letter - 22 July 2022 (2)\">45</a> • <a href=\"/cwcki/Jail_Letter_-_29_July_2022\" title=\"Jail Letter - 29 July 2022\">46</a> • <a href=\"/cwcki/Jail_Letter_-_2_August_2022\" title=\"Jail Letter - 2 August 2022\">47</a> • <a href=\"/cwcki/Jail_Letter_-_5_August_2022\" title=\"Jail Letter - 5 August 2022\">48</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">By recipient</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<table cellspacing=\"0\" class=\"nowraplinks navbox-subgroup\" style=\"width:100%;;margin: 0 -0.25em;;;\">\n<tbody><tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Miscellaneous</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_9_August_2021\" title=\"Jail Letter - 9 August 2021\">1</a> • <a href=\"/cwcki/Jail_Letter_-_20_August_2021\" title=\"Jail Letter - 20 August 2021\">2</a> • <a href=\"/cwcki/Jail_Letter_-_19_September_2021\" title=\"Jail Letter - 19 September 2021\">3</a> • <a href=\"/cwcki/Jail_Letter_-_3_October_2021\" title=\"Jail Letter - 3 October 2021\">4</a> • <a href=\"/cwcki/Jail_Letter_-_20_October_2021\" title=\"Jail Letter - 20 October 2021\">5</a> • <a href=\"/cwcki/Jail_Letter_-_21_October_2021\" title=\"Jail Letter - 21 October 2021\">6</a> • <a href=\"/cwcki/Jail_Letter_-_25_October_2021_(Virginia_fan)\" title=\"Jail Letter - 25 October 2021 (Virginia fan)\">7</a> • <a href=\"/cwcki/Jail_Letter_-_8_November_2021_(Stories_from_the_Penitentiary)\" title=\"Jail Letter - 8 November 2021 (Stories from the Penitentiary)\">8</a> • <a href=\"/cwcki/Jail_Letter_-_20_November_2021\" title=\"Jail Letter - 20 November 2021\">9</a> • <a href=\"/cwcki/Jail_Letter_-_28_January_2022\" title=\"Jail Letter - 28 January 2022\">10</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Bizarre Bazaar</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_4_January_2022\" title=\"Jail Letter - 4 January 2022\">1</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Bazaar\" title=\"Jail Letter - Prayer to Bazaar\">2</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Celestia</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_30_November_2021_(Celestia)\" title=\"Jail Letter - 30 November 2021 (Celestia)\">1</a> • <a href=\"/cwcki/Jail_Letter_-_9_December_2021\" title=\"Jail Letter - 9 December 2021\">2</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Eels / Helena</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_8_November_2021_(Eels_and_the_Eggman)\" title=\"Jail Letter - 8 November 2021 (Eels and the Eggman)\">1</a> • <a href=\"/cwcki/Jail_Letter_-_30_November_2021_(Eels_and_the_Egg-man)\" title=\"Jail Letter - 30 November 2021 (Eels and the Egg-man)\">2</a> • <a href=\"/cwcki/Jail_Letter_-_10_December_2021\" title=\"Jail Letter - 10 December 2021\">3</a> • <a href=\"/cwcki/Jail_Letter_-_9_May_2022\" title=\"Jail Letter - 9 May 2022\">4</a> • <a href=\"/cwcki/Jail_Letter_-_1_June_2022\" title=\"Jail Letter - 1 June 2022\">5</a> • <a href=\"/cwcki/Jail_Letter_-_4_June_2022\" title=\"Jail Letter - 4 June 2022\">6</a> • <a href=\"/cwcki/Jail_Letter_-_13_June_2022\" title=\"Jail Letter - 13 June 2022\">7</a> • <a href=\"/cwcki/Jail_Letter_-_25_June_2022\" title=\"Jail Letter - 25 June 2022\">8</a> • <a href=\"/cwcki/Jail_Letter_-_27_June_2022\" title=\"Jail Letter - 27 June 2022\">9</a> • <a href=\"/cwcki/Jail_Letter_-_4_July_2022\" title=\"Jail Letter - 4 July 2022\">10</a> • <a href=\"/cwcki/Jail_Letter_-_21_July_2022\" title=\"Jail Letter - 21 July 2022\">11</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Kenneth Engelhardt</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_4_October_2021\" title=\"Jail Letter - 4 October 2021\">1</a> • <a href=\"/cwcki/Jail_Letter_-_25_October_2021_(Kengle)\" title=\"Jail Letter - 25 October 2021 (Kengle)\">2</a> • <a href=\"/cwcki/Jail_Letter_-_30_October_2021\" title=\"Jail Letter - 30 October 2021\">3</a> • <a href=\"/cwcki/Jail_Letter_-_16_November_2021\" title=\"Jail Letter - 16 November 2021\">4</a> • <a href=\"/cwcki/Jail_Letter_-_27_November_2021\" title=\"Jail Letter - 27 November 2021\">5</a> • <a href=\"/cwcki/Jail_Letter_-_6_December_2021\" title=\"Jail Letter - 6 December 2021\">6</a> • <a href=\"/cwcki/Jail_Letter_-_13_December_2021\" title=\"Jail Letter - 13 December 2021\">7</a> • <a href=\"/cwcki/Jail_Letter_-_14_December_2021\" title=\"Jail Letter - 14 December 2021\">8</a> • <a href=\"/cwcki/Jail_Letter_-_11_January_2022\" title=\"Jail Letter - 11 January 2022\">9</a> • <a href=\"/cwcki/Jail_Letter_-_18_January_2022\" title=\"Jail Letter - 18 January 2022\">10</a> • <a href=\"/cwcki/Jail_Letter_-_19_January_2022\" title=\"Jail Letter - 19 January 2022\">11</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Kengle\" title=\"Jail Letter - Prayer to Kengle\">12</a> • <a href=\"/cwcki/Jail_Letter_-_11_May_2022\" title=\"Jail Letter - 11 May 2022\">13</a> • <a href=\"/cwcki/Jail_Letter_-_25_May_2022\" title=\"Jail Letter - 25 May 2022\">14</a> • <a href=\"/cwcki/Jail_Letter_-_14_July_2022\" title=\"Jail Letter - 14 July 2022\">15</a> • <a href=\"/cwcki/Jail_Letter_-_22_July_2022_(1)\" title=\"Jail Letter - 22 July 2022 (1)\">16</a> • <a href=\"/cwcki/Jail_Letter_-_22_July_2022_(2)\" title=\"Jail Letter - 22 July 2022 (2)\">17</a> • <a href=\"/cwcki/Jail_Letter_-_29_July_2022\" title=\"Jail Letter - 29 July 2022\">18</a>  • <a href=\"/cwcki/Jail_Letter_-_2_August_2022\" title=\"Jail Letter - 2 August 2022\">19</a> • <a href=\"/cwcki/Jail_Letter_-_5_August_2022\" title=\"Jail Letter - 5 August 2022\">20</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;line-height:1.2em;background:#F2F2F2;;\"><div style=\"padding:0em 0.75em;\">Spamton</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_-_22_December_2021\" title=\"Jail Letter - 22 December 2021\">1</a> • <a href=\"/cwcki/Jail_Letter_-_8_January_2022\" title=\"Jail Letter - 8 January 2022\">2</a> • <a href=\"/cwcki/Jail_Letter_-_Prayer_to_Spamton\" title=\"Jail Letter - Prayer to Spamton\">3</a></div>\n</td></tr></tbody></table></div>\n</td></tr></tbody></table></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#F2F2F2;;\">Calls\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Call_-_1_November_2021\" title=\"Jail Call - 1 November 2021\">1</a> • <a href=\"/cwcki/Jail_Call_-_24_December_2021\" title=\"Jail Call - 24 December 2021\">2</a> • <a class=\"mw-selflink selflink\">3</a> • <a href=\"/cwcki/Jail_Call_-_11_January_2022\" title=\"Jail Call - 11 January 2022\">4</a> • <a href=\"/cwcki/Jail_Call_-_13_January_2022\" title=\"Jail Call - 13 January 2022\">5</a> • <a href=\"/cwcki/Jail_Medallion_Promotions\" title=\"Jail Medallion Promotions\">6</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";line-height:1.2em;background:#F2F2F2;;\">See Also\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Letter_Gifts\" title=\"Jail Letter Gifts\">Jail Letter Gifts</a> • <a class=\"mw-redirect\" href=\"/cwcki/Praetor_Jail_Art\" title=\"Praetor Jail Art\">Praetor Jail Art</a> • <a class=\"mw-redirect\" href=\"/cwcki/Commandments\" title=\"Commandments\">Commandments</a> • <a class=\"mw-redirect\" href=\"/cwcki/Prayer\" title=\"Prayer\">Prayer</a> • <a href=\"/cwcki/Excommunication_letter\" title=\"Excommunication letter\">Excommunication letter from Kenneth Engelhardt</a> • <a href=\"/cwcki/Jail_Art_(reverse_side)\" title=\"Jail Art (reverse side)\">Jail Art (reverse side)</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250705142947\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.126 seconds\nReal time usage: 0.138 seconds\nPreprocessor visited node count: 1472/1000000\nPost‐expand include size: 75582/2097152 bytes\nTemplate argument size: 48491/2097152 bytes\nHighest expansion depth: 17/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   55.730      1 -total\n 77.04%   42.932      3 Template:Navbox\n 62.49%   34.824      1 Template:JailLetter\n 29.59%   16.488      2 Template:Navbox_subgroup\n 19.76%   11.011      1 Template:Infobox/Audiofile\n  9.54%    5.317      1 Template:Protip\n  7.86%    4.378      1 Template:Prison\n  7.79%    4.344      1 Template:Transcript\n  5.42%    3.020      1 Template:Tnavbar\n  4.60%    2.563      1 Template:Box\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:33882-0!canonical and timestamp 20250705142947 and revision id 325165. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jail_Call_-_10_January_2022&amp;oldid=325165\">http://sonichu.com/w/index.php?title=Jail_Call_-_10_January_2022&amp;oldid=325165</a>\"</div></div>",
  "categories": [
    "Category",
    "Jail Calls"
  ],
  "links": [
    "48",
    "Jail",
    "up in the Antarctic",
    "15",
    "19",
    "24",
    "25",
    "29",
    "32",
    "Commandments",
    "Jail Art (reverse side)",
    "Excommunication letter from Kenneth Engelhardt",
    "30",
    "Jail Letter Gifts",
    "children getting inf- infected",
    "8",
    "43",
    "1",
    "Prayer",
    "42",
    "Kenneth Engelhardt",
    "28",
    "10",
    "44",
    "2",
    "17",
    "34",
    "14",
    "38",
    "41",
    "40",
    "35",
    "20",
    "My Little Pony",
    "COVID-19",
    "39",
    "47",
    "21",
    "33",
    "3",
    "46",
    "Jail Communications",
    "7",
    "9",
    "16",
    "18",
    "31",
    "37",
    "6",
    "11",
    "23",
    "45",
    "26",
    "Praetor Jail Art",
    "4",
    "13",
    "27",
    "22",
    "36",
    "5",
    "12"
  ],
  "scraped_at": "2025-11-26T15:52:09.914617"
}