{
  "url": "https://sonichu.com/cwcki/Jason_Kendrick_Howell_interview",
  "title": "Jason Kendrick Howell interview",
  "display_title": "Jason Kendrick Howell interview",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>The following is an unedited archive of an interview which <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> conducted with <a href=\"/cwcki/Jason_Kendrick_Howell\" title=\"Jason Kendrick Howell\">Jason Kendrick Howell</a> in <a href=\"/cwcki/November_2009\" title=\"November 2009\">November 2009</a>. It contains information about how Chris was originally discovered by the <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a>, and how he responded to them.\n</p>\n<h2><span id=\"Chris-chan.2FJKH_Interview\"></span><span class=\"mw-headline\" id=\"Chris-chan/JKH_Interview\">Chris-chan/JKH Interview</span></h2>\n<p>We have with us <a href=\"/cwcki/Jason_Kendrick_Howell\" title=\"Jason Kendrick Howell\">Jason Kendrick Howell</a> of Tennessee, the originator of the Chris-chan <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> article. This Thanksgiving 2009, ED has twenty questions for the creator of one of the best known articles in ED's five year history. On November 3, 2007, JKH made the first edit as Howellgames. Chris-chan has since grown to have over 5,000 revisions, two wikis just for him, and is a favorite to win Pollfest as the ED audience's favorite article in our five year history. \n</p><p>Chris if you would like an interview, hop on <a class=\"external free\" href=\"irc://irc.encyclopediadramatica.ch/wiki\" rel=\"nofollow\">irc://irc.encyclopediadramatica.ch/wiki</a> and ask for <a href=\"/cwcki/Niggos\" title=\"Niggos\">Sheneequa</a>. \n</p><p><b>ED:</b> Please state your name and location for the camera. How far are you from <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a>?\n</p><p><b>JKH:</b> I live in <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Clarksville,_Tennessee\" title=\"wikipedia:Clarksville, Tennessee\">Clarksville, TN</a>, which is about 600 miles away from Ruckersville (about nine hours or so.) \n</p><p><b>ED:</b> How did you get involved with CWC [Christian Weston Chandler, or Chris-chan]?\n</p><p><b>JKH:</b> Back in November of <a href=\"/cwcki/2007\" title=\"2007\">2007</a>, Chris-chan became a major attraction on <a class=\"mw-redirect\" href=\"/cwcki/4chan\" title=\"4chan\">4chan</a> due to his <a href=\"/cwcki/CWC%27s_Sonichu_Site!\" title=\"CWC's Sonichu Site!\">website</a> and <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">comic</a>. Back then, we knew very little about his personal life outside of the stuff that is on his now deleted <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a> page and his old website. Over time, people started to dig up even more stuff on him, such as the <a href=\"/cwcki/The_Tale_Of_The_Crazy_Pacer\" title=\"The Tale Of The Crazy Pacer\">blog of a mall worker</a> who saw him pacing back and fourth watching stuff on his GBA. This had gone on for several days, so I decided to make an ED page on him in order to document most of the findings. I was involved in the earlier creation of the page, but I let other people work on it after a week or so. \n</p><p>A few months afterwords, I think like June or so, I found a comment on my talk page for ED from Chris asking me why I created the page on him and \"dragged his name through the mud\". I send him a rather sarcastic email back, and he made a <a href=\"/cwcki/Attention_All_Sonichu_Fans_(NOT_HATERS)\" title=\"Attention All Sonichu Fans (NOT HATERS)\">YouTube video</a> about it. It was one of the first times that anyone had gotten to him that badly from a troll point of view. I exchanged a few more emails with him, and he eventually stopped talking for a little bit and made one of his comics about me and my then girlfriend at the time, <a href=\"/cwcki/Kathleen\" title=\"Kathleen\">Kathleen</a>. I did a stupid thing back then and gave him my phone number in the hopes that I might be able to screw with him over the phone, but he used that as a way to track me down and find my MySpace page, which lead to the comic. He sent me a email shortly afterwords saying that he put me into a comic, and that was the last I heard of him for awhile. \n</p><p>Afterwords, I sort of quit keeping up with Chris when ED helped him win that <a class=\"mw-redirect\" href=\"/cwcki/GameStop_Be_A_Star_Sweepstakes\" title=\"GameStop Be A Star Sweepstakes\">guitar hero contest</a>, but I got dragged back when <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a> pretended to be me when he \"hacked\" his website. That was when I got a <a href=\"/cwcki/Jason_Kendrick_Howell_message\" title=\"Jason Kendrick Howell message\">angry phone call</a> from him that lead to the \"I'LL BREAK YOU DEAD!\" quote. \n</p><p><b>ED:</b> How did you find ED?\n</p><p><b>JKH:</b> I had been going to ED in the past to look up some stuff on people out of boredom, mainly <a href=\"/cwcki/DeviantART\" title=\"DeviantART\">deviantART</a> fuckers and such that have a lot of drama, all very good reading for a very bored person. I had previously gone to Uncyclopedia for awhile, but after that got old I found out about ED, I think from 4chan. \n</p><p><b>ED:</b> Who started all this CWC stuff in the first place? On what site?\n</p><p><b>JKH:</b> It sort of exploded at the same time on both SomethingAwful and 4chan, but I think he was first posted on /co/ on 4chan, and it eventually spread to /b/ and mainly /v/. I honestly could not tell you who started it, although I remember hearing about someone who discovered his website a few years earlier, but it did not catch on at the time. \n</p><p><b>ED:</b> Did you ever contact or see Chris-chan?\n</p><p><b>JKH:</b> The first time I ever contacted Chris-chan was when we first discovered about him, but he pretty much ignored me at the time. He later contacted me on ED when he found out that I was the one who made the page (He sent it back in April, I think, and I did not get it until June or so). I sent him the email he read in the YouTube video, and he sent me back a email with a \"FUCK YOU\" in it. Afterwords, he went all stalker on my ass and started to dig up info on me. I honestly thought he was planning on coming down and killing me at the time, since we did not know what he was like back then. He finally contacted me back in Fall of '08 or so when he got his website hacked, and left a nasty voicemail since he thought it was me at the time. The very last sort of contact I had with him recently was when I sent him a package with the first disc of <a href=\"/cwcki/Metal_Gear\" title=\"Metal Gear\">MGS3:SE</a> in it, but he was so paranoid of the mail that he sent it back. \n</p><p><b>ED:</b> How did you get to learn about him originally?\n</p><p><b>JKH:</b> Mainly through 4chan. I found out about him on a topic on the board, since that is all people talked about when we first discovered him and started to dig up stuff on him. We learned quite a bit about his past from the MySpace page he had at the time that talked about his failed <a href=\"/cwcki/Chop_Chop_Master_Onion%27s_Rap_Showdown\" title=\"Chop Chop Master Onion's Rap Showdown\">Parappa the Rappa contest</a> and <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>. \n</p><p><b>ED:</b> How do you feel about the whole CWC genre and the explosion of pages that grew out of your original seed?\n</p><p><b>JKH:</b> It's sort of amazing, although I think it would have grown either way, with me or without me making the ED page. He has his own website, YouTube channel, forum dedicated to keeping a eye on him, two whole wikis dedicated to him (one for the trolls, and one for himself), fan webcomic, flash adaptions of his comics, and many people on YouTube ranting and raving about the guy. He is pretty much in the same area Ed Wood is in: So bad, he is good, although the only difference is Ed Wood had fans. Chris has none. \n</p><p><b>ED:</b> How do you feel about the people that still actively troll him? Are you actively engaged in this world? Do you think it may have gone too far?\n</p><p><b>JKH:</b> The problem with the people that actively troll him is they put so much effort into it with disappointing results. For example: <a class=\"mw-redirect\" href=\"/cwcki/Liquid\" title=\"Liquid\">Liquid</a> set up the whole \"<a href=\"/cwcki/Kacey\" title=\"Kacey\">Casey</a> being his girlfriend\" thing, only for it to be ruined by him getting the Sonichu <a class=\"mw-redirect\" href=\"/cwcki/Copyright\" title=\"Copyright\">copyright</a> and <a href=\"/cwcki/Red_Letter_CWC_Certified_Day\" title=\"Red Letter CWC Certified Day\">acting like it was a big win</a> for him. I keep tabs on him mainly, the latest thing I did was a series of YouTube videos on <a class=\"mw-redirect\" href=\"/cwcki/Vivian\" title=\"Vivian\">Vivian</a>'s YouTube page that talked about the past Sonichu stuff. As for going too far, I think there was a couple of things I did not agree on, one of which was bringing <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">rocky</a> (an aid at Chris's <a class=\"mw-redirect\" href=\"/cwcki/Church\" title=\"Church\">church</a>) into the whole thing and blaming her, or trolling people that had nothing to do with anything. \nI'm still quite pissed about the copyright thing, though. Just as bad as the guitar hero contest. \n</p><p><b>ED:</b> Did you ever start or majorly contribute to any other articles on ED?\n</p><p><b>JKH:</b> Eh, not really. I like reading ED, but not editing it. Then again, I hate editing any wiki unless I see a need for it. \n</p><p><b>ED:</b> Do you have a Sonichu <a class=\"mw-redirect\" href=\"/cwcki/Medallion\" title=\"Medallion\">medallion</a> of your own?\n</p><p><b>JKH:</b> I wish.... \n</p><p><b>ED:</b> It's Thanksgiving today. Are you thankful for Christian Chandler?\n</p><p><b>JKH:</b> You know, I wonder...is he eating Thanksgiving dinner in his messy house, or will he be a lazy fatass and go out to dinner? My money is on going out. As for asking if I am thankful for him, I do think he has made many lulz and given insight on what you should NOT be. He is like the biggest anti-person I have ever seen. \n</p><p><b>ED:</b> Boxers or briefs?\n</p><p><b>JKH:</b> Briefs \n</p><p><b>ED:</b> Any thoughts on the current CWC article?\n</p><p><b>JKH:</b> It has definitely grown quite a bit in the last two years or so. I still notice a few sentences I did back then, but it is very different. I do think it is a little behind <a href=\"/cwcki/CWCki\" title=\"CWCki\">cwcwiki</a> on a few things, though, but that is to be expected. Compared to some of the other articles on ED, it has the most content on a single person, though, which is fucking amazing. \n</p><p><b>ED:</b> You said you quit following Chris-chan when ED helped him win a Guitar Hero contest. Was this because you weren't a fan of us helping him or were you just burned out on all the CWC content?\n</p><p><b>JKH:</b> A little of both. The logic ED had was that helping him win would possibly allow him to make it in the <a href=\"/cwcki/Guitar_Hero\" title=\"Guitar Hero\">Guitar Hero</a> game based on what the contest said, but make it a \"win\" for ED. Problem was, it basically gave him a $400 <a href=\"/cwcki/GameStop\" title=\"GameStop\">GameStop</a> gift card (or was it $600? I forgot.). \n</p><p><b>ED:</b> Why did you send him a <a href=\"/cwcki/Metal_Gear\" title=\"Metal Gear\">Metal Gear Solid</a> disc?\n</p><p><b>JKH:</b> Mainly out of boredom. At the time, we were talking about how many games he plays a day, and how he might try a game, but never finish it past the first level. I thought that he might actually try MGS and talk about it if I sent it to him, since he has talked a little bit about stuff people have sent him in the past. I put tracking on it and put a game shop's address on it so it would not look like it was from me. It basically sat at the local post office in Ruckersville once it got there until it got sent back to the game shop in Kentucky. I even included a little letter and such...Ah well. \n</p><p><b>ED:</b> Encyclopedia Dramatica is turning five on December 10th, and to celebrate we've been holding a pollfest to determine the audience's favorite article in our five year history. CWC is a heavy favorite. If he wins would you like a shirt to express our gratitude?\n</p><p><b>JKH:</b> Fuck yeah! If I ever got anything like that, I would frame it. One of those life mementos. \n</p><p><b>ED:</b> What was your favorite thing to come of this?\n</p><p><b>JKH:</b> If I had to say, it would have to be the large amount of content people have created. The <a href=\"/cwcki/Audiobooks\" title=\"Audiobooks\">audiobooks</a>, the commentary tracks, the flash cartoons (with many of them looking very decent), and just all the <a class=\"mw-redirect\" href=\"/cwcki/Fan_Art\" title=\"Fan Art\">drawings</a> people have made. Like I said earlier, its baffling that he has this much mockery behind him, which is pretty fucking awesome that the internet can ban together to make fun of a autistic idiot that is a leech on society in general.\n</p>\n<!-- \nNewPP limit report\nCached time: 20230706022155\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.030 seconds\nReal time usage: 0.031 seconds\nPreprocessor visited node count: 7/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:20799-0!canonical and timestamp 20230706022155 and revision id 308005. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Jason_Kendrick_Howell_interview&amp;oldid=308005\">http://sonichu.com/w/index.php?title=Jason_Kendrick_Howell_interview&amp;oldid=308005</a>\"</div></div>",
  "categories": [
    "Trolling",
    "ED Saga"
  ],
  "links": [
    "copyright",
    "Mary Lee Walsh",
    "Jason Kendrick Howell",
    "GameStop",
    "website",
    "Kathleen",
    "guitar hero contest",
    "Vivian",
    "church",
    "4chan",
    "angry phone call",
    "Encyclopedia Dramatica",
    "MySpace",
    "Ruckersville",
    "cwcwiki",
    "comic",
    "drawings",
    "YouTube video",
    "rocky",
    "2007",
    "Sheneequa",
    "Clyde Cash",
    "trolls",
    "MGS3:SE",
    "Guitar Hero",
    "November 2009",
    "deviantART",
    "audiobooks",
    "Metal Gear Solid",
    "Liquid",
    "blog of a mall worker",
    "acting like it was a big win",
    "Casey",
    "medallion",
    "Parappa the Rappa contest"
  ],
  "scraped_at": "2025-11-26T21:33:16.743068"
}