{
  "url": "https://sonichu.com/cwcki/Katie_Bay_E-mails_2",
  "title": "Katie Bay E-mails 2",
  "display_title": "Katie Bay E-mails 2",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>This page lists emails exchanged by Chris and Katie Bay on 24-27 <a href=\"/cwcki/July_2009\" title=\"July 2009\">July 2009</a>.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#24_July\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">24 July</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#25_July\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">25 July</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#26_July\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">26 July</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#27_July\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">27 July</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"24_July\">24 July</span></h2>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>I just want to know what <a class=\"mw-redirect\" href=\"/cwcki/Samantha_Thaddeus\" title=\"Samantha Thaddeus\">Sam</a> has been doing.\n<p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>I'll forward to you some of her messages I've received, including her confession. I've saved the e-mails, and they are mostly old, so direct forwarding on some may be undoable, but I will copy/paste the body, as well as the details for each message.\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Subject: And that's all I have so far from Sam.\n<p>Before I move on to make another trial at that damn, dirty song, I'm going to see if I can get REAL NAMES of her associates at Sony and <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/WVIR-TV\" title=\"wikipedia:WVIR-TV\">NBC29</a>. I ask you to keep that on the down-low from Sam. I understand I can not control how you're feeling, or what you will do, but I am entrusting you with that.\n</p><p>I always have an open pair of ears and heart for your input, and I promise you that I will keep anything you don't want Sam or anyone else to hear Confidentially between you and me alone.\n</p><p>You and your little bro and family take care and stay safe.\nLove and Peace,\nChristian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Well, good luck on the song. I mean, don't worry much about that song. That song is really just making fun of gay people if you didn't see the video. I'm sure you'll get back all you lost after that.\n<p>Anyway, I have personally decided to stop seeing Sam for the time being.\n</p><p>Also, since you didn't watch <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/PitchMen\" title=\"wikipedia:PitchMen\">Pitchmen</a>, I hope you watch the <a class=\"mw-redirect\" href=\"/cwcki/Billy_Mays\" title=\"Billy Mays\">Billy Mays</a> Tribute that will re-air tonight at 10 PM EST on Discovery.\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Sounds good. And I will set my DVR for Billy. :) And I have not seen the tomboy video; thank you for encouraging me NOT to drag myself down by watching it.\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"25_July\">25 July</span></h2>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Anyway, what did you think of the Billy Mays Tribute?\n<p>-kate\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"26_July\">26 July</span></h2>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Subject: So what are you going to do now?\n<p>Well I saw that video and its nice and all...\n</p><p>I dunno. I mean, you're autistic right? What does that do?\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>I am High-Functioning Autistic, Yes.\n<p>But I am steadily growing more an more confidence in myself since I stood up to \"oxystarscleanfanatic\". (:J I am back in the Saddle on my Comic Drawing and Coloring; I have resumed work diligently. You will see the Original Sonichu Site, with NEW features and then some within the next few months (sooner likely). :)\n</p><p>As for Sam, I can still play \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/UmJammer_Lammy\" title=\"wikipedia:UmJammer Lammy\">Um Jammer Lammy</a>\" on my <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a>, and I can create NEW Foreign <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> accounts to replace them, and I can buy a Yen and Peso card to re-sync Lammy and <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Creatures_3\" title=\"wikipedia:Creatures 3\">Creatures3</a> with my <a class=\"mw-redirect\" href=\"/cwcki/PSP\" title=\"PSP\">PSP</a> whenever.\n</p><p>I am Out also to socialize more confidently IRL, so that is another Plus.\n</p><p>I also grant credit for my Confidence Promotion to Stan Bush; the <a href=\"/cwcki/Transformers\" title=\"Transformers\">Autobot</a> Rock Star. And to quote his inspirational Lyrics,\n</p><p>\"I hold the future in my hand. The power is there at my command. Dare to keep all of my dreams alive.\" And basically ALL those lyrics; \"The Touch\" is another good inspirational song, also from Stan.\n</p><p>But Mostly, I am getting back onto The Sonichu, Rosechu and <a class=\"mw-redirect\" href=\"/cwcki/Cwcville\" title=\"Cwcville\">Cwcville</a> Saddle; going to remind the ignorant individuals WHO I AM, and NOT a damn <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">impostor</a>, as they throw such labels in my wake towards me.\n</p><p>But enough about me. How have you been lately, Kate? Have you recovered emotionally from the recent events? I hope you are feeling better. You have a younger brother to help you anyway, and that is good. :) I often wish I DID have a younger Bro or Sis (<a class=\"mw-redirect\" href=\"/cwcki/Sister\" title=\"Sister\">Sis preferably</a>), and I am the youngest of my Half-Brothers/Sisters who are all in their early 40s in Other places from Virginia to N.Y.C. But I still get by well. :)\n</p><p>Please continue to take care and stay safe, y'all.\nLove and Peace,\nChristian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>I dunno, ever since I moved to Nevada I don't really got any other friends around here. It's gonna be weird, but at least I got my little bro.\n<p>We went to eat yogurt last night and it was good. Expensive as always, but nice.\n</p><p>I've been going around the trolling board more and I've been realizing that no one knows what autism does.\n</p><p>You should clarify what <a href=\"/cwcki/Autism\" title=\"Autism\">autism</a> actually does to you. Like what is the difference between low and high functioning autism and stuff. You have first-hand experience so you are a legit source.\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Mainly, Autisim is a Major Mental Block in the Socialization part of the brain. You can look up more info on www.wikipedia.com.\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Hm, is this <a class=\"mw-redirect\" href=\"/cwcki/Asperger%27s\" title=\"Asperger's\">Asperger's</a> or Autism that you have?\n<p>I'm reading it and they seem similar to me.\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>AUTISM. It and Aspergers have NOTHING IN COMMON.\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Oh oh! I got an idea!\n<p>How about you tell the trolls go get that \"brown impostor\" because you are the \"fake\" one. Know what I mean?\n</p><p>You can do something to make people believe YOU'RE the impostor so the trolls will leave you alone. It's brilliant!\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Thank you, Kate. BUT I want to make people believe me for real me again.\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Subject: Actually, there is something you can see if you can learn for me that I would be truly grateful of\n<p>Learn the name of the VERY FIRST TROLL Who did ANYTHING against me; some bad rant, if he/she started that ED page, whatever. I wanted all the time to Learn From the First Troll the Five W's and How, but especially Why Me above all people? What did I do to that person? When did it happen? Where did it happen? How dare he/she?\n</p><p>I am about to return to the ED page and look up the alias of the VERY FIRST PERSON who started that damn thing.\n</p><p>Thank you, Kate.\n</p><p>Stay safe,\nChristian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>The creator of the ED page is <a href=\"/cwcki/Jason_Kendrick_Howell\" title=\"Jason Kendrick Howell\">Jason Howell</a>.\n<p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Subject: apparently I forgot to send you that list of suspects, so here it is.\n<p>Upon personal mental recollection, the Earliest Trolls I know of\nare as follows:\n</p><p>-<a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snycer</a>; Current Owner/manager of <a href=\"/cwcki/The_GAMe_PLACe\" title=\"The GAMe PLACe\">the Game and Hobby Place</a>.\nHe's hated my guts after multiple times borrowing the store's HDTV for\nConsole Gameplay. And in subtle retalliation, I hand wrote, on a\ncardboard box, ¨Michael Love the ¨F¨ Out of Mary Lee Walsh!¨ I tried\nto protect myself when he found it WEEKS later after having wrote it; I\neven convinced myself that the ¨F¨ meant ¨Fiddlesticks¨; It originally\nmeant ¨Fuck¨. That was why the Son of a Bitch Jew kicked me out of The\nGame Place, Permanently, After YEARS of Loyal Volunteer Service in the\nPokemon TCG League. I had apologized numerously before, but he's still\nthe pigheaded, stubborn Jew he was then. I was kicked out about\nFriday, June 13, 2008; it Was a Friday.\n</p><p>- <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a> (A Possible Troll) You know the story; tried to win\nher over in about 2 years time before I was kicked out of The Game\nPlace. She was rarely all that into me either, fairly much like how\n<a class=\"mw-redirect\" href=\"/cwcki/Hambeast\" title=\"Hambeast\">Faeryn</a> was Not into me either, but at least FAE Told Me Quicklu,\ninstead of trying to be subtle over a LOOONG Time.\n</p><p>-<a href=\"/cwcki/Daniel_Mimms\" title=\"Daniel Mimms\">Daniel Mimms</a> I have No idea of what the fuck got into his head,\nbecause we were like buddies in the history of the <a class=\"mw-redirect\" href=\"/cwcki/Pokemon\" title=\"Pokemon\">Pokemon</a> and <a class=\"mw-redirect\" href=\"/cwcki/Yu-Gi-Oh\" title=\"Yu-Gi-Oh\">Yu-Gi-Oh</a>\n<a href=\"/cwcki/Card_games\" title=\"Card games\">TCGs</a>. He always got me quick with his Squirtle, No Wartortle, with\nPokemon Breeder Deck. Bu I Know,\nwith the help of my father's\nScooby-Doo Detective Work that Mimms Was the One who put that Damn\nEncyclopedia Dramatica Sign in my front yard, Halloween Night, <a href=\"/cwcki/2008\" title=\"2008\">2008</a>.\nThere's a video somewhere on YouTube of the bastard showing off his\ndeed with pictures of mine and my dad's cars' Behinds with the License\nPlate, And a pic of the accomplice Girlfriend (Upon zoomed-in\nPerspective, I know that gal was Megan from what I could tell of the\nblurred face, hairstyle and body type).\n</p><p>Mimm's Friend, <a href=\"/cwcki/Lucas\" title=\"Lucas\">Lucas</a>, was the Troll who too that snapshot of mr the\nlast Friday Night of October, <a href=\"/cwcki/2007\" title=\"2007\">2007</a>, that went onto that damn ED Page in\nits Early Days of being typed up. It was Also the same Friday Night I\nbecame SHOCKED witnessing Megan making out with this turned-homosexual\ndude, Christopher (don't remember his last name... Could This Chris be\nthe Chris Crocker Sam was talking about trolling later?), then started\na game shortly after, still in shock, and during the whole game, I\nnervously talked like a robot. But I Saw the Camera Flash, and the\nPhotographer was TALL and wearing a trenchcoat; Lucas with a Capitol ¨T\nR O L L¨.\n</p><p>I have never suspected:\n-Squall Magione; he was a cool guy.\n-Any of the other individual employees who worked under Michael's\nManagement.\n</p><p>And I Know these are NOT Trolls:\n-Tony Wayne - He was a Family Man, with a job as a Physics Teacher at\nAlbemarle High; Squall was One of his Passing Students.\n-Federico Venegas -\nHe was a scrappy little <a class=\"mw-redirect\" href=\"/cwcki/Spanish\" title=\"Spanish\">spanish</a> child, who lived\nwith his Grandma. He was a Prankster, but he cared about me as a\nfriend. Last time I saw him in person, He GREW Taller than me at about\n13 (which that is his current age, as far as I can tell).\n</p><p>Impulsively, I would like to Pay Michael A Surprise Visit, But I don't\nwant to go back in there <a href=\"/cwcki/6_June_2010\" title=\"6 June 2010\">unarmed</a> with only memories. I Need my\nfriends. :)\nPlease see what you can learn about the confirmed Trolls I have just\nListed, And Find out what you can up to firing that guy Sam knows at\nSony, as well as her ¨brother¨ and the ¨hungry reporter¨ at NBC29.\n</p><p>Thank You. Stay Safe,\nLove and Peace,\nChristian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Subject: So I remember him\n<p>YET when I asked him those questions myself, he personally replied a lame \"Just for the Fun of it\". Okay, maybe NOT that ED page, because I know there was someone else BEFORE him who had to tell him about me, as well as mock me. I think I've forwarded you my list of Real Life Suspects of TROLLS (some confirmed) recently.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Are you sure Jason is not lying to you?\n<p>-kate\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"27_July\">27 July</span></h2>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>As for Jason Kendrick Howell, please see what Truths you can learn from or about him for me. Thank you. :)\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Subject: How was your day?\n<p>So, I'm deciding between headsets to buy. I've really needed a new one and I'm totally stuck on which one to buy lol\n</p><p>What brand is yours? Also, ink is expensive and stupid lol\n</p><p>-kate\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>The only Headset I have is the PSP Headset, compatible with the Skype portion on PSP 2000+ modles; I've been having a spot of trouble with my Skype recently, and I have not yet addressed it, but I will soon. I want to make sure we're on a same page on your headset question, even though I feel I am on a totally different page.\n<p>My day was okay; I colored in MORE pages at a More Comfortable, familar <i>[sic]</i> location where I drew and colored my comic pages, at my local mall. But please do not spread it around that I am likely to be hanging there again for Inspiration's Sake; if ANY trolls hear, they can just APPEAR IRL, and try to break me again. I do not need that stress again. But if ANYONE comes to me and WANTS to make trouble, I would NOT throw the first punch, but I would heavily counter. Again, PLEASE do not tell anyone online about me at the mall again.\n</p><p>Anyway, it was Peaceful, and I got a LOT of work done. :)\n</p><p>Also, if I recall, I sent you the message I have Billy Mays say on the page for him in <a href=\"/cwcki/Sonichu_9\" title=\"Sonichu 9\">The 9th Book</a>; what is your opinion on that, or can you recommend any advice to make it better? It has to be less than like 2, 300 words, to fit on the page. Also, I still need to know Billy's Eye Color.\n</p><p>I gtg; I have to ask <a class=\"mw-redirect\" href=\"/cwcki/Vivian\" title=\"Vivian\">Vivian</a> a question or two.\n</p><p>I'll TTYL,\nLove and Peace,\nChristian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>Well, I'm just looking for a headset that's decent and won't break. I've broken quite a few\n<p>Are people interested when you draw your art in the mall? Have you ever thought of selling art on commission? Why the mall? I mean, I'd be kinda embarrassed if i drew at the mall i suck lol\n</p><p>Man, you can find the mall peaceful? I always find it noisy and people are always being rude and shouting things. :(\n</p><p>Hopefully you got a lot of stuff done today!\n</p><p>-kate\n</p><p>ps: I'm not sure, but upon close examination, I believe his eyes are black.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>The mall is not as noisy on the less busy days; I have my PSP, Headset and a Memory Stick Duo FULL of Good Tracks; cups of water or lemonade are good for a Long Hours Stay (greater than 3 or 5 hours). :)\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a class=\"mw-selflink selflink\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240713120538\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.106 seconds\nReal time usage: 0.112 seconds\nPreprocessor visited node count: 895/1000000\nPost‐expand include size: 46916/2097152 bytes\nTemplate argument size: 24708/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   37.146      1 -total\n 77.73%   28.874      1 Template:Emails\n 67.78%   25.177      1 Template:Navbox\n  9.71%    3.605      1 Template:Tnavbar\n  9.51%    3.533     11 Template:Email\n  7.69%    2.858     13 Template:EmailReply\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:14034-0!canonical and timestamp 20240713120538 and revision id 197738. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Katie_Bay_E-mails_2&amp;oldid=197738\">http://sonichu.com/w/index.php?title=Katie_Bay_E-mails_2&amp;oldid=197738</a>\"</div></div>",
  "categories": [
    "Category",
    "E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "2007",
    "57",
    "MHS classmate E-mails",
    "Daniel Mimms",
    "Sydney Contacts",
    "White knight E-mails",
    "43",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "44",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "40",
    "Faeryn",
    "56",
    "39",
    "Mailbag",
    "21",
    "Autobot",
    "unarmed",
    "9",
    "Sis preferably",
    "Pokemon",
    "Vivian Gee",
    "Common Questions",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "25",
    "15",
    "59",
    "49",
    "PSP",
    "2010",
    "53",
    "Jackie Romy",
    "Regina e-mails",
    "52",
    "Blanca Weiss",
    "42",
    "2011-2012",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "17",
    "TCGs",
    "35",
    "47",
    "Jason Howell",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "31",
    "18",
    "Aug",
    "July 2009",
    "Gregg Mays",
    "Clyde Cash",
    "4",
    "Yu-Gi-Oh",
    "36",
    "Catherine E-mails",
    "PS3",
    "48",
    "19",
    "2004‒06",
    "Michael Snycer",
    "Letter",
    "50",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "8",
    "The 9th Book",
    "10",
    "2",
    "spanish",
    "2008",
    "2013-2014‎",
    "Clyde E-mails",
    "Uri Geller E-mails",
    "Tito",
    "3",
    "46",
    "autism",
    "7",
    "Misc E-mails",
    "2007‒08",
    "37",
    "11",
    "23",
    "26",
    "Thetan",
    "Billy Mays",
    "2009",
    "13",
    "61",
    "Cwcville",
    "45",
    "29",
    "32",
    "24",
    "Open Relationship E-mails",
    "Vivian",
    "Jack Thaddeus",
    "30",
    "58",
    "Samantha Thaddeus",
    "The Wallflower",
    "1",
    "28",
    "34",
    "PSN",
    "Miyamoto Saga",
    "the Game and Hobby Place",
    "38",
    "41",
    "20",
    "Jan‒July 2007",
    "Evan E-mails",
    "impostor",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "Asperger's",
    "Lucas",
    "16",
    "6",
    "Sept",
    "Sam"
  ],
  "scraped_at": "2025-11-26T15:48:17.336528"
}