{
  "url": "https://sonichu.com/cwcki/Light_Powered_Cwclight_Reviews_-_Punicrackder_V_plus_Music_Video",
  "title": "Light Powered Cwclight Reviews - Punicrackder V plus Music Video",
  "display_title": "Light Powered Cwclight Reviews - Punicrackder V plus Music Video",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Light Powered Cwclight Reviews - Punicrackder V plus Music Video</b> is a video uploaded to Chris's <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> channel on 12 <a href=\"/cwcki/September_2025\" title=\"September 2025\">September 2025</a>. This video is a part of Chris's <a href=\"/cwcki/Light_Powered_Cwclight_Reviews\" title=\"Light Powered Cwclight Reviews\">Light Powered Cwclight Reviews</a> series. It is notable that the V in Punicrackder V's name is the French pronunciation of the letter. \n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Video\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Video</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Description\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Description</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Raw_captions\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Raw captions</span></a></li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Transcript\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Transcript</span></a></li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#Outtakes\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">Outtakes</span></a></li>\n</ul>\n</li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Light Powered Cwclight Reviews - Punicrackder V plus Music Video</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/xvOl1w52vxM\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Search for video</b>\n</td>\n<td><a class=\"external text\" href=\"https://www.youtube.com/results?search_query=Light+Powered+Cwclight+Reviews+-+Punicrackder+V+plus+Music+Video\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/vidsearch?q=Light+Powered+Cwclight+Reviews+-+Punicrackder+V+plus+Music+Video\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>12 <a href=\"/cwcki/September_2025\" title=\"September 2025\">September 2025</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Marketing</span><a href=\"/cwcki/Chris_and_money#Money-Making_Schemes\" title=\"Marketing\"><img alt=\"Marketing\" decoding=\"async\" height=\"20\" src=\"/w/images/9/98/Marketing.png\" width=\"20\"/></a> <a href=\"/cwcki/Chris_and_money#Money-Making_Schemes\" title=\"Chris and money\">Marketing</a><span style=\"display:none\">Trolls</span><a href=\"/cwcki/Trolls\" title=\"Trolls\"><img alt=\"Trolls\" decoding=\"async\" height=\"20\" src=\"/w/images/b/b7/Trolls.png\" width=\"20\"/></a> <a href=\"/cwcki/Trolls\" title=\"Trolls\">Trolls</a><span style=\"display:none\">Music</span><a href=\"/cwcki/Chris_and_music\" title=\"Music\"><img alt=\"Music\" decoding=\"async\" height=\"32\" src=\"/w/images/2/2c/Music.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">Music</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Praetor</span><a href=\"/cwcki/Praetor\" title=\"Praetor\"><img alt=\"Praetor\" decoding=\"async\" height=\"32\" src=\"/w/images/8/8b/PraetorIcon.png\" width=\"32\"/></a> <a href=\"/cwcki/Praetor\" title=\"Praetor\">Praetor</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td>Not visible\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Combiner_Mode_Chris-Chan_Prime\" title=\"Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime\">Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Go_Transformers_-_Theme_of_Transformers_of_Cwcville_-_Music_Video\" title=\"Go Transformers - Theme of Transformers of Cwcville - Music Video\">Go Transformers - Theme of Transformers of Cwcville - Music Video</a>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Description\">Description</span></h3>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Review of the Punicrackder-V combiner figure of Transformers Legacy United Merged.\n<p>Playlist for Transformers Legacy United Merged figures:<br/>\n[<i>Link to playlist</i>]\n</p><p>Playlist for Punicrackder-V:<br/>\n[<i>Link to playlist</i>] \n</p><p>Past Ideas Reemerging movie playlist:<br/>\n[<i>Link to playlist</i>]\n</p><p>Follow me on BlueSky:<br/>\n[<i>Link to <a href=\"/cwcki/Bluesky\" title=\"Bluesky\">Bluesky</a> profile</i>]\n</p><p>You can buy Transformers toys and accessories at BigBadToyStore<br/>\n[<i>Link to BigBadToyStore</i>]\n</p><p>Official Cwclight Website, Blog and Store<br/>\n[<i>Link to <a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a></i>]\n</p><p>Official Christ Chan Sonichu Prime Etsy Store<br/>\n[<i>Link to <a href=\"/cwcki/OfficialCWCmart\" title=\"OfficialCWCmart\">OfficialCWCmart</a></i>]\n</p><p>The music video I personally animated with stop motion, originally for the ending of the Punicrackder-V Review video.\n</p><p>Go, Transformers! - Transformers of Cwcville (working title) Theme Song\nLyrics inspired by Hasbro and Tonka; written by Jesus Christine Weston Chandler Sonichu Prime.\nMusic by suno.com (AI Generated Music)\n</p><p>To Be Continued song generated by suno.com (AI Generated Music).\n</p>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Raw_captions\">Raw captions</span></h3>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Text from YouTube's captions\n</th></tr>\n<tr>\n<td>Hey, what's up everybody on YouTube? Jesus Christ Chance Sachi Prime here and\n<p>today we are coming to a lovely lovely little segment. We are quick review. We\nhave gone the long road running going to the combiner limbs. I had to delay a couple of videos with the uh at Selena\nand Christian Prime combiner modes, but it's going to be worth it. You're going to love what's going to be after this\nreview. But for right now, we got Practor V and all of its components between SAP the first, Crash the first,\nthe Decepticons, Cracktor, Punlap, and SAP. And by the way, so pronunciation.\nSo I did mention in the So there was a fumble in one part in the skit. In the previous episode, I said puncracker de,\nbut I like pronouncing it puncracker ve. So, it's just a slight mistake in the\npronunciation, but hey, put the cracker vecer v.\nYou're good either way. But still, the fun the pun is within all that. And you know, it's just all good. So, without\nfurther ado, let's combine this mostly Decepticone combination.\nOkay, so I moved the camera down to ground. Well, camera ground level for\nstarters because we don't obviously want to start with the feet and work our way up. So, four feet and legs. You know the\ndrill. Feet legs go on to feet\nfor starters. Oh, I forgot to pull up the peg on this one. My bad. And then we and then\nfour arms and body that in there and put this back in\nplace. That was a That was not meant to happen. All right. Now, let's move on\nup, which I should have done in the Medatron video. I gave you that. Everybody makes their mistakes, even\ngods and goddesses. And yes. Anyway, make sure everything is good. That's\nprobably going to get deleted. All right. But anyway, you know what? Let's put the decept the\nremaining Decepticone on here first. So, there's the arm.\nOh, where's my brain? But here you go. Other\narm. There we go. And cring the first forms\nthe head. And there you go. There you have Puncracker V or Punractor B\ndepending on how you want to pronounce that B at the end in all its tallness\nand glory. So, yep, it's a mighty figure made of at least two mighty burst robots\nand then just a bunch of then just a bunch of clones. What you what can you do? Especially when the third of the\ntrio did not want his neck to be compromised with a cold combiner limb.\nAh, good times. Anyway, so let's get in closer and look at all those lovely details. But not not at the belly or the\ncrush, but the head. There's the noggin. I'm going to move the camera closer.\nLet's see. Right there. Yeah. So, the head. Yep. Definitely. So reminiscent of\nwhat could be of like one of the uh jerk cop deceptic coats right there. Got the\nlots of blacks and silvers and um well I don't know if you can see it or not\nespecially I'm not going to force the camera to focus but anyway. So yeah, the eyes are\nred, but it's like you'd have to look close to see them. But yep, got all the\nlovely boy details throughout and that big gun that SA the first loves loves\nloves to gloat about. So anyway, so let's go down the body and you see all\nthat in its love and glory. Made of a pair of jeeps, a car, a big small jet\nwas supposed to be a big joke. You may as well call it a big joke, cracker. I\ndon't care. And you're not wearing clean underwear. She stupid pun. I know. But you know\nwhat? It was on my mind. I went for it. And you trolls can have your fun with that bean if you want. I don't care. I\ndon't care. I don't care. Oh, look a free hat. I don't care. Yeah. Anyway.\nAll right. So that silliness doesn't aside what we got for articulation. Yes,\nI'm going to tell you. So the head is not on the ball joint. So you don't get\nthe up or down movement, but the head it can rotate and do a full 360. And of\ncourse arms on that lovely little ratcheted joint.\nThey can do a full 360 as well. and they can move in and out in the case that\nnose cone. Tapping on the head, you have bicep\nrotation and as I mentioned earlier with Medatron and the in the vehicle and when\nI mentioned the arm mode, you got the two forms where you got the elbow articulation. So, of course, preferably\nyou could do this to get the full range of movement or of course\nturn these around and get that about 90° bit of articulation right\nthere. But, as you know, I love me the full range of movement. It's a good option. Options, they are good. All\nright, so let's do this. So, of course, there's no waist rotation, but legs legs\ncan move forward that far. You can do them high kicks with a Deceptic Cloud or even if they say the first was a to the\nside to get a foot and they can go back if you got the wings back here, which by the way, you can have in and out\ndepending on your preference, but yet all the way out like that. Yep. Gets in\nthe way of the feet. So yeah, they can move back that far and outwards.\nFull splits and then full splits and then a little bit more.\nYou got thigh rotation, 90° of bend at that knee. And with the\nfeet, there's no up or down leg move, but you do have rotation. and you have your echo tiltage.\nAll right, so let's run through all of the various uh well weapons and\naccessories you got in each of the individual components. One of which being right there front and center that\nbig gun. Yes. All right. So, hm, we got lots of op. We got still have a number\nof options despite that being there and blocking one gunport, but you can do what you want. If you want uh like maybe\nhave like couple of smaller guns up there, be like a little gun tower. That's an option. And let's uh take a\nlook around as well for other options of connectivity,\nwhich um well, frankly, look at the back. H nothing. You do have to port.\nYou do have the ports in the cracker the first hands right there, but I think that's not going to be really worth it,\nespecially considering um Oh, that's another point of articulation as well if you want to take advantage of that bend\nat the uh thigh. So, yeah, there you go. Full range of leg movement if you want\nto take advantage of that. But yeah, anyway, so just bear that in mind. Oh, you got that. But of course, you do have\nthese ports on the side. So, that's an option. Uh, so I'll go I'll run through this as well since I just remembered. So\nwe can take crafter's guns. We could store them on the thighs. That's an option, but then of course that limits\nthe arm movement. So still your choice. You can work around that.\nSo that's just that's one option. But of course uh\nnow at least between the uh the two firsts on here, they are the voya. So\ntechnically all warrior despite three despite three fifths of it being\njust your drones and clones. But yeah, let's talk about storage before we show\noff like details. But yeah, you got the ports right here on this SIB. So you put that\ngun in the slot right there, which I feel like that's best. And of course, you got the P slabs gun. Go put that on\nthe side on the thigh right there. And of course the the crafter's gun. You got\nports on either wing front and back. So you could store it up there if you want to store the back. Of course, as I\nmentioned earlier, you could store cracks of the first guns on the thighs.\nJust to show you how that looks as well. So you have the opt option. There's options options that are good. But of\ncourse, we can just give them a whole mess of weapon wielding in all this. So,\nwe could take the two guns. We can put one in each hand. So, that's an option.\nWe're definitely going to be mentioning the choice words at the moment there when you got the guns in the hands. But,\nof course, if you want to, you do have the ports on the unders sides of the hands. So you can potentially take the\nsmaller guns at least. Let me just do this. I feel like cuz I like it's sports side just being where I\ndon't just don't it goes. Yeah. Anyway, you can put that down here and you can\nput this down here. And uh yeah uh this up here just um if\nyou can get that up here down. Oh, actually you know what? Um duh idea. Um, let's see if this will work. Anyway,\nwell, if you don't mind for the fingers in, that's an option. So, yeah, got lots of peep baggy pegging and big gun peep\nbanging and all that good stuff right there. Yes.\nOkay. So, as you may see, I got I put the bigger figure stand in the back so\nwe can have some support. Obviously, the the bushes is got to make him front heavy. So, I'm just going to give the uh\nback ths a bit of a single click right there. It'll look like it just looking up for a moment.\nYep. Maybe I'll just uh do one click forward. So, let's get down to some lovely bunches of blushes.\nYes, we're going to put a bunch of blushes on this gun. Oh, and uh I didn't\nrealize this until uh well when I was actually recording the little video. You're gonna see after this review is\ndone, but um take a look at this uh take a look at SAB's big gun right here. There's another reason why it's special.\nSo, we can pop a bush in there and\nOkay. See, it has to be the thinner bush. So, I got to go in there and push push. Yeah.\nWell, you can see right there. It did earlier, but it was wedged in there. I was able to get that uh lovely little\nmoment, but yeah, essentially. Yep. You get some oranges going out there. All\nright, let's try this just to be sure. Yeah, there you go. All right, this way. There you go. You can see those little\norange lights being like it's all fired up. So, I'll leave it like that. There you go. So, that's one detail. Just one.\nYeah. pull up the camera and I'll lower it back down once again.\nSpoiler for the comparison, I suppose. The camera rotate that way. You know what? I'm going to do this so you can\nactually see the face. Okay. All right. So, let's do this. Let's do this. Oh, by\nthe way, right here, this hand, that's compatible. So, we can put couple of bushes right there. Yeah. Maybe these\nsmaller bushes. Make that work. It's a tight fit, but you can get them\nin there. And of course, this gun and this gun not\nbush compatible. And I might even on these small pegs. Nope. Too small. Don't work. But the rest of the guns, they're\nblue compatible. So, we can still get that going. All right. So, let's do\nbigger blushes on the on track to the first pair of guns\ncuz I have a feeling they're going to stick on there pretty dang good. All right, so we got that and thinking of\ncourse with elbow flexibility\ntaking that into consideration. Why is this one being a bit more weaker than well at first has a bit more security.\nAll right. But anyway, I am going to rotate him this way. So, we this on the course uh one more little blush for the\nDecepticone Pocrctor gun. So, yep, we're going to do this. We're going to make\nthis happen. I'm going to hold this arm up for support. But yep, we gonna do a big old bunch of punter cracker and VN\nSAV and the first big gun.\nThat was really powerful. Yes.\nAnd now for comparison. And just to note, I am not going to do the uh big\ncomparisons like I did with Medatron. I feel like that just uh speaks volumes enough in comparison with this one which\nuh when we get to the Medatron comparison. You will see. But anyway, so we we're still start considerably small\nand sticking with the main line and of course the one featured figure from the first wave and the one feature from the\nsecond wave. So for starters, here it is with Sonu. Yep. Definitely small. It's\nlike top of the head stands up to just above the knee or around the knee. Anyway,\nlet's uh get this out the way as well. So, combiner mode at Selena. So, you got\nthat going on. And here he is with\nthe optimist. His name is Optimus.\nI'm going to move him in the center just for a moment. So, we may as well do this all three in one. So here is puncrafter\nbay with CC2\ncombiner mode Christian prime. I'll probably lower the camera in a\nmoment so you can get the full view. And of course with\nChristian prime normal foot mode. I'll lower the camera so you can see. Uh you\ncan seen this pretty much just over the camera a bit.\nThere you go. It's standing in comparison with punc as such. And of course now to finish off\nthe smaller comparisons. Here it is with punish the first in front of the punish\nand clone. That's the leg and meat. I will load the camera once more\njust to give you that perspective. Yeah. Enough bomb. One more time.\nYeah. You do that freaking jerk up. Freaking\nfreaking Makoto. Gwen Gwy. Whatever.\nFreaking. Yay. All right. put you back over here for\nthe remaining comparisons itself.\nSo, of course, we'll save that main one for last. But first, we'll start off with good old Combiner Wars Super.\nLet's look. We got jets going on. So, of course, Superion is going to be in on this\nwith\nManosaur. Yes,\nwith Bruticus\ncompletely blastoff.\nAnd last but not leastly, here is Pana Crafter V compared with\nMedatron. So yeah, there you go. side by side in\nthis comparison finally. And also I've realized planet crackctor\nV initials H P C V plastic.\nYes. So there you go. Now of course you could scramble this\nguy as well. And if it's not clear and obvious, if you don't see the little lovely promoted symbol right there, the\nPBC symbol right there, or even the promoted symbol right there, well,\nyour first is a leg at that point and you got a little rocket jump on the\nright side at that point or it could be on the left side depending on what you want to do.\nAll right. So essentially this is what practor bay will look like if you had four decepticone jerk cops. But guess\nwhat? I don't have four decepticone jerk cops. So I borrowed same old car arm car\nleg from a sword to give you this example. Okay. So at this point this is pretty\nmuch what it look would look like if you had four deceptic clone crackctors. by borrowing a couple of aerialobots to\njust temporarily take their place. And of course, for a lovely\non the cheap opted, you have this kind of crafter bay\nconfiguration with all jeeps. Only needing to borrow Mr. Swindle\nfor one of the limbs. But anyway, there's all your possibilities. Give you\nall those options. Do what you will. Do what you like. It's all good when you have this set of figures. And there's a\ngift set available where there is a punfter for there is a PC crafter V spot set\navailable like a gift collector set as opposed to deister. Now it will it\nincludes the craft of averse and uh two uh Decepticone SAVs, two Decepticone\ncrafters, two Decepticone Punch Labs. So having fun with that. It's less It's one\nless expensive option, I suppose. But yeah, there you go.\nAll right. So, here you go. This is Pana Crafter V or Panractor Fay, which I\nprefer calling it. Anyway, so yep, it's uh the combination is quite the grand\nfigure. It definitely stands so intimidating and daunting that\nessentially just kind of like got no eyes and makes move what a jerk cop even\nDecepticone or even the first could do with just a zombie zombie individual\npretending to be police or even a holographic projection or just what or a\nrobot or yada yada yada whatever. Ah, and then of course you know the crackers\nnot all being cracked up to be just flying going around and you know being piloted by said zombian by said\nzombified type of people just mentally controlled individuals back in the day as PBC citizens and all that. I'm\nprobably going to just move this in the center so the camera so the picture can\nactually do better. So just make this a note to the editor. Just copy and paste\nthis steel image for the B the major the\nmajority of this one to replace it because it was off center and not in\nfront of the shirt here. So just all right\nI was talking about the crackers. Okay. Three, two, one. And then of course the\nSAVs being essentially like a bunch of vans that would take the poorest of people back in the day to so they could\nbe commit and turned into the students of PVC citizens. So that's kind of like\na long and short story of it. And yes, when you're even with a fake police car, yes, you can arrest the citizens as\nwell. But moreover, they just were like uh just taking out their baton bean sticks and just really abusing them and\nYeah. Anyway, just Okay. Well, I'm\njust going to get this out of the way and then I'm going to get my feelings out of the way. So, first and foremost,\nso there you go. I had picked up the Decepticones Putt Slav and SAV from\nTarget. I have picked up the Decepticone Cracktor and the first SAV from Walmart\nand from Big Bad Toy Store. And I picked up the the craft of the first figure\nfrom Target as well. Of course, you can find these all over the place. They are popping up in your Walmarts, your\nTargets, the Amazon.com, the Big Bad Toy Store, Entertainment Earth, and all the above. Just look around. You'll find\nthem. And you know, you can have fun as you'd like. just, you know, so much fun\nyou guys had. All right, so anyway, the links to uh at least Big Bad Tour store\nwill be in the description down below and of course my socials including of course my blue sky and my quick light\nsafe and good and everything in the list in the description down below as well.\nSo there you go. This is pund crafter bay. A combinations of what? Pun slabs,\ncrackctors, and savs. Panda cracker bait.\nSo, so anyway, here's the usual ending. It's\nall good. I feel like I'm well doing this, but anyway.\nAnyways, that's puncture bay and this is Jesus Christ s your prime saying remember you don't stop playing because\nyou grow old. You grow old because you stop playing and don't let any of those\nhaters, fakers, abusers or toxic individuals tell you otherwise or quail\nyour creativity. So yes, I feel more affirmed every time I say it because I\nam a geek as well. So yes, big gig, be you. Be proud, the haters, the\nfakers, the abusers, and just every single toxic,\ndarkest, cynic individual. Be you. Be proud.\nTrans\nmeets the eye of Dragon Bots in disguise. Autobots and guardians\naffecting the earth and every one of the chaos and evil wrath fighting the evil\nforces of the disapp. Day of Quickville is defended by the\nforces of good with the help of Christian and the son in\nthey call the power magic with their might and when they like stands\ngo transformers more than meets the eye. Go transformers. Go transformers.\nVehicles and beasts. They know how to fight for millennia in movies.\nCybertronic rhym\ngrimlock don't like hairs.\ntransgress\nmore than meets the eye.\nDragon\nrobots in disguise. Autobots and guardians defending the earth and everyone against the chaos and evil\nwrath fighting the evil forces of the district becomes a gay keeping them up\nby the forces of good and the sun\nand defend their Go transformers.\nMore than meets the eye. Go transformers. Transformers. Mighty mighty vehicles and\nbeasts. They know our fight from millennia. Rivalries lost love. Survival on energy.\nCybertronic drivers. Go for transformers. More than meets the\neye. Go transformers. Robert in disguise.\nGo transformers. Transformers.\nMore than that meets the eye. Go transformer.\nIt's quite tough up there as it is down here. Yes, I'll say. But finally, we made the\nright time. Okay, everybody. I have noticed that Puncractor Vay has been combined. So, let's get down to it. It's\ntime to combine and form Metatron once again\nin disguise. Autobots and guardians defending the earth and every one of the\nchaos and evils and renegades keeping them up. The city\nof quickfield is defended by the forces of the help\nin electrical power.\nGo transformers. Go transformers. More than meets the eye. Go transformers. Go\ntrans vehicles and beasts. They know how to fight for millennia in the least.\nRivalries, lost love. Survival of cyber crime.\nTransformers,\nget up. Get up, guys. Get up.\nYou guys go on ahead. I'll go down there and fight with me, Makoto. I'll see you\nall a little while after they mind explode. Go Transformers.\nTransformers. More than meets the eye. Go Transformers. Go Transformers. Mighty\nrobots. Mighty vehicles and beasts. They know how to fight for millennia in the east. Brotherly rivalries, lost loves,\nsurvival on energy. Cyber drivers from the gold\nmy Oh, time to go. I should get here as far as\nthe boat. There's no safe here at this point.\nAll decept to my location. Follow me through this\nportal. Nice work at the power plant, Su. You\nmanaged to give Megatron a really good beating he will not forget. Yeah, and those seekers were very tough nuts to\ncrack. I mean, not easily be able to take them down from the ground, but at least they were something. And then just\nthe multitude of Decepticons and generic Decepticons in general without just identities. Numerous\nnumerous numerous. Yeah. And that's definitely no joke right there. Su right\nyou. But at least we're able to get that once and for all. Even though they got to make some more and they'll be back\nlike flies on a warm summer day. Well, that's a nerd joke, but I'll go with\nthat. Yeah. Although I might take a bit of offense to that because I fly. Well, at least you're not an Incepticon wave. I\nmean, even Wasp there would probably cringe at a joke like that. Okay, so I have yet to bid for the update as well,\nSonu. I feel like the audience by want to hear this as well, if they're not going to get anything in the next video.\nAnyway, so tell me what happened at the power plant. Certainly, Chris, I'll tell you for the street. So, so Jazz and\nCliff Jumper went out ahead along with throw out and armors. They were actually there to just scout to see how many\nthere were, but they managed to get caught and the Decepticons had disabled.\nBut fortunately, they did not kill them. So, that was very good. By the time I and my team managed to get got there\nalong with Optimus Prime and his group of Autobots and the Guardians, we managed to actually get a real proper\nbeatdown. And fortunately, Computron was able to give us a hand at the end there,\ngiving us a bit of a hack into their data. We actually know why Gwen Makoto\nwanted those parts for the power plant in the first place. Oh wow, Sonu, we actually managed to get details of what\nGwy Makoto wanted to do with those parts of pieces. I'm definitely curious now as if my intuition didn't already tell me,\nbut please do tell. I do enjoy a good confirmation.\nOkay, tell this to you and uh everybody here at the Alba Bates. Fortunately, I can tell that everybody made it from\nthat island safe and sound. I'm very thankful for leader one and his command center and other guardians. At least I\nmanaged to get back on everybody on my team as well. So anyway, essentially Remy wants to get access to Robert\nFranklin Chandler's Junior schematics on a plastic molding machine.\nApparently that's a thing from the past that she wants. And considering it's a thing for the past\nis important for her details and an ability to open a portal that could actually really disrupt things. Oh\nthat is a confirmation. Christine's father and Christian's father as well between both halves of the earth. And\nit's like no wonder she does she wants those things, those plants. I can only imagine what she might be thinking. But\nI'm thinking essentially from my intuition, she not only wants to\nshatter the dimensions and the universe in this timeline, but she wants to put a massive dent in us Chris Chans and\nChrist Chance and trying to make an attempt on me, Christ Chan, and of\ncourse Christine Chan in this very timeline. Yes, that's pretty much what I gather for the intel of the Decepticones\nand some of the Decepticons that worked under her at that time. But yeah,\nessentially between that and some of the parts that were only manufactured at General Electric plants worldwide\nand of course imported materials from Cybertrons, those our metals and everything. She's planning on doing a\nmock space bridge that not only bridges between the dimensions and universe but\nalso timelines and of course going past and future in this very timeline.\nYes, I suppose suffice to say it is a time machine, but I feel like it's a bit\nmore complex than that. But yeah, of course, between that and using Air John as an energy source, specifically that\nthat came from this Earth as opposed to that from Cybertron. But yeah, that's Gy Makoto's plan\nwhatsoever. So, we got to definitely prevent her from doing that. And of\ncourse, as you intuit, if we do, Chris, we definitely needed to get that air John out of those caves. And oh wow, we\nhad to score a peak with that air John. With that Air John, we'll be able to do a thing in preparing the rifts in the\nsky that's around here presently. I knew it was bad enough that my gu that the guardians and I actually became\nseparated from our original dimension of the universe, but it's so nice that we're actually welcome here, that we\nwere not segregated at all. It's very welcoming. It would actually be very nice. Has no actually made the official\nfigures of us. Fortunately, we got a few coming in. I would love to see Leer One\nhave his figure in a new form. Yes, this is quite true Small Foot. But fortunately, but there's a figure of\nLeer One, Turbo, and Scooter. There's likely going to be following the figures for Psycho and Turbo. And that's going\nto be quite the ordeal when it comes to that. As if Megatron alone was not bad enough. Psycho was a menace in his own\nright. Darn right, Octopus. At least I was able\nto gather from within the Matrix during my time. I had it the wisdom that still pertained even in my form as hot rod.\nOnce again, having more villains in this timeline in their own figured way was\nlikely to manifest more evils in this world. As if there's not enough evils to\ngo around this timeline. It was bad enough back in 1982, but then it came\naround as we kept on progressing and progressing and everything kept on going and going and Hasbro had to pull all\ntheir details and accepting the multiverse for themselves and everything. It's still a lot to process\neven in my transistors. But still, at least it's something. And\nin the process as well, at least we get more heroes that will actually help us take down these villains. But then\nagain, I suppose that's going to be the thing with the dementia merge as Christ Chan had talked about over and over again. Even I'm still wrapping my\ncircuits around those details. Quite right, Bumblebee. But at least we are able to get things cleared up and\nactually get things going good once again. And the Autobots and I on the case here in one source city of this\nearth. That is to say a quick bill. Why to say a quick bill? Well, of course,\nChristine Prime for one, but on another, everybody wants a piece of a quick veil.\nNot just the bad guys, but even some good guys that actually turned bad\nthrough their misconduct and mistaken attempts and efforts, but at least we're able to get those numbers down. And\nChristian is able to manifest the good and better of these people. I mean if\nyou look at the recent events from today's date of June 5th 2025 between\nboth halves the evils are really exposing themselves and those that\nactually were good and became evil or sided with evil they're realizing they\nbacked the raw pony essentially using the uh earth sprays you know aren't you\nand all my years of experience and temporary matrix holding working with everybody of the 13 primes as\nI never met somebody as good and experienced as you. It's no wonder that even though I came from another\ntimeline, you were worthy of temporary at least wielding the matrix. You make a\ngood prime in your own right. But so, hey, you did good. You impress me and\nOptimus. So, good on you, Sonu. Good on you. Thank you. And thank you,\nBumblebee. I will always take good pleasure in my ability to continue to do\ngood for everyone and of course make sure everything continues to be made right and good and I get to actually be\na good leader and all the years centuries millennia of experience I got\nfrom the training grounds and from the day when I was formed in Christian\nprimes laboratory run was there that day I do remember that\nThat was a good thing I had to learn from that. And wow, when I meditated from that, I actually learned that I was\na sichuie from Earth. So, it just made sense. I end up coming here being stationed in see a quick fail. And that\njust feels good with me. But still, we got to take things into\nconsideration moving forward. So, everybody,\nlet's keep up the good work. We got a lot more to do as not only the bet merge completes but in welcoming everybody of\nthe 1218 half onto the whole undivided earth being alongside us in general even\nChrist prime knows that's going to be quite an ordeal and that is regardless\nof that I wonder what the Decepticons are up to right now they be upgrading me or even Megatron\nand the Renegades she that battle But Stalia was a tough one.\nHe got down quickly enough and I had to take him down again. He tried to take me down, but I never let him get me down.\nBut still, I'm worried they all made out okay. At least most of them.\nEh, I'm certain they did. At least Makoto. And I bet she's fuming all over about it as we speak.\nDamn it. We lost again. What is up with freaking Metatron?\nI know. What is up with that? I mean, even your big plastic gun does not\nphaser one bit these days. What is going on with that? Siv, your gun is not so\ncracked up as it should be. Yes, laugh. You think I didn't notice? I mean, my\nbig gun is definitely one that could tear down buildings in one blast. And then something happened with\nMedatron or otherwise her components. It's got to be Christian Prime since she was an armed this time.\nI mean, I just that's got to be it. If Prime's pary does not actually explain\nwhy these defenses are higher, then it's of course Prime.\nShe's got a freaking patron of leadership from another dimension. If it does not consent to the wisdom of this\nuniverse, it's got to be that from throughout the freaking multiverse. here. So I could definitely see that in\nmy previous scans of not only Optimus Pride's matrix and when the matrix was in hot rod,\nI also had scanned Christian Pride's matrix as well once or twice and there\nis the higher amount of energy and vibrations from within Christian Pride's matrix as opposed to Optimus's matrix.\nSo therefore, it does stand to logic and reason that there would be the greater\namount of wisdom from throughout the multiverse that does give her a leg up\nin anything that you may consider. Of course, Wave, you know very well as I\ndo, especially when I had to deal with other crimes from throughout not only\nthe multiverse, but the past and present of this timeline. over and pets in one\nway or another and pets and haunts me within that vast multitude.\nAnd not to mention in this timeline in this universe, Christ Chad Prime being\nthe Avatar has apparently has been conferred even by soundwave from having\nscanned Christian Prime's matrix as well as Optimus's matrix. and for the powers that have been confirmed from that.\nAnything is possible with the right imagination. I bet Galvatron too many\ntimes and he was a future version of me. I I was able to make the right choice and not be affected by unic multiple\ntimes and yet somehow I managed to get infected just a little bit by Unicron. I\nhad to kick it out. At one point I had to go be Galvatron and I had to revert\nback to being Megatron. Always a pain when I have to go through the multiversal complexes of those\ndetails. But yes, Makoto, we agree it is indeed imperative that we actually take\nover the multiverse. So then we can be conquering of everything and everyone\nregardless of the primes rather than be optimist\neven bumblebee or even Christian prime here. That's why I am helping you. I\nwant to take down all these prime so that I can rule this universe by myself. Even though I looked in other timelines\nwhere I actually did succeed, I still want to do it anyway. I turned good for a little while. But yet there's still\nthat deep within me that came about from when I took down Sentinel Prime and when\nOptimus came around from being Orion. That's right, Megatron. But we still\nneed more information in regards to Prime herself and what she is actually\ncapable of as well as Christ through her. Focus.\nYes, ma'am. I want you to get your couple more of your fellow focus robos\nand get yourselves together. I want all the intel possible in the grander scheme\nof things. But yeah, go take pictures and videos of Prime and any other\ndocuments to come down from within song shoes on my face and even from Shan\nPrime's lair. Don't go do anything stupid like the trolls of the 1218 half\nof this very earth did. There's no need for such perverted nonsense.\nI agree mount but when I split apart into some more focus robo I cannot actually maintain a focus of my clones\nlike reflector had tried do within himself hide mine or not but in any\nevent I will go to the base and I shall get this information for youto ma'am\nthat's right you better and you better get the information on how powerful prime is and if you don't I'll have\ncrasher stop you with her electric bells. But good actually. I'm always\nhappy to lay a hand when my feet are required for the test. Makoto,\nI would not fail you, Gwy. Makoto, ma'am, I shall be focused along with my partners and we shall get the footage\nand information you requested. I shall make way now and to the base. We will\nsneak in covertly. I'll be in touch. That's right. Now get to work.\nYes, ma'am.\n</p>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h3>\n<center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:3px outset #bb2222\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:CWCism-IllBreakYouDead.png\"><img alt=\"CWCism-IllBreakYouDead.png\" decoding=\"async\" height=\"113\" src=\"/w/images/0/05/CWCism-IllBreakYouDead.png\" width=\"150\"/></a>\n</td>\n<td><i> This media needs a <a href=\"/cwcki/CWCki:Transcription_Style\" title=\"CWCki:Transcription Style\">transcript</a>. Help CWCki by <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Light_Powered_Cwclight_Reviews_-_Punicrackder_V_plus_Music_Video&amp;action=edit\" rel=\"nofollow\">transcribing the content</a>. If the media is too long, transcribe select portions which are funny or informative.</i>\n</td></tr>\n</tbody></table></center>\n<h3><span class=\"mw-headline\" id=\"Outtakes\">Outtakes</span></h3>\n<dl><dd><i>Main article: <a href=\"/cwcki/Punicrackder-V_Outtakes\" title=\"Punicrackder-V Outtakes\">Punicrackder-V Outtakes</a></i> <i></i></dd></dl>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Transformers\" title=\"Template:Transformers\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Transformers&amp;action=edit&amp;redlink=1\" title=\"Template talk:Transformers (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Transformers&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <i><a href=\"/cwcki/Transformers\" title=\"Transformers\">Transformers</a></i></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Videos\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<table cellspacing=\"0\" class=\"nowraplinks navbox-subgroup\" style=\"width:100%;;margin: 0 -0.25em;;;\">\n<tbody><tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\">Misc.</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Christian_Weston_Chandler%27s_FUTURE_MESSAGE\" title=\"Christian Weston Chandler's FUTURE MESSAGE\">Christian Weston Chandler's FUTURE MESSAGE</a> • <a href=\"/cwcki/Chris_Comes_Out_of_the_Closet\" title=\"Chris Comes Out of the Closet\">Chris Comes Out of the Closet</a> • <a href=\"/cwcki/Son-Chu_Review\" title=\"Son-Chu Review\">Son-Chu Review</a> (<a href=\"/cwcki/Son-Chu_Review_Skit_Redux\" title=\"Son-Chu Review Skit Redux\">2024 alternate ending</a> • <a class=\"mw-redirect\" href=\"/cwcki/Retro_Review:_Titans_Return_Son-Chu_Review\" title=\"Retro Review: Titans Return Son-Chu Review\">2025 revision</a>) • <a href=\"/cwcki/December_2023_livestreams\" title=\"December 2023 livestreams\">Fan Mail and Cwcville Autobots</a> • <a href=\"/cwcki/Transformers_-_Past_Ideas_Reemerging\" title=\"Transformers - Past Ideas Reemerging\">Past Ideas Reemerging</a> • <a href=\"/cwcki/Discovering_Transformers_Legacy_United_Merged_Wave_3\" title=\"Discovering Transformers Legacy United Merged Wave 3\">Discovering Transformers Legacy United Merged Wave 3</a> • <a href=\"/cwcki/Transformers_Legacy_United_Merged_Reviews_-Wave_3_Trailer\" title=\"Transformers Legacy United Merged Reviews -Wave 3 Trailer\">Transformers Legacy United Merged Reviews -Wave 3 Trailer</a> • <a href=\"/cwcki/Go_Transformers_-_Theme_of_Transformers_of_Cwcville_-_Music_Video\" title=\"Go Transformers - Theme of Transformers of Cwcville - Music Video\">Go Transformers - Theme of Transformers of Cwcville - Music Video</a> • <a href=\"/cwcki/PSA:_Ignorance_Is_Truly_Bliss_Against_The_Haters_And_Fakers\" title=\"PSA: Ignorance Is Truly Bliss Against The Haters And Fakers\">PSA: Ignorance Is Truly Bliss Against The Haters And Fakers</a> • <a href=\"/cwcki/How_much_caffeine_has_he_had_with_his_Energon%3F\" title=\"How much caffeine has he had with his Energon?\">How much caffeine has he had with his Energon?</a> • <a href=\"/cwcki/JCWCSP_singing_Go,_Transformers!_(Extended_Version)\" title=\"JCWCSP singing Go, Transformers! (Extended Version)\">JCWCSP singing Go, Transformers! (Extended Version)</a> • <a href=\"/cwcki/JCWCSP%27s_OLDER_Transformers_and_Gobots_Figures_For_Sale_on_Cwclight\" title=\"JCWCSP's OLDER Transformers and Gobots Figures For Sale on Cwclight\">JCWCSP's OLDER Transformers and Gobots Figures For Sale on Cwclight</a> • <a href=\"/cwcki/JCWCSP%27s_older_Transformers_for_sale\" title=\"JCWCSP's older Transformers for sale\">JCWCSP's older Transformers for sale</a> • <a href=\"/cwcki/Cwclight_Reviews_Opening_Intros_with_Subtitles\" title=\"Cwclight Reviews Opening Intros with Subtitles\">Cwclight Reviews Opening Intros with Subtitles</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\">Pmurt Saga</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/Oh,_Wait._I%27ve_got_one_more...\" title=\"Oh, Wait. I've got one more...\">Oh, Wait. I've got one more...</a> • <a href=\"/cwcki/Something_Completely_Different_-_A_few_Transformers_Jokes,_also_anti-Pmurt\" title=\"Something Completely Different - A few Transformers Jokes, also anti-Pmurt\">Something Completely Different - A few Transformers Jokes, also anti-Pmurt</a> • <a href=\"/cwcki/Eid,_Pmurt,_Eid\" title=\"Eid, Pmurt, Eid\">Eid, Pmurt, Eid</a> • <a href=\"/cwcki/The_Alpha_Trion/%22Young_Warrior%22_Challenge\" title='The Alpha Trion/\"Young Warrior\" Challenge'>The Alpha Trion/\"Young Warrior\" Challenge</a> • <a href=\"/cwcki/Alpha_Trion/%22Young%22_warrior_challenge_explained\" title='Alpha Trion/\"Young\" warrior challenge explained'>Alpha Trion/\"Young\" warrior challenge explained</a> • <a href=\"/cwcki/The_United_States_of_America_has_NO_President_or_Vice_President,_Whatsoever\" title=\"The United States of America has NO President or Vice President, Whatsoever\">The United States of America has NO President or Vice President, Whatsoever</a> • <a href=\"/cwcki/Live_Game_Stream_-_C-Log_04142017\" title=\"Live Game Stream - C-Log 04142017\">Live Game Stream - C-Log 04142017</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\"><a href=\"/cwcki/Light_Powered_Cwclight_Reviews\" title=\"Light Powered Cwclight Reviews\">Light Powered Cwclight Reviews</a></div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Bumba-Lumba\" title=\"Light Powered Cwclight Reviews - Bumba-Lumba\">Bumba-Lumba</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Son-Chu\" title=\"Light Powered Cwclight Reviews - Son-Chu\">Son-Chu</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Silver\" title=\"Light Powered Cwclight Reviews - Silver\">Silver</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Excelina\" title=\"Light Powered Cwclight Reviews - Excelina\">Excelina</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Prowler\" title=\"Light Powered Cwclight Reviews - Prowler\">Prowler</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Armoraxe\" title=\"Light Powered Cwclight Reviews - Armoraxe\">Armoraxe</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Punislav_the_First\" title=\"Light Powered Cwclight Reviews - Punislav the First\">Punislav the First</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Wave\" title=\"Light Powered Cwclight Reviews - Wave\">Wave</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Chapper\" title=\"Light Powered Cwclight Reviews - Chapper\">Chapper</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Fireshot\" title=\"Light Powered Cwclight Reviews - Fireshot\">Fireshot</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Rollout\" title=\"Light Powered Cwclight Reviews - Rollout\">Rollout</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Medatron\" title=\"Light Powered Cwclight Reviews - Medatron\">Medatron</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Chris-Chan_Prime\" title=\"Light Powered Cwclight Reviews - Chris-Chan Prime\">Chris-Chan Prime</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_S.A.V._(Scoundrel_As_Vessel)_the_First\" title=\"Light Powered Cwclight Reviews - S.A.V. (Scoundrel As Vessel) the First\">S.A.V. (Scoundrel As Vessel) the First</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Decepticlone_Crackder\" title=\"Light Powered Cwclight Reviews - Decepticlone Crackder\">Decepticlone Crackder</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_C-C_82_(Autobot)_Chris-Chan_Origin_Form\" title=\"Light Powered Cwclight Reviews - C-C 82 (Autobot) Chris-Chan Origin Form\">C-C 82 (Autobot) Chris-Chan Origin Form</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Gwenmi_Mikoto\" title=\"Light Powered Cwclight Reviews - Gwenmi Mikoto\">Gwenmi Mikoto</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Decepticlone_S.A.V._(Scoundrel_As_Vessel)\" title=\"Light Powered Cwclight Reviews - Decepticlone S.A.V. (Scoundrel As Vessel)\">Decepticlone S.A.V. (Scoundrel As Vessel)</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Crackder_the_First\" title=\"Light Powered Cwclight Reviews - Crackder the First\">Crackder the First</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Decepticlone_Punislav..._yay\" title=\"Light Powered Cwclight Reviews - Decepticlone Punislav... yay\">Decepticlone Punislav... yay</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Combiner_Mode_Excelina\" title=\"Light Powered Cwclight Reviews - Combiner Mode Excelina\">Combiner Mode Excelina</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Combiner_Mode_Chris-Chan_Prime\" title=\"Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime\">Combiner Mode Chris-Chan Prime</a> • <a class=\"mw-selflink selflink\">Punicrackder V plus Music Video</a> (<a href=\"/cwcki/Punicrackder-V_Outtakes\" title=\"Punicrackder-V Outtakes\">Outtakes</a>) • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_(Renegade)_Focus\" title=\"Light Powered Cwclight Reviews - (Renegade) Focus\">(Renegade) Focus</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Tork\" title=\"Light Powered Cwclight Reviews - Tork\">Tork</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Stallion\" title=\"Light Powered Cwclight Reviews - Stallion\">Stallion</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Sparky\" title=\"Light Powered Cwclight Reviews - Sparky\">Sparky</a> • <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Autobot_Soldier_Clyde\" title=\"Light Powered Cwclight Reviews - Autobot Soldier Clyde\">Autobot Soldier Clyde</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\">Sample Videos</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/Subtitled_Video_Sample\" title=\"Subtitled Video Sample\">Subtitled Video Sample</a> • <a href=\"/cwcki/November_2025_social_media_posts#Another_video_sample\" title=\"November 2025 social media posts\">Transformers Video Sample</a> • <a href=\"/cwcki/November_2025_social_media_posts#Custom_Transformers_movie_sample_video\" title=\"November 2025 social media posts\">CWC Transformers movie preview</a></div>\n</td></tr></tbody></table></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Fandom\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<table cellspacing=\"0\" class=\"nowraplinks navbox-subgroup\" style=\"width:100%;;margin: 0 -0.25em;;;\">\n<tbody><tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\">People</div>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"new\" href=\"/w/index.php?title=Chris_McFeely&amp;action=edit&amp;redlink=1\" title=\"Chris McFeely (page does not exist)\">Chris McFeely</a> • <a href=\"/cwcki/Emgo316\" title=\"Emgo316\">Emgo316</a> • <a class=\"new\" href=\"/w/index.php?title=Jcc2224&amp;action=edit&amp;redlink=1\" title=\"Jcc2224 (page does not exist)\">Jcc2224</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sentinel_Fucked_Up_Prime\" title=\"Sentinel Fucked Up Prime\">Sentinel Fucked Up Prime</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";padding-left:0em;padding-right:0em;;\"><div style=\"padding:0em 0.75em;\">Fan media by Chris</div>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Decepti-Clones\" title=\"Decepti-Clones\">Decepti-Clones</a> • <a href=\"/cwcki/Samurai_Pizza_Bots\" title=\"Samurai Pizza Bots\">Samurai Pizza Bots</a> (<a href=\"/cwcki/Samurai_Pizza_Bots_(TSSSF_pack)\" title=\"Samurai Pizza Bots (TSSSF pack)\">TSSSF pack</a>) • <a href=\"/cwcki/The_Autobots_of_Cwcville\" title=\"The Autobots of Cwcville\">The Autobots of Cwcville</a> • <a class=\"mw-redirect\" href=\"/cwcki/Transformers_Legacy_United_Merged\" title=\"Transformers Legacy United Merged\">Transformers Legacy United Merged‎</a> (<a href=\"/cwcki/Transformers_Legacy_United_Merge_Bios\" title=\"Transformers Legacy United Merge Bios\">Bios</a>)</div>\n</td></tr></tbody></table></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"new\" href=\"/w/index.php?title=GoBots&amp;action=edit&amp;redlink=1\" title=\"GoBots (page does not exist)\">GoBots</a> • <a href=\"/cwcki/Hasbro\" title=\"Hasbro\">Hasbro</a> • <a href=\"/cwcki/Megatron_pistol\" title=\"Megatron pistol\">Megatron pistol</a> • <a href=\"/cwcki/Optimus_Prime\" title=\"Optimus Prime\">Optimus Prime</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Light_Powered_Cwclight_Reviews_-_Combiner_Mode_Chris-Chan_Prime\" title=\"Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime\">Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Go_Transformers_-_Theme_of_Transformers_of_Cwcville_-_Music_Video\" title=\"Go Transformers - Theme of Transformers of Cwcville - Music Video\">Go Transformers - Theme of Transformers of Cwcville - Music Video</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251126220815\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.156 seconds\nReal time usage: 0.174 seconds\nPreprocessor visited node count: 1532/1000000\nPost‐expand include size: 93972/2097152 bytes\nTemplate argument size: 75452/2097152 bytes\nHighest expansion depth: 12/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   81.543      1 -total\n 60.72%   49.511      3 Template:Navbox\n 50.55%   41.224      1 Template:Transformers\n 27.99%   22.821      1 Template:Infobox/video\n 22.38%   18.247      2 Template:Navbox_subgroup\n  5.61%    4.574      1 Template:Marketing\n  4.34%    3.542      1 Template:Succession\n  4.33%    3.528      1 Template:Quotebox\n  4.28%    3.488      1 Template:Praetor\n  4.28%    3.486      1 Template:Transcription\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:40635-0!canonical and timestamp 20251126220815 and revision id 354505. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Light_Powered_Cwclight_Reviews_-_Punicrackder_V_plus_Music_Video&amp;oldid=354505\">http://sonichu.com/w/index.php?title=Light_Powered_Cwclight_Reviews_-_Punicrackder_V_plus_Music_Video&amp;oldid=354505</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2025",
    "Videos Christian uploaded to YouTube"
  ],
  "links": [
    "Chris's videos",
    "Decepticlone Punislav... yay",
    "Videos",
    "Cwclight",
    "The United States of America has NO President or Vice President, Whatsoever",
    "Combiner Mode Excelina",
    "Music",
    "Rollout",
    "Something Completely Different - A few Transformers Jokes, also anti-Pmurt",
    "Excelina",
    "Oh, Wait. I've got one more...",
    "2024 alternate ending",
    "Praetor",
    "Punislav the First",
    "Emgo316",
    "Christian Weston Chandler's FUTURE MESSAGE",
    "JCWCSP singing Go, Transformers! (Extended Version)",
    "JCWCSP's OLDER Transformers and Gobots Figures For Sale on Cwclight",
    "Silver",
    "Medatron",
    "Samurai Pizza Bots",
    "Punicrackder-V Outtakes",
    "TSSSF pack",
    "OfficialCWCmart",
    "Fireshot",
    "Stallion",
    "Alpha Trion/\"Young\" warrior challenge explained",
    "The Alpha Trion/\"Young Warrior\" Challenge",
    "JCWCSP's older Transformers for sale",
    "Transformers Legacy United Merged‎",
    "Prowler",
    "Eid, Pmurt, Eid",
    "Optimus Prime",
    "Fan Mail and Cwcville Autobots",
    "Transformers",
    "Decepticlone S.A.V. (Scoundrel As Vessel)",
    "Megatron pistol",
    "YouTube",
    "Chris-Chan Prime",
    "Go Transformers - Theme of Transformers of Cwcville - Music Video",
    "Bios",
    "How much caffeine has he had with his Energon?",
    "Bumba-Lumba",
    "S.A.V. (Scoundrel As Vessel) the First",
    "Hasbro",
    "Sentinel Fucked Up Prime",
    "Outtakes",
    "Combiner Mode Chris-Chan Prime",
    "Cwclight Reviews Opening Intros with Subtitles",
    "Subtitled Video Sample",
    "Chris Comes Out of the Closet",
    "Armoraxe",
    "Gwenmi Mikoto",
    "Trolls",
    "(Renegade) Focus",
    "September 2025",
    "Light Powered Cwclight Reviews",
    "Chapper",
    "Past Ideas Reemerging",
    "C-C 82 (Autobot) Chris-Chan Origin Form",
    "Son-Chu",
    "Tork",
    "Sparky",
    "Discovering Transformers Legacy United Merged Wave 3",
    "Son-Chu Review",
    "Autobot Soldier Clyde",
    "Live Game Stream - C-Log 04142017",
    "The Autobots of Cwcville",
    "Wave",
    "Bluesky",
    "Decepticlone Crackder",
    "Transformers Legacy United Merged Reviews -Wave 3 Trailer",
    "Light Powered Cwclight Reviews - Combiner Mode Chris-Chan Prime",
    "Crackder the First",
    "Decepti-Clones"
  ],
  "scraped_at": "2025-11-26T15:39:09.528666"
}