{
  "url": "https://sonichu.com/cwcki/LoveYouLongTime_E-mails,_2009",
  "title": "LoveYouLongTime E-mails, 2009",
  "display_title": "LoveYouLongTime E-mails, 2009",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>The <b>Gal Pal E-mails</b> are a set of emails which Chris sent to multiple <a href=\"/cwcki/Gal_pal\" title=\"Gal pal\">female friends</a> over the years, all of whom were played by <a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>. They were leaked onto the <a href=\"/cwcki/CWCki_Forums\" title=\"CWCki Forums\">CWCki Forums</a> / <a href=\"/cwcki/Kiwi_Farms\" title=\"Kiwi Farms\">Kiwi Farms</a> gradually beginning in late <a href=\"/cwcki/January_2015\" title=\"January 2015\">January 2015</a>.<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup> While several of them are not dated, they appear to range from June through September <a href=\"/cwcki/2009\" title=\"2009\">2009</a>. During this period, Chris had to deal with the hacking of his <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a> by <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a> and friends, a <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">brown-striped impostor</a>, <a href=\"/cwcki/THAT_IS_MY_HOUSE\" title=\"THAT IS MY HOUSE\">angry parents</a>, and <a href=\"/cwcki/Muscle_bra\" title=\"Muscle bra\">fashion discoveries</a>. Several names were redacted by LoveYouLongTime.\n</p><p><a class=\"mw-redirect\" href=\"/cwcki/Gal_Pal_E-mails_2\" title=\"Gal Pal E-mails 2\">More e-mails were leaked</a> in September 2016.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Messed-up_biological_clock\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Messed-up biological clock</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Ranking_China\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Ranking China</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#The_Cwcville_political_scene\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">The Cwcville political scene</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Experiments_with_alcohol_and_balloon_art\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Experiments with alcohol and balloon art</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Chris_looks_for_a_free_hooker\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Chris looks for a free hooker</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#Finding_someone_who_will_agree_to_have_sex_with_Chris\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Finding someone who will agree to have sex with Chris</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#An_anime_convention_and_more_fun_with_alcohol\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">An anime convention and more fun with alcohol</span></a></li>\n<li class=\"toclevel-1 tocsection-8\"><a href=\"#Who_was_the_very_first_troll?\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Who was the very first troll?</span></a></li>\n<li class=\"toclevel-1 tocsection-9\"><a href=\"#Chris_asks_Michael_for_a_500-word_essay\"><span class=\"tocnumber\">9</span> <span class=\"toctext\">Chris asks Michael for a 500-word essay</span></a></li>\n<li class=\"toclevel-1 tocsection-10\"><a href=\"#A_pretty_girl_and_a_brown-striped_impostor\"><span class=\"tocnumber\">10</span> <span class=\"toctext\">A pretty girl and a brown-striped impostor</span></a></li>\n<li class=\"toclevel-1 tocsection-11\"><a href=\"#Printer_trouble_and_a_creepy_plot\"><span class=\"tocnumber\">11</span> <span class=\"toctext\">Printer trouble and a creepy plot</span></a></li>\n<li class=\"toclevel-1 tocsection-12\"><a href=\"#My_mother_and_my_father_are_angry_with_me!\"><span class=\"tocnumber\">12</span> <span class=\"toctext\">My mother and my father are angry with me!</span></a></li>\n<li class=\"toclevel-1 tocsection-13\"><a href=\"#Paranoia_reigns_at_14_Branchland_Court\"><span class=\"tocnumber\">13</span> <span class=\"toctext\">Paranoia reigns at 14 Branchland Court</span></a></li>\n<li class=\"toclevel-1 tocsection-14\"><a href=\"#Tugboat_confusion\"><span class=\"tocnumber\">14</span> <span class=\"toctext\">Tugboat confusion</span></a></li>\n<li class=\"toclevel-1 tocsection-15\"><a href=\"#The_muscle_bra_email\"><span class=\"tocnumber\">15</span> <span class=\"toctext\">The muscle bra email</span></a></li>\n<li class=\"toclevel-1 tocsection-16\"><a href=\"#Penis_Size\"><span class=\"tocnumber\">16</span> <span class=\"toctext\">Penis Size</span></a></li>\n<li class=\"toclevel-1 tocsection-17\"><a href=\"#Rambling\"><span class=\"tocnumber\">17</span> <span class=\"toctext\">Rambling</span></a></li>\n<li class=\"toclevel-1\"><a href=\"#References\"><span class=\"tocnumber\">18</span> <span class=\"toctext\">References</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Messed-up_biological_clock\">Messed-up biological clock</span></h2>\n<p>On 5 <a href=\"/cwcki/June_2009\" title=\"June 2009\">June 2009</a>, Chris's <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> account was hacked by trolls. On 10 June, he regained control, apparently with the help of this gal pal, who Chris thanks in this email. Their relationship seems to be rather new.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Hey, [redacted]. I'm sorry for not picking up. I was busy with a project Monday night, then I fell asleep later on. Confidentially, Sunday after awaking at 6 PM (I think I told you about what happened; missed <a href=\"/cwcki/Wesley_Memorial_United_Methodist_Church\" title=\"Wesley Memorial United Methodist Church\">church</a> with wrong AM/PM setting, and slept in some more), I stayed awake for over 24 hours, then I fell asleep this morning during 1 AM. I had a busy day yesterday, between my meeting with <a href=\"/cwcki/Rocky_Shoemaker\" title=\"Rocky Shoemaker\">Rocky</a>, going out for breakfast with <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">my mother</a>, picking up a perscription, thinking further about the <a class=\"mw-redirect\" href=\"/cwcki/LittleBiGPlanet\" title=\"LittleBiGPlanet\">LittleBiGPlanet</a> level (I've made up a set of 8 Sonichu/Rosechu Dolls; they're cute), and other things I can't remember at the moment. Anyway, after falling asleep this morning, I didn't feel like much, so I took a day off; I fed my <a href=\"/cwcki/Chandler_Cats\" title=\"Chandler Cats\">cats</a> though. I got up a short while ago at about 11 PM.\n</p><p>I know, I know; my <a href=\"/cwcki/Biological_clock\" title=\"Biological clock\">biological clock</a> reverted back to a messed-up status. Which is one reason I need an in-person <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">girlfriend/sweetheart</a>; to encourage me to \"Come to Bed\" and nudge me and stayed until I was fully awake, at more appropriate times. *sigh* I'm only human.\n</p><p>Anyway, I've received your voicemail, and that is good you got my <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> back. Thank you, [redacted] (if I may call you that). :) I'll ask you to hold onto the password and spell it out for me, letter/number by letter/number, tomorrow night in your call. I promise to leave my phone on Loud and Pick Up. I set my phone to silent when asleep, but the Alarm is still loud always.\n</p><p>I'll likely go for a walk at the <a href=\"/cwcki/Charlottesville_Fashion_Square\" title=\"Charlottesville Fashion Square\">Mall</a> this coming afternoon; other things that come up may come up.\n</p><p>But all in all, I am still healthy and okay. :) Thank you for your concern, and I aplogize for any bother I may have caused you.\n</p><p>Send my kind regards to [redacted] and [redacted] for me. You all take care, and I'll talk to you later.\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Ranking_China\">Ranking China</span></h2>\n<p>According to the Gal Pal: \"Backstory to this is that friend of Chris had a sleepover with <a href=\"/cwcki/Trolls\" title=\"Trolls\">some other girls</a> who joined in on a phone call with him... And the Easter Egg(s) is the girl named Crystal which is pretty easy to guess but we had <a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">BlueSpike</a> voice Azul, hurr hurr get it? Sorry, bad joke. Blue had to do falsetto because at that point his voice wasn't that of a 13 year old. \"\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Mon, Jun 15, 2009 at 11:58 AM\n<p>They all look soo good. Thank you. Also, IMHO, between Crystal and Scout; I would definitely love to date either one of them, and after giving thought to last night's chat as well... I'd give my first date ever to Scout. My reasons behind the decision: they both are really hot and beautiful.\n</p><p>Crystal did show good, honest interest in me. She was also very sweet in how she talked. Her name is the same as the name I had planned on giving to my future daughter. Yet she said she would be going back to California shortly.\n</p><p>Granted Scout has her eyes on another dude, there is a chance that he may not feel for her or that he can be already taken or is gay (not to put down the guy in her eyes or offend her personally). She was fun to talk with. She gives off an encouraging energy that I feel more attracted to. She has the same hairstyle and figure as the women who have seen in my dreams before (the water-filled labyrinth and YES, the one I had recently with the asian-looking woman). And I have the impression that she lives around C-Ville; please verify that for me.\n</p><p>I would have included Azul in the rankings; she was HOT too, but she already has her own children, and I was not looking for a woman already with children. But still, I highly compliment her figure, looks and charm. Although she is shy now, she can overcome that easily soon; yet that makes her more cute and can work for her when she is ready to find a guy here in the U.S. I wish her very well in her future. :)\n</p><p>I still would like to meet all of them and hang out for a while, if possible before Crystal has to leave.\n</p><p>Also, talking about the \"Lisp\" of a gay dude, like I said before, a \"lisp\" to me is the speech imparement from lack of a few teeth. The word that would have been more appropriate and understandable was \"Efemminate\". But that's just for your information.\n</p><p>Please send my kind regards to Crystal, Scout and Azul for me. And if Scout is willing to give me a real-life try (dating me), please give her my number, so we can set up a date.\n</p><p>Oh, and also, the picture of Crystal and Scout, is that really a room in your house, [REDACTED]? It looks good. What does that sign above the window say? I can only make out 2/3 to 75% of it.\n</p><p>I'll TTYL.\nLove and Peace to you all, Christian C.\n</p><p>P.S.\n</p><p>Please let me know if Logan accepted my apology.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"The_Cwcville_political_scene\">The Cwcville political scene</span></h2>\n<p>Chris's friend took additional measures to help Chris root out YouTube trolls. On 10 July 2009, Chris uploaded a <a href=\"/cwcki/CWC_Calls_Out_Three_Na%C3%AFve_YouTubers#CWC_Calls_Out_ShmionSonozaki\" title=\"CWC Calls Out Three Naïve YouTubers\">video</a> calling \"Shmion Sonozaki\" a \"coward, naive, retarded individual,\" contributing to the suspension of his account.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Thank you for informing me about this person, and I understand the message you relayed from [redacted]. Please see what else you can learn about \"Shmion Sonozaki\"; where he/she lives for one thing.\n</p><p>Also, about that Cwcville Site; it is Blasphemous how far they took the <a class=\"mw-redirect\" href=\"/cwcki/Billy_Mays\" title=\"Billy Mays\">Billy Mays</a> lie. Upon further consideration, I would say <a class=\"mw-redirect\" href=\"/cwcki/Cwcville\" title=\"Cwcville\">Cwcville</a> is more of a King/Queen type of politic, since I would not want anyone else taking over my city and whatnot. Still, as you know I run it with a firm hand, and keep it in a healthy state. I also with to contact the webmaster of that site and tell him myself about his erroneous statements, and also make it Clear that Billy was NEVER Mayor. *sigh* *What a headache*\n</p><p>Also, I remembered what I wanted to let you know about last night; I've found the Complete DVD set of the anime, \"Shuffle\", at Best Buy yesterday for $49.99 (plus tax). I have downloaded the entire 24-episode series from the Playstation Store for $1.99 per episode. At 1.99 X 24 = 47.76, it was obvious that downloading the episodes was the Better Bargin there. <a href=\"/cwcki/Chris_and_brand_loyalty\" title=\"Chris and brand loyalty\">That's a Plus for Sony</a>.\n</p><p>I've just read an e-mail from [redacted]. I'll forward it to you to let you know what he said. At least we all can still meet up at the Downtown Mall Friday to hang out; please let me know if [redacted] can join us.\n</p><p>I'll TTYL,\n</p><p>Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Experiments_with_alcohol_and_balloon_art\">Experiments with alcohol and balloon art</span></h2>\n<p>On 13 July 2009, <a href=\"/cwcki/Chris%27s_Big_Night_Out_II\" title=\"Chris's Big Night Out II\">footage</a> of Chris hanging out in a bar with friends was uploaded onto YouTube. On the same day, <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a> gave what Chris calls a \"sex-challenge,\" that he must upload a video of himself having sex with a hooker in order to win back his hacked PSN network accounts. Not long afterward, Chris sent the following email. \n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Jul 15, 2009 at 2:43 AM\n<p>I'm sorry I didn't pick up earlier; I drifted off at about 6:30 PM. I had a day. I awoke 6 AM; fed my cats, had breakfast and whanot. Later went with <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">my father</a> to <a href=\"/cwcki/Burger_King\" title=\"Burger King\">Burger King</a>; I only had a cup of coffee. I confided in my father about my <a class=\"mw-redirect\" href=\"/cwcki/Alcohol\" title=\"Alcohol\">drinking</a>; he was not as cool as I thought he was going to be. Still, he taught me about his vast knowledge of liqour, wine and <a class=\"mw-redirect\" href=\"/cwcki/Reeb\" title=\"Reeb\">beer</a>. We stopped by the nearby ABC and Food Lion on the way home for him to show me the varieties from his P.O.V.\n</p><p>He has sampled a lot of varieties in his lifetime. He would love to sit out on his outdoor swing and have a Miller or a Micolobe (mom too), but they both take a LOT of medications, so they can't drink alcohol, cause mixed with their medications in their bodies could kill them. I was hoping he would not tell mom about it, but he said he HAD to tell her. She gave me 2 minutes of her emotions, compressed into a few I statements and telling me what she is limiting in her things for me; food and gas money. But I'm sure she'll be over it soon and it will go back to normal. It's not like I drink everyday, although I did for a short while, then I had a short dry spell.\n</p><p>My family is also concerned about <a href=\"/cwcki/Chris_and_health\" title=\"Chris and health\">my health</a>, because I'm taking one medication for my <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>-management, as well as an imitation of Lipitor. I have an appointment with my doctor this afternoon, so I'll ask him about that (upon my mother's suggestion).\n</p><p>Later on, at about 2, I went downtown with my father to the Shell at Pantops for their Hot Dogs (He liked their cole slaw and BBQ meat they had before on their Hot Dog fixings bar, as well as the old deal they had on their dogs; 2 for something inexpensive. But the price rose, they no longer had the cole slaw and BBQ, and while we still had two dogs there, he's crossed that location off his list of good places to eat. Then he went to the nearby CVS for motion sickness pills, the C'Ville Market for Tomatoes, then the nearby Goodwill upon my request (I've bought a denim jacket). Then we got back home about 4:30.\n</p><p>I put the jacket in with a load of laundry, then I watched the X-Play reruns my DVR recorded for me from today. They replayed their 1 hour special on the MMO Gameplay. It was interesting; they also had shots from Second Life among the MMO games. Then I felt like turning on an episode of <a href=\"/cwcki/Monty_Python\" title=\"Monty Python\">Monty Python</a> on my <a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PS3</a>, and I was debating on heading out tonight, or where I could go right now to flirt with women before the Baja. I was left feeling drowzy, and I fell asleep.\n</p><p>Aside from my day, my father told me the fate of those bottles of wine we had that I mentioned before. They got lost in the movings from house-to-house during my <a class=\"mw-redirect\" href=\"/cwcki/Providence_Middle_School\" title=\"Providence Middle School\">Middle</a> and <a class=\"mw-redirect\" href=\"/cwcki/High_School\" title=\"High School\">High School</a> years (from among 4 houses in all), and the wine rack they were housed in was donated to a Goodwill.\n</p><p>Also, I looked up your YouTube account from my <a class=\"mw-redirect\" href=\"/cwcki/IBAChandler\" title=\"IBAChandler\">new account</a> last morning. I thought I asked you not to upload any new videos you shot of me. No hard feelings, but I respectfully ask you to refrain from Uploading any more in the future, please. Lord knows how many <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> have mocked me from the footage, even to Mirror the videos for their personal use.\n</p><p>And after awakening from my nap a few minutes ago, I had a thought from asking [redacted] to create a Balloon Sneaker for the balloon mouse to live in. With my mind as creative as a <a href=\"/cwcki/CADD\" title=\"CADD\">CADD</a> program, I had imagined how a 3-dimensional sneaker could be made from 2 or 3 inflated white balloons and 2 uninflated gray balloons (for sneaker laces), even to expand it to be a boot (so he can pretend he caught a boot instead of a fish).\n</p><p>Then I had the idea, [redacted] is THAT GOOD at Balloon Art; I'm going to look up a Balloon Art Convention (for in case he does not know of any) for him, and I am confident in his ability to put together the BIGGEST thing he'd like to create from balloons; he could create a human-size Statue of Liberty if he wanted to.\n</p><p>Aside from my doctor's appointment this afternoon, I also have a meeting with Rocky. I'm also going to hang at the mall to flirt with the ladies; may as well Strike while my confidence is HOT.\n</p><p>I'll TTYL. Take care and Stay safe.\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p><p>P.S.\n</p><p>What are your thoughts about the <a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">sex-challenge</a> I was thrusted with?\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Jul 15, 2009 at 11:37AM\n<p>Good to hear you're doing alright. It did sound like you had a full day! I'm also proud of you that you told your parents. While they may be disappointed for now, it's a step forward in them understanding you're an adult now. It's unfortunate that they cannot enjoy a beer now and then because of their medication, because it could have been an activity you all could have shared.\n</p><p>I apologize that you did not want any new videos up, because you never mentioned not wanting them there. So in the future any new vids will only be shared between us and Taylor. I also think the trolls are just jealous of your new found\nconfidence because they have none. Either way, just tell me beforehand if you want things shared on YouTube for future reference.\n</p><p>You enjoy your meeting with Rocky today. I think it's great you have somebody like her to talk to. I can tell you look up to her from all the things you tell me you've learned from her. Also, good luck at the mall today, I'm glad you're confidence it skyrocketing!\n</p><p>I believe you can get through with the sex challenge. Just keep your confidence up!\n</p><p>Anyhow. Feel free to e-mail me with any new updates from today. Have a good day!\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Jul 15, 2009 at 1:42PM\n<p>Thank you, ... :)\n</p><p>Also, I think I told you about the PSN account situation so far.\n</p><p>New Update; I've just called Dan Gallen (a bigwig at Sony), who helped me out with getting my US accounts back. He had it set that only my PS3 console was banned from the PSN for the time; I've asked him to restrict access to my accounts for the remainder of the time. Also, he apparently had the access to my PS3's stats, so I've asked him to reset my out-of-country accounts' e-mail addresses and whatnot, so hopefully that challenge will be not a concern now. If Jack tells me he can't get into any of those accounts, then I'm cool. I've also made the suggestion of requesting all Download History Trophy information be copied into a temporary PSN Code for transferring to a NEW PSN account when switching; he was impressed with the suggestion and will relay it to the PSNPeople who handle the updates and whatnot.\n</p><p>gtgnow, but I'll TTYL. Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Chris_looks_for_a_free_hooker\">Chris looks for a free hooker</span></h2>\n<p>This email was sent not long after the previous one. In an effort to meet Jack Thaddeus's demand, Chris turned to Craigslist, but to no avail. \n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>In my sarch on <a href=\"/cwcki/Craigslist\" title=\"Craigslist\">Craigslist</a>, the ONLY women who left a phone number on their Ad were under \"Adult Services\", which they would have wanted money. I tried calling one, learned she wanted a hundred, then in the middle of telling my story about <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack</a> and my <a class=\"mw-redirect\" href=\"/cwcki/PSN\" title=\"PSN\">PSN</a> account recovery with a Sex video, she hung up on me. :(\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Finding_someone_who_will_agree_to_have_sex_with_Chris\">Finding someone who will agree to have sex with Chris</span></h2>\n<p>Given Chris's lack of success in finding a hooker, Chris's gal pal apparently volunteered her services in finding him a sex partner. Having located a possible candidate, Chris debated how much she needed to know about Jack Thaddeus and his blackmail. It is unclear whether this anonymous woman was requesting that she be paid for having sex with Chris. In any case, nothing came of this, and Chris would remain a <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">virgin with rage</a> for the next couple years. Jack Thaddeus withdrew this particular ultimatum on 19 July 2009.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>I've given it more thought and calmed down a bit as well. You may inform [redacted] about me being the creator of <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a> and <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a>, and that I have Fans and Trolls who have been contacting/troubling me. Show her some of my art if possible. And let her know about my PSN account; that the Trolls have hacked into it twice before and they've gotten into it again, and I've been troubled with recovering that. About that much to let her be informed about is cool.\n</p><p>If you feel it advisable to let her know about <a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack</a> and his challenge for my out-of-country and second US account, you may tell her about that.\n</p><p>I feel it best if she does know about some to all of the stories/situations, so she doesn't have to feel out of the loop of knowledge. I would feel better if when she agrees to the sex, she has a general understanding and cares enough about me to help.\n</p><p>Thank you for listening, [redacted].\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"An_anime_convention_and_more_fun_with_alcohol\">An anime convention and more fun with alcohol</span></h2>\n<p>In this email, Chris's friend tries to get him to attend Otakon, an <a href=\"/cwcki/Anime\" title=\"Anime\">anime</a> convention, which was held in Baltimore from July 17 to 19. While Chris would not attend, <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">Liquid Chris</a> did, and made a killing off Sonichu merchandise, galvanizing Chris to start a <a href=\"/cwcki/Liquid_Chris#CWCivil_War_begins\" title=\"Liquid Chris\">civil war</a>.\n</p><p>Chris also gropes his television screen.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>I will get the pages rolling soon within the week.\n</p><p>Also, thank you for the Otakon info. $65 sounds affordable, but I'm not sure I could afford the other essentials like gas, souvineres and whatnot. If [redacted] is cool, I can share a ride with you two on the trip, and I'll sleep in the Lounge area. I could fend for myself at <a href=\"/cwcki/McDonald%27s\" title=\"McDonald's\">McDonalds</a> or somewhere inexpensive like that. But I'll let you and [redacted] discuss that. If it is cool, I would pay my $65 for the Otakon.\n</p><p>Also, I did something completely different today, this morning, while my father was reading his paper at the Burger King in <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a>, I snuck over to the nearby ABC store (telling him I was going to the Pawn Shop), and not only did I find the Jack Daniels, But I found some pre-made Long Island Tea in a Bottle for $10. So after gathering the funds, I returned later for that, a Sweet &amp; Sour Mix, two Lemons and a 2-Liter Coca Cola. I've filled 5 12oz bottles from Mike's Hard Cranberry/Lemonade; I had one earlier. I have expierenced the tipsy feeling, and then some, in my <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_room\" title=\"Chris's room\">bedroom</a>. I played the \"Roy Rogers McFreely\" episode of \"American Dad\" on my PS3, mainly to learn what it was mixed with a cold Coke to make a Roy Rogers; GRENEDINE! :D I'll try that in a week or so. Also, I was soo tipsy, after Hayley exposed her painted breasts, I paused, founced over to my HDTV and try to feel her breasts. Soo Silly. :)\n</p><p>Before today, [redacted] told me they didn't sell Long island in bottles; I've just proved him wrong. F.Y.I., the mix was a \"Barton\" Brand, and it was located under \"Mixes\" at the ABC.\n</p><p>Another note, I want [redacted] I pray she'll give me some time over the Killzone 2 Extra.\n</p><p>I'll TTYL\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"Who_was_the_very_first_troll.3F\"></span><span class=\"mw-headline\" id=\"Who_was_the_very_first_troll?\">Who was the very first troll?</span></h2>\n<p>On 24 July 2009, when Chris asked Jack why he was being trolled, Jack cryptically <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">replied</a>, \"Who was the very first troll? That will answer your question.\" This captured Chris's attention. Chris sent a near-identical copy of this email to <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> on 26 July.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Damn! Upon personal mental recollection, the Earliest Trolls I know of are as follows:\n</p><p>-<a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snycer</a>, Current Owner/manager of <a href=\"/cwcki/The_GAMe_PLACe\" title=\"The GAMe PLACe\">the Game and Hobby Place</a>. He's hated my guts after multiple times borrowing the store's HDTV for Console Gameplay. And in subtle retalliation, I hand wrote, on a cardboard box, \"Michael Love the \"F\" Out of <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>!\" I tried to protect myself when he found it WEEKS later after having wrote it; I even convinced myself that the \"F\" meant \"Fiddlesticks\"; It originally meant \"Fuck\". That was why the Son of a Bitch <a class=\"mw-redirect\" href=\"/cwcki/Jews\" title=\"Jews\">Jew</a> kicked me out of The Game Place, Permanently, After YEARS of Loyal Volunteer Service in the <a class=\"mw-redirect\" href=\"/cwcki/Pokemon\" title=\"Pokemon\">Pokemon</a> <a class=\"mw-redirect\" href=\"/cwcki/TCG\" title=\"TCG\">TCG</a> League. I had apologized numerously before, but he's still the pigheaded, stubborn Jew he was then. I was kicked out about Friday, June 13, 2008; it Was a Friday.\n</p><p>-[redacted] (A Possible Troll) You know the story; tried to win her over in about 2 years time before I was kicked out of The Game Place. She was rarely all that into me either, fairly much like how [redacted] was Not into me either, but at least [redacted] Told Me Quicklu, instead of trying to be subtle over a LOOONG Time.\n</p><p>-[redacted] I have No idea of what the fuck got into his head, because we were like buddies in the history of the Pokemon and <a href=\"/cwcki/Yu-Gi-Oh!\" title=\"Yu-Gi-Oh!\">Yu-gi-Oh</a> TCGs. He always got me quick with his Squirtle, No Wartortle, with Pokemon Breeder Deck. Bu I Know, with the help of my father's Scooby-Doo Detective Work that [redacted] Was the One who put that Damn <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> Sign in my front yard, Halloween Night, 2008. There's a video somewhere on YouTube of the bastard showing off his deed with pictures of mine and my dad's cars' Behinds with the License Plate, And a pic of the accomplice Girlfriend (Upon zoomed-in Perspective, I know that gal was [redacted] from what I could tell of the blurred face, hairstyle and body type).\n</p><p>[redacted] Friend, [redacted] was the Troll who too that snapshot of mr the last Friday Night of October, 2007, that went onto that damn ED Page in its Early Days of being typed up. It was Also the same Friday Night I became SHOCKED witnessing [redacted] making out with this turned-homosexual dude, Christopher (don't remember his last name... Could This Chris be the Chris Crocker <a class=\"mw-redirect\" href=\"/cwcki/Samantha_Thaddeus\" title=\"Samantha Thaddeus\">Sam</a> was talking about trolling later?), then started a game shortly after, still in shock, and during the whole game, I nervously talked like a robot. But I Saw the Camera Flash, and the Photographer was TALL and wearing a trenchcoat; [redacted] with a Capitol \"T R O L L\".\n</p><p>I have never suspected:\n</p><p>-[redacted]; he was a cool guy.\n</p><p>-Any of the other individual employees who worked under Michael's Management.\n</p><p>And I Know these are NOT Trolls:\n</p><p>-[redacted] - He was a Family Man, with a job as a Physics Teacher at Albemarle High; Squall was One of his Passing Students.\n</p><p>-[redacted] -\n</p><p>He was a scrappy little spanish child, who lived with his Grandma. He was a Prankster, but he cared about me as a friend. Last time I saw him in person, He GREW Taller than me at about 13 (which that is his current age, as far as I can tell).\n</p><p>Impulsively, I would like to Pay Michael A Surprise Visit, But I don't want to go back in there unarmed with only memories. I Need my friends. :)\nPlease see what you can learn about the confirmed Trolls I have just Listed, And Find out what you can up to firing that guy Sam knows at Sony, as well as her \"brother\" and the \"hungry reporter\" at NBC29.\n</p><p>Thank you. Stay Safe,\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Chris_asks_Michael_for_a_500-word_essay\">Chris asks Michael for a 500-word essay</span></h2>\n<p>Still bothered by Jack's question, Chris continued the search for clues by sending a letter to <a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael Snyder</a>. He constructed this typed copy of his hand-written letter for his gal pal. Why Chris expected Mike to respond to this weird combination of anger and civility is beyond neurotypical understanding.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>I will type it up verbatim now;\n</p><p>July 27, 2009\n</p><p>Michael Snyder/\n</p><p>The GAMEe PLACe\n</p><p>243 Ridge McIntire Rd.\n</p><p><a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a>, VA 22903\n</p><p>Michael,\n</p><p>It has been About One Year, One Month, Two Weeks (14 Days) since you kicked me out of my weekly volunteer work at \"your\" store with [redacted] at the Pok'emon Trading Card Game League. FIDDLESTICKS! The feelings of that shameful event between you, my mother, Barbara Anne Weston Chandler, and me (Both of Me; <a href=\"/cwcki/Christopher%27s_name_change\" title=\"Christopher's name change\">Christian of NOW, and Christopher of the '80s</a>). I want to let you know that I no longer hold hard emotions against you of that day, as well as a few fridays before when you BOASTED NO Wii-Play. There WERE Children without the Electivere, Magmortar and Surfing Pikachu.\n</p><p>*SIGH*\n</p><p>So, I will ask you again, Please Let Me BAck Into The PLACe.\n</p><p>But Now I get to the Main Point of hand-writing this Letter today. You know WELL not only of the Encyclopedia Dramatica Page against me, but of my infinite (symbol) swarm of countless Internet Bullies and Trolls who (quoting Stan Bush),\n</p><p>\"Trying to break your (my) spirit, Keeping you (me) down,\" but I fight them all and emerge victorious after \"Fighting for the things you (I) know are right.\"\n</p><p>I Digress. I am looking up and searching for the VERY FIRST \"CWC TROLL\"; the very First Individual who Ranted Against Me, Sonichu and Rosechu. Enclosed is a copy of my List of Suspects from as early as October, 2007. You are at the top of the list. I have already informed my church's pastor, pastoral counsoler And Our Charlottesville Detective (working on stopping these Trolls).\n</p><p>I WANT YOU TO BE GOD-WATCHING HONEST WITH ME, Michael Snyder.\n</p><p>-Are You One of those Trolls?\n</p><p>-For Reasons Before November 2007, Why did you hate me or Troll me? *The Wii-Thing DOES NOT COUNT, because that happened June, 2008.*\n</p><p>-What did I ever do to you?\n</p><p>-*WHY TROLL ME ABOVE ALL MORE SUCCESSFUL or LESS SUCCESSFUL PEOPLE?\n</p><p>-Or in short, for you to respond with a MINIMUM 500-Word Essay, What The F***?\n</p><p>Please reply via Hand-Written Letter ONLY, as Quickly As Possible.\n</p><p>Have a good day.\n</p><p>Peace,\n</p><p>Christian W. Chandler\n</p><p>(angry Sonichu face with lightning bolts sparking)\n</p><p>And out of the WHOLE list e-mail, here is what I had enclosed for his information out of it:\n</p><p>[letter cuts off]\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"A_pretty_girl_and_a_brown-striped_impostor\">A pretty girl and a brown-striped impostor</span></h2>\n<p>This email was probably sent on 29 July 2009. Chris had finished and uploaded <a class=\"mw-redirect\" href=\"/cwcki/Episode_19\" title=\"Episode 19\">Episode 19</a> the day before.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>I have some good news, and I would appreciate your input as well. :)\n</p><p>On the way home from Church today, I stopped by Best Buy for a catalog and a short browse; while I was wondering the PSP Aisle, this pretty girl who works there asks me, \"May I Help You?\" I said, \"No thanks, I'm just browsing,\" then I got a good look at her. Then she complimented my <a href=\"/cwcki/Pedo-Glasses\" title=\"Pedo-Glasses\">glasses</a>; she wanted bigger frames fromt the pair she has; she's nearsighted too. Then the <a class=\"mw-redirect\" href=\"/cwcki/Medallion\" title=\"Medallion\">Medal</a> came into Talk; without saying my name yet, I told her in a nutshell about being the original creator of Sonichu, Rosechu and Cwcville, and the <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">comic pages</a> I had, as well as being internet famous, with Trolls; had the <a href=\"/cwcki/CWC%27s_Sonichu_Site!\" title=\"CWC's Sonichu Site!\">Original Site</a>, had to take it down, then with help from a friend of mine (that's you), I'm back up and runnin' on <a class=\"mw-redirect\" href=\"/cwcki/Cwcipedia\" title=\"Cwcipedia\">Cwcipedia</a>. Then she was like, \"Oh! I know you from your YouTube Videos. What was your name? Don't tell me... Okay, give me a hint.\" \"Name the Religion.\" \"My Religion?\" \"No, The Religion.\" \"Oh, Chrstian!\" Then I asked her name; her name is [redacted]. We chatted a bit further, and then we parted ways for the time. I'll be coming back to Best Buy for \"Music Advice\" later this week and try to ask her out.\n</p><p>If you, or [redacted] or [redacted] would like to check her out for yourself; she didn't wear a nametag today, but she was one of the Blue-Shirted Employees; has Cinnamon-Brown Hair, tan and eye-makeup; about 4 to 5 feet tall. I think her hair was long.\n</p><p>Also, I've completed the <a class=\"mw-redirect\" href=\"/cwcki/Dating_Education\" title=\"Dating Education\">Dating Education</a> Episode last night, and the episode is fully colored, texted and uploaded onto Cwcipedia. Then, with the Billy Mays page, I created a Memorial Page; I invited him to come back and visit Charlottesville (invited his family too) for our current or future Dogwood Festival. Imagine if that happened, and if there was a Photographic moment of me shaking hands with Billy Mays 3; THAT would put a kick in the Trolls balls.\n</p><p>That reminds me, as for <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">the Impostor</a> taking the Troll Load off of me, as nice as that sounds, I just can not let that happen. He takes my Trolls; he would take the Good Fans as well. And where does that leave me? Nowhere.\n</p><p>Plus, if you watched his foreign-talking video recently, he Creepily Mentions DarkHorse Comics (just after [redacted] talked about it). Still, I have a new goal among my goals; start the Comic-Talk between me and DarkHorse, DC or Marvel. I've decided to leave Archie behind, as from what I've seen in their books, they don't cut as much adult meat as I have covered once or twice, as you may remember. And the Impostor pretty much made me feel uncomfortable about DarkHorse, because HIM saying it at the moment, and the way he said it, it was equivilant to a Mother or Father joining in on a Child's current Fad; TURN-OFF for the Child. But I won't let that stop me from talking to DarkHorse if they start talking to me.\n</p><p>I gtg for now. I'll take a break, then I'll draw the Samurai Pizza Autobots on a page, as I have done for practice with the other Autobots and Decepti-Clones.\n</p><p>Stay safe and take care.\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p><p>P.S.\n</p><p>[redacted] has also informed me of a Special Summer Celebration Picnic from the C-Ville Therapeutic Recreation Program &amp; The Independence Resource Center; they're having music, games and more, PLUS some <a href=\"/cwcki/University_of_Virginia\" title=\"University of Virginia\">UVA</a> <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">Law Enforcement</a> Representatives I could ask for their help in my current situation on starting to put Sonichu and Rosechu into the business world and whatnot. I will be attending the picnic.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Printer_trouble_and_a_creepy_plot\">Printer trouble and a creepy plot</span></h2>\n<p>While Chris was infuriated that <a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">Liquid Chris</a> was impersonating him, he also saw this as an opportunity to convince Liquid's girlfriend <a href=\"/cwcki/Kacey\" title=\"Kacey\">Kacey</a> that he was \"the Real C.W.C.\" This evolved into a dumb plan to trick Kacey into coming to his house so that they could have sex. It involved <a href=\"/cwcki/For_Kacey_from_CWC\" title=\"For Kacey from CWC\">video</a>, <a href=\"/cwcki/Kacey_Call_1\" title=\"Kacey Call 1\">phone calls</a>, and <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">help from friends</a>.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>3 August 2009\n<p>ChrisChanSonichu@aol.com\n</p><p>8/3/09\n</p><p>A couple of things. Currently, my Scanner is out of order; something wrong with the Print Cartridge. Trials and Errors lead me to believe it may have something to to with the copper contact prongs syncing up with the cartridge. I use an HP Printer/Copier/Scanner, it takes HP 56 Black/57 Color, but it has been working with the less expensive Nukote Cartridges up till now (Nukote can be found at <a href=\"/cwcki/Mal-Wart\" title=\"Mal-Wart\">Wal-Mart</a> and Sam's Club; they are Recycled Cartridges with new ink).\n</p><p>I also wanted to check on if you've got in touch with [redacted] yet, or your thoughts on the topic. Please let me know. I will also ask [redacted] to get in touch with [redacted] to better soften the hard truth before she comes over, meets the real parents, then the Real C.W.C.\n</p><p>I will do some drawing of new pages today, some coloring too. If you know anyone who will look a my printer and repair it as a favor, I would appreciate it. Although, I may ask Liz [Reverend Elizabeth Foss] or <a href=\"/cwcki/Rocky_Shoemaker\" title=\"Rocky Shoemaker\">Rock</a> if they know anyone as well. Whatever. :)\n</p><p>I'll TTYL,\n</p><p>Stay safe, take care,\n</p><p>Love and Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"My_mother_and_my_father_are_angry_with_me.21\"></span><span class=\"mw-headline\" id=\"My_mother_and_my_father_are_angry_with_me!\">My mother and my father are angry with me!</span></h2>\n<p>This panicked email is best read in conjunction with <a href=\"/cwcki/THAT_IS_MY_HOUSE\" title=\"THAT IS MY HOUSE\">a certain video</a> he made on the same day.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>27 August 2009\n<p>chrischansonichu@aol.com\n</p><p>8/27/09\n</p><p>Also, because of <a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">my MONTHS-OLD mistake</a>, my mother took away my Car Keys, my Drivers License... TRAPPING ME IN <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">THE HOUSE THAT LOVE BUILT</a>, BUT YEARS LATER, CHAOS ENSUED! *sob*\n</p><p>Mom and Dad are both very angry with me. I've informed [redacted] and I'll call my detective tomorrow. IDK, you have IN with the trolls, please see if you can talk them into HELPING me remove that footage off of the internet. (I KNOW, they'll be too damn stubborn, stupid and cocky to help, but any port in a hurricane). *feelin' dizzy*\n</p><p>I gotta get back to searching on YouTube for the similar videos and flagging them; you flagging them can help too.\n</p><p>Please tell [redacted] all that for me; maybe she and her family can help, IDK.\n</p><p>RALLY THE GOOD, LOYAL TROOPS!\n</p><p>Yet another MAJOR REASON TO TAKE DOWN THAT E.D. Page, because they probably have all that shit on there as well. And all it took was ONE TROLL calling my house and telling my father about seeing a portion of his Wall of Records (LPs) in pictures.\n</p><p>HELP!!! HELP!!! HELP!!!\n</p><p>Because aside from flagging, IDK what to do. Originally, the videos were uploaded onto a Mega Upload site (I FORGOT WHICH ONE) in a zip folder for \"<a class=\"mw-redirect\" href=\"/cwcki/Julie\" title=\"Julie\">Julie</a>\".\n</p><p><a href=\"/cwcki/Chris_and_religion\" title=\"Chris and religion\">God and Christ Help Me</a>.\n</p><p>I'm sorry, but I'm <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stressing</a> out here.\n</p><p>TTYL,\n</p><p>Christopher Christian W.C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Paranoia_reigns_at_14_Branchland_Court\">Paranoia reigns at 14 Branchland Court</span></h2>\n<p>This email provides a follow-up from the events of the previous day.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>28 August 2009\n<p>ChrisChanSonichu@aol.com\n</p><p>8/28/09\n</p><p>It can be better... Did you tell anyone about my telling you about my parents threatening to kick me out? I'm not blaming you; I'm just asking. And let me remind you that everything I tell you should be treated as confidential ONLY between you, [redacted], [redacted] and [redacted] (BTW, I trusted [redacted] with viewing <a href=\"/cwcki/THAT_IS_MY_HOUSE#Uncut\" title=\"THAT IS MY HOUSE\">the uncut video</a> last night; I felt I could trust her).\n</p><p>Also, my mother is in an untrusting mood; she is not trusting anyone right now, including you and [redacted] it's not y'all's faults, and I think at the time communications between you and my parents can only stir more trouble.\n</p><p>Maybe wait a week or two, then I think it would be advisable for you to call my family on their house phone (leave a message, as my father moniters all incoming calls on caller ID and left messages) from y'alls house or cell phone; NO SKYPE to my house, please. Then you can meet my father at least (he's the more socialable parent right now) and try to quell the mistrust my family feels.\n</p><p>*sigh*\n</p><p>I'm trying to restore peace into this house that is now filled with chaos, because of those trolls.\n</p><p>I'll copy most of this message for [redacted] to read as well, because I feel it advisable for her to meet my family in person as well (especially the chance of better things to come between me and her). :)\n</p><p>I'll TTYTonight,\n</p><p>Stay Safe and Take Care,\n</p><p>Christopher Christian W. Chandler.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Tugboat_confusion\">Tugboat confusion</span></h2>\n<p>In a <a href=\"/cwcki/Kacey_Call_4\" title=\"Kacey Call 4\">phone call</a> on the previous day, <a href=\"/cwcki/Kacey\" title=\"Kacey\">Kacey</a> had used \"tough love\" to persuade Chris to look for a job.\n</p><p>Another piece of interesting information in this email is that Chris is trying to apply for a copyright. Unlike the job search, this effort would eventually <a href=\"/cwcki/Red_Letter_CWC_Certified_Day\" title=\"Red Letter CWC Certified Day\">bear fruit</a>.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>29 August 2009\n<p>chrischansonichu@aol.com\n</p><p>8/29/09\n</p><p>But my mother and father are old and a bit stubborn on parting (especially my mother); Tell Them That, not me. If She would wise up, I would only be happy to take All the bulky furniture that is just sitting there out to the front lawn, call Goodwill and have them come and pick up All That.\n</p><p>On a brighter side, my family has calmed some more; I got my keys back, but she says Not to drive myself anywhere.\n</p><p>Also, [redacted] showed me some tough love and encoraged me to fill an application at <a href=\"/cwcki/Mal-Wart\" title=\"Mal-Wart\">Wal-Mart</a>, even though I have not confirmed all the details I need to know on the work limits from <a class=\"mw-redirect\" href=\"/cwcki/Tugboat\" title=\"Tugboat\">Social Security</a> yet. The .gov website offered no straightforward answers, and I called the dude the lady at the office reccomended. And I hastily went onto WalMart.com and filled out a job application for the Charlottesville location. [redacted] encoursged me to shoot for a 20 hour work week, but I think the limit is 10 or 15; She told me to be ambitious like that. And in the part of inputting which days I would be available, I left Sat and Sun Not Available, but I filled in the remainder 11 am to 5 pm; that rounds to 30 hours. Crap. I'm stressin', because I still do not understand fully the Work Ticket Limit.\n</p><p>Anyway, I am going to read over the <a href=\"/cwcki/Chris_and_copyright\" title=\"Chris and copyright\">copyright</a> forms today and try to understand what I would need to do.\n</p><p>I'll TTYL,\n</p><p>Stay Safe,\n</p><p>Chris.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"The_muscle_bra_email\">The muscle bra email</span></h2>\n<p>This is the famous <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">muscle bra email</a> which had been leaked separately in October 2009. The reference to \"hackery\" probably refers to his brief, dumb attempt in <a href=\"/cwcki/File:ChristopherWantsOut.PNG\" title=\"File:ChristopherWantsOut.PNG\">YouTube</a> <a href=\"/cwcki/File:ChristopherWantsOut2.PNG\" title=\"File:ChristopherWantsOut2.PNG\">comments</a> to make people believe that he had multiple personalities.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>3 September 2009\n<p>ChrisChanSonichu@aol.com\n</p><p>9/3/09\n</p><p>I'll send the password again. And I can assure you, [redacted] that IT WAS HACKERY. While I am asleep, I have my computer Turned Off and my PS3 set onto Life With Playstation. And lately, I've been having my usual good night sleeps; NO NEW aches and pains from whatever.\n</p><p>Stress causes Memory Loss sometimes. At least I undid the hacker who got into my YouTube.\n</p><p>Also, I did my shopping today; I haven't been able to draw or color today yet, but I will set some time tonight. I got my copy of G.H.5, my new 3-in-one-printer, and I found the <a href=\"/cwcki/Muscle_bra\" title=\"Muscle bra\">sports bras</a> at Wal-Mart; 3-packs for $10 a pack. In leiu of going into the fitting room, I asked the nearby female employee to measure my bust size; I'm a 43. So I got a 3-set of 42; I've been wearing one for try... It is sooo comfortable, and my <a class=\"mw-redirect\" href=\"/cwcki/Manboobs\" title=\"Manboobs\">manboobs</a> do not bounce as easily; I jumped a few times to see. OMG, WOW! <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl_Saga\" title=\"Tomgirl Saga\">This material feel so, so, so good on my skin.</a> It's like a Guitly Pleasure or something. :)\n</p><p>Anyway, I got my exercise in today. I also went to McD, Toys 'R' Us, Sheetz, Food Lion and Target for applications; NO PAPER APPLICATIONS! OMG, it really ground my gears to realize that. Although at Target, I was not totally surprised; I went straight to their computer station and filled in their application online. But EVERYONE IS LIKE GOING DIGITAL WITH NO PAPER TRAIL; It Sucks! This is even WORSE Than that CRAPPY PowerWeb at <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">PVCC</a>.\n</p><p>Yes, you have read correctly, I HAVE ALWAYS HATED THAT DAMN, STUPID POWERWEB! Even in it's pre-released Over Advertising, which was TOTALLY UNECCESSARY. Every time I was FORCED into using that Damn System, I was always reluctant, and I had to use my Student ID No., which I HAD NEVER CARED TO MEMORIZE; I only glanced at a few numbers at a time upon entry, and \"In One Ear And Out The Other\" with that soiled piece of what would have been valuable information. You said I was the first person you met to Hate Kenneth; well, I'm probably the first person you met who Always Loathed the PowerWeb since its PreBirth.\n</p><p>*sigh*\n</p><p>But I digress... and this bra feels sooo good.\n</p><p>Something else, I'll forward you an email I sent to [redacted] last night after our conversation to best start another concern of mine.\n</p><p>I'll TTYL,\n</p><p>Stay Safe,\n</p><p>Chris.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Penis_Size\">Penis Size</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Nov 24, 2009 at 6:50PM\n<p>I hope you are still sate and well. Also, just a reminder, please get in touch with [REDACTED] to hook me up with a woman who can put-out for me (preferably a white, smoke-free and STD-free 18-27-year old).\n</p><p>Also, I have drawn 2 pages today and I have just uploaded them onto the Cwcipedia. It took me about 3 hours to think, draw and color them. I was offered to hang out with my parents in an outing this afternoon, but I declined, to draw the pages.\n</p><p>In other thoughts on my mind right now, I have just forwarded an e-mail to you from Jack Thaddius; apparently, as the Cwcipedia Sysop told me, Jack bought the ability to sell ad-space on there. \"What the hell was he thinking with that damn pickle suit?\" In case you haven't seen the two offensive ads yet, there is one for a contest for a Mexico Trip; the image is of a Pickle Person, which offends me, because of the past issues with the people in the Pickle Suits who tricked me online. I suggested to Jack to change the image to the Mexico Flag. And the other is of Peter Griffin, PROMOTING... UGH!!! gay-rights: THAT ONE SHOULD BE REMOVED ALTOGETHER\n</p><p>Something I thought I'd bring up in tonight's phone-talk, do you remember the Pepsi Machines with the Credit Card Slots that used to be at Fashion Square a few years ago? I do; upon first impression, I couldn't wait to try it, but it cost me. $5 at a time, because it was their test to verify the card was valid. I was bothered by that, so later on, after I sorted that out at the bank, I put up hand-written signs to tape on those machines a warning, \"Warning. There is a $5 charge per credit card use,\" or something like that. Eventually a short time after, they removed those machines and replaced them with Coca-Cola Machines. So you can blame me for that swap.\n</p><p>It didn't hit me until later, but what you told me last night, about my penis size being a disappointing size... before I fell asleep, the topic randomly came back in my memory, and I felt bad and belittled from that comment; I cried a bit. Aside from that, I hope the testosterone results with a higher-level of testosterone over estrogen when I take that test in a couple of weeks with a bit of my blood. I feel like my balls were being broken with such comments; I'm just letting you know about that.\n</p><p>\"sigh\" But I digress. I'll TTYL, Stay Safe,\n</p><p>LOLove, Christian.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Rambling\">Rambling</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Nov 25, 2009 at 5:59PM\n<p>So far today, I went out with my mom and dad; they went to Kroger for some Rotiseree Chicken for Thanksgiving tomorrow, and for lunch from the Deli, plus Dressing from Wood Grill. I had already eaten, so they dropped me off at Wal-Mart for the while; I walked for half an hour, then I sat at McDonalds with Sudoku on my PSP and a cup of tea. I pondered over the next page for the comic, then I felt down from feeling lonely due to the no-girlfriend thing, and the lack of virgin-breaking sex. I don't remember all the details of the thoughts from the self-reflection, but I do remember some.\n</p><p>Anyway, I am feeling a bit better emotionally, and I am going to draw, color and upload page 86 shortly, and I plan on answering the current set of messages in the mailbag tonight, plus I'll be checking in with some of my relatives to send Thanksgiving Wishes.\n</p><p>Also, I've just received disc one of Sonic X Season 6; I have the episodes ripped, all there is left is to convert them to MP4 files with the PSP Video 9 on my PC and move them into a \"Sonic the Hedgehog\" folder on my PS3's external hard drive. It will take the total length of time of all the episodes to convert, so that's plenty of time for me to draw that\npage.\n</p><p>Also, they've updated the Playstation Store yesterday; they have their 99 cent TV episode sale; some shows for 99 cents apiece; they've included Season 4 of \"Heroes\", and I downloaded the \"Thanksgiving\" episode from there. I'll be turning that on while I draw/color.\n</p><p>And I've replied to another e-mail from Vivian; I promised her daily progress reports, and I told her to get in touch with you on other portions of the Sonichu Project.\n</p><p>I had another thought or two, but they escape me at the moment; hopefully I'll remember them before our phone talk later.\n</p><p>Stay Safe,\n</p><p>TTYL, Christian.\n</p>\n</td></tr></tbody></table>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Gallery\n</th></tr>\n<tr>\n<td><center><ul class=\"gallery mw-gallery-traditional\">\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:61.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal01.png\"><img alt=\"Galpal01.png\" decoding=\"async\" height=\"27\" src=\"/w/images/thumb/9/91/Galpal01.png/120px-Galpal01.png\" srcset=\"/w/images/thumb/9/91/Galpal01.png/180px-Galpal01.png 1.5x, /w/images/thumb/9/91/Galpal01.png/240px-Galpal01.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:48px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal02.png\"><img alt=\"Galpal02.png\" decoding=\"async\" height=\"54\" src=\"/w/images/thumb/3/3c/Galpal02.png/120px-Galpal02.png\" srcset=\"/w/images/thumb/3/3c/Galpal02.png/180px-Galpal02.png 1.5x, /w/images/thumb/3/3c/Galpal02.png/240px-Galpal02.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:72.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal03.png\"><img alt=\"Galpal03.png\" decoding=\"async\" height=\"5\" src=\"/w/images/thumb/e/e0/Galpal03.png/120px-Galpal03.png\" srcset=\"/w/images/thumb/e/e0/Galpal03.png/180px-Galpal03.png 1.5x, /w/images/thumb/e/e0/Galpal03.png/240px-Galpal03.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:63.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal04.png\"><img alt=\"Galpal04.png\" decoding=\"async\" height=\"23\" src=\"/w/images/thumb/3/3a/Galpal04.png/120px-Galpal04.png\" srcset=\"/w/images/thumb/3/3a/Galpal04.png/180px-Galpal04.png 1.5x, /w/images/thumb/3/3a/Galpal04.png/240px-Galpal04.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:65px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal05.png\"><img alt=\"Galpal05.png\" decoding=\"async\" height=\"20\" src=\"/w/images/thumb/0/01/Galpal05.png/120px-Galpal05.png\" srcset=\"/w/images/thumb/0/01/Galpal05.png/180px-Galpal05.png 1.5x, /w/images/thumb/0/01/Galpal05.png/240px-Galpal05.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:66.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal06.png\"><img alt=\"Galpal06.png\" decoding=\"async\" height=\"17\" src=\"/w/images/thumb/4/4c/Galpal06.png/120px-Galpal06.png\" srcset=\"/w/images/thumb/4/4c/Galpal06.png/180px-Galpal06.png 1.5x, /w/images/thumb/4/4c/Galpal06.png/240px-Galpal06.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:31.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal07.png\"><img alt=\"Galpal07.png\" decoding=\"async\" height=\"87\" src=\"/w/images/thumb/a/ae/Galpal07.png/120px-Galpal07.png\" srcset=\"/w/images/thumb/a/ae/Galpal07.png/180px-Galpal07.png 1.5x, /w/images/thumb/a/ae/Galpal07.png/240px-Galpal07.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:44px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal08.png\"><img alt=\"Galpal08.png\" decoding=\"async\" height=\"62\" src=\"/w/images/thumb/7/73/Galpal08.png/120px-Galpal08.png\" srcset=\"/w/images/thumb/7/73/Galpal08.png/180px-Galpal08.png 1.5x, /w/images/thumb/7/73/Galpal08.png/240px-Galpal08.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:54.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal09.png\"><img alt=\"Galpal09.png\" decoding=\"async\" height=\"41\" src=\"/w/images/thumb/e/e5/Galpal09.png/120px-Galpal09.png\" srcset=\"/w/images/thumb/e/e5/Galpal09.png/180px-Galpal09.png 1.5x, /w/images/thumb/e/e5/Galpal09.png/240px-Galpal09.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:64px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal10.png\"><img alt=\"Galpal10.png\" decoding=\"async\" height=\"22\" src=\"/w/images/thumb/5/50/Galpal10.png/120px-Galpal10.png\" srcset=\"/w/images/thumb/5/50/Galpal10.png/180px-Galpal10.png 1.5x, /w/images/thumb/5/50/Galpal10.png/240px-Galpal10.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:61.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal11.png\"><img alt=\"Galpal11.png\" decoding=\"async\" height=\"27\" src=\"/w/images/thumb/6/6a/Galpal11.png/120px-Galpal11.png\" srcset=\"/w/images/thumb/6/6a/Galpal11.png/180px-Galpal11.png 1.5x, /w/images/thumb/6/6a/Galpal11.png/240px-Galpal11.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:62.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal12.png\"><img alt=\"Galpal12.png\" decoding=\"async\" height=\"25\" src=\"/w/images/thumb/f/f5/Galpal12.png/120px-Galpal12.png\" srcset=\"/w/images/thumb/f/f5/Galpal12.png/180px-Galpal12.png 1.5x, /w/images/thumb/f/f5/Galpal12.png/240px-Galpal12.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:56.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal13.png\"><img alt=\"Galpal13.png\" decoding=\"async\" height=\"37\" src=\"/w/images/thumb/e/e1/Galpal13.png/120px-Galpal13.png\" srcset=\"/w/images/thumb/e/e1/Galpal13.png/180px-Galpal13.png 1.5x, /w/images/thumb/e/e1/Galpal13.png/240px-Galpal13.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:56.5px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal14.png\"><img alt=\"Galpal14.png\" decoding=\"async\" height=\"37\" src=\"/w/images/thumb/8/82/Galpal14.png/120px-Galpal14.png\" srcset=\"/w/images/thumb/8/82/Galpal14.png/180px-Galpal14.png 1.5x, /w/images/thumb/8/82/Galpal14.png/240px-Galpal14.png 2x\" width=\"120\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg\"><img alt=\"Galpal 090715 - Experiments with alcohol and balloon art2.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/0/04/Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg/93px-Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg\" srcset=\"/w/images/thumb/0/04/Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg/139px-Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg 1.5x, /w/images/thumb/0/04/Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg/185px-Galpal_090715_-_Experiments_with_alcohol_and_balloon_art2.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_-_Penis_Size.jpg\"><img alt=\"Galpal - Penis Size.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/e/ef/Galpal_-_Penis_Size.jpg/93px-Galpal_-_Penis_Size.jpg\" srcset=\"/w/images/thumb/e/ef/Galpal_-_Penis_Size.jpg/139px-Galpal_-_Penis_Size.jpg 1.5x, /w/images/thumb/e/ef/Galpal_-_Penis_Size.jpg/185px-Galpal_-_Penis_Size.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_091125_-_Rambling.jpg\"><img alt=\"Galpal 091125 - Rambling.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/1/16/Galpal_091125_-_Rambling.jpg/93px-Galpal_091125_-_Rambling.jpg\" srcset=\"/w/images/thumb/1/16/Galpal_091125_-_Rambling.jpg/139px-Galpal_091125_-_Rambling.jpg 1.5x, /w/images/thumb/1/16/Galpal_091125_-_Rambling.jpg/185px-Galpal_091125_-_Rambling.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n</ul></center>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\"><a class=\"external free\" href=\"https://kiwifarms.net/threads/old-school-chris-crap.7441/\" rel=\"nofollow\">https://kiwifarms.net/threads/old-school-chris-crap.7441/</a> (archive: <a class=\"external free\" href=\"https://archive.ph/1ejxt\" rel=\"nofollow\">https://archive.ph/1ejxt</a>)</span>\n</li>\n</ol></div>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"65%\">\n<tbody><tr align=\"center\" style=\"background:#00FF00\">\n<td colspan=\"3\"><b><a class=\"image\" href=\"/cwcki/File:MITPS.png\"><img alt=\"MITPS.png\" decoding=\"async\" height=\"32\" src=\"/w/images/0/0b/MITPS.png\" width=\"32\"/></a> <a href=\"/cwcki/Emily\" title=\"Emily\"><span style=\"color:white;\">Emily Saga</span></a> <a class=\"image\" href=\"/cwcki/File:MITPS.png\"><img alt=\"MITPS.png\" decoding=\"async\" height=\"32\" src=\"/w/images/0/0b/MITPS.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<td colspan=\"7\"><center><span style=\"font-size:150%\"><b>The Players</b></span></center>\n<p><b>People:</b> <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> • <a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a> (<a href=\"/cwcki/Emily\" title=\"Emily\">Emily</a> • <a href=\"/cwcki/Kim_Wilson\" title=\"Kim Wilson\">Kim Wilson</a> • <a href=\"/cwcki/Disguises\" title=\"Disguises\">Unknown Gal-pals</a>) • <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Bob Chandler</a> • <a href=\"/cwcki/Man_in_the_Pickle_Suit\" title=\"Man in the Pickle Suit\">Man in the Pickle Suit</a> • <a href=\"/cwcki/Magical_Man\" title=\"Magical Man\">Magical Man</a> • <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a> • <a href=\"/cwcki/Faeryn\" title=\"Faeryn\">Faeryn</a> • <a href=\"/cwcki/Robert_Simmons_V\" title=\"Robert Simmons V\">Robert Simmons V</a> • <a href=\"/cwcki/Bryan_Bash\" title=\"Bryan Bash\">Bryan Bash</a> • <a href=\"/cwcki/Statustjej\" title=\"Statustjej\">Statustjej</a><br/>\n</p>\n<hr/>\n</td></tr>\n<tr>\n<th align=\"left\">LoveYouLongTime:\n</th>\n<th align=\"left\">Emily:\n</th>\n<th align=\"left\">Kim:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li>E-mails (<a class=\"mw-selflink selflink\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a>)</li>\n<li><a href=\"/cwcki/Kiwi_Farms_posts_(LoveYouLongTime)\" title=\"Kiwi Farms posts (LoveYouLongTime)\">Kiwi Farms Posts</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Church_audio\" title=\"Church audio\">Church Visit</a></li>\n<li><a href=\"/cwcki/Date_with_Emily\" title=\"Date with Emily\">Date with Emily</a></li>\n<li><a href=\"/cwcki/Hooker_incident\" title=\"Hooker incident\">Hooker incident</a></li>\n<li><a href=\"/cwcki/Sign_Destruction_Video\" title=\"Sign Destruction Video\">Sign Destruction Video</a></li>\n<li><a href=\"/cwcki/Man_in_the_Pickle_Suit#Videos\" title=\"Man in the Pickle Suit\">A Message to Chris Chan. From an old friend.</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Chris%27s_Big_Night_Out\" title=\"Chris's Big Night Out\">Chris's Big Night Out</a></li>\n<li><a href=\"/cwcki/Chris%27s_Big_Night_Out_II\" title=\"Chris's Big Night Out II\">Chris's Big Night Out II</a></li>\n<li><a href=\"/cwcki/Rollin%27_and_Trollin%27\" title=\"Rollin' and Trollin'\">Rollin' and Trollin'</a></li>\n<li><a href=\"/cwcki/Magical_Man_Potion\" title=\"Magical Man Potion\">Magical Man Potion</a></li>\n<li><a href=\"/cwcki/PVCC_NEW_info:_on_Chris_and_Barbara_spoon_eachother!\" title=\"PVCC NEW info: on Chris and Barbara spoon eachother!\">Confirmation of spooning</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"3\"><b>Coinciding Sagas:</b> <a href=\"/cwcki/Template:ClydeCashSaga\" title=\"Template:ClydeCashSaga\"><span style=\"color:#FF0000\"><b>Clyde Cash</b></span></a>, <a href=\"/cwcki/Template:LiquidSaga\" title=\"Template:LiquidSaga\"><span style=\"color:#8b4513\"><b>Liquid</b></span></a>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-selflink selflink\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251022225450\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.258 seconds\nReal time usage: 0.285 seconds\nPreprocessor visited node count: 1533/1000000\nPost‐expand include size: 77320/2097152 bytes\nTemplate argument size: 50128/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 10075/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%  145.430      1 -total\n 39.01%   56.726      1 Template:Collapsible\n 29.97%   43.581      1 Template:Emails\n 26.88%   39.095      1 Template:Navbox\n 17.72%   25.773      1 Template:SonichuGirlsSaga\n 12.59%   18.304      2 Template:Saga\n  5.92%    8.617      8 Template:Saga/core\n  5.52%    8.021     18 Template:Quotebox\n  4.36%    6.347      2 Template:Color\n  4.12%    5.991      1 Template:Tnavbar\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:21119-0!canonical and timestamp 20251022225450 and revision id 301055. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=LoveYouLongTime_E-mails,_2009&amp;oldid=301055\">http://sonichu.com/w/index.php?title=LoveYouLongTime_E-mails,_2009&amp;oldid=301055</a>\"</div></div>",
  "categories": [
    "Category",
    "E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "Liquid Chris",
    "LittleBiGPlanet",
    "2007",
    "57",
    "MHS classmate E-mails",
    "virgin with rage",
    "Statustjej",
    "This material feel so, so, so good on my skin.",
    "Episode 19",
    "Sydney Contacts",
    "my MONTHS-OLD mistake",
    "White knight E-mails",
    "Unknown Gal-pals",
    "43",
    "new account",
    "Autism Awareness E-mails",
    "bedroom",
    "God and Christ Help Me",
    "cats",
    "Megan Schroeder",
    "60",
    "BlueSpike",
    "44",
    "Rebeckah Bentley E-mails",
    "PVCC",
    "Julie",
    "14",
    "CWCipedia",
    "Oct 2008",
    "Michael Snyder",
    "Surfshack Tito E-mails",
    "2005‒06",
    "40",
    "Faeryn",
    "56",
    "39",
    "help from friends",
    "Mailbag",
    "21",
    "female friends",
    "9",
    "Original Site",
    "Mall",
    "Chris's Big Night Out",
    "Pokemon",
    "Vivian Gee",
    "Common Questions",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "Magical Man Potion",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "TCG",
    "25",
    "Christian of NOW, and Christopher of the '80s",
    "15",
    "59",
    "49",
    "53",
    "Monty Python",
    "stressing",
    "2010",
    "Jackie Romy",
    "brown-striped impostor",
    "Kim Wilson",
    "biological clock",
    "Regina e-mails",
    "52",
    "anime",
    "2011-2012",
    "Blanca Weiss",
    "42",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "Sonichu",
    "a certain video",
    "17",
    "comic pages",
    "Man in the Pickle Suit",
    "fashion discoveries",
    "phone call",
    "Rosechu",
    "Kiwi Farms",
    "YouTube",
    "35",
    "Magical Man",
    "47",
    "Burger King",
    "Date with Emily",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "the Impostor",
    "THE HOUSE THAT LOVE BUILT",
    "stress",
    "31",
    "18",
    "Aug",
    "Kiwi Farms Posts",
    "Mary Lee Walsh",
    "Gregg Mays",
    "Clyde Cash",
    "4",
    "Kacey",
    "36",
    "Bob Chandler",
    "Catherine E-mails",
    "PS3",
    "48",
    "Chris's Big Night Out II",
    "Bryan Bash",
    "19",
    "Hooker incident",
    "Jew",
    "Rollin' and Trollin'",
    "glasses",
    "2004‒06",
    "my mother",
    "Michael Snycer",
    "UVA",
    "Emily",
    "Letter",
    "50",
    "Robert Simmons V",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "CWCki Forums",
    "sex-challenge",
    "8",
    "manboobs",
    "10",
    "2",
    "angry parents",
    "Rocky",
    "2008",
    "Jack",
    "2013-2014‎",
    "Charlottesville",
    "Dating Education",
    "Clyde E-mails",
    "Sign Destruction Video",
    "Encyclopedia Dramatica",
    "footage",
    "Wal-Mart",
    "Uri Geller E-mails",
    "Tito",
    "3",
    "46",
    "7",
    "Misc E-mails",
    "2007‒08",
    "Church Visit",
    "11",
    "23",
    "37",
    "Cwcipedia",
    "26",
    "Thetan",
    "Billy Mays",
    "Law Enforcement",
    "2009",
    "13",
    "61",
    "Cwcville",
    "45",
    "29",
    "32",
    "24",
    "Yu-gi-Oh",
    "More e-mails were leaked",
    "Open Relationship E-mails",
    "Chris",
    "church",
    "girlfriend/sweetheart",
    "Jack Thaddeus",
    "30",
    "58",
    "Craigslist",
    "Samantha Thaddeus",
    "Middle",
    "The Wallflower",
    "trolls",
    "1",
    "my father",
    "28",
    "Social Security",
    "June 2009",
    "drinking",
    "sports bras",
    "copyright",
    "PSN",
    "Miyamoto Saga",
    "the Game and Hobby Place",
    "video",
    "bear fruit",
    "34",
    "phone calls",
    "Rock",
    "38",
    "41",
    "20",
    "Ruckersville",
    "High School",
    "Jan‒July 2007",
    "Evan E-mails",
    "That's a Plus for Sony",
    "January 2015",
    "some other girls",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "16",
    "Medal",
    "6",
    "CADD",
    "McDonalds",
    "Emily Saga",
    "beer",
    "replied",
    "my health",
    "Sept",
    "Sam"
  ],
  "scraped_at": "2025-11-26T15:50:57.632618"
}