{
  "url": "https://sonichu.com/cwcki/LoveYouLongTime_E-mails,_2011-2012",
  "title": "LoveYouLongTime E-mails, 2011-2012",
  "display_title": "LoveYouLongTime E-mails, 2011-2012",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>This page contains leaked e-mails between Chris and personas played by <a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>, from 2011-2012.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Borb_vs_MAGfest\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Borb vs MAGfest</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#UTI\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">UTI</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Tomgirl\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Tomgirl</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Tard_Rage\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Tard Rage</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Lost_Inspiration_for_Sonichu\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Lost Inspiration for Sonichu</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#The_Hooker_and_a_Court_Date\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">The Hooker and a Court Date</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Purpose_in_life?\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Purpose in life?</span></a></li>\n<li class=\"toclevel-1 tocsection-8\"><a href=\"#Dogs\"><span class=\"tocnumber\">8</span> <span class=\"toctext\">Dogs</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Borb_vs_MAGfest\">Borb vs MAGfest</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sat, Jan 15, 2011 at 6:29 pm\n<p>Listen, I lied. I was not sick, but I did have <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>-induced belly-aches, and I had a running nose, because I Cried because of ME and my Mother. This family of mine is soo fragile; one of us in the three leaves, and the other two are just as good as dead, homeless and lost. Financially, ALL SSI income counted for, by my father's count, we're struggling to surviving. And They Would lock me out upon my return if I had gone to MagFest, then where would I be? Just like that trip to Cleveland, the destination was Not Solid; without a Point A to return to or my car had died on that trip, I would have been damned lost and out. Just the same as this trip to MagFest; all that for a One Night Stand and Risk of another Troll Setup, I just could not afford it emotionally. Yesterday, in a final, childish attempt, I gave my mom and dad the Autistic Treatment; Silent, Deaf and No Eye-Contact, which wrecked a family outting to Country Cookin' that afternoon. After getting back home, she came up to my room, and in an angry, sad tone told me sarcastically, \"Go on your trip, but at least take two blankets with you to keep warm,\" then she left crying. Then my father came in a few minutes later telling me of us three beng a whole and what would happen if one leaves. And informed me that due to the crap on the internet against and about me from the trolls and what I uploaded, as well as my real events between PVCC, the mall the cops and all that shit, plus being psychologically matched to the <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Jared_Lee_Loughner\" title=\"wikipedia:Jared Lee Loughner\">high school and college dropout who shot the people in Arizona</a>. And the great number of people locally and worldwide who hate and loathe me. Legally, I am a Sitting Duck. And he told me of mom saying she was going to pack up and leave the house, then I ran downstairs, finding her on the couch; she was soo miserable and sad; she talked of Wanting to Die, \"you don't even have to change my clothes, you can just bury me in what I have on.\" I was soo sad and crying and soo sorry for the way I misbehaved; we hugged and made up a bit. Then I went back upstairs and told dad she was lying on the couch. Then I opened my DSi's Notebook app and drew up a three circle pyramid diagrahm of me, mom and dad, analyzing all three aspects, and I felt more sad. I saved the app, turned the handheld off, turned off the TV, grabbed my quilt, wrapping it around my head, and set up to my scrunched sleep position on the couch. But I did not go to sleep, i cred and cried some more, which led me to move to my bed, still with quilt on my head, I laid face down into my pillows and cried a lot more. I felt very miserable and realizing that at this point my only reason for being was to keep this falling apart family together. And even worse, I lied to you in the e-mal I sent you post-father and pre notebook-writing. I called up <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">Rocky</a> and talked to her about the situation, because I needed someone to talk to immediately, pre-quilt. I felt worse than shit. A few minutes later, mom calls me on my cell to check on me; I tell how miserable I was; she came upstairs. I was on the bed, in fetus position with quilt on my head. I did not feel like showing my face. she sat by my side, rubbed my back with one hand in comforting attempt, confiding in me moments of similar events that happened to her. i eventually sat up with her, and we shared a good, long cry with tissues. Then we went up to <a class=\"mw-redirect\" href=\"/cwcki/Wal-mart\" title=\"Wal-mart\">wal-mart</a> for groceries at about 8 after finishing our cry and recovering. We were there about when you called; I was not ready to tell the truth yet. Points are my family and I do not have any friends and outside family to depend on; mom and dad's relatives gave us constant cold shoulders, thinking they're royalty, when really they're no better off.\n</p><p>And any friends were either dead, left behind in <a class=\"mw-redirect\" href=\"/cwcki/Midlothian\" title=\"Midlothian\">Midlothian</a>, or alive and giving us cold shoulders too. They will never feel at ease with me going anywhere more distance away than <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> or <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a>, not unless they actually know And Have Met in Person any people of my acquaintance, Including You, [REDACTED]. I am very sorry. And at the destinaton, unless They are sure it is okay and safe for me to be around or stay at, I'm still a Legally Sitting Duck; <a class=\"mw-redirect\" href=\"/cwcki/Troll\" title=\"Troll\">Troll</a> Set-Up Paranoid and such. And also, mom treated me to half-payment of a copy of DC Universe Online to make up for not allowing me to go. Even after that, I still feel low as shit. I am soo sorry to you, [REDACTED], for lying to you about the recent sickness and making destined-to-fail promises, but family does come first, and it does say in the commandments and Bible to Honor Thy Mother and Father. And I must further insist on you and my parents meeting in person and talking in good faith and confidence. I feel ashamed to answer my own phone at the moment and for a while, so I ask you to contact my father on our house phone at 434-990-0198 to set up the meeting location and time, after your return from the Mag Fest, please.\n</p><p>Stay Safe and Well,\n</p><p>Christian\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Mon, Jan 17, 2011 at 10:34 PM\n<p>Ok Chris, first, let me start off. I do not make friends with children. I'm an adult. What children do when they make a playdate is have their parents call each other. I don't deal with your parents. I'm sure they're nice people, but unless you're a child, I don't have to talk to them. I'm friends with you.\n</p><p>Now, it sounds like there's a lot of drama going on at your house. Some of the things your mother said and did seem rather selfish to me. Chris, I just want you to know that it is possible for you to be both loyal to your parents and socialize with friends. She acts like if you have friends, you're betraying her.\n</p><p>That's selfish of her and unfair to you.\n</p><p>But I really don't know your mother and could be completely misinterpreting the situation. It's just worrying when she says such dramatic things. I know you're very sensitive and it seems unnecessarily hurtful to you.\n</p><p>But I'm probably wrong. Your mother loves you. I'm just worried about some of the things she said. Ask Rocky what she thinks.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sun, Jan 23, 2011 at 2:23 PM\n<p>I am sorry for not answering your calls the past week. There were two reasons why I didn't pick up. I have felt, and still feel, really terrible about being forced to stay at home and miss MagFest and Rebecca. I just have been kicking myself about the whole bunch of real-life drama that went on last weekend. Before continuing, the second reason was that since Wednesday, I have been falling asleep between 7 and 9 PM, I am serious. And on some of the days, I awoke at 2:30 AM at the earliest.\n</p><p>And I have told Rocky about the situation and how I felt last Monday. I forgot what she told me in response, but she did feel sorry for me. That same day, I also brought to loan and install my Sega Dreamcast for the homeless who were staying at the Church for 2 weeks as part of PACEM. The men appreciated the gameplay so far. And that night, I also helped served food to them. It was nice. I would have gone the next night, but I didn't make it between my deep depression from the past weekend and LittleBigPlanet 2 gameplay. During my waking hours, the new gameplay was refreshing; I started feeling creative inspiration once again. With new ideas for expanding the Sonichu and Rosechu storytelling through new levels, a Versus Revamp of my Aqua Teen Burgertime level, and an educational Video Show of people with Autism and how they should be treated socially and positively in my own words plus facts quoted from Wikipedia. I was starting to feel recovered from the past mess. But today, Elizabeth led her sermon talking about those who dropped everything when they were called (by Jesus) and how nowadays we have to really take verything into consideration before answering any call. It retreived my misery, and I cried all over again, and I drove home feeling very sad with the shackles hooked to the \"ball\" that is my house and parents by the chain. And worse, I again felt really ashamed of myself, because I had failed You on accepting and taking the call to what could have been a better or worse (because of the possible trolls and shit) future.\n</p><p>*Sigh*\n</p><p>Now I still feel the gloom and self-shame, and I am not sure if I feel ready to be talking with you on the phone again, because I feel like I don't deserve that right aymore. I failed you and myself...\n</p><p>IDK, I guess I'll check in again later; I just feel too sad to think clearly. *On a positive note, I'm attaching a fun group photo I took yesterday in LBP 2; check your PSN mailbox for a few more.\n</p><p>Stay Safe,\n</p><p>Christian.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"UTI\">UTI</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sun, Feb 6, 2011 at 6:41 PM\n<p>The past week has been fair, but half-weak at the end. The past few days, I have been enduring the pains of a bladder/urinary infection. I saw my doctor, and he prescribed some antibotics for me. It was Thursday night when it started; I felt burning pains at my pee-hole; I only got about less than four hours of sleep at first. The pains kept me awake. Then I awoke at 3AM, and after one set of short excretions (#1) sitting on the john, I found a bit of blood in the water.\n</p><p>I called for the doctor appointment at about 9:00AM. I have been forced to remain at home on the sound experience from my mother, who has had similar experiences and similar antibiotic prescription, that I would feel weighed down and stuck at home for a number of days.\n</p><p>Friday, it was obvious that I felt soo tired, but I mustered the energy to see the doctor, and pick up my prescription after an hourly wait at my local CVS. I arrived back home at about near 2:45 PM; I took my first antibiotic pill, and crashed on the couch for an appreciated number of hours of less pain-interrupting sleep; I awoke later at about 10:20 PM.\n</p><p>Mom has been most helpful and caring to me during the time. After awaking, I felt some mild headaches (I had worse headaches during Friday afternoon as well), and I felt afraid that if I raised myself up, it would get worse for me. \n</p><p>Thankfully my mother came in for a visit and talked to me; I eventually mustered the energy to get up with minimal pain. Then I went to the bathroom for #1; less burning, but I felt pain during excretion and had to make more effort to push it out. Then after flushing and washing my hands, I returned to my couch and my mother. She brought me a carton of orange juice and a carton of chocolate soy milk. The vitamins from both have been helpful.\n</p><p>During the early Saturday Morning, I felt some energy to turn on LBP2 and resume work on my Autism Animation Sets. I have them completed and most satisfactory. I also learned more estensive tricks and tips on the Multiple Layer Glitches, which all are still functional in LBP 1, as well as LBP2. I feel I have successfully mastered that trick; trials and errors gone through, learned and pending. I think everyone who sees them will be impressed once I have completed the scripts and recordings and published the 5 Parts. Dang that Thermometer; I swear, it goes to a limit of about 10MB per level (based on backed-up level data).\n</p><p>Also, I have been feeling sad on the decreasing in communication between you and me; I feel like I have not met your expectations, and I felt I would be an embarasment to you at this point after the previous, recent events. Like a drill sargent who has got lost during a mission for his general; he doesn't know I have failed the mission, and the D.S. understand the situations, and he feels he could not return without success and suffer being court-marshalled (or something like that). I feel I probably shouldn't hang with you, because I do not meet your high expectations. And that, in itself makes me feel sad, cry and feel ashamed of myself more. Under my own will, I hope to eventually cure my Autism, bild a good amount of self-confidence and return to you a real man with medal of honor. Then I think you'll feel more proud of me, [REDACTED].\n</p><p>You are still in my thoughts and my heart, dearest friend. (:_=( Anyway, I am mentioning you in my Animation, under the name of \"Mic\"; sounds like \"Mickey\", but without the \"key\", and with a \"c\" instead of a \"k\". I also animate you with two Sackbots and a custom costume; I'll send you an in-game photo later to your PSN.\n</p><p>*sgh* Please pardon me, I have been crying for you, our friendship and your respect.\n</p><p>As for my ailment, today I have felt better, surprisingly the antibiotics didn't weigh me down, or so I thought. I had overslept and missed church, but this afternoon I went out, got some tea with lemonade (an \"Arnold Palmer\", LOL) and something to eat. After eating, I felt the blood going to my gut worse than I had felt it before (probably the side-effect of the Antibiotics); I marched forward to take a walk around Wal-Mart for a while. A later Aftershock gut pain shortened the walk, so I drove myself back home to my couch with my full big cup of tea. And now I type you this message.\n</p><p>Depending on how I feel in due time, I plan on going to the Valentine's Dance at the Key Center on the 12th (this coming Saturday), but that's still a wait-and-see.\n</p><p>I feel need to back off for now, but I'll check in again later.\n</p><p>Stay Safe, Dearest\n</p><p>Love,\n</p><p>Christian.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Tomgirl\">Tomgirl</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, May 11, 2011 at 1:37 AM\n<p>I missed you earlier tonight; I had my cellie in my reach and loud waitin' for you. You were busy; I understand.\n</p><p>Anyhoo, I had a good time at Applebees Monday. I sang \"Teenage Dream\" and \"Piece of Me\", and I really let out my feminine groove thang. A woman (older than me I think) had a lovely singing voice when she sand. I complimented her, and she thanked and hugged me. It was her first time singing apparently. I also took notice of most of the other women there; there was one in a red dress, a group of four black cuties, and one in pink AND a pink hairdoo (colored; I could tell from her dark roots). And I got encouraged after singing like I was lookin' for; someone shouted, \"You go, girl.\"  I also tried a cosmo; it was okay, but I've had better. I was also thinking of trying a daquri (I've heard of it before). You missed\nout on seeing me this time; I would like to have you in the audience anyway.  Perhaps on Friday at the Baja or another Monday at the Apple. :)\n</p><p>I couldn't get the piercing yet; it turns out I misunderstood over the phone when I called ACME earlier; they charge 45 for a naval piercing.  It was unbelieveable for me, especially after I had trouble finding it on the Corner.\n</p><p>I also bought another zebra tank during the Monday outting, and I found another denim mini my size for 8 at Sears. Manufacturers sure do get assymetrical on feminine skirt and pant sizes. As a male, I'm a 38 W, which translates roughly to 18 feminine, and the new mini, which fit me great, was a 13. What a world. I also found on clearance a pair of chained earrings \"Hannah Montanna\"­brand for only 2; I got it for the 3 pairs of charms, featuring guitars. It also had stars and hearts. I carefully removed the charms and maintained the charm rings. I like the charms to hang onto my hoops and change them whenever. I bought a set of silver hoops Tues on clearance at Target for 5; a lot Easier than the blue ones I was wearing before.\n</p><p>My Tuesday outting also included getting soap at Wal­Mart and searching for a new power cord for my mother's cell; she greatly misplaced her original.  I found a good replacement at Big Lots.\n</p><p>I figured out a new swift trick for changing clothes. I can wear pants and a tee over my skirt and tank respectively; I'm like Stripperella. I keep my hairband and bracelets in my bag with my makeup. I keep my sandals in a target cloth bag for the shoe swap in the car. Worth the trouble to keep the secret (I shouldn't really require to have, but I do for the golden oldies) from my parents.\n</p><p>On the topic, I wanted to get your opinion on something else; I'm super fine and very comfortable in the skirts, tanks and everything; I feel very empowered. I was wondering, do you feel it be a step too far if I started using the ladies'restroom?  I mean, recently, I have observed when I go into the men's room with my outfit and attitude, I feel out of place in there. Crazily, if a tomboy who takes it soo far started feeling discomfort in the ladies' room, I would not hold it against her for using the men's room.\n</p><p>Something else, Jackie has been soo detailed in her responses, as I have forwarded to you; reading it makes me feel flabbergasted; I have a hard time coming up with an appropriate response after the first read or two. It took me like three times to come up with what I responded. Internet socializing and communicating over it is such a hassle to me.\n</p><p>Also, I have been enoying the Looney Tunes Show that started up on the Cartoon Network recently. This week's episode brought Lola Bunny back into Bugs' life; it was soo fun and cute. It's title is \"Members Only\", it'll air again Saturday at 2:30 PM. I reccommend checking out the episode.  Although IMHO, it appeared to be a TOTAL persona change for Lola since \"Space Jam\"; she became a scatterbrain, and I feel that is not right for her.  Still a fun story, though. :)\n</p><p>Please call me Tonight if you can.\n</p><p>Stay Safe, \nChristian.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Tard_Rage\">Tard Rage</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Jun 21, 2011 at 10:19 PM\n<p>I'm just checking in. I have offered my introductory thoughts on the Kaka page, for June 22; consideringnthe time it was today upon posting, I felt it was appropriate to date it so.\n</p><p>I feel at unease to prattle on about the XL, so here's the skinny. The selling price for the DSi is considerably Low between GameStop and Toys R Us for 25 and 50 at the pawn shops. At Best Buy, however, there is a limited-time offer for selling a DSi there for 75 (see this week's flyer or bestbuy.com/tradein). As its value is decreasing, I felt that I simply must act as quickly as possible, yet feel grand need to keep my FlipNote data in full tact with link to the Hatena and all. The DSi XL (to be refered to as \"xl\" for the remainder of this message) has a much greater current value compared to the dsi. So, in a nutshell; I'm moving the Flipnotes to the xl, so I can sell my dsi for its greatest current value with less grief. And with that, I can stand to make equal or more than that after the 3DS FlipNote app becomes available to download (or they add the original FlipNote Studio to the eShop, whichever comes first soonest). And as a bonus, I can transfer the pre-installed two Brain Age apps (currently not already owned) to my 3DS from the xl, and I can register it for coins on my Club Nintendo account.\n</p><p>Now that I have explained it to you, I wish to hear not another word on the matter. I have my plans laid out on the payment to Fingerhut and all. I will be deleting this message after sending it.\n</p><p>Another thing for now, remember the past discussion where you mentioned Bobby got a 3DS (please confirm or correct the fact in your reply, because I also remember the tone of sarcasm and catching me in that lie at the time). If Bpbby having a 3DS is true, I wish to add him to my 3DS friends list and have him add me. My Friend Code is 2836-0121-9073, UserName: Chris Chan, and I would require his F.C. and U.N. as well, please. I have also attached the QR code for my 3DS Mii for him.\n</p><p>I will let you know of the next time to call me, but not yet. I feel for your best interest that you moniter your conversational tones and feelings, because I feel a sense of continuous sarcasm and/or feelings of mild anger in the recent conversations. I feel unease from the tone and feeling(s); I would greatly appreciate it if you would work on it, so you don't accidently come off as possibly cynical or of the sort.\nIIITTYL. Stay Safe,\n</p><p>Christian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Jun 21, 2011 at 10:50PM\n<p>Well Chris, you could have kept your original DSi and kept staring at your precious flipnotes to your heart's content, but instead you got $75 of Best Buy credit, and put yourself into $260 more debt with Fingerhut. So you're now -$185 in the hole MORE than you were before. Actually, you probably will end up paying even more than that to Fingerhut, since you'll probably only be able to afford to pay the minimum amount due each month, which will load you down with Fingerhut's ridiculous interest rates. And all so that you could gain absolutely nothing more than you already had, since you were perfectly able to keep playing flipnote on your first DSi. And you'll probably just spend that Best Buy credit on more games than you can possibly have time to play. Good money saving skills there, Chris. Totally proud of you and shit.\n</p><p>As for what you do and do not wish to hear, I don't really care. I'm not your servant who is only allowed to speak when spoken to and about what you deign is appropriate. If I feel need to make a friend face something unpleasant for his own good, then I'm going to do it. And don't bother telling me when I'm \"allowed\" to call you next. I actually have a life (you know, those things like a job, socializing, my boyfriend, so on) and don't have the time to drop what I'm doing and come listen to you gibber about make-up and demand advice, so I'll call you when I feel like calling you. Does that work for you?\n</p><p>P.S.. I'm not going to give Bobby your 3DS friend info, because 1) he's impressionable and don't want him picking up your bad habits, and 2) he's 13 years old and it's creepy for a 30-year-old man to want to be friends with a child.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Jun 22, 2011 at 12:09 AM\n<p>Wow. You've just mean-spirit-talked a friend towards something sad. SERIOUSLY, woman, you need a 'tude check and manners reeducation. It Almost makes me feel relieved that we're not a couple, because you have been most stepsister like.\n</p><p>I do not have any froends on my 3DS, and I thought we could help each other out. Oh, but, OOOOOHH, he's soo damn popular around school making mouth-talk from his navel or some rediculous class clown act.\n</p><p>How's the sex with [REDACTED]? Soo good or soo faked; you may have likely made him up along with the constant daily sex to try to make me feel fucking jealous. I can see why [REDACTED] was good friends with you before, it's because he found a super-strong tomboy brute that He wished he was for real instead of a hispanic trolling liar and con-artist.\n</p><p>I guess I am not such an intelligent individual either; I'm terrible at money-managing. I am a fucking retarded idiot. I'm married to Both my Lesbian Hands. ]:( My life is a sucky one, because I have no job and, ooh! Ooh! I have not my girlfriend face-to-face towards commitment. I do not own the car I drive. I show up at Cinderella's without a fairy godmother to tux or dress me up to dance with her. Oh, I'm on a one-way ticket to hell, because I am doing what I can to stay in the emotionally and socially costing house my seinor citizen parents own. I have been sarcastic throughout this message, minus the first paragraph, in case you haven't noticed.\n</p><p>Well who the hell are you to belittle me to make yourself better or telling me that I am better than you? Putting words into my mouth. I am slow in the head and autistic, but do what I can to get by and better myself, even though I make mistakes sometimes or often shoot myself in the foot. Is a LITTLE good natured support for my decisions or whatevet THAT hard to offer these days, even though I have my own emotional trauma dramas to constantly deal with in my own fucking head?!!!\n</p><p>'sigh\" E-mail me when you are as good-natured and Optimistic as Pinkie Pie in this generation of My Little Pony.\n</p><p>I still care about you.\n</p><p>Stay Safe,\n</p><p>Christian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Jun 22, 2011 at 2:14 PM\n<p>Wow, Chris. And you're pretty much a jerk. No, seriously. You're a big fat, lying jerk. Don't \"woman\" me. Are you trying to be derogatory? What are you, sexist now? Manner reeducation? Yes, Chris, I'm the one who needs the manner reeducation. I'm the one who constantly lies to their supposed best friend. I didn't stick around for over two years for shits and giggles. Apparently you have forgotten all the times I have TRIED to help you. I emphasize on \"tried,\" because you don't listen. You've told me countless times you will change or you \"will work on it\" or \"take it into consideration.\" And it's not because you're autistic or \"slow in the mind\" that you won't change. It's because you don't want to. No, you can't fix being autistic, but I have shown you and given you the tools to fix the things you can. But every single time you give me excuse after excuse on why you can't do it. I mean, for Christ's sake, you lied to me about working out.\n</p><p>Chris, you had the GALL to ask me for Bobby's friend code after the attitude you gave me. Why would I want him to be friends with you? His parents and I have worked hard to help him. I don't want these years of effort gone to waste. And Chris, it's extremely creepy that a 30 year old wants to be friends with a 13 year old. You two should have nothing in common besides having a 3DS.\n</p><p>And about [REDACTED], you're the one who keeps asking about him. Why would I make something up out of nowhere? You asked about the sex, so I told you about it. And it sounds like you ARE jealous if you had to bring the subject up with no basis behind it. Chris, I get laid because I don't lie to my friends, commit fraud, and actually work on a daily basis to better myself mentally and physically. No, Chris. I'm able to get laid and have friends because I stick by them. Sticking by you is what I've done for you the past two years, but you don't appreciate it. Not one bit. Or you wouldn't lie to me ALL THE TIME.\n</p><p>Chris. You're not on a one way ticket to hell because of what you just said. Apparently you stopped listening when it got too stressful for you to deal with. You're on a one way ticket to hell because you lie, commit fraud, are prejudice against people you don't even know, and you find absolutely nothing wrong with that. That's you're problem. You don't think you're in the wrong for doing it. You act like a child when called out on your bullshit and try to justify it by making up excuses. As an adult you need to say, \"I'm sorry, I shouldn't have done that\" and move on. You bitch and moan about the gays \"showing their business in your face\", but then you go and shove your tomgirl shit in everyone's face and demand they accept and respect your differences even though you won't respect theirs.\n</p><p>I mean, Chris. Whatever happened you NEVER EVER getting another credit card again? That's exactly what Fingerhut is, minus a physical card. It's the same principle; borrowing money, then having to pay back extra when you don't pay it all off at once. That's my problem with you using Fingerhut. You have admitted numerous times you have a spending problem and are a compulsive buyer. Somebody like that should NEVER use credit, because they end up spending more than they have. Chris, a good rule of thumb for using credit is never using it if you don't have the actually money to pay it all off at the time if necessary. Chris, I highly doubt you have $700-800. I tried to explain to you that you're just wasting money in the end. This was all over you trying to get $75. RIGHT NOW despite you having to eventually pay back MORE THAN DOUBLE that much. No matter how you look at it, you're losing money either way.\n</p><p>Good natured support? I'm supposed to support your unecessary and damaging buying habits? That's like supporting a drug addict or alcoholic. You honestly don't care how your actions affect other people. In the past, it has affected your parents because they had to bail you out of your debt. Ever thinking about buying your own car or your own home? Forget about that, your credit score is most likely shot. What your doing now is affecting me as well, because it's just putting the nail in the coffin of you not caring what other people say if it doesn't go along with what you want.\n</p><p>I have supported you over the past two years. I supported your safe endeavors, like recently, with you being a tomgirl. Or you being with Jackie. Those things should HELP you either discover yourself and/or make you a better person. When I first met you, I saw a bright, creative individual. Sure, you had your flaws, but those could have been fixed with support from a friend. But as time rolled by, I realized how much of a selfish, lazy jerk you are. You don't want to improve yourself. You want others to do the work for you. In the past when I gave you the tools to help yourself, you expected me to do ALL the work. Even now, you want others to do all the work for you. Do you think people get fit or get jobs or significant others because it was handed to them? Hell, no. People work hard for those things, yet you think you're a special snowflake who deserves to have everything handed to him. Nobody is going to hand you a job, a house, a car, etc. In the past you have expected Jackie to make all the effort in the relationship. You expected her to come to you, despite her being busy with school. And don't give me the bullshit that you're afraid of your parents kicking you out. No they won't. You're their last child who hasn't left them yet. Do you honestly think they're going to kick you out? They might scare you and say they will, but they'll just turn around and accept you back. They control you because you let them. And you love to let them, because you can use that \"they'll kick me out\" bullshit as an excuse to not do anything.\n</p><p>I'm sure at this point you're wondering why I even bother to be your friend. It's because I care. And see hope. There have been times when you have made improvements. In a sense, you took a step forward, but then something would come up and the idea of working to keep moving forward would seem less appealing, so in the end you take two steps back. But this is the last straw, Chris. No more lying. I can't be friends with somebody who consistently lies to me to avoid getting in trouble. Chris, you lie because you know what you did was wrong and you're trying to avoid the consequences. Grow up. I wouldn't be a friend if I didn't tell you when you were wrong. If let you do whatever you pleased and let you keep hurting yourself, then in a sense I would be a troll. And I do not want to be a troll in your life.\n</p><p>So, Chris. When you actually want to talk to a real friend then send me an email back. Until then, feel free to complain to all your other friends about how horrible and mean I am for not being a doormat to\nyour delusions.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Lost_Inspiration_for_Sonichu\">Lost Inspiration for Sonichu</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sat, Dec 17, 2011 at 10:09 AM\n<p>Hey, [REDACTED]. I'm just sittin' here at McD, with a peppermint mocha, just had some chicken noodle soup; just completed today's sudoku puzzle in the Post paper, and I've been thinking about life.\n</p><p>Three or four people I did not know at all showed up, and stupidly acknowledged me, during my court date thursday; obvious trolls. I don't know, I think all of these people originally hated me, because I stopped drawing, then they found more reasons to hate me for the sake of hatred. I lost my inspiration; Why can't these people accept that and stop hating me with the online shit smear campaign.\n</p><p>I REALLY do want to go back to the world of Sonichu I created and draw/write more stories. But the mixture of 90-to-10 hatred and kindness, with the frigging blackmail, deception and all... My father passing away... My having to tend to my mother... Michael, his Trap, and the Court shit... Having had bronchitis... and the topper, NO GIRLFRIENDISWEETHEART. I feel greatest difficulty in finding the creative inspiration all over again. *sigh*\n</p><p>It makes me feel sad, down and depressed, with Only gaming distractions to best take my mind off of real life. If only those idiot Trolls would just understand that I am only one human; creative inspiration only best comes from 100 Percent POSITIVE ENCOURAGEMENT: REMOVE ALL of their hate-filled websites, pages, images, videos, audio and whatever, simply just leave me, my family and life be, and mind their own individual bees' wax and business..., then maybe I can find inner peace, happiness, a girlfriend, And my creative inspiration to draw, color and write. &lt;:( *sigh*\n</p><p>Thanks for listening to my venting. You and [REDACTED] and yours have a very Merry Christmas.\n</p><p>Stay Safe.\n</p><p>Still recovering from sickness and emotions,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"The_Hooker_and_a_Court_Date\">The Hooker and a Court Date</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Fri, Apr 6, 2012 at 3:55AM\n<p>Right before getting out of my car, I had the radio on at Z-95.1; Katy Perry's \"Teenage Dream\" was playing at that moment. And Right after I left, after starting the vehicle, Kelly Clarkson's \"Stronger (What Doesn't Kill You)\" played. If you think about it, at the right times of the occasion, BOTH tracks were soo appropriate and spot-on. Also, the night before, I rewatched the \"My Little Pony - Friendship Is Magic\" episode, 2-18: \"A Friend in Deed\"; Pinkie Pie sings her delightful \"Smile\" Song, so in relation, it was playing in my head at times during the day, and it still comes up upon the recall of the whole.\n</p><p>And yesterday, the 5th, having all of the pleasant goodness of Mia sexing me up, her likeable friendliness and everything, it really helped me throughout the troubling Court Date (Hearing). I have had to put up with Snyder telling his side of the testimony. He still lies about me and mom hitting him with the van, and even worse, he adds a Third Hit that \"Sent him flying through the air\". I made my disagreement obvious as stated my \"Uh-uh\"s, \"No\"s and left-to-right head shakes; audio backed up on a recorder the judge used, and I can bet there is a camera or more in the courtroom. There were at least 3 or 5 additional instances where the bastard lied within, and his own adding into, what had transpired.\n</p><p>And unfortunately, while I still am out of jail, the whole process is still being belabored; mom and I, we have another court date in two weeks to schedule another court date to follow in about two months at the most. Eventually, mom and I will present our testimony, and it is well good that Rob speaks and deals on our behalf. And Snyder got his renewed Protective Order, even though after hearing the reasons, with the Facts that I, myself, acted NOT Violently, but Cowardly on the 10/28/2011 day, the \"Owner of a Toy Shop\" got his way, mom, Rob and agreed amongst ourselves that the bastard does not deserve it at all. But, on the other hand, Snyder did have a number of slip-ups in giving his testimony; slipping out a few incriminating details about himself, so as long as mom and I keep our distance from him, and our noses clean, we may get out of this yet. But the wire is thin on Me.\n</p><p>Well, I have had the down emotions during the excruciating greater-than-three-hours there, but after leaving and some distance away from the building, recalled the events of Wednesday Afternoon, and perked up and smiled again. I Had Sex. I Had Sex. Yes I Did. Yes I Did. (: D\n</p><p>I will delete this e-mail from my end, and trust you to keep the details in strictest of confidentiality.\n</p><p>Please reply with your thoughts from reading the previous e-mail; look forward in delight to reading your thoughts and input. :)\n</p><p>Stay Safe, Christian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Thu, Apr 12, 2012 at 1:07 AM\n<p>I haven't heard back from you for like a week.\n</p><p>I have been feeling more self-confident since I had sex with Mia. I gave her a gift basket with three apples, lavender air-freshener, breath mints, a 4-gig flash drive with the track sets of the 1990 WTJU jazz marathon, Teenage Dream and Stronger (What Doesn't Kill You) ablum tracks, and a Hello Kitty Pez Dispenser to show her my appreciation for the best introductory sexual experience ever, new friendship and new-found self-confidence. I will be hanging out with her again after she gets back into town; more conversation, maybe some lunch; whatever. I can talk with her more about the Cherokee Tribe. She has given me more reasons to Smile a Lot.\n</p><p>I have also made more social progress recently by flirting with a pretty banker at the local Kroger's inside bank; Recognizing facial expressions towards the positive is a great, and flattering, ice-breaker. Although finding a number of strict, sad and lonely faces is a bit of a downer. Progress is progress.\n</p><p>I also went to Redoak with my mother on vacation last weekend; I hung with her while she planted new bulbs by her father and Corina's graves. We stayed in a hotel on the lake in Clarksville; she always wanted to enjoy a hotel stay, and she did.\n</p><p>BTW, I told Rocky half about that as well yesterday; I did not mention Mia's name, OR the details of the act. And while I have told mom about Mia, I half-lied to her about how we met; I told her that Mia and I met at Wal-Mart, had the pleasant conversation and exchanged phone numbers. My mother would freak if I told her that I paid for sex.\n</p><p>Anyway, please reply and let me know what's been good with you and Phil, and please let me know what came to mind after reading the details of my first time.\n</p><p>TTYL, and Stay Safe; Christian W. Chandler.\n</p><p>I owe you one as well for that. :)\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Thu, Apr 12, 2012 at 5:32AM\n<p>Fwd: Another thing \n—-Original Message—— From: Christian Weston Chandler &lt;chrischansonichuGaol.com.&gt;\n</p><p>Before meeting up with Mia, I went to Ultimate Bliss for information on finding the female escorts, this was before trying Mia on the phone; I found a printed flyer on MTV Inexperienced Young Adults Auditions (on the electronic-locking door). I sent them an e-mail recently with interest in finding my Sweetheart.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Fri, Apr 13, 2012 at 9:35PM\n<p>I have made my final decision; I will make up an open note confirming the unvirgin fact, and as long as they do no get the whole truth, they still have nohing on me, and the can't hold the prolonged virginity over my head anymore.\n</p><p>Thank you, TTYL, and Stay Safe. Chrstian.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Sat, Apr 14, 2012 at 7:21 PM\n<p>Yes, it IS frustrating to deal with mixed signals in communication; a misunderstanding is common in causing fights and wars. The best we can do is attempt to clear away the misunderstandings towards a clear and better understanding towards peace. And you Have stuck by me a long time in keeping communication and keeping close in our friendship, and for that, I am truly grateful.\n</p><p>I have also hung out with Mia again today; treated her to a pleasant and good lunch and another good amount of conversation. We got to know each other a little better. Then after returning her to her hotel room, I gave her another little donation towards her funding, and gave her the Missionary. I am Naturally Really Good; a Lot better than had thought before. If I may state, you really missed out on having this bad boy, that has felt tightness within a pussy that gave birth to two girls beforehand; I'd say that hallway would be loosing all of the doors off their hinges with my penetration, relatively speaking (referencing to the \"Robot Chicken\" sketch with the woman tossing a wiener down a hallway in front her boyfriend; look it up on YouTube). \nhttp://ww.youtube.com/watch?v=fEAbPt|42ZE\n</p><p>And I have just watched The (New) Three Stooges Movie; it was a lot of laughs, it had a fair set of plots, and I feel the actors captured the essence of the original Moe, Larry and Curly very well. It was neat seeing Larry and Curly watching Moe giving the MTV Jersey Shore gang the pokes, slaps and gags. And the placement of the classic theme song and Act Cards (out of three) were well-placed. And all of the classic references make this movie a real feat for the classic reproduction. Oh, and it had scandal, attempted murder, and a \"Dizzy Doctor\" bit with mishapped diaper changes that ended up in a water pistol fight.\n</p><p>It was very good. :)\n</p><p>I will be deleting this e-mail from my end, so please delete the original text when replying, or start a fresh e-mail.\n</p><p>TTYL, and Stay Safe, Christian. :)\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Apr 17, 2012 at 7:19 PM To: chrischansonichuGaol.com\n<p>I'm glad you had another great time with Mia. :) Any future plans with her? How much did you pay her the last time? It doesn't sound as much the way you phrased it. I bet she gave you a discount as a repeat customer, lol\n</p><p>Anyhow, didn't you have to go to court the other day? How did that go? Honestly, the way you phrased your Facebook status, it got me worried that it didn't go so hot....Just let me know you and your mother are doing okay. As long as you did nothing wrong, then the justice system will see that you and your mom are innocent, so don't give up hope. There's that saying, \"what doesn't kill you makes you stronger.\" Just remember there's a light at the end of the tunnel (and possibly more fun times with Mia. ;)).\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Apr 17, 2012 at 11:06 PM\n<p>Firstly, and actually, I paid her 15 minute rate last time, which was 80. I will be seeing Mia again to get some flirting advice and tips, because recently when I tried my ice-breaker of being contemplative on a couple of women's faces, I blanked a bit, lost my place and had to recover, and stuttered a bit. I also plan on getting some more professional kissing practice and input from either Mia or one of her gal friends (she's not fond of tongues in mouth; she is a spot of a germ phobe too, like me). I can't help but feel for her in her situation, like the number of female escorts; she sets a goal of making 3,000 before Saturday to rewards herself with a weekend off. I mean, at the most, she would have to get business from eight people a day to a total of 40 a week. And considering the varying personalities and all, THAT is really tough. But she Really is a good, nice and compassionate woman, and she really appreciates the kind and understanding person that I am. :)\n</p><p>On the recent Twitter topic, aside from the Trolls getting that tweet I made after the court date, which went fine; only the waiting was excruciating. I found from the talk pages of the Cwcki on the subject of my sexual intercourse, between the \"facebook\" and \"Virgin With Rage\" pages, I laugh now at their crazy talk and theories. I found they get their info from the admin, \"Cogsdev\", who has a Twitter account, and that was the main reason why I reactivated my account there, to look up her tweets (learned she was a woman from her user page). The trolls' theory of me \"spending 250 dollars on a prostitute\" spawned from @cogsdev; I do not know where she got that idea from, other than making it up, because I Never used the terms of \"spending\" or \"prostitute\" in the sourced facebook entry and Note I typed. I followed her tweets and links within, and could not find much on her source of information. So, earlier today, I Direct Messaged her, asking simply, \"What makes you think that I \"Hired a Prostitute?\" I had the good feeling in sending that message, as well as the Note I earlier typed on facebook. I really shocked the bitch, and gave the Trolls another thing to worry about from me. I am finally giving THEM a scare back; it is to laugh. ::j\n</p><p>I have a couple of thoughts to offer in your vacation paragraph. \"Relax or Party\"; that is a question. It depends on what you really feel. Do you really feel that you have been pestered, bothered or such from at least 5 or 10 people? Or do you feel that your life has been considerably repetitive and needs something zesty and fresh? I feel it good to analyze the recent events of your life, so you can get a better idea towards your answer of \"To Relax or to Party\". Also, I have heard of Ocean City, but what is \"Nags\"? I have never heard of that place before.\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"Purpose_in_life.3F\"></span><span class=\"mw-headline\" id=\"Purpose_in_life?\">Purpose in life?</span></h2>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Everything has been doom and gloom these past few weeks. Don't get me wrong, I'll always been here to listen and help with your problems,\n<p>but I also like to hear about the happy things as well. I enjoy\nreading about your day. :) The other day you posted about your mom\ngoing to the hospital. Is she doing okay now? I'm sure the puppies are\nlike therapy to her. What about you? I know you've been really\nstressing about leaving the house because of the trolls, but have you\nbeen going out some? Being cooped up all day isn't good for you\nhealth.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Mon, Jun 4, 2012 at 12:50 AM\n<p>Mom is fair; she is mostly recovered from pnumonia again. She currently has more energy than I do. The puppies are healthy, strong and mostly well­-behaved.\n</p><p>I really, Really, REALLY pray, hope, and wish everything was NOT frigging doom and gloom with me either. I Wish I was NOT Hated and Feared by the entire world for the wrong reasons, as it has been.\n</p><p>I am soo tired from stress, it is harder for me to maintain focus in thought. I feel like I just want to go ahead and die naturally, unless the stress kills me first, and I am not going to commit suicide of any sort. At least I don't have to worry about dying a virgin. I feel like my dream of starting up a family with my future sweetheart and having our Crystal daughter is not going to be realized, or come true.\n</p><p>We do get out; it was just for June second that I had to stay at home to remove me from any suspicion by the damn Jerkops. We have no respect for the local \"police\". I slept most of the day away after staying awake for a long while worrying; I crashed at about 8:00 AM.\n</p><p>My only great purpose now is for my mother, our two cats, and our two puppies; NO Girlfriend/Sweetheart, as freaking promised from multiple dreams, for Christian Weston Chandler. Only hatred, fear, discrimination, and a whole wide world of extreme, unjustifiable shit... lies in the wake of my once good name.\n</p><p>Nobody really, truly understands me. I am sad, confused, lost,... I do not understand.\n</p><p>Stay Safe with Peace,\nChristian W. Chandler\n(sent from my iPod)\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Dogs\">Dogs</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Oct 8, 2012 at 8:50PM\n<p>I feel old sometimes to often as well. As for me, it has been in and out for my mother and/or myself. Our dogs have grown; they are stronger too. They both need some serious training, and my mom recently met, and flirted with, a verified \"Smith\" who is a pro dog trainer. He offered to train the beagles for a discount from his original rate. She is still planning on deciding when to take the dogs to him. Aside from that, I find a better peace of mind from building with Lego sets and playing video games here, as well as my weekly meets with Rocky, the dogs when they are being good, snugly, entertaining and comforting; we would not take an infinite amount of money for them, and the on and off comforting of my mother.\n</p><p>On the other topic, I have sent Anna the email, and I have checked my Facebook. I think my account was compromised as well, because a friend Request was sent from my account to an obvious Troll and accepted behind my back. I unfriended the Troll and changed my password immediately. Right before, I have also found the leaked F.B. photos and stuff from my page on the Cwcki Forum; nothing on the Cwcki website yet. As far as I found, no one has put 2 and 2 together yet from the photos of my Lego house that I had moved from upstairs to downstairs.\n</p><p>IDK a lot of things, and my mid is constantly a blank...\n</p><p>Keep talking to me now and then, please.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Mon, Oct 8, 2012 at 9:00 PM\n<p>I know we've lost touch for a bit. Life is so hectic! What kind of problems are your pups giving you? Are you going somewhere for dog training or is he coming to your house? And lol, how funny that your mom was flirting with the dog trainer. :) I did training on my own with my own dogs. I think they're doing good! Right now I'm booking my rooms for Magfest. Last Magfest was great! And the hotel was absolutely beautiful because they had their Christmas stuff still up. You and your mom should go to Magfest. Even though your mom probably won't enjoy the actual activities of Magfest, she can relax for the Weekend. The rooms are so nice.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Tue, Oct 9, 2012 at 11:12 PM\n<p>Among which, when the pups misbehave, they will jump up wildly on one of us, they grow, bark, fight viciously with each other (spot of wolf in them), reach up for things to steal and destroy, etc. But most of the time, they are very good dogs.\n</p><p>I am not able to make long distant (very far from the house) plans, at least until if and when we get the pen cleaned up, get a new doghouse built in it, and let the dogs be free in there, And after we are able to see Christmas Day this year (12/22/2012 theory(ies)). I am concerned about that, yes (going to wait it out on the date inside).\n</p><p>BTW, Anna replied informing me that her password was More complicated, and hacking was unlikely, but she is keeping her eyes and ears open; hoping that hacking was a lie. After that friend request from my account sent behind my back, I tend to think they got into My account instead and trying to shift the blame onto her. All they got were screencaps from my page. Upon my next feeling, I will soon make a new post to watch for re-screencapping. Plus, I have a plan for forcing the idiots to realize that all I have for them is Nothing and make them get tired of me more quickly.\n</p><p>Sent from my iPhone\n</p><p>Stay Safe,\n</p><p>Christian W. Chandler\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wed, Oct 10, 2012 at 10:06 PM\n<p>Have you gotten your pups fixed? If not, then that might be a big factor into their behavioral issues. Also, if you haven't gotten them fixed then you're running the risk of them breeding and having puppies between brother and sister. You can probably buy a doghouse that's reliable and cheap at maybe WalMart or PetSmart. Since the weather is nicer, take them out for longer walks to wear them out. They're still puppies, so they definitely still have a lot of pent up energy that needs to be drawn out of them.\n</p><p>But anyways, I'm only worried that Anna got hacked because the screencaps the have been released of your Facebook features Anna's Facebook icon next to the comment bar. I'll upload a picture of the screencap as an example. It has to be a hacker, because despite Anna and I having our clashes I trust your judgement in people and friends.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Thu, Oct 11, 2012 at 3:48 PM\n<p>Yes, both dogs have been fixed months ago. I thank you for your compliment on my judgment of good people, but my mental capabilities are not as strong as they used to be, plus add all of the paranoia I have accumulated.\n</p><p>I've just checked on the forums, and sho'nuf, they \"capped the last post I made. :( Still thinking... I will reply to your next email.\n</p><p>Sent from my iPhone Stay Safe, Christian W. Chandler\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background: #CEF2CE; border:1px dotted #A3BFA3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Thu, Oct 11, 2012 at 8:53 PM\n<p>That's good they've been fixed. Since they are still very young, I recommend taking them out for longer walks in the evening. Switch the route up every once in a while to keep things fresh and it'll be a new adventure for them. If you keep them cooped up in the house, they're going to have pent up energy that's going to turn into bad behavior. Beagles are generally high energy breeds and very inquisitive because of their hound blood. The biggest thing when it comes to training dogs is to ignore the bad behavior and reward for the good. Anyways, since were on the topic of pets I know a while ago you took your dogs to PetSmart to get groomed? How was it there? I'm looking for a new place to take my dogs since Petco is pretty pricey.\nBesides your doggie dilemma how have you been?\n</p>\n</td></tr></tbody></table>\n<table class=\"mw-collapsible mw-collapsed\" style=\"border:1px solid #aaa; background-color:#f9f9f9; padding:5px; font-size:95%; clear:both; margin:0 auto; width:75%;\">\n<tbody><tr>\n<th style=\"background-color:#ccf;\">Gallery\n</th></tr>\n<tr>\n<td><center><ul class=\"gallery mw-gallery-traditional\">\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_110115_-_Barb_vs_Madison_plans1.jpg\"><img alt=\"Galpal 110115 - Barb vs Madison plans1.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/9/9c/Galpal_110115_-_Barb_vs_Madison_plans1.jpg/93px-Galpal_110115_-_Barb_vs_Madison_plans1.jpg\" srcset=\"/w/images/thumb/9/9c/Galpal_110115_-_Barb_vs_Madison_plans1.jpg/139px-Galpal_110115_-_Barb_vs_Madison_plans1.jpg 1.5x, /w/images/thumb/9/9c/Galpal_110115_-_Barb_vs_Madison_plans1.jpg/185px-Galpal_110115_-_Barb_vs_Madison_plans1.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_110115_-_Barb_vs_Magfest_plans2.jpg\"><img alt=\"Galpal 110115 - Barb vs Magfest plans2.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/4/4f/Galpal_110115_-_Barb_vs_Magfest_plans2.jpg/93px-Galpal_110115_-_Barb_vs_Magfest_plans2.jpg\" srcset=\"/w/images/thumb/4/4f/Galpal_110115_-_Barb_vs_Magfest_plans2.jpg/139px-Galpal_110115_-_Barb_vs_Magfest_plans2.jpg 1.5x, /w/images/thumb/4/4f/Galpal_110115_-_Barb_vs_Magfest_plans2.jpg/185px-Galpal_110115_-_Barb_vs_Magfest_plans2.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_110115_-_Barb_vs_Magfest_plans3.jpg\"><img alt=\"Galpal 110115 - Barb vs Magfest plans3.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/8/88/Galpal_110115_-_Barb_vs_Magfest_plans3.jpg/93px-Galpal_110115_-_Barb_vs_Magfest_plans3.jpg\" srcset=\"/w/images/thumb/8/88/Galpal_110115_-_Barb_vs_Magfest_plans3.jpg/139px-Galpal_110115_-_Barb_vs_Magfest_plans3.jpg 1.5x, /w/images/thumb/8/88/Galpal_110115_-_Barb_vs_Magfest_plans3.jpg/185px-Galpal_110115_-_Barb_vs_Magfest_plans3.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_110206_-_UTI.jpg\"><img alt=\"Galpal 110206 - UTI.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/2/2a/Galpal_110206_-_UTI.jpg/93px-Galpal_110206_-_UTI.jpg\" srcset=\"/w/images/thumb/2/2a/Galpal_110206_-_UTI.jpg/139px-Galpal_110206_-_UTI.jpg 1.5x, /w/images/thumb/2/2a/Galpal_110206_-_UTI.jpg/185px-Galpal_110206_-_UTI.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_110206_-_UTI2.jpg\"><img alt=\"Galpal 110206 - UTI2.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/d/df/Galpal_110206_-_UTI2.jpg/93px-Galpal_110206_-_UTI2.jpg\" srcset=\"/w/images/thumb/d/df/Galpal_110206_-_UTI2.jpg/139px-Galpal_110206_-_UTI2.jpg 1.5x, /w/images/thumb/d/df/Galpal_110206_-_UTI2.jpg/185px-Galpal_110206_-_UTI2.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg\"><img alt=\"Galpal 111217 - Lost Inspiration for Sonichu.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/3/3c/Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg/93px-Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg\" srcset=\"/w/images/thumb/3/3c/Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg/139px-Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg 1.5x, /w/images/thumb/3/3c/Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg/185px-Galpal_111217_-_Lost_Inspiration_for_Sonichu.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_120604_-_Doom_and_Gloom.jpg\"><img alt=\"Galpal 120604 - Doom and Gloom.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/5/55/Galpal_120604_-_Doom_and_Gloom.jpg/93px-Galpal_120604_-_Doom_and_Gloom.jpg\" srcset=\"/w/images/thumb/5/55/Galpal_120604_-_Doom_and_Gloom.jpg/139px-Galpal_120604_-_Doom_and_Gloom.jpg 1.5x, /w/images/thumb/5/55/Galpal_120604_-_Doom_and_Gloom.jpg/185px-Galpal_120604_-_Doom_and_Gloom.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_121011_-_Dogs1.jpg\"><img alt=\"Galpal 121011 - Dogs1.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/c/c3/Galpal_121011_-_Dogs1.jpg/93px-Galpal_121011_-_Dogs1.jpg\" srcset=\"/w/images/thumb/c/c3/Galpal_121011_-_Dogs1.jpg/139px-Galpal_121011_-_Dogs1.jpg 1.5x, /w/images/thumb/c/c3/Galpal_121011_-_Dogs1.jpg/185px-Galpal_121011_-_Dogs1.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_121011_-_Dogs2.jpg\"><img alt=\"Galpal 121011 - Dogs2.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/f/fe/Galpal_121011_-_Dogs2.jpg/93px-Galpal_121011_-_Dogs2.jpg\" srcset=\"/w/images/thumb/f/fe/Galpal_121011_-_Dogs2.jpg/139px-Galpal_121011_-_Dogs2.jpg 1.5x, /w/images/thumb/f/fe/Galpal_121011_-_Dogs2.jpg/185px-Galpal_121011_-_Dogs2.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n<li class=\"gallerybox\" style=\"width: 155px\"><div style=\"width: 155px\">\n<div class=\"thumb\" style=\"width: 150px;\"><div style=\"margin:15px auto;\"><a class=\"image\" href=\"/cwcki/File:Galpal_121011_-_Dogs3.jpg\"><img alt=\"Galpal 121011 - Dogs3.jpg\" decoding=\"async\" height=\"120\" src=\"/w/images/thumb/c/c4/Galpal_121011_-_Dogs3.jpg/93px-Galpal_121011_-_Dogs3.jpg\" srcset=\"/w/images/thumb/c/c4/Galpal_121011_-_Dogs3.jpg/139px-Galpal_121011_-_Dogs3.jpg 1.5x, /w/images/thumb/c/c4/Galpal_121011_-_Dogs3.jpg/185px-Galpal_121011_-_Dogs3.jpg 2x\" width=\"93\"/></a></div></div>\n<div class=\"gallerytext\">\n</div>\n</div></li>\n</ul></center>\n</td></tr></tbody></table>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"65%\">\n<tbody><tr align=\"center\" style=\"background:#00FF00\">\n<td colspan=\"3\"><b><a class=\"image\" href=\"/cwcki/File:MITPS.png\"><img alt=\"MITPS.png\" decoding=\"async\" height=\"32\" src=\"/w/images/0/0b/MITPS.png\" width=\"32\"/></a> <a href=\"/cwcki/Emily\" title=\"Emily\"><span style=\"color:white;\">Emily Saga</span></a> <a class=\"image\" href=\"/cwcki/File:MITPS.png\"><img alt=\"MITPS.png\" decoding=\"async\" height=\"32\" src=\"/w/images/0/0b/MITPS.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<td colspan=\"7\"><center><span style=\"font-size:150%\"><b>The Players</b></span></center>\n<p><b>People:</b> <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> • <a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a> (<a href=\"/cwcki/Emily\" title=\"Emily\">Emily</a> • <a href=\"/cwcki/Kim_Wilson\" title=\"Kim Wilson\">Kim Wilson</a> • <a href=\"/cwcki/Disguises\" title=\"Disguises\">Unknown Gal-pals</a>) • <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Bob Chandler</a> • <a href=\"/cwcki/Man_in_the_Pickle_Suit\" title=\"Man in the Pickle Suit\">Man in the Pickle Suit</a> • <a href=\"/cwcki/Magical_Man\" title=\"Magical Man\">Magical Man</a> • <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a> • <a href=\"/cwcki/Faeryn\" title=\"Faeryn\">Faeryn</a> • <a href=\"/cwcki/Robert_Simmons_V\" title=\"Robert Simmons V\">Robert Simmons V</a> • <a href=\"/cwcki/Bryan_Bash\" title=\"Bryan Bash\">Bryan Bash</a> • <a href=\"/cwcki/Statustjej\" title=\"Statustjej\">Statustjej</a><br/>\n</p>\n<hr/>\n</td></tr>\n<tr>\n<th align=\"left\">LoveYouLongTime:\n</th>\n<th align=\"left\">Emily:\n</th>\n<th align=\"left\">Kim:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li>E-mails (<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a class=\"mw-selflink selflink\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a>)</li>\n<li><a href=\"/cwcki/Kiwi_Farms_posts_(LoveYouLongTime)\" title=\"Kiwi Farms posts (LoveYouLongTime)\">Kiwi Farms Posts</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Church_audio\" title=\"Church audio\">Church Visit</a></li>\n<li><a href=\"/cwcki/Date_with_Emily\" title=\"Date with Emily\">Date with Emily</a></li>\n<li><a href=\"/cwcki/Hooker_incident\" title=\"Hooker incident\">Hooker incident</a></li>\n<li><a href=\"/cwcki/Sign_Destruction_Video\" title=\"Sign Destruction Video\">Sign Destruction Video</a></li>\n<li><a href=\"/cwcki/Man_in_the_Pickle_Suit#Videos\" title=\"Man in the Pickle Suit\">A Message to Chris Chan. From an old friend.</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/Chris%27s_Big_Night_Out\" title=\"Chris's Big Night Out\">Chris's Big Night Out</a></li>\n<li><a href=\"/cwcki/Chris%27s_Big_Night_Out_II\" title=\"Chris's Big Night Out II\">Chris's Big Night Out II</a></li>\n<li><a href=\"/cwcki/Rollin%27_and_Trollin%27\" title=\"Rollin' and Trollin'\">Rollin' and Trollin'</a></li>\n<li><a href=\"/cwcki/Magical_Man_Potion\" title=\"Magical Man Potion\">Magical Man Potion</a></li>\n<li><a href=\"/cwcki/PVCC_NEW_info:_on_Chris_and_Barbara_spoon_eachother!\" title=\"PVCC NEW info: on Chris and Barbara spoon eachother!\">Confirmation of spooning</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"3\"><b>Coinciding Sagas:</b> <a href=\"/cwcki/Template:ClydeCashSaga\" title=\"Template:ClydeCashSaga\"><span style=\"color:#FF0000\"><b>Clyde Cash</b></span></a>, <a href=\"/cwcki/Template:LiquidSaga\" title=\"Template:LiquidSaga\"><span style=\"color:#8b4513\"><b>Liquid</b></span></a>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a class=\"mw-selflink selflink\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a href=\"/cwcki/White_knight_E-mails\" title=\"White knight E-mails\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251023012806\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.223 seconds\nReal time usage: 0.248 seconds\nPreprocessor visited node count: 1529/1000000\nPost‐expand include size: 91501/2097152 bytes\nTemplate argument size: 62783/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 8192/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%  135.770      1 -total\n 38.06%   51.675      1 Template:Emails\n 32.23%   43.755      1 Template:Navbox\n 30.50%   41.415      1 Template:Collapsible\n 22.06%   29.951      1 Template:SonichuGirlsSaga\n 16.86%   22.890      2 Template:Saga\n 10.16%   13.793      8 Template:Saga/core\n  4.75%    6.454     17 Template:Quotebox\n  4.62%    6.272      2 Template:Color\n  3.16%    4.286      1 Template:Tnavbar\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23611-0!canonical and timestamp 20251023012806 and revision id 301053. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=LoveYouLongTime_E-mails,_2011-2012&amp;oldid=301053\">http://sonichu.com/w/index.php?title=LoveYouLongTime_E-mails,_2011-2012&amp;oldid=301053</a>\"</div></div>",
  "categories": [
    "Category",
    "E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "2007",
    "57",
    "MHS classmate E-mails",
    "Statustjej",
    "Sydney Contacts",
    "White knight E-mails",
    "Unknown Gal-pals",
    "43",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "60",
    "Megan Schroeder",
    "44",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "40",
    "Faeryn",
    "56",
    "39",
    "Mailbag",
    "21",
    "9",
    "Chris's Big Night Out",
    "Vivian Gee",
    "Common Questions",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "Magical Man Potion",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "25",
    "15",
    "59",
    "49",
    "53",
    "2010",
    "Jackie Romy",
    "Kim Wilson",
    "Regina e-mails",
    "52",
    "Blanca Weiss",
    "42",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "17",
    "Man in the Pickle Suit",
    "35",
    "Magical Man",
    "47",
    "Date with Emily",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "stress",
    "31",
    "18",
    "Aug",
    "Kiwi Farms Posts",
    "Gregg Mays",
    "Clyde Cash",
    "4",
    "36",
    "Bob Chandler",
    "Midlothian",
    "Catherine E-mails",
    "48",
    "Chris's Big Night Out II",
    "Bryan Bash",
    "19",
    "Hooker incident",
    "Rollin' and Trollin'",
    "2004‒06",
    "Emily",
    "Letter",
    "50",
    "Robert Simmons V",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "8",
    "wal-mart",
    "10",
    "2",
    "Rocky",
    "2008",
    "2013-2014‎",
    "Charlottesville",
    "Clyde E-mails",
    "Sign Destruction Video",
    "Uri Geller E-mails",
    "Tito",
    "3",
    "46",
    "7",
    "Misc E-mails",
    "2007‒08",
    "Church Visit",
    "11",
    "23",
    "37",
    "26",
    "Thetan",
    "2009",
    "13",
    "61",
    "45",
    "29",
    "32",
    "24",
    "Open Relationship E-mails",
    "Chris",
    "Jack Thaddeus",
    "Troll",
    "30",
    "58",
    "Samantha Thaddeus",
    "The Wallflower",
    "1",
    "28",
    "34",
    "Miyamoto Saga",
    "38",
    "41",
    "20",
    "Ruckersville",
    "Jan‒July 2007",
    "Evan E-mails",
    "62",
    "Savannah Chandler Messages",
    "55",
    "33",
    "16",
    "6",
    "Emily Saga",
    "Sept"
  ],
  "scraped_at": "2025-11-26T15:51:01.162105"
}