{
  "url": "https://sonichu.com/cwcki/Mumble_3",
  "title": "Mumble 3",
  "display_title": "Mumble 3",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Mumble 3</b> is the third of the <a href=\"/cwcki/Mumble\" title=\"Mumble\">Mumble</a> chats involving <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>. It was held on 5 <a href=\"/cwcki/February_2009\" title=\"February 2009\">February 2009</a>, and continued in <a href=\"/cwcki/Mumble_3.5\" title=\"Mumble 3.5\">Mumble 3.5</a>.\n</p><p>Length: <b>2:51:34</b>\n</p>\n<h2><span class=\"mw-headline\" id=\"Synopsis\">Synopsis</span></h2>\n<p>The third Mumble chat begins with with small talk between Chris and <a class=\"mw-redirect\" href=\"/cwcki/Julie\" title=\"Julie\">Julie</a>, punctuated by loss of audio in places, macaroni cheese, money and passwords. <a class=\"mw-redirect\" href=\"/cwcki/Clyde\" title=\"Clyde\">Clyde</a>, at this point, is flashing in and out of the conversation, without actually making an appearance until the later stages. <a href=\"/cwcki/Molvan%C3%AEa\" title=\"Molvanîa\">Molvanîa</a> has been destroyed, it turns out. Julie almost blows her cover a couple of times while referring to \"Cameron\", who seems to continuously <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">change gender</a>. We also discover that all of Chris's female creations think that he’s handsome, just like <a class=\"mw-redirect\" href=\"/cwcki/Snorlax\" title=\"Snorlax\">Barb</a> does. This would appear to be the reason why he <a class=\"mw-redirect\" href=\"/cwcki/Love_quest\" title=\"Love quest\">can’t understand why he’s single</a>. Clyde makes a cameo appearance. Julie is getting paranoid, believing that Clyde is out to get her, and she wants Chris to protect her. Chris seems unworried by Julie voicing her fears about a knife wielding Clyde Cash coming to get her, even when she is sure he's out side her house. Julie and Chris agree to take each other's virginity and imagine their first time together. Chris promises to try hard not to prematurely ejaculate. Clyde appears and reveals he's heard everything. The two threaten and try to psychoanalyze each other. Clyde denigrates Chris's existence and questions in detail how he'll support Julie or even himself, casting serious doubt on Chris's life skills. Clyde forces Chris to make <a href=\"/cwcki/Chris_Comes_Out_of_the_Closet\" title=\"Chris Comes Out of the Closet\">a video saying that he's gay</a>, threatening to harm Julie if he doesn't.\n</p>\n<h2><span class=\"mw-headline\" id=\"Summary\">Summary</span></h2>\n<p>The chat is quite long, weighing in at nearly two and a half hours, and is one of the longest Mumble chats. It is unknown how the trolls kept Chris on for so long. \n</p><p>Chief talking points are as follows:\n</p>\n<ul><li>Chris and Julie log for a private chat. There appears to be some problem with the audio cutting out.</li>\n<li>Julie blames the global financial crisis for her not being able to visit. Chris accepts this.</li>\n<li>Small talk: Julie is a very good cook. Julie has her <a href=\"/cwcki/Sonichu_Girls\" title=\"Sonichu Girls\">Sonichu Girls</a> password back.</li>\n<li>Julie wants to talk about their relationship.</li>\n<li>Julie fucks up, tipping off Chris that she's a troll. She excuses the mistake on her bad <a class=\"mw-redirect\" href=\"/cwcki/English\" title=\"English\">English</a>.</li>\n<li>Chris wants to Google Molvanîa (something he should have done ages ago), but Julie fast-talks him out of it.</li>\n<li>Julie explains that Molvanîa has been destroyed.</li>\n<li>Julie changes the subject and asks about how Virginia is.</li>\n<li>A wild Clyde Cash appears, then disappears without saying a word.</li>\n<li>Chris's alarm goes off, ruining his train of thought. He performs no other action, so presumably the alarm was to remind him to be even more forgetful than usual.</li>\n<li>Julie asks about Chris's parents. He says they are fine.</li>\n<li>Chris drops spoilers about the upcoming Sonichu.</li>\n<li>They talk music. Julie loves Alizée. Chris likes all music, but especially <a href=\"/cwcki/Britney_Spears\" title=\"Britney Spears\">Britney Spears</a>.</li>\n<li>Clyde returns again, but again leaves without saying anything.</li>\n<li>Julie asks Chris if he is attracted to Rosechus. Chris answers by saying <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">they are attracted to him</a>.</li>\n<li>Chris believes he is handsome but doesn't know why he doesn't have a girlfriend. He says this to Julie, his sweetheart.</li>\n<li>Chris pesters Julie to come visit him, without offering to assist her in anyway.</li>\n<li>Clyde speaks, demanding to know why Chris hasn't killed him yet.</li>\n<li>Chris bitches to Cogs, saying among other things that he can draw romance well, dating education, and how he shouldn't be held accountable for including pornography in a children's comic because he does what he wants to do.</li>\n<li>Chris says he might include more non-Sonichu characters in <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\"><i>Sonichu</i></a>.</li>\n<li>In Molvanîa men come to the women's houses first, which Chris deludes himself into believing happens frequently in the USA as well.</li>\n<li>Julie is worried that Clyde might rape her like he did to Panda.</li>\n<li>Julie thinks she sees \"someone <a href=\"/cwcki/Chris_and_race#Asians\" title=\"Chris and race\">Asian</a> outside her house. She is worried it might be Clyde. Chris says he'd be scared too.</li>\n<li>Julie is sure someone's outside her house. Chris tells her to try not to think about it.</li>\n<li>There's pounding on Julie's door. She investigates; it's a salesman. Chris gives a relieved, crazed laugh.</li>\n<li>Almost immediately, they begin idle banter about cars.</li>\n<li>Chris, possessing all the subtlety of the raging inferno that was the Hindenburg in its final moments, suggests that he and Julie engage in cybersex.</li>\n<li>Chris believes that Panda is gone and that he should immediately move on.</li>\n<li>Chris admits that it's possible he will prematurely ejaculate. The prospect unsettles him some.</li>\n<li>Julie and Chris discuss their first time. Terrible, unmentionable things occur as they go into detail, moving into full on cybersex. Chris concedes it's probable that he'll prematurely ejaculate on his first time.</li>\n<li>Chris lies about his penis size. See accompanying image.</li>\n<li>Chris explains that his semen will taste like strawberries, since he's been eating lots of them in preparation.</li>\n<li>Chris drops his phone number. Yet again.</li>\n<li>Julie AFKs out. At least one troll quietly slips into giggles.</li>\n<li>Julie returns. They discuss Chris's parents.</li>\n<li>Julie tries to white-knight Chris. <a class=\"mw-redirect\" href=\"/cwcki/White_Knight\" title=\"White Knight\">It ends with the usual amount of fail</a>.</li>\n<li>Julie has a plan to get Chris to <a class=\"mw-redirect\" href=\"/cwcki/Redmond\" title=\"Redmond\">Redmond</a>. Chris wants to go, but desperately doesn't want to expend any money, effort, time or thought into the process or even leave his house.</li>\n<li>Clyde returns. He reveals he was lurking under the name of his <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">cousin</a>. He has heard everything.</li>\n<li>Clyde threatens Julie. Chris threatens Clyde.</li>\n<li>Chris stands up Clyde for a bit. Clyde lays the smackdown, saying Chris's logic makes no sense. It doesn't.</li>\n<li>Clyde threatens Julie with <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Russian_roulette\" title=\"wikipedia:Russian roulette\">Russian roulette</a>. Chris shows that he doesn't know anything about how the game works.</li>\n<li>Chris and Clyde argue about who is crazier. [<i>Spoiler: Chris.</i>]</li>\n<li>Clyde reveals his backstory.</li>\n<li>Chris won't leave his shitty landfill for any reason.</li>\n<li>Chris tries to invoke Trolls Remorse in Clyde, which doesn't work.</li>\n<li>Chris displays immense hypocrisy throughout the whole third quarter of the chat.</li>\n<li>Chris watches <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Sex_in_the_City\" title=\"wikipedia:Sex in the City\"><i>Sex in the City</i></a>.</li>\n<li>Clyde tells Chris he doesn't have autism, bringing up the Wikipedia article to prove it. Chris is stunned into silence, finally admitting that high functioning autism isn't a real thing.</li>\n<li>Chris gives a list of his cooking and cleaning qualifications, going into specific detail about how to empty bins, load a washing machine, clean cat poo and clean up an overflowing commode.</li>\n<li>Clyde laughs.</li>\n<li>Clyde argues against the brick wall that is Chris's mind.</li>\n<li>Clyde has a job.</li>\n<li>Chris believes that he is <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">simultaneously overqualified for almost any position imaginable</a> and a [<i>jack of all trades, master of none</i>], to such an ludicrous extreme that he is unsuitable <a href=\"/cwcki/Wendy%27s\" title=\"Wendy's\">even for minimum wage work.</a></li>\n<li>Clyde frigging flips out, blowing his stack.</li>\n<li>Chris babbles about how <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">Rocky</a> is helping him but is unable to list any specifics, mentioning a Dr. Price.</li>\n<li>Chris STILL doesn't know why <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Megan</a> got upset, even though Clyde literally screams the answer at him.</li>\n<li>Chris ripped up the original <a class=\"mw-redirect\" href=\"/cwcki/SheCameForCWC.jpg\" title=\"SheCameForCWC.jpg\">pic She Came For CWC</a>, saying he keeps the remains in a \"<a href=\"/cwcki/Crumple-Lope\" title=\"Crumple-Lope\">crumple-lope</a>\" (<i>presumably a crumpled-envelope</i>).</li>\n<li>Chris blames his homophobia on the <a href=\"/cwcki/Nathanael_Greene_Elementary_School\" title=\"Nathanael Greene Elementary School\">Principle of Nathanael Greene Elementary</a>.</li>\n<li>Chris says he never said he hated homosexuals, an outright lie. Clyde goes spastic.</li>\n<li>Clyde finally gets to the point: Chris must make <a href=\"/cwcki/Chris_Comes_Out_of_the_Closet\" title=\"Chris Comes Out of the Closet\">a video</a> where he admits to being gay. In exchange, Clyde won't dismember Julie. Chris initially declines.</li>\n<li>Under pressure from Julie, Chris takes a very long time to FINALLY decide that he will make the video, even after Clyde reminds him he can just make <a href=\"/cwcki/Chris_Destroys_His_Vibrator\" title=\"Chris Destroys His Vibrator\">a second video after to say that the first was blackmail and that he's straight.</a></li>\n<li>Clyde notes that he is about to get banned, so leaves.</li>\n<li>Some guy comes along and Chris discusses what happened.</li>\n<li>Chris gets Julie to agree to taping their first time and uploading it to YouTube.</li>\n<li>Chris goes off to make <a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">the video</a>. The trolls burst out laughing; JulieSpike sings <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Still_Alive\" title=\"wikipedia:Still Alive\">Still Alive</a> from <i>Portal</i>, and soon all the trolls join in as the video ends.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<center>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#FFFF00\" colspan=\"2\" style=\"font-size:110%; color:#008080;-moz-border-radius:10px\"><b>Mumble 3</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/17ieQ3XKPSA\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>5~10 <a href=\"/cwcki/February_2009\" title=\"February 2009\">February 2009</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Featuring</b>\n</td>\n<td><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>, <a class=\"mw-redirect\" href=\"/cwcki/Clyde\" title=\"Clyde\">Clyde</a>, <a class=\"mw-redirect\" href=\"/cwcki/Bluespike\" title=\"Bluespike\">Bluespike</a>,\n</td></tr>\n</tbody></table>\n</center>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<h4><span id=\"00:00:00_Introduction.2C_Audio_Fail\"></span><span class=\"mw-headline\" id=\"00:00:00_Introduction,_Audio_Fail\">00:00:00 Introduction, Audio Fail</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> There we are. [<i>Random background noise</i>] Hmm now... What now? Oh.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hi Chris!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hello.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ho- [<i>audio cuts out</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, say that again? You kinda broke up there.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hold on, let me adjust my mic- [<i>cuts out again</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh! It's you!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>muted</i>] Yes of course! \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Huh.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Pause</i>] So how are you Chri- [<i>More audio failure</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm okay Julie, how are you?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm wonderful, thank you. Everything at home o-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Everything's Okay- Everything's Okay at home. Uh, I mean It's only I think that was you asked-yeah. I know you just bought that mic but it seems to be failing at points. Oh well.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uh, let me configure it really- [<i>cut</i>] Maybe I can increase the vol- [<i>cut</i>].\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> If anything you might have to close it and relog back then to up after you get it configure correctly. I mean order-or-or to get to configure it correctly.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well actually I did that, I logged back in after I configured it- [<i>cut</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. Well you should carry speaker a little longer there (?)\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> So- [<i>cut</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Aggravated</i>] <i>Sigh.</i> Broke up again. [<i>Pause</i>] I mean you can tell when you're breaking up because you look at the you-your lips up next to your name on the thing here and you kinda get grayed out, and that means you're- that's kinda like when you get cut off. [<i>Pause</i>] Or when you're done speaking.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> hey I, oh I think I know what you- Is it better now-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You got cut off again.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> That's weir-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. I don't know either. You just got it- you just installed it so uh, hmm. This is like first install jitters, or something. I dunno.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Is it better now?  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I heard your, eh, eh, Yeah. I mean, I was able to hear you clearly until the points where you got cut of so uh, uh, yeah. I mean, yeah, you know, try saying something longer and I'll let you know if you get cut off mid-sentence.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I hope this microphone does not cut out as that would be horrible.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright, I got- I had your full sentence there. I heard ya. I heard ya.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Alright, that is good-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Huh. You got cut off again.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> That's weird, I don't know what could be causing it. I turned off everything else that was using the connection.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Well we just, well- it's best to try to make the best- make the best of it. So you know, uh, I'll try to understand you up- I mean- until the points, I mean the points- I mean, as best as I can even if you get- even if you might get cut off sometime. But anyway it's-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm sorr- I'm sorry about that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's okay. Hmm. So uh, how are you?\n</p>\n<h4><span id=\"00:04:14_Money.2C_Jobs\"></span><span class=\"mw-headline\" id=\"00:04:14_Money,_Jobs\">00:04:14 Money, Jobs</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm wonderful! Things in <a class=\"mw-redirect\" href=\"/cwcki/America\" title=\"America\">America</a> are wonderf-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep, I hear that. I'm just sorry about uh, the rising cost of things due to the economic crisis and all.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, it's very hard on me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Alright so, uh tell me- so you said you were uh working at fast food or something to uh, earn money?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, I'm working at restaurants. I'm a professional cook. Sorry. My English is still bad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You said you were a professional cook?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I am professional at cooking.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, that's good. Maybe after you come over here I could try a little bit of your cuisine for uh... lunch or dinner.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, I would enjoy that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, mostly I just uh warm up a TV dinner, but you know I am able to uh, cooking things- uh, cooking things for my- cooking things for myself when I have the instructions in front of me and the ingredients. But it's kind of, like hmm, you know, <a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">a bit crowded in my kitchen in here</a>.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:05:30_Food\">00:05:30 Food</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> What's your favorite thing to eat?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. I like, mostly like <a href=\"/cwcki/Obesity\" title=\"Obesity\">mac and cheese</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm very good at cooking.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll take your word for it. And I'll look forward to uh, trying your-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Interrupting</i>] I'll be right back, sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay.\n</p><p>[<i>brief pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm back.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:05:59_Lost_Passwords\">00:05:59 Lost Passwords</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Okay. Let's- anyway you didn't answer my question how'd uh, did your passwo- how'd you get your password back after the previous time your brother changed it on ya?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Actually um, he actually just put it back to the original last. I'm not sure if he's gonna give it back this time, however.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Um. Hmm. Has he told you uh, me- he's probably just doing it just to annoy you but uh, maybe he- maybe uh, maybe he like, I don't know his mindset but maybe he wants something?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Perhaps.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean like did you ask him like, did you ever ask him like why did you change my password other than just to annoy me? What is it that you want?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I actually don't know why he chang- [<i>cut off again</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's like if you- [<i>Julie interrupts, brief pause</i>] It's like you got to try get into his head a little bit.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Like, you know, one thing you could do, you could, check out his room, see if you can find anything he's written down or look at, you know, look a clues in his room that describes him. Maybe you could, find something- find something there that uh, you can put in- put in common terms with or whatever, and uh, give him something that uh, makes him feel good from somewhere among those clues.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Enthusiastic</i>] Yes I could do that! That's a very good idea!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_Room\" title=\"Chris's Room\">my room</a> is a slew of big clues. [<i>Chris pronounces \"slew\" as \"slow\"</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah.\n</p><p>[<i>Windows beeping</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah so uh... what else do you want to talk about?\n</p>\n<h4><span class=\"mw-headline\" id=\"00:08:07_About_Our_Relationship...\">00:08:07 About Our Relationship...</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Umm, I'm not really sure. Maybe we could talk about- I'm not sure. Maybe our relationship?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Sudden intake of breath, as though wincing in pain</i>] Oooh. Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Should I- Should I not bring this up?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, it's okay, it's okay. [<i>Pause</i>] Mmm. Ummm. Yeah. I mean I'm just trying to think about what- what's a good- what's a, something to say at the moment. I mean you don't know what to say, you could say <a href=\"/cwcki/Mary_Poppins\" title=\"Mary Poppins\">Supercalifragilisticexpialidocious</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ah. Have you heard from my friend Cameron Van- you know Cameron yet? Have you heard from him yet?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahh, Cameron?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes. [<i>Realizing error</i>] Oh. Her. Sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. Uh, possibly is that uh, Is that- I dunno is that like your aunt, still over in <a href=\"/cwcki/Molvan%C3%AEa\" title=\"Molvanîa\">Molvanîa</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, I have unfortunate news about Molvanîa. It- it appears to have been destroyed. I know that sounds strange, but, I don't know what happened. I'm very worried.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Maybe I can find something on the-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I miss my hometown.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I hear ya. Hang on, I'll uh, I'll Google Molvanîa, see if I can-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Backpedaling</i>] no, that's alright, I'm pretty sure I know what happened.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. Uh, tell me in your own words what you think happened.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I don't know, It's just, I think the dictator of Molvanîa, I think he was assassinated, \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> The dictator was assassinated.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm not sure. As far as I heard from Cameron before he- I lost all contact with him.   \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Incredulous</i>] You mean her, don't you?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Sorry, I keep getting confused, my English is awful. I'm sorry.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay, you're trying. You're doing- you're doing okay.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you very much.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I think I'd like to talk about something else. I, you know.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's fine, talk about anything.\n</p>\n<h4><span id=\"00:10:40_How.27s_Virginia.3F\"></span><span class=\"mw-headline\" id=\"00:10:40_How's_Virginia?\">00:10:40 How's Virginia?</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> So, how's <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay. Uhh, you know, it's a good place to live. As, especially going out to <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> and uh, whatnot, but it's okay.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, that sounds wonder-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, I can't, I mean I don't know what much to say, but uh, you know <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">my Father</a> could tell you, oh yeah, Virginia's a historic town, cuz, you know we got all the history from like, Thomas Jefferson and, oh yeah, <a href=\"/cwcki/A_Hike\" title=\"A Hike\">the Monticello</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> What do you like to do in Virginia?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. What Do I like to do in Virginia? Hmm. I dunno [<i>nervous laugh</i>] Been living in Virginia pretty much all my life so, pretty much just living my normal life at this point. Other than- other than that I can't really say, you know?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Can you tell what that includes? I really want to know what your life is like, I would love to know.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Ahh, let me think about that. My life is like, uh...\n</p>\n<h4><span id=\"00:12:02_A_Wild_Clyde_Cash_Appears.21\"></span><span class=\"mw-headline\" id=\"00:12:02_A_Wild_Clyde_Cash_Appears!\">00:12:02 A Wild Clyde Cash Appears!</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh no!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I see <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde's</a> here. Uh oh.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh well, let's just ignore him.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. It's like uh, he seems to be under the \"Inactive\" area.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah no one can hear us here.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, and uh, here's a note, it says that Clyde left the channel.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, that's good.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> In the left column here. Hmm. Don't really, I mean, don't really have much on my mind uhh, right now, let me see. Ah, mostly I've just been uh, collecting my thoughts and taking my time. You know, recovering from the Internet, from the <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a> of the, the stress of the Internet and whatnot.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, the Internet can be a very stressful place, especially with all these <a class=\"mw-redirect\" href=\"/cwcki/Jerks\" title=\"Jerks\">jerks</a> trying to make you mad.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Yeah it can be very tiring is- yep. Very tiring.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> You should stand up to them sometime. You should just tell them you're not going to take it anymore.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah I think I, I pretty much do that, just like you know, like, I keep my cool- I kept my- pretty much kept my cool and not so much- [<i>Chris's cell phone alarm goes off</i>] Excuse me.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:13:40_Alarms_Are_Distracting...\">00:13:40 Alarms Are Distracting...</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That was my phone, reminding me of, er, just a reminder.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, okay.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, lost- lost my train of thought there.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Awww.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Don't you just hate that where you lose your train of thought and it's hard to recover?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah. I hate it so much.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I- yep I- I hear you there.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:14:12_Bob_and_Snorlax\">00:14:12 Bob and Snorlax</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> So, so how is your life? I mean, are things with your parents okay? I would love to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm, you know, uh, can't complain. It's uh, not to- not totally bad. It's okay. I mean, uh, it's-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Is your father giving you trouble again?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Uh not so much lately. Uh, I had to go downtown with him to get his pacemaker checked.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, I hope he's okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> D'awright.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> How's <a class=\"mw-redirect\" href=\"/cwcki/Snorlax\" title=\"Snorlax\">your mother</a>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> She's alright.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I heard her singing, what was it, <a href=\"/cwcki/Mumble_2\" title=\"Mumble 2\">yesterday</a>? She's a very good singer.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. You know I told her that, uh, you know. Y'all- Y'all on the Mumble here heard her singing and they gave you a compliment it's like you know, \"Oh, I can't sing, I'm tone deaf. They're just lying to try to make you feel good.\" Just a little um, just a little mod- just a little modesty there. From her point.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Everything I said about her awesome singing. I- I- It was a hundred percent true Chris, I assure you.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I know. I mean, I think she- I think she's a great singer too.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> As do I.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Sorry, could you repeat that, what was that?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> As do I, I agree with you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, as do you. That's what you said. Hm. It sounded like you said somethings, it sounded like you said \"something, something why\". Heh.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, like, I dunno, heh. Could be asking a question like, \"Why, blahdah blahda\". But never mind about that. I mean, I mean- I mean I understand, I'm understanding you clearly. Up to like, you know, up to when you get cut off and whatever.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> So apparently Clyde did get kicked from the Mumble server, so that's good.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hopefully he's gone for good. He's been trying to promote his awful comic.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Yeah I'm definitely gonna take- I'm definitely gonna- I've been taking some time, and I've been thinking about like you know doing a page at a time, and uploading that to my website. As, as I- as I draw the comic.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hey Chris, umm... I know maybe it's confidential, but could you tell me about- a bit about the next comic? I really want to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Tough love, simply enough- in the first episode <a class=\"mw-redirect\" href=\"/cwcki/Wild\" title=\"Wild\">Wild</a> and <a class=\"mw-redirect\" href=\"/cwcki/Simonla\" title=\"Simonla\">Simonla</a> will meet in the <a class=\"mw-redirect\" href=\"/cwcki/Dating_Education\" title=\"Dating Education\">Dating Education</a> class, and it'll just be like, a simple romance, without them- with only the professor knowing it, the two get paired up uh, communicating with each other over- over, like Internet and cell phone and whatnot in practice. And then they all love each other.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Cool. I look forward to reading about it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah I mean, but, you would think, you know, Simonla is a ground/bug type and uh, Wild's a grass-electric. It's like they wouldn't, uh, hook up very well on the opposite traits. But you know, Wild don't- wild don't care. Loves her.\n</p>\n<h4><span id=\"00:17:37_Music.2C_Aliz.C3.A9e\"></span><span class=\"mw-headline\" id=\"00:17:37_Music,_Alizée\">00:17:37 Music, Alizée</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Wow. That sounds so nice. You know what, I'd like to change the subject a bit?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, sure.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Can I ask you about your taste in music? I'm an <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Aliz%C3%A9e\" title=\"wikipedia:Alizée\">Alizée</a> fan myself!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Can I show you one of her videos? Her videos?  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhhh, no. Uh, no that's okay, but you said Alizée, I think I've heard that name mentioned before.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, I believe it was mentioned uh, last time.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I kinda like mo- like uh, all types of <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">music</a>. Uh, some heavy metal, not so ehhh, but you know I'll play it on <i><a href=\"/cwcki/Guitar_Hero\" title=\"Guitar Hero\">Guitar Hero</a></i>, at least.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I've been trying to get <i>Guitar Hero</i>. That's one of the next games I've been planning to get.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Guitar Hero Metallica?  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, even <i><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Guitar_Hero:_Metallica\" title=\"wikipedia:Guitar Hero: Metallica\">Guitar Hero: Metallica</a></i>, or maybe <i><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Guitar_Hero_World_Tour\" title=\"wikipedia:Guitar Hero World Tour\">World Tour</a></i>.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> World Tour's already out. With the band kit.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I can possibly get that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Or you can- or you can get <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Guitar_Hero_III:_Legends_of_Rock\" title=\"wikipedia:Guitar Hero III: Legends of Rock\"><i>Guitar Hero III: Legends of Rock</i></a> or <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Guitar_Hero:_Aerosmith\" title=\"wikipedia:Guitar Hero: Aerosmith\"><i>Aerosmith</i></a>.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I hear there are some rock stars that are actually playable in <i>Guitar Hero III</i>, who are they?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahh, I can't really, I don't really memorize- I don't really memorize the uh, playable characters, but in <i>World Tour</i> I did create a playable version of myself.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Cool.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Yeah there's a video on the <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> that shows me playing with my character and the <a href=\"/cwcki/Gitar_of_Fail\" title=\"Gitar of Fail\">Sonichu Guitar</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah, I noticed you played really well. Do you know how to play the real guitar?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ehhh. No, but you know, the guitar, the plastic guitar's good enough for me, I mean, I feel it's good- good enough. Like playing a real guitar. [<i>Voice becomes very gloomy</i>] Even though it's not, but still, [<i>back to cheerful</i>] It's good enough for me!\n</p>\n<h4><span class=\"mw-headline\" id=\"00:19:33_Troll_Wars_VI:_Return_of_the_Clyde\">00:19:33 Troll Wars VI: Return of the Clyde</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh no. I think Clyde's back. Hopefully he doesn't notice this. Hopefully [<i>drowned out by clattering noises</i>] -but let's just ignore him again.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean, yeah. He's not in- he's not in our private channel. So, he's not hearing us.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yea- [<i>cut off again</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Yeah but anyway- yeah, I like all kinds of music. Uh, but uh, you know, my favorite female pop star- my favorite female pop star-singer I'd say would be, would have to be <a href=\"/cwcki/Britney_Spears\" title=\"Britney Spears\">Britney Spears</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I agree, Britney Spears is very nice.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:20:13_Attracted_to_Cartoons\">00:20:13 Attracted to Cartoons</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> You know, about your comic? I actually have a question I've been pondering for quite awhile.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ask.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Umm, do you find yourself attracted to your female characters you created at all?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ah, do I find myself attracted to my female characters?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> That you have created, yes. I'm sorry if it's a bit too much but I feel like I just, I've been pondering it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Let me think about that, hmm. Are we including the <a href=\"/cwcki/Rosechu_(species)\" title=\"Rosechu (species)\">Rosechus</a>?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Huh. What?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh, hang on a second, we've got an interloper here.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It must be a troll.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, there he goes, he got kicked out.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, there he goes. Thank goodness.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep. Ah, right so, are we talking about uh- so, in addition, yeah uh, the <a href=\"/cwcki/Crystal_Weston_Chandler_(sister)\" title=\"Crystal Weston Chandler (sister)\">human</a> <a href=\"/cwcki/Allison_Amber\" title=\"Allison Amber\">female</a> characters. Are we also talking about me being attractive to the Rosechus?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, I've been pondering. I'm just wondering.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah they'd- yeah I would say they all have a good ap- I would- they all think I'm handsome. Like <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">my mother</a>. My mother- my mother thinks I'm- my mother tells me constantly that I'm handsome and I agree with her, like when I look at myself in the mirror. But it's like, you know, every time she tells me I'm handsome I'm like, “If I'm so handsome why don't I have a girlfriend?”  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I don't know! I can't imagine why either. You're- well to use the best word you're just dashing. You're just wonderful.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I appreciate that.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It is my pleasure.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:22:07_Money\">00:22:07 <a href=\"/cwcki/Chris_and_money\" title=\"Chris and money\">Money</a></span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Brief pause, stress sigh</i>] Let me go off-topic a bit. So, how- how long do you think it will be until you feel like you'll be able to afford to make the trip to uh, come to Virginia?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm not sure. Things are tough with the economic problems in <a class=\"mw-redirect\" href=\"/cwcki/America\" title=\"America\">America</a> currently. Hopefully you'll be able to um, hopefully I'll be able to soon.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. You getting any financial help from your family? I mean uh, you can count <a class=\"mw-redirect\" href=\"/cwcki/Max\" title=\"Max\">your brother</a>, but I'm not necessarily counting him.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, most of my family live in Molvanîa. For after- I mean, before it happened. I hope they're okay.\n</p>\n<h4><span id=\"00:22:48_Clyde_Speaks.21\"></span><span class=\"mw-headline\" id=\"00:22:48_Clyde_Speaks!\">00:22:48 Clyde Speaks!</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'm here Chris...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Clyde?! What are you doing here?\n</p><p>[<i>Chris gives a stress sigh</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I just wanted to stop by and say hi, Julie.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Get out.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yep.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Look Chris, Chris. I just wanna tell you something.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah wh-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'm off my medication right now, I'm off my leia (presumably leash) and I'm still angry at you now. Last time was a mistake. I shouldn't, <a class=\"mw-redirect\" href=\"/cwcki/Vivian\" title=\"Vivian\">Vivian</a> told me... [<i>exhales</i>] Oh god. Tell me Chris. I just want you to answer one thing.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What is it.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Why haven't you killed me yet? Why haven't you killed me yet.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Pause</i>] Chris I think he's trying to tick me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Clyde, how did you get in here?!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>Short whisper</i>] Magic.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> You must be on your drugs again, you jerk!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Not this time. Not this time. I was being too nice last time, obviously. That was me on drugs. I was too nice when I was on drugs.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You know Clyde, I have an answer- I do have an answer for you. I haven't killed you yet because you're doing a good job doing it to yourself.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Uhhh... I haven't attempted to kill myself. Ever.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Druggie.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I don't think he's gonna leave. I'm scared. What if he tells all the other jerks what you've been saying? What if he knows?! No. I don't know. [<i>Clyde momentarily interrupts</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> He knows nothing. He's been mostly out of this conversation.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I know everything. Ever.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Op. There we go, he got kicked out. [<i>pause</i>] There you go he got kicked out. Yeah but I think most- I think- I think we're safe because he did not hear most of our conversation since, you know, he was mostly in the inactive column.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:25:22_Clyde_Leaves\">00:25:22 Clyde Leaves</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> I have to be right back soon.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> So there should be something we can do about Clyde.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But uh, like uh- I'm not too worried about him. I mean I'll deal with him- [<i>Julie interrupts</i>] I mean I'll deal with him when uh, he pops in.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh according to <a href=\"/cwcki/Cogsdev\" title=\"Cogsdev\">Cogsdev</a>, he says that uhh Clyde shouldn't be able to come back. [<i>pause, stress sigh</i>] Hmm, right so we were-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It must be another troll.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:26:09_Chris_talks_to_Cogsdev\">00:26:09 Chris talks to Cogsdev</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Nah, that's okay. They're taken care of... They're being taken care of- they're taken care of. But anyway getting back to our conversation, talk about uh, yeah you tried- I was asking you if you had any <a class=\"mw-redirect\" href=\"/cwcki/Monthly_Tugboat\" title=\"Monthly Tugboat\">financial aid</a> from your family. But uh, then you said that they- the troubles in Molvanîa and such. Uh. Yeah, but mostly uh- any help at all from your family? Financially. [<i>pause</i>] Julie? Okay. \n</p><p>[<i>Pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Uhh, Cogsdev, you can- you heard the whole conversation, didn't you? [<i>Pause</i>] Oh. Okay. [<i>unclear mumbling, pause</i>] Oh, okay, well that's okay, you didn't have to uh, come into the channel, but uh, yeah okay but anyway so what's your question? \n</p><p>[<i>Pause</i>] \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Active manner. Hmm. Yeah cuz I like- cuz I like to uh, hmm. But I mostly am attracted to women so when I draw my female characters I like to uh... with like you know I, yeah. I like to make them attractive. I have done, uh, hmmm. [<i>pause</i>] I can't really uh, hmmm. No, I would not have uh, sex with any of them but it's like you know, uh... It's like but you know, I love them as if they were my friends or uh, or like you know, my brain children. But I would never have <a class=\"mw-redirect\" href=\"/cwcki/Sex\" title=\"Sex\">sex</a> with them. I mean it's like uh, alright, yeah, Cogsdev, I know you're a girl and I will take your word for it on that, but uh, yeah but, yeah. It's like uh, you have- you would have- if you had a son, wouldn't you want to make him look attractive?  \n</p><p>[<i>Pause']</i>\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright, there you go, you'd dress him up as nice- as nicely as possible. [<i>Pause, then inaudible mumbling</i>] Obviously I watched uh, yeah, I did watch <a class=\"mw-redirect\" href=\"/cwcki/Pornography\" title=\"Pornography\">Pornography</a> and then I did get the frustration from the e- from between the <a class=\"mw-redirect\" href=\"/cwcki/ED\" title=\"ED\">ED</a> page it- the page and the <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a>. But it's also like, you know uh, I've all- I've wanted to do something like that, you know uh, just to stretch uh an adult muscle in my head. And plus, if you'll look at the, uh, at the lovey-dovey non-<a href=\"/cwcki/Nudes\" title=\"Nudes\">nudity</a> scenes like uh, you know just the embracing and the kissing. They're like my best works of- they're like my best examples of <a class=\"mw-redirect\" href=\"/cwcki/Art\" title=\"Art\">art</a>. It's like even though I'm a frustrated <a class=\"mw-redirect\" href=\"/cwcki/Virgin\" title=\"Virgin\">virgin</a>, I can draw romance very well.\n</p><p>[<i>Pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. I just- but- you know, a bunch of times I most but- like majority of- like most other people I'm <a class=\"mw-redirect\" href=\"/cwcki/Random\" title=\"Random\">random</a>. And I'll uh, I'll never know what I'm gonna- sometimes I never know what I'm gonna do next. If I'm- um- what I mean I work out- I don't think- sometimes I don't think I feel. If I wanna do something to- just for the heck of it then I'll do it. But yeah, the <a class=\"mw-redirect\" href=\"/cwcki/Comic\" title=\"Comic\">comic</a> is mostly intended for children.\n</p><p>[<i>Pause, <a class=\"mw-redirect\" href=\"/cwcki/Sigh\" title=\"Sigh\">sigh</a></i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But it's also like you know, it's- I'll figure that it's also like it's intention for like when they get older. Years later they're- they're in their teenage years and they're like uh, they're looking back at the earlier stuff and it's like \"Oh that was so childish.\" But then it's like you know I- I added this uh- this- the uh, the T-rated or the- or adult materials I pretty much did. It's like uh, they could relate better- they could like relate to that in their adult- in their teenage and adult years. Just uh- just uh- just a small branch out, if you will.\n</p><p>[<i>Pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> More of a- I would say that uh, related to like what I would like in my romantic love life. Or like, you know, when I have my romantic relationship with my sweetheart. That's pretty much- I'm gonna be doing it. And also with that uh, also good advice for uh, those that don't know for themselves. Like I'm working on the <a href=\"/cwcki/Dating_education\" title=\"Dating education\">dating education</a> episode I was just telling Julie about a little bit. But yeah, that nine-year-old who wrote <a href=\"/cwcki/How_to_Talk_to_Girls\" title=\"How to Talk to Girls\">that book</a> pretty much took the words out of my mouth, and then some, but mostly-\n</p>\n<h4><span class=\"mw-headline\" id=\"00:33:46_Julie_Returns\">00:33:46 Julie Returns</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm back, Mr. Chandler!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Laughs</i>] Oh that's- that was fun. I was just talking to Cogsdev uh, pretty much.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ah, I see!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> you know it's just-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> So, did I miss anything important?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahh, not really. Just answered the- I just answered a couple of her questions.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, alright. Wait, how did- huh. Oh, never mind. [<i>pause</i>] So I'm sorry I had to take a brief absence. <a class=\"mw-redirect\" href=\"/cwcki/Max\" title=\"Max\">My brother</a> called me for help with something.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I see. Hmmm. I'm sure Cogsdev won't mind but I'm just gonna see if I can... how to do it here it says “kick and mute” I just want- I just want to move- oh, she moved herself. Okay. So, alright so, what did he want? You to help him with?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He just- he just wanted to help- me to help him with um, from the kitchen.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. I see. That's good. Hmm.  \n</p>\n<h4><span class=\"mw-headline\" id=\"00:35:10_Non-Sonichu_Characters\">00:35:10 Non-Sonichu Characters</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. I just thought of another question while I was helping him in the kitchen.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I noticed that all your characters are indeed- well, most of them are indeed Sonichus and Rosechus.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Do you plan to make any other characters that are not Sonichus and Rosechus? Like that character I gave to you earlier?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Possibly. But you know that there are some, there are other animal characters outside that, the Sonichus and Rosechus, you know, there's <a href=\"/cwcki/Flame_the_Sunbird\" title=\"Flame the Sunbird\">Flame the Sunbird</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes there is him. I-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Of course we have the human characters.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes I know, but aside from them, do you plan on making any other non-Sonichu or Rosechu characters?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, possibly for like you know uh, one way or another hero villains, side characters, It just-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I look forward to it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Time will tell. And uh... here's a thought, after uh, you move to uh, Virginia, and you come be- and you come be with me, then uh, it's like you could help me work on that. Create those characters.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I am pretty good at character design. I've made a few characters like the one you've seen before.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I wanna ask.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm?\n</p>\n<h4><span class=\"mw-headline\" id=\"00:36:48_Monthly_Tugboats\">00:36:48 Monthly Tugboats</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> You said before that you do get money every month, is this not right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh yeah, I do get, yeah I do get a mo- <a href=\"/cwcki/Monthly_tugboat\" title=\"Monthly tugboat\">social security</a>.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, you must have more money than I. Can you try to come to Ohio sometime? Or would you prefer if I came to your house.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'd rather uh, you came to my house. Cuz I just don't feel comfortable traveling long distances, uh by myself at least.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I guess, but I've never been in America myself either. I'm somewhat worried myself.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Best thing you can do to relive that tension is just to, take a deep breath, once in awhile, take your time. You know, quote unquote stop and smell the roses.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Alright I guess.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You know it's like, uh, you don't have to uh, be in a hurry to get from point A to point B. It's just like, you can space it out in- you can space it out in your own mind, at your own individual pace. As long as you go.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah, I think I'll try uh, slowly move over. Hopefully I'll get there this year. If I'm lucky.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Yeah this year. Or uh, I dunno. I'll tell ya what uh, it may be possible, but I might uh, be able to board you here if uh, board you here in my- board you here in my room until uh you get uh, until you get an apartment for yourself, you know? [<i>Windows beeping</i>] Until you get here.\n</p>\n<h4><span id=\"00:38:42_Things_Are_Different_in_Molvan.C3.AEa\"></span><span class=\"mw-headline\" id=\"00:38:42_Things_Are_Different_in_Molvanîa\">00:38:42 Things Are Different in Molvanîa</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Can I ask you something though?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> In Molvanîa... men indeed do come to the womens houses first. But how things are different here? I figured that they have the same rules.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well you know, same more or less. But it's like uh, most people are more comf- most men are more comfortable with uh, what they call a “<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Sadie_Hawkins_Day\" title=\"wikipedia:Sadie Hawkins Day\">Sadie Hawkins</a>” situation because uh- alright yeah, Sadie- it's uh, pretty much just fictional character Sadie Hawkins, you can look her up on uh <a href=\"/cwcki/Wikipedia\" title=\"Wikipedia\">Wikipedia</a> or something.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I think I will.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah but, mostly it's like uh, no guy would- every- every guy was like afraid to uh, talk to her so, she pretty much did the asking of the guy- asking to the guys. And uh, they would most likely say yes but- yeah so, she pretty much started a trend of women asking the guys or going to them.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I see.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I just, for a long while I felt more comfortable- more comfortable in a Sadie Hawkins situation.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uh huhh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Like you know uhhh, pretty much the women- pretty much the women coming to me that's uh, pretty much why during my in-person experiences, during my sweetheart search in the earlier years when I actually were, in- actually was in the lo- in the real life locations. I was waiting for the women to come to me. Cuz I was just shy and uncomfortable- I just was shy mostly.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But you don't need to be shy around me, you know me, you trust me completely, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. But still-\n</p>\n<h4><span id=\"00:40:48_Don.27t_Be_Afraid\"></span><span class=\"mw-headline\" id=\"00:40:48_Don't_Be_Afraid\">00:40:48 Don't Be Afraid</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> You shouldn't be scared.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but also there's the uh, there's like role troubles and my fam- and my mom would- and my mom would worry and all that sort of- all that sort of-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>interrupting</i>] my brother worries about my safety. You know, he doesn't want me to get hurt out there because the world is a mean place.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I hear- I hear you there.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. I'm still worried.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Sometimes you just gotta take a plunge. I mean, listen to me, talking like this. It's like I should be taking plunges for myself. Hmm. Here's some thing-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>interrupting</i>] Well, I guess I could try.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I would appreciate that. I really would.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I- I will- I promise you right now, I just want you to know, that I will consciously try to get to Virginia in this year. I will try my very hardest.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Thank you. I want you to know I mean that from my heart. Thank you, Julie.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> You are very welcome Chris. But again, I'm worried. What if Clyde- what if he attempts to rape me as he did with <a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">Panda</a>? I'm worried. Worried for my own safety.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah but uh, as long as you don't uh, put it on the Internet where you're currently living, then uh-\n</p>\n<h4><span class=\"mw-headline\" id=\"00:42:36_Clyde_the_Stalker\">00:42:36 Clyde the Stalker</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes but he's able to follow me. I think I've seen a car around my house- someone... someone Asian in it? I think Clyde is Asian, I'm worried. He looked in with an evil glare, I'm worried. I think it was half-Asian actually, I'm not really- I'm just really scared that if I try and leave my house that he's gonna do awful things to me. <a href=\"/cwcki/Sex_tape\" title=\"Sex tape\">Awful horrible things</a> to me! I'm scared Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I hear you. I feel for you. I'd be scared too.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But I don't think! I- I don't think he'd rape you. Which is why I think maybe you should come- I apologize for the background noise, TV is on.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's okay. Uhhh, but you- surely that guy cannot be out there all the time.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes but I see his car even at night. I have a feeling he may be stalking me but I don't know where he is and I'm scared to call anyone about it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well do you have his license plate number?  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But Chris I- no I don't. But, I know Chris, that- you're tough Chris. I actually- I believe in you. You are the strongest person I've ever met. You're tough! I know you are. I know you've described yourself a couple times but, you are the strongest person I know. I know this! I want you to protect me Chris. Can I please trust you? With my life? Do you think that would be...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright you can trust- I'm- you can trust me to protect you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you Chris I apprecia [<i>audio cut off</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. I will protect you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah the TV is extremely loud. I should ask my brother to turn it down.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Actually I'm not hearing your tel- I'm not hearing your television.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Huh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So you know, it's okay at this point.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Alright. [<i>brief pause</i>] Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you. I'm happy that I could trust you. And I'm happy that you can also trust me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm happy too. That uh, you're able to uh, to trust me very much as well and that you understand me very well. Makes me feel better. Makes me feel happier.  \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm very, it's my pleasure making you feel happy, Chris. It's my ple- [<i>Audio cuts out</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, Cogsdev uh, Okay, uh, did you have another question or something?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'll be right- [<i>Audio cuts out</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>to Cogsdev</i>] oh yeah well we were just talking uh, but yeah, Julie will be right back so uh, it's okay. Did you have something else on your mind?\n</p><p>[<i>Pause</i>]\n</p>\n<h4><span id=\"00:47:00_He.27s_Outside.21_Oh_no.21\"></span><span class=\"mw-headline\" id=\"00:47:00_He's_Outside!_Oh_no!\">00:47:00 He's Outside! Oh no!</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> So anyway, uh, yes I do see someone outside my house. I don't know who it is.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Just uh, just try not to think about it.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I won't.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah I mean uh, it's not like you saw- I mean, it doesn't- it not- it's not hold it- it does not look like he's looking a <a href=\"/cwcki/Megatron_pistol\" title=\"Megatron pistol\">gun</a>, is he?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm not sure, he's holding something. I'm worried.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well just- just best not to- to try not to think about it.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Someone's pounding on my door.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Someone's pounding on your door...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm gonna to go lock it. I'm worried, Chris. I'm gonna go lock it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay. Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh- it was... I looked outside, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uh huh?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It turns out it was a <a href=\"/cwcki/BILLY_MAYS\" title=\"BILLY MAYS\">salesman</a>.\n</p><p>[<i>Chris gives a maniacal, crazy laugh</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahh, that's a relief.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm sorry, I- I acted so silly!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, but it's okay- it's only- it's only human. You're only human.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay, we're all human. I mean, I was scared for you too. [pause] I was pretty much quaking over here!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I was so scared! I'm so silly.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's a'right. I'm here for you.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I appreciate that, Chris.\n</p><p>[<i>pause</i>]\n</p>\n<h4><span id=\"00:48:42_Now_That_Julie.27s_Not_About_To_Get_Stabbed.2C_Let.27s_Babble_About_Cars\"></span><span class=\"mw-headline\" id=\"00:48:42_Now_That_Julie's_Not_About_To_Get_Stabbed,_Let's_Babble_About_Cars\">00:48:42 Now That Julie's Not About To Get Stabbed, Let's Babble About Cars</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> So. I think I would like to change the topic if that's a'right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Sure. Whatcha wanna talk ab-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> How do you like <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Burnout_(video_game)\" title=\"wikipedia:Burnout (video game)\"><i>Burnout</i></a>, Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's- it's alrigh...t. Yeah... get to cruise around...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Maybe we should race sometime.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. I did notice in a- uhh- in a- in a trailer that, uh... apparently uh, the concept Camaro that <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Bumblebee_(other_incarnations)#2007_Transformers_film\" title=\"wikipedia:Bumblebee (other incarnations)\">Bumblebee</a> was, uh... is in the game too.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah I heard they're actually releasing uhh... I forget the exact name, but they're actually gonna... release <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/DeLorean_DMC-12\" title=\"wikipedia:DeLorean DMC-12\">the same car</a> from <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Back_to_the_Future\" title=\"wikipedia:Back to the Future\"><i>Back to the Future</i></a>.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Huh. That's interesting. By the way you know, I also do have the music video, uh- that was on the <a href=\"/cwcki/PlayStation_Network\" title=\"PlayStation Network\">PlayStation Network</a> for a limited time- uh, <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Fast_Car\" title=\"wikipedia:Fast Car\">\"Fast Car\"</a>...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. It's basic- I forgot who was the guy who... sang it, but I do uhh have the MP3 of it as well. But, anyway, in the beginning it's like- this person who has a PSP... he's getting a message from- from the guy doing the song... from his PlayStation 3... or his PSP or something like that. And then he gets into Burnout, then gets his license... does- a his video with, uh... car action and such. [<i>Chris's voice fades out</i>] I forgot how it... goes. [<a class=\"mw-redirect\" href=\"/cwcki/Stress_sigh\" title=\"Stress sigh\">stress sigh</a>] Mmm. I could send the video over the PlayStation Network I would, but apparently they only will allow you to send photos or... something like that- I don't know how to send videos.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I do have it on my PlayStation 3.\n</p><p>[<i>pause</i>]\n</p>\n<h4><span id=\"00:50:29_Oh_Chris.2C_You.27re_The_Master_Of_Subtlety\"></span><span class=\"mw-headline\" id=\"00:50:29_Oh_Chris,_You're_The_Master_Of_Subtlety\">00:50:29 Oh Chris, You're The Master Of Subtlety</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> When- When I do go to Ruckersville, Virginia with you... I would love to play <i>Guitar Hero</i> with you... and <i>Burnout</i>, and all the games. I would love to just play for hours with you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I would love that too. <a class=\"mw-redirect\" href=\"/cwcki/Hanky-panky\" title=\"Hanky-panky\">Play with you.</a>\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Huh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You know, in <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Guitar_Hero_Encore:_Rocks_the_80s\" title=\"wikipedia:Guitar Hero Encore: Rocks the 80s\"><i>Guitar Hero: Encore... Rock the 80's</i></a>... the, uh encore number was uh... <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Play_With_Me\" title=\"wikipedia:Play With Me\">\"Play With Me\"</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, cool! That's... quite the coincidence.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So... [<i>Chris does a bizarre voice here</i>] come play. Come plaaaay!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Haha- I will!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Come play. ... and maybe... you know, there may be... <a class=\"mw-redirect\" href=\"/cwcki/Hanky_panky\" title=\"Hanky panky\">other things</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Heh!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Other... fun things. [<i>Chris has a lecherous tone to his voice</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I hear you!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Just- just each other on the couch... or on my bed.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I can't wait.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> ...Yeah. [<i>stress sigh</i>] This point yeah. Pretty much, uhh... but don't quote me- um, I don't want you <a href=\"/cwcki/CWCki\" title=\"CWCki\">spreading it around</a> and uh... well yeah, at this point, uh... eh... <a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">Sarah... Panda</a> is gone. I'll just let her fly away right now... to uh... to Clyde, if she is going there, just let her fly- just let her- I'll just let her go. I'll give you my-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm real- I'm very sorry to hear Panda has left you. And after all this time and you loved her. And she would just leave you for that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay. <a href=\"/cwcki/Chris_and_death\" title=\"Chris and death\">I'm able to recover.</a> Then... move on.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I hope so.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But anyway. Uhh, Julie- I'll let you take my virginity.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>muted</i>] Thank you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> After you get here and we spend... <a href=\"/cwcki/Third_date\" title=\"Third date\">plenty of time</a> together and get to know each other in person.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I look forward to that, 100% Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You've come so far. You'll be the uh- the wife- the one who actually made it.\n</p>\n<h4><span id=\"00:52:51_Chris_The_Cherry_Popp.27n.2C_Prematurely_Ejaculating_Machine.21\"></span><span class=\"mw-headline\" id=\"00:52:51_Chris_The_Cherry_Popp'n,_Prematurely_Ejaculating_Machine!\">00:52:51 Chris The Cherry Popp'n, Prematurely Ejaculating Machine!</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, can I ask you something?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh yeah. How do you think our first time would- [<i>audio cut</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'd do the best I can. [<i>gives a nervous, scared laugh</i>] Hopefully not prematurely ev-ejaculate.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hope not! I wanna enjoy it as much as I can.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, certainly I would try my best to make it as... satisfactory as possible. I mean, I've watched a lot of pornography, educational... or, uh just... sets or uh, and I've learned from that.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I see. What position would you like best? Can I ask?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't know. Cowgirl.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I've heard of it. I think I might enjoy it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're on top.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>giggle</i>] Wait, how would I be on top?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm on my back-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh yeah, I remember.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. [<i>pause</i>] Mmm. So yeah, Julie, you know, come here as soon as possible... If you can make it by- if you can make it for even at least a visit... on my, by my, on my birthday... later this month... I would appreciate that.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I promise you, I will try my absolute hardest to visit you on your birthday.\n</p><p>[<i>pause</i>]\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:1240785819569.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"199\" src=\"/w/images/thumb/b/ba/1240785819569.jpg/300px-1240785819569.jpg\" srcset=\"/w/images/thumb/b/ba/1240785819569.jpg/450px-1240785819569.jpg 1.5x, /w/images/thumb/b/ba/1240785819569.jpg/600px-1240785819569.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:1240785819569.jpg\" title=\"Enlarge\"></a></div>Chris is smiling for you. Just for you.</div></div></div>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Too bad you can't see me smile, because <a href=\"/cwcki/Creepy_stare\" title=\"Creepy stare\">I'm smiling for you</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, there's always... S-Skype, but... nah. Not right now.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay. [<i>pause</i>] There's also PlayStation Network Chat. I have PlayStation Eye. But uhh-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -unfortunately, your brother... maybe he'll- maybe he'll give it back to you.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:54:54_The_First_Time_OH_GOD.\">00:54:54 The First Time OH GOD.</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> I hope so. Hey Chris, I know you might not want to, I'm just asking, but do you think you could describe the first time? \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmmmmm...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> For me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm... I tell you what, how about I uh... type it up and send it to you on multiple messages on PSN...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Aww, are you sure?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Cuz... cuz I can't recollect it off the top of my head, and it's a lot of detail.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But you can stay... I'll stay for the whole thing! It's a lot easier to say it in words. Please Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> For me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I might. It's gonna take me... a while to recollect.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'll wait the entire time.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You are a trooper.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> And it doesn't have to be perfectly accurate.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Lemme just ask you though, out of curiosity... are you a virgin?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Indeed I am. And I'll gladly let you take it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Let's take each other.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uh huh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. [<i>pause</i>] Take it as a compliment, you're making me hard.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay, so can you describe it? For me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah okay I'm trying- lemme- okay, mmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I will patiently wait.\n</p>\n<h4><span id=\"00:56:38_I_HAVE_TO_TRANSCRIBE_THIS.3F.21_WHAT_THE_HELL_MAN.21_WHAT_THE_HELL.21\"></span><span class=\"mw-headline\" id=\"00:56:38_I_HAVE_TO_TRANSCRIBE_THIS?!_WHAT_THE_HELL_MAN!_WHAT_THE_HELL!\">00:56:38 I HAVE TO TRANSCRIBE THIS?! WHAT THE HELL MAN! WHAT THE HELL!</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> We will firstly make out.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. During that day I would have eaten plenty of strawberries.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I love strawberries. Lemme tell you Chris...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm <a href=\"/cwcki/Mass_debating\" title=\"Mass debating\">masturbating</a> right now to this thought. So please continue.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> We're making out. Mmm. We're... I'd let you... I'd let ya... pull my pants down, and let you warm me up a bit.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would love to.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhhgh... You wouldn't mind giving- uh, you wouldn't mind giving me a, uh... blowjob?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I wouldn't mind. I wouldn't mind at all.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So uh, you just imagine it... and you're enjoying it I think?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Of course I am.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. You have my right hand on... your left shoulder.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> J-just just- just having it there.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes!\n</p>\n<h4><span class=\"mw-headline\" id=\"00:58:20_Chris_Admits_To_Probable_Premature_Ejaculation\">00:58:20 Chris Admits To Probable Premature Ejaculation</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. A'right yeah, then eventually yeah... You would pretty much, eventually uh, you might- you might get some of the premature stuff... at least that's like, out of the way. [<i>inhales nervously</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> We would continue after that, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I still have a lot more... I still got a lot more tiger in my tank. Rawr.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Me too.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm.\n</p>\n<h4><span class=\"mw-headline\" id=\"00:58:54_Return_to_Ear_Rape\">00:58:54 Return to Ear Rape</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Let's say we, uh... undress each other.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes. [<i>Julie sounds bored</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll unhook your bra.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Then I would, uh... be... be marveling at your... at your... nipples.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Cuz you've already marveled at my <a href=\"/cwcki/Duck\" title=\"Duck\">dick</a>...!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>pause</i>] Excuse me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're pretty- I mean-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Can you repeat that?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I said, you would have already marveled at my... dick.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes I have.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. Then we just- then we'd just be undressing each other... at this point. Then I'd know that it's your turn. I'll massage your breasts with my hands and I'll have my mouth at your pussy.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm... I would enjoy that very much.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. There you go, massaging and giving me... my head.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:00:09_Julie_Encourages_Chris\">01:00:09 Julie Encourages Chris</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, can I ask you something?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeeees?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> As I am... are you too... masturbating to this?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't have my hand... on me.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I was wishing maybe we could... do it together.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm... let's call this a little rehearsal. We don't necessarily need to let anything go with the moment.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh a'right. Please continue though.\n</p>\n<h4><span id=\"01:00:44_Sexy_Time_Again.21\"></span><span class=\"mw-headline\" id=\"01:00:44_Sexy_Time_Again!\">01:00:44 Sexy Time Again!</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> You know what? I just grabbed it.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm happy to hear.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, it's, it's not hanging out- but I'm grabbing it. You made me grab it.\n</p><p>[<i>Julie giggles twice</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Then eventually, uh... I'll give it to you first doggy style.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you. [<i>pause</i>] Please continue.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. In and out, in and out... mmm.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Thenightmarecontinues.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"224\" src=\"/w/images/thumb/e/e1/Thenightmarecontinues.jpg/300px-Thenightmarecontinues.jpg\" srcset=\"/w/images/thumb/e/e1/Thenightmarecontinues.jpg/450px-Thenightmarecontinues.jpg 1.5x, /w/images/thumb/e/e1/Thenightmarecontinues.jpg/600px-Thenightmarecontinues.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Thenightmarecontinues.jpg\" title=\"Enlarge\"></a></div>SEVEN INCHES MY MORBIDLY OBESE ARSE.</div></div></div>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Hey Chris, can I ask you something? How big is it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It can go up to seven inches.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh wow! I'd love that. [<i>pause</i>] Please continue, I'd love to hear it. I love to hear this- thank you!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So... just let it play in your imagination. In and out, in and out- doggy style!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yay!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Then eventually... I'd fall towards you and we'd both lay together on the bed, side by side... I mean we are lying- we are laying on our sides. I am behind you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ohh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Chris puts on another retarded voice</i>] My dick is still in your pus-sey, and my fingers are making sure it stays in there.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm... Would you do it <a class=\"mw-redirect\" href=\"/cwcki/Homo\" title=\"Homo\">up the butt</a>?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/Homos#Evidence_that_Chris_is_a_homo\" title=\"Homos\">Not on the first time</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ahh, a'right.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> We'll enjoy the moment.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. I am.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>retard-o voice returns</i>] In and ooooout, in and oooooout. It... feels good.\n</p><p>[retarded, incomprehensible stammering]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>more retarded voice</i>] And pretty soon, and pretty soon the cowgirl... You're on top! You're on top of meeee... you're riding-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would ride that so much.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -me, you're riding me hard. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm hmm.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Strawberries.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"216\" src=\"/w/images/thumb/8/83/Strawberries.png/300px-Strawberries.png\" srcset=\"/w/images/8/83/Strawberries.png 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Strawberries.png\" title=\"Enlarge\"></a></div>This is what Chris actually believes.</div></div></div>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> B-but then, but then... [<i>Chris suddenly switches to his normal voice</i>] By the way I would be wearing a condom. So like you know, so like you know I have no problem wearing it, so if I got inside you and be protected... or I could like pull it out, and go right all onto... your bosom. Or into your mouth. Whatever you want. I'll give you a pearl necklace, or I'll... feed it to ya. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ahh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What do you want. What is it you desire.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Maybe just... to have it. Maybe just to eat it, I suppose. You did say it would taste like strawberries.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's because I would have eaten a bunch of strawberries beforehand.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> So... mmm. There you go. [<i>retarded voice returns</i>] Huh huh... in the mouth![<i>normal</i>] You're enjoying that.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. And then we would pretty much... <a class=\"mw-redirect\" href=\"/cwcki/Recycling\" title=\"Recycling\">clean each other up in the bathroom</a>. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm hmm!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> After that. Or we'd just hang around in the bed. W- W-\n</p><p>[<i>Chris and Julie talk over each other for a second or so</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Excuse me for a second, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>Bored monotone</i>] I think... I'm coming.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ho- ho boy!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you so much Chris! That was a wonderful story. I hope that some day it will be a reality.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> We'll soon see, won't we?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I hope so.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:04:58_Getting_in_Contact_IRL\">01:04:58 Getting in Contact IRL</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Is it possible you could take a picture of yourself... and send it to me in a PlayStation Network... message?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I will try and get a camera, yes!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I like that. Oh, by the way, uhh... you do have my phone number right?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uhhm- not yet, but I haven't been able to get hold of a phone, only at my current workplace. I was a- I was pretty desperate to find a place to live so I wasn't able to actually get a phone yet. But I would love to have it, so I can call it once I get to that point where... I can get one.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right well uh, you have uh... a pencil and paper?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uh huh, I do.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right well you can call me on my cell, it's uh... 760-0848, area code 434.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> One more time please?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I should uhh start from the beginning, it's uh, (434) 760-0848.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I- [<i>audio cut</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Got that?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Uh huh, indeed I did.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right, read that back to me.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> A'right. [<i>pause</i>] (434) 760-088- sorry. (434), 76...0-084...8.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah that's right.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Good.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> After you get your phone, let me know your number... uh uh- message on the PlayStation Network at work-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> A'right-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -or whenever we talk in private, and then I'll know it's your phone number.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm hmm! I'll try get a phone soon.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay. Good. Mmm. And uh- you know what? You made me feel good, even though I [<i>Windows beeping in the background</i>] didn't <a class=\"mw-redirect\" href=\"/cwcki/Chris_Loses_It\" title=\"Chris Loses It\">lose it</a> right away, you made me feel good.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm! I'm happy.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm happy I made you feel wonderful... as well.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm, you did.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I think it'll be better... when we're actually better in person.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It will.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You know what? I'm imagining myself leaning towards you, and my forehead's touching your forehead... \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> ...and we're looking at each other eye to eye...\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm. [<i>pause</i>] And then what happens?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>snorts, pause</i>] I dunno, we just... be emotional and then... and then we make out some more. [<i>laughs</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I look forward to it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, let's be emotional in person, together, when it gets to that point.\n</p>\n<h4><span id=\"01:08:06_Julie_AFKs_Out.2C_Some_Trolls_Laugh\"></span><span class=\"mw-headline\" id=\"01:08:06_Julie_AFKs_Out,_Some_Trolls_Laugh\">01:08:06 Julie AFKs Out, Some Trolls Laugh</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes. [<i>pause</i>] I'll be right back, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay, me too.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> A'right.\n</p><p>[<i>Sound of random junk being moved</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Umuhh- I'll be back in about five minutes.\n</p><p><font color=\"#CC00FF\"><b>Basement Rosechu:</b></font> In addition, this partnership is a better [<i>inaudible</i>] ability, will allow you to [<i>inaudible</i>] for any reason. We are a rapidly changing market, and under- [<i>Presumably, Chris tracks down the escaped rodent and murders her</i>]\n</p><p>[<i>Ominous silence</i>]\n</p><p><font color=\"#4DBD33\"><b>Troll:</b></font> [<i>faint</i>] Oh... god...! ...Huhuh... [<i>This is presumably the unknown dude who appears later in the chat</i>]\n</p><p>[<i>Sound of typing</i>]\n</p><p>[<i>Silence</i>]\n</p><p>[<i>Giggling and slapping of thighs in the background</i>]\n</p><p><font color=\"#4DBD33\"><b>Troll:</b></font> [<i>faint</i>] What the... fuck.\n</p>\n<h4><span id=\"01:09:42_Julie_Returns.2C_Chris.27s_Parents\"></span><span class=\"mw-headline\" id=\"01:09:42_Julie_Returns,_Chris's_Parents\">01:09:42 Julie Returns, Chris's Parents</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Ahh- hang on a second, I gotta put my earphones back on. [<i>pause</i>] Okay, so you were say-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> If I may ask?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Sorry, what?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Um-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh, you-y-y-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -would your parents mind?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> My parents mind what?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> If I came over to your house and we did the business? [<i>pause</i>] Would they mind? Would they be okay with it? I hope so.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, I think they're- I think they're- they're cool.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would love to meet your father and mother.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. And I- and I would- Imma let them know about you as well. They're looking forward to meeting you as well. You know, in introduction.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Mmm? Can you say that again?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I didn't hear you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. I said um- I'll tell- I'd talk to my mother, and let her know about uh you, and after you come over I'll be only too glad to uh, introduce you to <a class=\"mw-redirect\" href=\"/cwcki/Cole\" title=\"Cole\">the whole family</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm happy to see that- to hear that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> So Chris, mostly I've been talking about- mostly I've like been starting to talk... is there anything I can talk about? Anything I can answer for you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] Uhh, nothing comes to my mind right now, it's- it's pretty much... blank, you know? Hmm.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:11:34_The_Future\">01:11:34 The Future</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm, a'right. [<i>pause</i>] Hey Chris, how do you think your future will be like?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> H-How do I think my future will be like?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes! Either yours or mine and yours.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well uh you know, you know, for me at least you know, eventually, I would be married and... have my daughter named <a href=\"/cwcki/Crystal_Weston_Chandler_(daughter)\" title=\"Crystal Weston Chandler (daughter)\">Crystal</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hopefully you can be married to me, and I can be the mother. [<i>pause</i>] Chris, I would gladly be the mother to Crystal. Gladly.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right. Good. Unngh.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Would I be a housewife, Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm- we'll see, but uh, I was kinda hoping to be the house husband.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But I'm very good with <a class=\"mw-redirect\" href=\"/cwcki/Sonee\" title=\"Sonee\">children</a>... and I can cook.. I can clean very well, too.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, we'll see what- we'll see what happens when the time- when the time is right, you know?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> A'right. Do you think in the event that we- in the event that we do decide that I am the house... wife... maybe you could get a job? What job would you like to have? That's a good question, I would like to ask you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhhm, I'm not certain... but at least you know, you're promising, 'cuz, you know, you're thinking that doctor's a good job...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Wait Chris, what about your CADD degrees? You could get a job with that, can't you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh... probably, but uh, not really sure at the moment.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Cuz Chris, the thing is, I really don't have an American high school diploma, I can't work.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'm gonna *try* to get doctor, but it's not gonna be easy, you know?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I hear ya'. Hmm. Oh, I will definitely give the question some thought. Plenty of thought.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:13:58_Julie_Tries_To_White-Knight_Chris\">01:13:58 Julie Tries To White-Knight Chris</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Also, I'm really happy- I was looking at- I was looking at the Internet, I was happy to find out that there are a lot of things I can get online that I wasn't able to find in the Molvanîan stores. I was able to... I'd like to set up something called a PayPal, have you heard of it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. It's pretty good! Maybe-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I think I'll get one.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh... I usually use Paypal for like, uh... paying or... receiving money for goods I sell on eBay.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I didn't realize you sold things on eBay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, I did.\n</p><p>[<i>Julie and Chris talk over each other</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah uh, just various things I didn't need anymore. But it's like you know, it costs money to list- it costs money to list on eBay, and you would have to have a bank account linked to the PayPal account...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ahh.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But it's like you know- knows, it- so then it knows, so they know where to send the money to or take the money from.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I thought of something that might be able to get you money.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hey- what if you advertised Sonichu? And, it would gain popularity, and you could sell merchandise... you wouldn't need <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_saga\" title=\"Miyamoto saga\">Nintendo</a>, you could just sell it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm... I don't know about that, uhhm- \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I think it's a good idea, you really should advertise. Like, in your neighborhood. Maybe in <a class=\"mw-redirect\" href=\"/cwcki/Ruckersville\" title=\"Ruckersville\">Ruckersville</a>.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Umm... I'll give that some thought. I'll give that some thought. [<i>pause</i>] I'm not making any promises, I'm not making any promises, but I will gi- I will definitely... greatly consider it.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Could I consider something, Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Maybe- you could go outside, do a meet-and-greet. Just walk around Ruckersville and meet a lot of people. Say- just be nice to them and tell them about Sonichu, the popularity will indeed grow.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>pause</i>] That's something-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> They'll tell their friends.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's something that... in addition... I can think about.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I really hope you do, cuz', I really wanna see Sonichu become a main brand- maybe even a video game to come out, something I can play on my PS3. It would be wonderful.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. But you know what's uhh- more wonderful? Or what will be more wonderful?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> What? What?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You being here.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would hope that too. Sadly, the economy is not letting that happen easily. I've said before, I'm tr-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -trying very, very hard to get over there.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And your efforts will be greatly rewarded when you come.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I... since. Hmm. I figure you should try and do something. You need to prove to Nintendo that Sonichu is a great idea. I know that as far as what I've heard, they aren't exactly-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, actually... they agreed- they uh, they did, uh, you've heard- they've acknowledged that it is a great idea, but because I was unable to uh make the trip, because I could not afford it- afford the trip- said trip myself, to uh Redmond from Virginia, I mean, even on an airplane, or even in- or even on a- road trip...\n</p>\n<h4><span id=\"01:17:49_Julie.27s_Redmond_Plan\"></span><span class=\"mw-headline\" id=\"01:17:49_Julie's_Redmond_Plan\">01:17:49 Julie's Redmond Plan</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Well Chris, I have like- a step by step plan on what you can do. You can save up for a couple of months, step one. Step two, reserve a cheap airline ticket that can get you to Redmond. Second, bring a trusted friend along- maybe you can get a-hold of <a href=\"/cwcki/Cole_Smithey\" title=\"Cole Smithey\">Cole Smithey</a>, perhaps?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Uhh, I-I-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Are you still in touch with him?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh, sorry.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Maybe you could bring... Hmm- you could bring your <a class=\"mw-redirect\" href=\"/cwcki/Bob\" title=\"Bob\">father</a>? Maybe he could help. I've heard he's... he's got [<i>inaudible</i>] expertise.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>mumbles</i>] Mmm maybe my <a class=\"mw-redirect\" href=\"/cwcki/Snorlax\" title=\"Snorlax\">mother</a>... erm. Or you know, here's a thought... I could bring you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Weeell, I think we could try that, but I-I don't think it'll be in the near future if we try that...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> But by all means...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's uh, gonna be a while before we can uh, save up enough money to uh, actually... save up e- save up like... $800 for like a pair of tickets.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I don't think it'll be $800... I think it'll be something... maybe like $500? I'm not sure? But- I'm not positive...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, time will tell.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well, a couple of months and... you know. You can get there. They'll reimburse you, so it won't be a big loss- maybe-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -maybe you can get Sonichu made. You have to assert yourself, as I've said before.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:19:22_More_On_Nintendo\">01:19:22 More On Nintendo</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah... but it's also- but it's also like you know uh, I thought, I thought yeah- pretty much uh, <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> uh, pretty much gave me a pretty much- a very aggressive talk down to about... the project's cancellation.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. Though Reggie is... the big cheese of Nintendo, you should try-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -You should try... showing to Reggie that... you are just as capable... as anyone else at Nintendo. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah. No I've made-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -Show 'em you can... show 'em you can, <a class=\"external text\" href=\"http://www.youtube.com/watch?v=jUTl1vEG62Q\" rel=\"nofollow\">as Reggie once said at E3 I believe? Show 'em you can kick arse and take names.</a>\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. Yeah. But I gotta be able to afford the trip first. Then I can show it- then I can show it to him. And uh, after you get here, you can help me with that.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would love to help you with Sonichu. The game. I would love to help you. I honestly would.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And you know what else- and you know what else you can help me with in addition to that?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> What?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a class=\"mw-redirect\" href=\"/cwcki/Sweetheart_from_the_ground_up\" title=\"Sweetheart from the ground up\">You can keep me emotionally sound... and secure.</a>\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I will, I promise I will.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah uh, you know, I- <a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">I like your voice</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ch-Chris. Maybe you should try writing a game design document. Like, all your plans for the game... \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -every plan for the game?\n</p><p>[<i>Chris and Julie talk over each other</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -planning things out.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have uhh some... story I- I have some ideas for stories and unlock-ables already... typed up.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Well if-if you-if you could type it up or just send it to me, maybe ref-refine it a bit, maybe... send it to me- maybe I can try and...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -yeah well it's not complete, well I mean I still have other story details to figure out. But-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's still gonna be a while... for probably even that. And those ideas will be- pretty much will be translated into comics beyond <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">book number ten</a>.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:21:40_About_The_Next_Comic\">01:21:40 About The Next Comic</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm. Oh, that's another question- can I ask you something?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> About the next comic... do you think it'll take as long as the last one, or do you think it'll get here sooner?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] Urgh, we'll see. Depends on how I feel.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I'll do everything in my power to help you.\n</p><p>[<i>sound of Windows beeping in the background</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I'll... greatly appreciate that.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Hmm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. I should go, uhh... collect my thoughts about everything that we talked about, and... just go and give everything we talked about great consideration... and uh, big deal of thought.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> A'right. Hey Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Do you think you can come back here tomorrow for another private chat? I'd enjoy it if you could.\n</p>\n<h4><span id=\"01:22:48_From_Behind_The_Mirror.2C_Clyde_Returns.21\"></span><span class=\"mw-headline\" id=\"01:22:48_From_Behind_The_Mirror,_Clyde_Returns!\">01:22:48 From Behind The Mirror, Clyde Returns!</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> Wow, I've been here the entire time... heh heh heh... under <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">my cousin's name</a>, of course. *tsk* And by the way, Julie- how'd you enjoy that Salesman-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Clyde, get out of here, you jerk!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> How did you enjoy that salesman?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> How do you- how did you know?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Guess who that was... [<i>whisper</i>] Guess who that was...!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Get outta here you jerk!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> It's a troll! ...who was it?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It was me! C'mon I was in- arrg, God, you irritate me sometimes! And next time... I'll bring my <a href=\"/cwcki/Megatron_pistol\" title=\"Megatron pistol\">gun</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>whimpering</i>] Chris, I'm scared!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave her alone!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You're all the way over there, what are you gonna do?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">I'll haunt your dreams</a>.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I don't sleep.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll haunt you in your sleep.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I don't... sleep.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll haunt you at your every waking moment... in your- in the deep crevasses of your mind.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That's all you're going to do? Do you want me to just kill Julie and say-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -Chris...!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -I'll just haunt you in your dreams? [<i>cackles maniacally</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>sounding terrified</i>] He's gonna kill me Chris, help! Do something, please!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave her alone, you bastard.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That's not gonna make me do anything. That's not gonna make me do anything.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Watch out-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Are you going to run, Chris?\n</p><p>[<i>Julie begins crying and babbling in terror in the background</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That'll show me. Run away, run away! That'll do it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm not running.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What are you gonna do, Chris. What are you gonna do.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris? I'm worried...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] I will be by your- I will always be by your side, Julie.\n</p><p>[<i>Clyde and Julie talk over each other</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You can't even make the trip to Redmond... You can't even make that trip!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He knows where I live- he has a gun- he's gonna kill me!\n</p><p>[<i>They stop</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I'm worried for my life, you have to do something...! You said you'd protect me...!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have God by my side.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>chuckles</i>] There is no God, Chris. What are you going to do?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'll pray for Julie's safety. And I'll pray for you to... leave her alone. Ow. I'll definitely-\n</p><p>[<i>Julie whimpers and sobs in the background</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Praying... will do nothing, Chris. You couldn't even protect Sarah-! What makes you think you can protect Julie?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm offering... praying... is my way- is one way of offering... hope.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Hope. Obama- and that will do nothing!-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -and piece of mind-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -that will do nothing! ...maybe I should- \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -it will-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -just show up at her doorstep again.\n</p><p>[<i>pause</i>]\n</p>\n<h4><span class=\"mw-headline\" id=\"01:25:40_Clyde_and_Chris_Argue\">01:25:40 Clyde and Chris Argue</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Get outta here ya' bastard.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That's all you're gonna say, g-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -Chris!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -et outta here, y-you're not going to protect Julie.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm prot-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -Chris!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Well I can see she- worth-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am here. I will protect Julie.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> How?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave- you leave- you leave her alone.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Your words do nothing. You haven't taken action in your life, have you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have taken more action than you have taken... anything.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That didn't even make sense- when's the last time you been outside your house?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -terday.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Doing what? Doing WHAT? At McDonald's? Buying your- whatever-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He was getting something for his mother, you JERK- something you probably never... did!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, I was getting my mother a cup of coffee.\n</p><p>[<i>Clyde bursts into hysterical, maniacal laughter</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Ooooh my God, and tell me, tell me-\n</p><p>[<i>Chris and Clyde talk over each other- Clyde is inaudible</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well laugh now you bastard, but God will strike down, and smite thee.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Smite me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Okay, okay. Tell me what's the most... action thing you've ever done. I ran away from home, living on the streets and living in below-zero temperatures. What have you done, Chris?\n</p><p>[<i>Extremely long pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have stood up... \n</p><p>[<i>Chris and Clyde talk over each other again; again, Chris wins and Clyde can't be heard until the end</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -for my friends. And myself.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Like <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Megan</a>, am I right? Am I right?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You are only... a single, solitary soul. With only as much power as the next one. You are only- you are only trying to talk down to me... and scare... me... and Julie, because you yourself are-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -he IS scaring me!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Yes, and you totally protected S-Sarah, didn't you?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>frightened</i>] Chris, he knows where I live! He says he's gonna kill me! He has-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Of course I know where you live.\n</p><p>[<i>pause</i>]\n</p>\n<h4><span class=\"mw-headline\" id=\"01:28:03_Chris_Stands_Up_To_Clyde\">01:28:03 Chris Stands Up To Clyde</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> All you're trying to do is just... make yourself- all you're trying to do is- trying to up yourself... make yourself feel superior, when clearly you are not.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Clearly I am. I mean, come on. You can't even... tell me- you said you would like... fight me or something, you said you would inflict pain- c'mon man, you can't even like, I don't know, I don't know, like, any. I'm a little tired right now. Huh. I'm lost for words. There's-There's is no way to describe how pathetic you are. There is no way describe how pathetic you are.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You know what? You calling me pathetic is calling yourself... pathetic. You're about as pathetic as you are describing me as pathetic.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> ...what.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're the pathetic one. [<i>pause</i>] 'cuz you called me the pathetic one.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Wow, you really are autistic, aren't you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I may be high functioning autistic... but I know... the mindset of the majority of people individually. I have seen [<i>Windows beeping</i>] a lot... in my lifetime. I have seen so much. [<i>pause</i>] And you are trying to scare me... with your own... infe-with your own... inferiority... and <a class=\"mw-redirect\" href=\"/cwcki/Slow_in_the_minds\" title=\"Slow in the minds\">slow wit</a>.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What do you mean, slow wit? You're the one with autism!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You probably suffer from your own mental innis [sic] or physical ailment, don't you.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No, not really. I'm damn good looking. I'm pretty sure you'd be dead gay for me.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I bet you're on drugs, aren't you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris would never [<i>inaudible, something about being gay</i>], you jerk!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -okay Julie. I will never be turned.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yeah but Chris he knows where I live, I- mmm... I'm scared.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'll plan a visit tomorrow okay, Julie? I'll plan a visit tomorrow.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Noo...!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave her alone!\n</p>\n<h4><span class=\"mw-headline\" id=\"01:30:23_Russian_Roulette\">01:30:23 Russian Roulette</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> What are you gonna do? What are you going to do?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'm going to play Russian Roulette. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Ahh...! Chris!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You know what that is? I put a bullet... in a gun. For a thrill thing. Let's just see if she has the... luck, of an honest and pure girl.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] You know what? You've played Russian Roulette with yourself... I bet. And you've always come out at a loss...\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> If I lost I would be dead. Y-You know what Russian Roulette is, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Chris tries to be deep and meaningful</i>] Ooooh, not loss- as in, loss of life... but loss. As in loss- of emotion, of-\n</p>\n<h4><span class=\"mw-headline\" id=\"01:31:18_Clyde_Is_Crazy\">01:31:18 Clyde Is Crazy</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> Okay, you know what- forget the Russian Roulette game, I'm just gonna shoot her, how about that?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> [<i>fake sounding cries</i>] Chris! Help! ...Clyde, I'm warning you. My brother has-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What are you gonna do, Julie? What are you gonna do.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Dude. She has her brother... to defend her.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Uhh- Her- I've seen her brother, he's pathetic, I could easily kick his arse.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I doubt it.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Wait what is?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah well, you clearly underestimate a whole lot of people. So many-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Uhh, no I haven't. I easily got rid of <a href=\"/cwcki/Robert_Simmons_V\" title=\"Robert Simmons V\">Robert Simmons</a>, and I easily got rid of Sarah. I can do the same... again and again... and again and again and again. [<i>pause</i>] And again.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/Death_threats\" title=\"Death threats\">You really are a psychopath.</a>\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/The_Dark_Knight_(film)\" title=\"wikipedia:The Dark Knight (film)\">Why so serious?</a>\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You... need to be put in an institution.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Hehe, more like you need to be put in an institution. Hehe. I mean, you're obviously delusional- you really believe... that you- that you can smite me- and that you can stop me, with your words... you really think that.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't just think that... but I am confident.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You say that you know that- that's just confidence. I know that Julie will be DEAD tomorrow.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I know... that you... are already dead inside.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Yes, I've been dead inside for quite some time, you were right about something. But I'm still living... in this little body of mine... and I will take Julie's... tomorrow.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Noo...!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You will not.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You're right, you're right, I won't. I'll just leave her... I don't know. I don't know what I'll do.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> What are you gonna do!?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -she's a nice woman, she deserves to live. You don't, Chris- you don't deserve to live.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right if you've got the guts to say that, why don't you come over to my house in Ruckersville Virginia, you bastard?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Why should I? I'd be making the game too easy. And I... why don't you come to me?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh. I could easily come to you. But the question is, are you... are you, so called, brave enough to actually come to the man who you think you could take down easily... but you obviously fear so much.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You know the point of me doing this is so that you come to me, you do know that right?[<i>pause</i>] What, are you going to hide behind your parents? Your mother and father will protect you- is that what's going to happen?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> ...do not interrupt me, because I was at a trail of thought. [<i>pause</i>] Without me, your rage goes on without a point.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> W-Well yeah, that's the point. My rage will die when you die. That's... kind of the point.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And then what would you do?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> And then I could feel at peace.\n</p>\n<h4><span id=\"01:35:05_Clyde.27s_Backstory...\"></span><span class=\"mw-headline\" id=\"01:35:05_Clyde's_Backstory...\">01:35:05 Clyde's Backstory...</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> You would feel at peace, huh. Yet I bet- that actually you could say the same thing about somebody else who probably has abused you in your lifetime.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You said you ran away from home.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Yeah.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Was it something- was it- did you run away from home because your mother, or your father, or maybe both of them... was- was uhh, abusing you?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It was nothing like that, it was for a girl. That was a pretty bad lead in my opinion, but I've gotten over that. I'm here. And I want to do something terrible. I should write down my plan, right now.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>]\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So what are you gonna do. Whatcha gonna do. [<i>long pause</i>] Nothing apparently.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No...! I am going to do something.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Go to McDonald's?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, you really need to do something, I'm scared!\n</p><p>[<i>long pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm doing something Julie. I'm standing up for you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes, but he knows where I live!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I bet you can't even stand up, could you? Ha ha ha...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You just leave- you leave her alone. You let- you let- you let her live, you leave her... physically unharmed. Cuz, just as easily, I can call the police on you.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> A'right, do it. [<i>inaudible</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I will tell 'em the whole story. About you, and <a class=\"mw-redirect\" href=\"/cwcki/Ryan_Cash\" title=\"Ryan Cash\">Ryan</a>, and uh- what you did... they can- they can and will find you.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Well, a'right, look. My actual house is in Australia, a'right? But you're not gonna find anything there- you're just gonna find... woo. A bunch of weed I left back there, okay? I mean, you're gonna hide behind the police... and that's not gonna do anything because, you know, I am in America so- they aren't gonna do anything.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah well, let me ask you something. How could you afford... a trip to... Australia and back with every fare you could go quickly.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's called an inheritance. An inheritance. An inheritance.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You ran away from home, how did you inherit something?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Of course, I'm not a stupid person. I made up with my parents before they mysteriously died for some reason.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm taking a <a href=\"/cwcki/Pocket_knife\" title=\"Pocket knife\">stab</a> at this, but you killed them?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No. They uh... carbon monoxide.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>Chris sounds triumphant</i>] Carbon monoxide.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's some- ruhg. Look, never mind, you're too stupid to figure this out.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, I am not stupid. I have- I have perfectly... understanding... what carbon monoxide is.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Then what is it?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's a poisonous gas.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Where do you think that normally comes from? There's so many general- hehehe... accidental carbon monoxide poisonings.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/Autism\" title=\"Autism\">I can obviously tell because uh- you definitely killed them with your c- with the carbon monoxide, because you are putting so much emphasis on accidental.</a> You can set it- you can set it- you have obviously set up something that would... LEAK. The carbon monoxide... and kill your parents. What did you have against your parents?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Man you jump to conclusions... like a <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Office_Space\" title=\"wikipedia:Office Space\">jump to conclusions mat</a>. You seriously need help, you autistic fuck.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Oh- *I'M* the one who jumps to conclusions? Well you jump to- you jump to conclusions of me being <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">uncapable</a> of doing anything.\n</p>\n<h4><span id=\"01:39:46_Chris_Won.27t_Leave_His_Filthy_Shithole\"></span><span class=\"mw-headline\" id=\"01:39:46_Chris_Won't_Leave_His_Filthy_Shithole\">01:39:46 Chris Won't Leave His Filthy Shithole</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> You are uncapable [sic] of doing anything, I know that. [<i>pause</i>] What, am I right? Am I right? Just admit it. [<i>pause</i>] Oh God- every single woman, you wanted them to come to your house, you wanted... Sarah to come to your house, you wanted Julie to come to your house, you are so lazy- why don't you leave your house? <a href=\"/cwcki/Obesity\" title=\"Obesity\">And drop a few pounds</a>.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> God, stop it! That's enough!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's true isn't it, Julie, though? Is it true?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> No it's not, you're lying, stop it!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> He is lazy. He's not going to come to you, you have to come to him- you have to sacrifice everything. He just sits at home and... you know... plays his PS3.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> You're lying!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -plays his PS3. Isn't that right?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Stop it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, you are lying.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Stop it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Listen-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -I'm right!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He IS lying.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah, listen. Listen Clyde- if I could, I would come to- come to Julie personally, I would. But I have a lot at stake here. I leave- if I leave my house... a-and I mean, I don't know Julie's address. I don't know where she is right now. A-An if I had... and if I had- if I uh, had the address, I would most definitely go to her because she is- [<i>incomprehensible stammering, stress sigh</i>] -she would be there... to accept me. And let me in.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah? \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I know... I know that I said I would like you to come to me, but... I feel it would be better for you if I went to your house. That was my decision. I would... like to go to your place. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Thank you, Julie. I appreciate that but- I'm jus- I'm just letting you know...\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Actually, Chris-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> NO. I will never-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> This is actually a very hard choice-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No... Julie, I'm not going to let you-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> ...this is actually a choice...\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -never going to let you leave.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> CLYDE! Fine.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> SHUT THE FUCK UP.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No. I won't.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris... I need to think about this. I will think about this. Who's going to go where.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You can't think while you're dead, you know that right?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> This is... this is a somewhat hard choice for me to make, Chris. But I assure you- something will be done.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You're going to let them [<i>inaudible</i>], let them walk out, sacrifice her safety... just for you? Ooooh- you ARE pathetic man, you know that, right?\n</p><p>[<i>sound of random junk bumping around, an occasional stress sigh, long pause</i>]\n</p>\n<h4><span class=\"mw-headline\" id=\"01:42:56_More_Insults\">01:42:56 More Insults</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> I tell you what. You, Clyde... are so small. \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> More insults. That's going to stop me. You're gonna hurt my feelings so much I'm just... stay inside my hotel, and-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't have- \n</p><p>[<i>Chris, Julie and Clyde talk over each other- only Chris is audible</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't have- I don't have- \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I don't have to hurt your feel-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> What do you think about what I said? Do you agree with what I said Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Y-yeah. I-I hear you, Julie.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Thank you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Y-yeah. Anyway. You are small... [<i>stress sigh</i>] You think you can talk down... to anybody. You feel superior. When clearly, you are not. So therefore, you are definitely the small one in this room.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Why am I pathetic? That I actually went out the world, saw everything...\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I-It's because-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -instead of playing my PS3.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Because you stooped so low... to try and hurt other people, to try and make yourself feel better. That... is pathetic. Thinking that... hurting others... will compensate for anything, for the better, when clearly it does not. \n</p><p><font color=\"#4DBD33\"><b>Troll:</b></font> [<i>whisper</i>] AOmm...\n</p>\n<h4><span class=\"mw-headline\" id=\"01:44:23_Chris_Tries_To_Monologue_Clyde_To_Death\">01:44:23 Chris Tries To Monologue Clyde To Death</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> All it does is just... [<i>whisper</i>] hurts... [<i>normal</i>] the other people, and it hurts yourself further... because... you hurt... others, against God's will, and you can only... try to tone that pain down... with your own self abuse... in your- with your- in your own... weed... and whatnot. That- that's just sad. You have my PITY. [<i>pause</i>] You have my pity, Clyde. And I'm sorry that- I'm sorry that Ryan... committed suicide over the one mistake I made in protest of that ED page... but you do not need to harm anybody, you do not need to kill anybody, because all that will do is just hurt yourself further. Because after your- after your supposedly... you supposedly did this revenge act, then what would you do? You don't- you don't know. But you say yourself, that you will be at peace-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Exactly! That- that's my goal, to be at peace!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> But does it really... fulfill... your emotional needs-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Yeah. Yeah, it does. It really does.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It does- it will not. <a href=\"/cwcki/Death_threats\" title=\"Death threats\">Harming others does not accomplish anything.</a>\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris, you know all about harming others. You harm people every day. Your parents have to support you, every single day, they hurt inside. They hurt so much.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I know they hurt. And I feel their pain.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You are the CAUSE of their pain. They probably regret birthing you every single day. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> They do not. They appreciate it. They appreciate every moment. They have put so much time and effort in me- transforming me from... a mental nu- a mental case... to a- to a social pers- to a social butterfly... who can do s- who can do so much more than any other low-functioning autistic person can ever do. And for one thing? If they had not raised me the way they did, I would not be on the Internet, talking to... <a href=\"/cwcki/Trolls\" title=\"Trolls\">all the people</a> I have been talking to. <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">I am a warrior in my own rights</a> and my own personality.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So that's why your parents got you that <a href=\"/cwcki/Abusive_babysitter\" title=\"Abusive babysitter\">babysitter</a>... to GIVE you your autism in the first place, isn't it?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Clyde, I think that's enough.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No, I want him to answer this.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It's okay Julie. They did not know better about the babysitter. How could they?  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Alright.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Nobody but- It's not like uh, they knew the mindset of the babysitter. Nobody knows the mindset of any individual right off the bat. They have to get to- They have to actually take a little time to see inside them for how good or bad a person they are. And that takes a lot of time and energy. And my mother and father, in my lifetime, saw so much good in me, and all- I have been- and all I have shown for them was a lot of- was a lot of equal good. Some mistakes were made, yes. And I will not deny it, but I appreciate my mother and father, every day of my life. Because without them, I would not be a mainstream socially acceptable kind of man that I am today.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Let me tell you, let me ask you something from your brother, uhh, <a href=\"/cwcki/Cole_Smithey\" title=\"Cole Smithey\">Cole Smithey</a>, I believe.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Half.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> He said your parents, Bob and Barbara, met at a bar. And they concepted you out of a drunken stupor.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> What.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Your parents birthed you because they were drunk. They didn't know what they were doing.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> They were not-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> gave birth to a failure like you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Listen, they were not drunk. They were-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Ask them about it. Cole Smithey told you years ago to ask them about it but you never did, did you? Why don't you go ask them?\n</p>\n<h4><span id=\"01:49:20_Sex_in_the_City.2C_you_Faggot\"></span><span class=\"mw-headline\" id=\"01:49:20_Sex_in_the_City,_you_Faggot\">01:49:20 Sex in the City, you Faggot</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> You listen to me. Drunk or not, they had me. At an old age where my mother was so close to menopause and my father was a senior citizen. It- I was truly a miracle. It's like, I'm just like a man with only one ball and a woman with only one ovary. Which by the way, I picked that up from an episode of <a href=\"/cwcki/Homos\" title=\"Homos\">Sex in the City</a>.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Wuh- that's nice that you watch Sex in the City. You faggot. Anyway, ahhh-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Anyway-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Sex in the City is for girls, you do know that right?  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I feel that- that shows that are supposedly aimed for girls are- are best- are best set for- are best viewable by those of both genders. Because men can attribute very well- very- in a positive way emotionally from such emotionally enriching programs. And also, less wars would be caused if men were more emotionally [<i>audio break</i>] -iked as such- more emotionally caring and understanding. Like women are.\n</p>\n<h4><span id=\"01:50:51_War.21\"></span><span class=\"mw-headline\" id=\"01:50:51_War!\">01:50:51 War!</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> You do know wars have been caused for political reasons, not because men don't care. It's not about “ease of mental understanding feelings”, it's because of political gain. Power and corruption. What is wrong with you?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh</i>] Those people who have fought for power are clearly, were clearly not very well off themselves because they had to hide behind power themselves. So many people hid behind- hide behind one thing or another. I don't have to hide behind anything to prove myself. Anything or anyone.\n</p><p>[<i>Julie makes moaning noises in the background as Chris talks</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You do know that uh, even <a href=\"/cwcki/Operation_BARBarossa\" title=\"Operation BARBarossa\">Hitler</a> had a girlfriend?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes, I have heard that.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:51:53_Chris_sucks\">01:51:53 Chris sucks</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> My god Chris. Do you not understand? You are pathetic. Completely pathetic. Apparently- I'm surprised you managed to get three women interested in you. And yet you're not going to do anything. Come on Julie. If you stick with this man you will be making the worst mistake of your life. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Wu- well-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> That's not true!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Name three redeeming qualities that Chris has.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> There are too many to name! There are so many, I would have to make a lot of paragraphs all about them. And every quality he has is why I like him. And love him. So step off.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Okay, Chris, let me tell you something. Where do you think Autism comes from?  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Scientifically speaking it has possibly come from a drug, or otherwise it may possibly be genetic.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>furious</i>] Then why do you say a babysitter did it?! That's not drugs or uh, whatever the other thing you said. Genetics!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> The ba- ba- stop. The babysitter locked me in a room by myself. Without anybody else to play with or socially interact with. That's just, that's just a real-life event that brought out the uh, curse that was buried within me. From the genetics, or the uh, medication. \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Stop lying to me. You don't have autism, you're just using it as an excuse to blame all your problems.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have- I have <a href=\"/cwcki/Autism_papers\" title=\"Autism papers\">medical papers</a> I have, that prove- that prove that I was- that I did have autism. That's-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>interrupting</i>] That was in the <a href=\"/cwcki/1980s\" title=\"1980s\">1980s</a>. Get a REAL diagnosis!\n</p>\n<h4><span class=\"mw-headline\" id=\"01:53:57_Suddenly_Chris_loses_the_plot\">01:53:57 Suddenly Chris loses the plot</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> My first word- I said my first word when I was two weeks old.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Impossible. No man can learn a language that fast.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Believe it or not, I was in my mother's arms, and there was a woman witness aside from my mother, and I said “monkey”.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>laughing</i>] Are you sure you didn't say “McDonald's”?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I was trying to say mommy, but instead I said monkey.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Okay. If you get a real diagnosis, like now, you know what they'll call you? They'll just call you an idiot. Cuz that's what you are. You don't have autism, don't blame it on that.  \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're right. I don't have to blame everything on autism. But I am and was- I was at least. And I am a man, and I have recovered beyond- from beyond that. I have come out of my own autistic shell. And have- and have conquered so many boundaries that any low-functioning autistic person would only be too scared to leap over.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>Enraged</i>] They are not scared! What is wrong with you?! They have actual mental issues! You don't!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Right, they were inhibited. But I have conquered my inhibitions. You're right, I should not have to blame my autism. Because clearly I have conq- clearly I have overcome it.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You didn't overcome anything. You were just lazy from the start. You didn't want to make friends, you just said “Oh they're gay, I don't want to be their friend”. You know high-functioning autism is a lie, it's a complete lie.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It may be a lie from your point of view, \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's not a point of view, it's fact, it's fact.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Maybe from your point of view, but-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I just said not point of view! It's a fact.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It may be. But it describes an origin.\n</p>\n<h4><span class=\"mw-headline\" id=\"01:56:37_The_terrible_truth_of_High-Functioning_Autism\">01:56:37 The terrible truth of High-Functioning Autism</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> Look- look it up yourself! Look up high-functioning autism. Who actually agrees with it? No one! Only actual autism or that Asperger's thing, but no such thing as high-functioning autism. No such thing.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>sigh, pause</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> As I said, get a real diagnosis! Now! And see what they say about you.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I may consider that.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Don't consider it, do it. I want you to know the truth. Maybe then I won't hurt Julie. We'll make a deal. I won't hurt her if you just do my demands. And they're simple demands, not crazy stupid ones.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, please.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What's that Julie? You want him to do it?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I just want you to leave me alone Clyde!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I will! If Chris does what I ask.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright. I will see- I will look into getting a more updated diag- analysis of my autism.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris, that means that I think you're gonna be lying again. And you know how much I hate lies.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Clyde, I tell you nothing but the truth.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You have been lying this whole time. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well, as far as my autism goes, we shall soon see. I will find somebody to test me, and we will soon see what it says on the paper.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Okay. Look it up on Wikipedia. High-functioning autism, right now. I want you to look that up. Alright?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Fair enough.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> See the part were it says “Classification”? It's not a recognized diagnosis.\n</p><p>[<i>annoying loud clattering as Chris types</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm typing it.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -As said in the 1980s as a crazy voodoo economics blah blah blah. Okay? You get a real diagnosis. This to why. This it doesn't exist anymore, today's society.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm, say that again?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Read the part where it says classification. Read it. Read it to me. If you can read.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It says here it's not a recognized diagnosis in the DSM, oh, Diagnostic Statistical Manual of Mental Disorders.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Exactly! It's not recognized.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So do you know what that means Chris?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>brief pause</i>] Give me a moment and I will answer that question. I wish to read further in this document.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's a simple sentence with simple comprehension! It's not a- it's not a recognized diagnosis. So what does that mean? That they diagnosed you with something that doesn't exist!\n</p><p>[<i>All quiet on the Weston front. Finally Chris speaks.</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Alright. From this, from the one sentence, in this said I was never with a mental block.  \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Exactly. You never had a mental block.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Fine. I agree.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Now why do you blame everything on your autism when you don't have it? What was really stopping you Chris?\n</p><p>[<i>Very long pause, approximately fifty seconds. Occasional typing in the background.</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Maybe you should... make a video... to your so-called fans. Maybe that'll help you stop me. You think that'll stop me? No, it won't.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. A'right, so what- so to answer your question... the only thing that was stopping- the only thing that was stopping me from... this, was... because I was- I was- I was less able to... interpret non-verbal cues.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> W-W-What are you talking about. Look, I mean, come on man- you're 26 years old, you live with your parents, and now you don't have this mental block- what are you gonna blame it on? You can't get it- you don't have a job, I-I-even if you were given all the money in the world, you wouldn't be able to figure out how to rent an apartment. You wouldn't even know how to cook, you don't know how to clean, you are a pathetic excuse for a man. \n</p>\n<h3><span id=\"02:03:09_Chris_is_Educated_On_Cooking.2C_Living_in_Filth\"></span><span class=\"mw-headline\" id=\"02:03:09_Chris_is_Educated_On_Cooking,_Living_in_Filth\">02:03:09 Chris is Educated On Cooking, Living in Filth</span></h3>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> Sir! I will have you know that in high school I took two home economics classes, so I am very well educated- so I am educated on cooking. And, I have been cleaning... a whole bunch of <a class=\"mw-redirect\" href=\"/cwcki/Chandler_cats\" title=\"Chandler cats\">cat poo</a>. As well as some cat pee. And recently, when I overflowed a commode I had to clean some of the wat- a little bit of the water that ha- that was on the floor, with 409 and paper towels. Aaand I am capable-\n</p><p>[<i>Clyde appears to have some kind of laughter based seizure in the background</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am capable of loading the washing- the uh, washing machine, with clothes of a white- or a <a href=\"/cwcki/Niggos\" title=\"Niggos\">colored</a>... and put in some laundry d- and put in some laundry detergent from... a single <a class=\"mw-redirect\" href=\"/cwcki/Fapcup\" title=\"Fapcup\">cup</a>... out of a whole box, close the lid, and start the washing machine. And then transfer everything to the drier... and start the drier. And also I am capable of loading the dishwasher... with the dishes... on the bottom and the cups- and the cups and the mugs on the top rack... putting some powdered detergent in there... and starting the dishwasher. I am also capable of uh... using of a- hand washing the uh dishes, the cloth- the wash- the- the dish cloths and such... I am also capable of uh, taking the garbage bags out of the garbage can... and putting an empty garbage bag into the garbage can... and taking the garbage- taking the garbage bag... taking the bags full of garbage up to the top of the hill, to be burned in the barrel. And also, the cans will be- will be- will be in the c- will be in the bags, and they go to the <a class=\"mw-redirect\" href=\"/cwcki/Recycling\" title=\"Recycling\">recycling</a> facility.\n</p><p>[<i>Chris seems very impressed with his remarkably mundane list of abilities</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Congratulations! You can do anything that a normal person can do. I con- [<i>sound of windows beeping in the background</i>] -<a href=\"/cwcki/Count_Graduon\" title=\"Count Graduon\">gradulate</a> you. [<i>pause</i>] Lemme tell you something- you need two classes to tell you how to do that? God- you can't support yourself, you can't- you can't support a family. God you make me so angry. \n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Tell me, why do I make you angry?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Because you are a pathetic excuse for a man. And I'm trying to protect these women, with, you know, whatever I have to do to get them away from you. That is why Sarah is no longer talking to you. I have convinced her that you are a pathetic excuse for a man, you can't do anything.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm. \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> And so far you haven't proven otherwise- you still live with your parents, you still don't have a job, you failed to go to Nintendo- I mean God, that was a golden opportunity and you failed miserably. So what do you have to say to that.\n</p><p>[<i>pause</i>]\n</p>\n<h4><span id=\"02:06:22_Paging_Mr_Floyd.2C_Your_Wall_Is_Back\"></span><span class=\"mw-headline\" id=\"02:06:22_Paging_Mr_Floyd,_Your_Wall_Is_Back\">02:06:22 Paging Mr Floyd, Your Wall Is Back</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> I did not have the money to... make the trip, but-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Because you do not have a job. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No, because- no, it was because I was compulsive with spending. And I did not... have enough saved at the moment. But I am s- but I am saving-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> How much do you have m- how much money do you have saved at the moment? How much money do you have saved, from what you get from the government. That's it. If you had a job, you would have plenty of money to go. You know that $300 is... barely anything for someone with a job.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> $300 dollars. You're thinking I get $300 a month... \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You would get well more than that if you HAD A JOB! [<i>Clyde sounds enraged</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>smug</i>] I got news for you. I heard I'd get $800 a month.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>Clyde begins to crack</i>] God you- [<i>Windows beeping</i>] get- way more than $800 a month IF YOU HAD A JOOOOB.\n</p><p>[<i>pause</i>]\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Wall.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"225\" src=\"/w/images/thumb/6/67/Wall.jpg/300px-Wall.jpg\" srcset=\"/w/images/thumb/6/67/Wall.jpg/450px-Wall.jpg 1.5x, /w/images/thumb/6/67/Wall.jpg/600px-Wall.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Wall.jpg\" title=\"Enlarge\"></a></div>This is what Clyde is arguing against.</div></div></div>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> And it increases with every... year... on my birth month.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You do realize that people make thousands more a month, with something called- [<i>deep intake of breath</i>] A JOOOOOOB!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am aware of that. But I just do not feel... at the time... that I need to be... in a job, because, I am getting the money from the <a href=\"/cwcki/Monthly_tugboat\" title=\"Monthly tugboat\">social security</a>... and my fath- and my father's assured me that it's more than- that it's more than anyone can make... in a jooooob...\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Are you- are you- are you an IDIOT!? You could EASILY make more than $800 a month with a JOOOOOB. Look- I'm pretty sure you could make more on minimum wage!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well that's just, pretty much, shows what you know. Have you ever had a job?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Of course. I've had [sic] one right now. A driving job. Where I drive people around tonnes of places. Sure, gas is expensive, but I make more than enough. And I love driving, it's my favorite thing- [<i>Clyde's voice becomes stalkerish</i>] I love it so much.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I mean- lemme- lemme ask. Limo... or taxi?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> It's my own, personal, driving business.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I see. Hmm.\n</p>\n<h4><span id=\"02:08:44_Chris.27s_Skills\"></span><span class=\"mw-headline\" id=\"02:08:44_Chris's_Skills\">02:08:44 Chris's Skills</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> You can make your own job. If it's a service people want. Which is more than I can say for [<i>inaudible</i>], there's tons of people without cars. And I get get them places. So Chris- what are your skills? What can you do?\n</p><p>[<i>significant pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Actually I'd say basically I'm... <a href=\"/cwcki/Obesity\" title=\"Obesity\">all-round</a>. But you see, that's a problem- I have too many... skills that I am good at. You might say-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>Clyde seems naturally incredulous and angry</i>] If you're so good at them, then get a job in ANY ONE of those skills. C'mon! \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You might- you might say I'm a jack of all trades... and master of none. \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Then get something with minimum wage- c'mon man, that is th- that is the worst excuse I've ever heard. [<i>Clyde adopts a mocking tone</i>] I'm too GOOOOD for all these things, I'm not gonna get a job! [<i>normal voice</i>] That is the worst excuse I've ever heard.\n</p><p>[<i>pause, large amount of background noise and static</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am cap- I am capable... and willing... to get a job... whenever I want to. But I just want to make sure that I have a job where I would feel... most comfortable- most comfortable... with [<i>Windows beeping</i>], where I would feel- where I would not feel that I was being... pigeoned-holed for my skills... and that I was making fu- that I was making good use of my uh- skills as well. And-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No you don't.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And defin- and also... make enough- make if possible, over a thousand a month.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You could easily make over a thousand a month. I mean, Christ man, you have two degrees in this CAAAAAAAAD thing, right? \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>smug</i>] I have earned those, yes. It's-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What have you done with those? What have you DONE.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>smug</i>] I have designed the <a class=\"mw-redirect\" href=\"/cwcki/CWCville_Shopping_Mall\" title=\"CWCville Shopping Mall\">CWCville shopping center</a>.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Show me. Show me this. Show me. I'd love to see it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It would take a whole bunch of scanning.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You've got time. Send it to me. You know my e-mail- you know, GREGG MAYS- with three g's. And what else have you done with your degree?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have put more perspective into my artwork. And my creativity.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> What do you get from your artwork? NOTHING. You don't get money from your artwork.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Maybe not, but it was uh- but it is- it is something that is capable of... enjoying. At my own personal pace.\n</p>\n<h4><span class=\"mw-headline\" id=\"02:11:41_Clyde_Loses_It\">02:11:41 Clyde Loses It</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> No- I am also capable of enjoying blowjobs, okay? But doesn't mean- I CAN'T MAKE MONEY OFF THAT. [<i>pause, quietly</i>] In fact that costs me.[<i>normal</i>] But ANYWAY. [<i>dramatic</i>] What... can you do... that makes... MONEY. You are a PARASITE on America's teat [<i>inaudible</i>]. You just LEACH off the government, getting money that- those who- money just because you're autistic- WHICH YOU ARE NOT. You're just leaching off the government. [<i>pause</i>] People with actual jobs support your lazy arse.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am capable of... standing up... and supporting myself, wh- when I am... when I am ready to. But I like to feel like I-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>exploding</i>] You're 26 years old, WHAT DO YOU MEAN YOU'RE NOT READY?! \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I like to feel like I have a woman by- by my side to help me make sound decisions. [<i>digital sound in the background</i>] At the right time.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Spoiler alert: you're never going to get a woman. [<i>pause</i>] You know what? You wouldn't even like it-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes he will! Me!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Be quiet. I'm talking, Julie. I'm trying to tell you- \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> No!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -how pathetic he is, you need to see what this man-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> No! No!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -is the worst mistake of your life!\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> You're a jerk!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> No- no. I'm trying to help him. You know my cousin <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian</a>? She's been trying to help this fool... and guess what? Nothing has worked. [<i>Clyde stammers uncontrollably</i>] -get actual help. What have you done, Chris- WHAT HAVE YOU DONE.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>smug</i>] I... am seeing my pastoral counselor. <a href=\"/cwcki/Rocky_Shoemaker\" title=\"Rocky Shoemaker\">Rocky Shoemaker</a>... on a weekly basis.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> And how has she helped your life?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> She is helping me grab a more s- stable, s-sense in my mind, and capable of uh understanding... [<i>another, identical digital sound</i>] p-pieces of my... pieces... around here and there.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That doesn't make SENSE! See an ACTUAL psychologist.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Mmm. Well. She may- she is- she may not have a degree in psychology, but I feel that her work is greatly... greater that w-w-w-wait a minute, lemme rephrase that. [<i>muttering</i>] Gimme a moment... [<i>sharp intake of air, normal voice</i>] She is... wonderful. And... certainly more than any... $25 an hour-per-visit psychologist can do. And I have seen a $25 dollar an hour psychiatrist... Dr Price. I forgot his first name.\n</p><p>[<i>Chris confuses a psychologist, someone who simply counsels their patient, with a psychiatrist; someone who can provide the aforementioned council but may also prescribe powerful anti-psychotic and anti-convulsive medication. Reference: <a class=\"external free\" href=\"http://depression.about.com/cs/psychotherapy/f/psychologist.htm\" rel=\"nofollow\">http://depression.about.com/cs/psychotherapy/f/psychologist.htm</a> . It's interesting to wonder which one he actually saw, especially since the name of the doctor on his <a href=\"/cwcki/Autism_papers\" title=\"Autism papers\">autism papers</a> isn't Price, it's probably not the same doctor. As for the first name of the doctor who treated him, all signs point to <a class=\"external text\" href=\"http://www.vitals.com/doctors/Dr_Douglas_B_Price.html\" rel=\"nofollow\">Douglas</a>.</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> And what did this... Price guy... do?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> When I was... when I was required by <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">Piedmont Virginia Community College</a>... or more specifically, the real life <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>... to uh, see Dr Price... he helped me sort out some <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">anger management</a> i- sort out some anger management issues I had... at that time. And also allowed me to- and also helped me... in... putting my sweetheart search in perspective. And how to improve on that... and I think uh, that from his help I was able to uh... more comfort- more comfortably at my own pace actually make some good- make a good- good number of gal-pals and then find uh, and then eventually find one that uh, would be my true sweetheart.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> And it'll be me, Clyde. Don't you think otherwise you jerk!\n</p><p>[<i>pause</i>]\n</p>\n<h4><span id=\"02:15:34_Clyde_Can.27t_Beat_The_Wall\"></span><span class=\"mw-headline\" id=\"02:15:34_Clyde_Can't_Beat_The_Wall\">02:15:34 Clyde Can't Beat The Wall</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>stress sigh</i>] Uhgh... I've got nothing. I- I can't even begin to describe how pathetic you are.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You see-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He's rubber you're glue, everything you say bounces offa him and sticks to you.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris used that insult a while ago. That- insults do nothing. I'm citing some real life things I know about Chris, and I'm using it against him, I mean- you say that <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">ED page</a> is full of lies but every single thing on it is true. I know the people there. I know who <a class=\"mw-redirect\" href=\"/cwcki/Blanca\" title=\"Blanca\">Blanca</a> is. [<i>whisper</i>] I know all these people. [<i>normal</i>] Yet you seem... urgh. You think that ED twists your words around- they're YOUR WORDS. People are just interpreting as such. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>smug</i>] Exactly. MIS-interpreting them.\n</p>\n<h4><span id=\"02:16:27_Chris_Doesn.27t_Know_Why_Megan_Left\"></span><span class=\"mw-headline\" id=\"02:16:27_Chris_Doesn't_Know_Why_Megan_Left\">02:16:27 Chris Doesn't Know Why Megan Left</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> They are YOUR WORDS. I mean, why do you think <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Megan</a> left? Why do you think Megan left.\n</p><p>[<i>long pause</i>]\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:ShecameforCWC_(200803).JPG\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"232\" src=\"/w/images/thumb/6/6c/ShecameforCWC_%28200803%29.JPG/300px-ShecameforCWC_%28200803%29.JPG\" srcset=\"/w/images/thumb/6/6c/ShecameforCWC_%28200803%29.JPG/450px-ShecameforCWC_%28200803%29.JPG 1.5x, /w/images/thumb/6/6c/ShecameforCWC_%28200803%29.JPG/600px-ShecameforCWC_%28200803%29.JPG 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:ShecameforCWC_(200803).JPG\" title=\"Enlarge\"></a></div>Some of Chris's tender honesty.</div></div></div>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> I CAN answer that... and I am just try- and I am trying to think- and I am thinking... of a good way... to phrase it. In my own a- in my own honest and <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">humble</a> opinion. [<i>long pause</i>] Simply put I was... very- I was... emotional. And I tried to outreach- I tried to reach out for her in an emotional sense... with... tender- with <a class=\"mw-redirect\" href=\"/cwcki/Rape\" title=\"Rape\">tender honesty</a>... and uh... a gentle... hand on the shoulder... apparently I got to close. And she felt uncomfortable, and she just forced me away.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>furious</i>] <a class=\"mw-redirect\" href=\"/cwcki/SheCameForCWC.jpg\" title=\"SheCameForCWC.jpg\">YOU DREW A PICTURE OF YOU HAVING SEX WITH HER.</a> What is wrong with you!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That was... after the ED page, and I did that in protest against it.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>angry</i>] That doesn't even make sense! You drew that out of your... God, I don't even know- wanna think... sexual deviant. That is why Megan left you, because you are way too fucking creepy for her. She put up with you for <a class=\"mw-redirect\" href=\"/cwcki/Megan_Saga\" title=\"Megan Saga\">two years</a> while you touched her and... GOD, I don't wanna think about it. So for two years she put up with you. And what do you do? You draw a picture of you having sex with her.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> For your information, it's hard to tell, because... I had her- I had her eyes... censored. Just like you would see on any television... program. Of-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -that sort.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"400\" src=\"/w/images/thumb/1/1f/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg/300px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg\" srcset=\"/w/images/thumb/1/1f/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg/450px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg 1.5x, /w/images/thumb/1/1f/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg/600px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_07.jpg\" title=\"Enlarge\"></a></div>The <a href=\"/cwcki/Crumple-Lope\" title=\"Crumple-Lope\">Crumple-Lope</a>, or as the State of Virginia will one day refer to it as, 'Exhibit A'. This is where the remains of Chris's horrible drawing presumably lie.</div></div></div>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"225\" src=\"/w/images/thumb/e/e8/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg/300px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg\" srcset=\"/w/images/thumb/e/e8/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg/450px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg 1.5x, /w/images/thumb/e/e8/Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg/600px-Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Christine_Weston_Chandler%E2%80%99s_Lot_Of_32_Porn_Drawings_01.jpg\" title=\"Enlarge\"></a></div>\"I have actually done it up into bits and pieces.\"</div></div></div>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> You... told her. That it was her. She knew that it was you. It's just between you, and Megan- it doesn't have anything to do with anyone else, that ED, no trolls, [<i>inaudible</i>] -have lost, whatever. It's between you and Megan. You screwed it up. You're the only one to blame.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes. I made the mistake. <a href=\"/cwcki/I_Am_The_TRUE,_Original_CCWC\" title=\"I Am The TRUE, Original CCWC\">I do not deny it</a>. And I blame myself for uh, having drawn that picture. In fact... I have actually done it up into bits and pieces, and I have the pieces tucked away in a crumple-lope [<i>sic. Presumably he means envelope.</i>]. That one drawing.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You know what? That's an improvement. That is something of an improvement. But that still doesn't make up for everything else you've done.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>massive stress sigh</i>] I will not-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Lemme tell you something. Why do you hate <a href=\"/cwcki/Homos\" title=\"Homos\">gay people?</a> You know [<i>voice goes to a whisper</i>] <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">my cousin</a> is the biggest... lesbian. [<i>normal voice</i>] So why do you hate them?\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That is... I just do. I have had the bad experiences, against... I forget his last name at the moment. But- he was the Principal at- Oh yes. Doctor Johnson of <a href=\"/cwcki/Nathanael_Greene_Elementary_School\" title=\"Nathanael Greene Elementary School\">Nathanael Greene Elementary.</a> The principal. He was a h- he was uh, the homo... that pretty much set me against... the homos and further kept me on the <a class=\"mw-redirect\" href=\"/cwcki/Homo#fear_of_becoming_a_homo\" title=\"Homo\">straight path</a>. And plus, if I was ever a ho- if I was ever- if I ever, if I were ever... had any attractions to the men, then I would be uh- more inclined to associate with them, but I have rarely associated with a man. I've felt more comfortable with the women. And-\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Asperchu_Principal_Parody.JPG\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"214\" src=\"/w/images/thumb/5/5c/Asperchu_Principal_Parody.JPG/300px-Asperchu_Principal_Parody.JPG\" srcset=\"/w/images/thumb/5/5c/Asperchu_Principal_Parody.JPG/450px-Asperchu_Principal_Parody.JPG 1.5x, /w/images/thumb/5/5c/Asperchu_Principal_Parody.JPG/600px-Asperchu_Principal_Parody.JPG 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Asperchu_Principal_Parody.JPG\" title=\"Enlarge\"></a></div>After Chris told <a class=\"mw-redirect\" href=\"/cwcki/Alec\" title=\"Alec\">Alec</a> about Principal Johnson, it was parodied in <a href=\"/cwcki/Asperchu\" title=\"Asperchu\">Asperchu</a>.</div></div></div>\n<p>[<i>Clyde talks over Chris</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris, that is a lie. That is a lie.\n</p>\n<h4><span class=\"mw-headline\" id=\"02:20:15_Chris_Stacks_Lies_On_Lies\">02:20:15 Chris Stacks Lies On Lies</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> I've felt more attracted... to...\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Chris, did you watch the Super Bowl? \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I did not watch the Super Bowl.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> With your male friends- COME ON. Just because they're your friends doesn't mean it has to be GAY.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I guess-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Just because one. Bad. Person. Just ruined it, doesn't mean every single person is bad. Just like Mary Lee Walsh is a terrible woman doesn't mean all women are bad, right?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I guess... [<i>pause</i>] Yes. I agree with you with that statement.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>annoyed</i>] So why do you hate them so much?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I never really said... that I hated them. That is another misinterpretation-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>explodes</i>] YES YOU DID, <a href=\"/cwcki/CWC_Update_30_January_2009\" title=\"CWC Update 30 January 2009\">YOU SAID IT IN YOUR VIDEOS</a>, DON'T LIE TO ME! ...lies.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Okay well, okay, I was misunderstood. I may have chosen a wrong choice of words.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>furious, quoting Chris</i>] <i>I HATE THEM</i>. HOW... ELSE...! HOW CAN YOU MIS- DAAAAAAGOD! That is just BLATANT HATRED. That is just blatant hatred.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It was obviou-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Then why did you-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> It was obviously misplaced rage.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> For a thing that happened to you years ago.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yes.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You can't blame- you blame that principle all you want, I agree with you on that. If they feed you something terrible, then that's fine. But way you can hate EVERY. SINGLE. PERSON. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You are right! I do not hate every single... person. I mean, I will respect... and only respect... my fellow maaan. And, pretty much acquaint to [<i>sic</i>]... only friends- only friends with a man. I am willing to associate... with my- with my fellow man. [<i>pause</i>] But fo- but fortunately God has blessed me with a majority of <a class=\"mw-redirect\" href=\"/cwcki/Gal-pals\" title=\"Gal-pals\">female friends</a>, to show me that... to show me how to get to [<i>sic</i>] more in touch with my emotions because... if you- if you notice in the definition of autism, defini- er- er-... [<i>stress sigh</i>] We have- we autistics have a lack... in the uh non-verbal... non-verbal communications and misinterpreting them... and with that we are unable-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> [<i>furious again</i>] I JUST SAID YOU WEREN'T AUTISTIC. You aren't! That is a lie! You're- [<i>Windows beeping</i>] blaming autism AGAIN.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am not blaming my autism. I'm just describing... a couple of traits among the autistic people.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Which you aren't. [<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah w-w... autistic people also... have the inability-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -which I just said you AREN'T. So why are you bringing it up?\n</p><p>[<i>The Wall keeps talking, simply ignoring Clyde</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> ...the inability to express their emotions... soundly. With- without understanding.\n</p>\n<h4><span class=\"mw-headline\" id=\"02:23:23_Clyde_Demands_A_Video\">02:23:23 Clyde Demands A Video</span></h4>\n<p><font color=\"#4DBD33\"><b>Clyde:</b></font> A'right. Listen to me- I'll give you a two day reprieve. Just make a video to YouTube. Three minutes, <a class=\"mw-redirect\" href=\"/cwcki/Captain%27s_Log,_Stardate_February_5th,_2009\" title=\"Captain's Log, Stardate February 5th, 2009\">proclaiming your love for men. how gay you are</a>, and I'll give you a three day break. You try to save Julie. Well I guess [<i>inaudible</i>] or something. If you don't do it within the next-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Wait- wait!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> THREE hours... I will- w-well, we'll see Julie's funeral... in a few weeks, then. A'right? You understand me?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh god-!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -you shut up-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> -oh GOD!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Clyde, you shut up. I'm straight. \n</p><p>[<i>Clyde, Julie and Chris all talk at once; this is all I can make out</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I will never be-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -make a video to YouTube, I will destroy your image. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, I think he means it!\n</p><p>[<i>They stop talking over each other</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> And if you don't do it? I will... I don't wanna kill Julie. Just... maybe just cut off an arm.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave her alone.\n</p><p>[<i>Julie begins to cry in the background</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris, please, Chris, he knows where I live!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Well-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You leave Julie alone. I am straight-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He's going to do it! He's going to do it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -and I will never admit the opposite.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So you're not gonna make that video.\n</p><p>[<i>pause</i>]\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Make another reasonable request.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> That is a pretty reasonable request. I mean-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> You're asking me- you're asking me-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -you can always <a href=\"/cwcki/Chris_Destroys_His_Vibrator\" title=\"Chris Destroys His Vibrator\">take it back with another video!</a>\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Well I- you are asking me to <a href=\"/cwcki/List_of_Chris%27s_lies\" title=\"List of Chris's lies\">lie</a>. Right off the bat, you are asking me to make a false-\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris! You can just remove it after he sees it, can't you? As long as he sees it, you can remove it!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Hmm.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I don't wanna lose my arm...!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'll take off a leg too, how about that?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Oh God...! Oh God Chris, I'm sorry, I just don't know what to do- I'm scared!\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So what's it gonna be... your image, or your woman?\n</p><p>[<i>long pause, approximately seven seconds</i>]\n</p>\n<h4><span id=\"02:25:14_What.27s_It_Gonna_Be.3F\"></span><span class=\"mw-headline\" id=\"02:25:14_What's_It_Gonna_Be?\">02:25:14 What's It Gonna Be?</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> My... image. I will... sacrifice that.\n</p><p>[<i>Chris retardedly misunderstands the question. He was being asked which he would SAVE, not which he would SACRIFICE. Clyde begins to laugh hysterically.</i>]\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> So you're gonna- you're going to heeeh... let her lose her aaarm-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>annoyed</i>] No, I said I would sacrifice-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> -oooh what the fuuuuck!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>screaming</i>] SHUT UP! [<i>normal</i>] I'm sacrificing my image.\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Ahhh. Okay. I thought you were THAT pathetic, for just a second. But you're a little bit above pathetic. Which I haven't come up for a word for that yet. Okay- three hours. Three minutes. If I don't see it then, I'll make some plans. And I feeear-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Charles[<i>sic?</i>]- specifically what you want me to say in the video...\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> You're gay. How much you love men. How loooong you've been closeted... you pretend you have all these gal-pals but they're only to disguise your true nature. You've always been born this way. And it's all you have to say. [<i>pause</i>] And you better do it.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And I have three hours to come up with a three minute video-\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Yes... that's my request.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> -of that sense. Very well. \n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> Well... I appear that I'm going to be banned from this server soon. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] Sorry, can you repeat that?\n</p><p><font color=\"#4DBD33\"><b>Clyde:</b></font> I'm going to be banned from this server soon. I fear it. Well- tootles. [<i>inaudible</i>] -smoke.\n</p>\n<h4><span id=\"02:26:32_Clyde_Vanishes_In_A_Puff_Of_Smoke.2C_Some_Dude_Appears\"></span><span class=\"mw-headline\" id=\"02:26:32_Clyde_Vanishes_In_A_Puff_Of_Smoke,_Some_Dude_Appears\">02:26:32 Clyde Vanishes In A Puff Of Smoke, Some Dude Appears</span></h4>\n<p><font color=\"#0033FF\"><b>Chris:</b></font> [<i>stress sigh</i>] Julie I will make the video. I will abide with his request.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Chris... I think you might have saved my life. I am eternally grateful. \n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I am willing to sacrifice [<i>beep</i>] anything for my woman. \n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> If there's anything you want me to do... for you.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Is Clyde in here?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> No.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> He's gone.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Was he in here?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Yeah.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> If he's ever in here again, um- just find me? I-I'm the admin of the server. So I can-\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Y-Yeah, it's okay this time. \n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> He just wants me to lie.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Wait, what?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> He wants me to lie in a video.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Lie about what?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> About my orientation.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> That's terrible. Why would w-w- don't do it, Chris!\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I have to.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Why?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> For Julie.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> That's admirable I guess. I know you're a good person, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'd rather lose my- I'd rather lose my image than a woman who cares about me very much. [<i>pause</i>] And uh, Julie?\n</p>\n<h4><span class=\"mw-headline\" id=\"02:27:49_Taping_His_First_Time\">02:27:49 Taping His First Time</span></h4>\n<p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> <a href=\"/cwcki/For_Julie%27s_Eyes_Only\" title=\"For Julie's Eyes Only\">We can vi- we can videotape... I would like it if we could videotape our first time together.</a>\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I would like that too, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I'm- I mean like, you know, over a- over my <a href=\"/cwcki/PSEye\" title=\"PSEye\">PlayStation Eye</a>, and over with uh- with uh- with uh the <a href=\"/cwcki/Pickle\" title=\"Pickle\">worst parts</a> cut out, uh- I can upload that and uh... we'll undo that.\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> I'll leave you alone.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> That's okay. [<i>More Windows beeping, pause</i>] Undo the lie I would have to tell.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> All right- yes. Where would you upload it, exactly? The video of our first time?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I would add it to where like uh- I would put it in a good sense where it would stay, where would stay on the YouTube.\n</p><p>[<i>Transcriber's note: Such a video would almost certainly be immediately removed for Terms of Service violations, not that Chris would ever be concerned about the rules and regulations of the various free services he uses.</i>]\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> ...okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> Julie?\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Yes?\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> I love you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> I love you too, Chris.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> And also, inform your <a class=\"mw-redirect\" href=\"/cwcki/Max\" title=\"Max\">brother</a>. About what I am going to do for you.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay.\n</p><p><font color=\"#0033FF\"><b>Chris:</b></font> A'right. I'll talk to you later.\n</p><p><font color=\"#CC00FF\"><b>Julie:</b></font> Okay Chris. Thank you.\n</p><p>[<i>Presumably, Chris leaves</i>]\n</p>\n<h4><span id=\"02:29:01_This_Was_A_Triumph.21\"></span><span class=\"mw-headline\" id=\"02:29:01_This_Was_A_Triumph!\">02:29:01 This Was A Triumph!</span></h4>\n<p><font color=\"#D44942\"><b>BlueSpike:</b></font> <a class=\"external text\" href=\"http://www.youtube.com/watch?v=Y6ljFaKRTrI\" rel=\"nofollow\">This was a triumph! I'm making a note here: HUGE SUCCESS. It's hard to overstate my-</a>\n</p><p>[The trolls laugh over the top of each other uncontrollably. BlueSpike continues to sing Still Alive, and soon, all of the trolls all join in.]\n</p><p><font color=\"#0B610B\"><b>Dude:</b></font> Holy...! Holy shit!\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> Holy fuck!\n</p><p><font color=\"#D44942\"><b>BlueSpike:</b></font> -satisfaction! Aperture Sci-\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> -satisfaction!\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> He he he!\n</p><p><font color=\"#D44942\"><b>BlueSpike:</b></font> -we do what we must, because, we can! \n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> Haaaa haaaaa!\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> Ha ha ha ha ha ha ha ha ha ha ha ha-\n</p><p><font color=\"#D44942\"><b>BlueSpike:</b></font> -For the good of alll of us... for the ones who are dead!-\n</p><p><font color=\"#D44942\"><b>BlueSpike:</b></font> -but there's no crying over every mistake- \n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> .....................................every mistake-\n</p><p><font color=\"#D44942\"><b>BlueSpike:</b></font> -you just keep on trying till you run out of-\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> -you just keep on trying till you run out of-\n</p><p><font color=\"#0B610B\"><b>Troll:</b></font> -you just keep- ha ha ha ha ha ha... out of-\n</p><p>[<i>Tape runs out</i>]\n</p>\n<h2><span class=\"mw-headline\" id=\"Links\">Links</span></h2>\n<ul><li><a class=\"external text\" href=\"https://docs.google.com/open?id=0B6mRSOBYFcaBNTF2dkh5dUJIbEk\" rel=\"nofollow\">Download</a> <a class=\"external text\" href=\"https://drive.google.com/file/d/1AGtIdI4XxQfvsMZt5t6wPH0AG9LGt32k/view?usp=sharing\" rel=\"nofollow\">Archive</a></li></ul>\n<center><b>    Chats and calls</b></center>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Classic_Chris_era&amp;action=edit&amp;redlink=1\" title=\"Template:Classic Chris era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Classic_Chris_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Classic Chris era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Classic_Chris_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Classic_Chris_Era_(27_October_2007_to_20_March_2010)\" title=\"Saga\">Classic Chris era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Sonichu_(IRC_chat)\" title=\"Sonichu (IRC chat)\">IRC</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b><a href=\"/cwcki/2008\" title=\"2008\">2008</a>:</b> <a href=\"/cwcki/IRC_(16_October_2008)\" title=\"IRC (16 October 2008)\">Oct 16</a> • <a href=\"/cwcki/IRC_(24_October_2008)\" title=\"IRC (24 October 2008)\">Oct 24</a> • <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_Sonichu_IRC_Chloe_Introduction\" title=\"Chris's Sonichu IRC Chloe Introduction\">Oct 26</a> • <a href=\"/cwcki/IRC_(26_November_2008)\" title=\"IRC (26 November 2008)\">Nov 26</a> • <a href=\"/cwcki/IRC_(13_December_2008)\" title=\"IRC (13 December 2008)\">Dec 13</a> • <a href=\"/cwcki/IRC_(15_December_2008)\" title=\"IRC (15 December 2008)\">Dec 15</a> • <a href=\"/cwcki/IRC_(17_December_2008)\" title=\"IRC (17 December 2008)\">Dec 17</a> • <a href=\"/cwcki/IRC_(18_December_2008)\" title=\"IRC (18 December 2008)\">Dec 18</a> • <a href=\"/cwcki/IRC_(22_December_2008)\" title=\"IRC (22 December 2008)\">Dec 22</a> • <a href=\"/cwcki/IRC_(27_December_2008)\" title=\"IRC (27 December 2008)\">Dec 27</a> • <a href=\"/cwcki/IRC_(28_December_2008)\" title=\"IRC (28 December 2008)\">Dec 28</a> • <a href=\"/cwcki/IRC_(31_December_2008)\" title=\"IRC (31 December 2008)\">Dec 31</a><br/><b><a href=\"/cwcki/2009\" title=\"2009\">2009</a>:</b> <a href=\"/cwcki/IRC_(02_January_2009)\" title=\"IRC (02 January 2009)\">Jan 2</a> • <a href=\"/cwcki/IRC_(03_January_2009)\" title=\"IRC (03 January 2009)\">Jan 3</a> • <a href=\"/cwcki/IRC_(04_January_2009)\" title=\"IRC (04 January 2009)\">Jan 4</a> • <a href=\"/cwcki/IRC_(20_January_2009)\" title=\"IRC (20 January 2009)\">Jan 20</a> • <a href=\"/cwcki/IRC_(21_January_2009)\" title=\"IRC (21 January 2009)\">Jan 21</a> • <a href=\"/cwcki/IRC_(23_July_2009)\" title=\"IRC (23 July 2009)\">Jul 23</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/PandaHalo\" title=\"PandaHalo\">PandaHalo</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_Sex_Logs\" title=\"Chris Sex Logs\">Skype Sex Logs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> / <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivitheg%27s_AIM_chat\" title=\"Vivitheg's AIM chat\">Vivitheg's AIM chat</a> • <a href=\"/cwcki/Hooker_incident#Result\" title=\"Hooker incident\">Hooker incident call</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">BlueSpike</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b><a href=\"/cwcki/BlueSpike_PSN_Chats\" title=\"BlueSpike PSN Chats\">PSN Chats</a>:</b> <a href=\"/cwcki/BlueSpike_PSN_Chat_1\" title=\"BlueSpike PSN Chat 1\">1</a> • <a href=\"/cwcki/BlueSpike_PSN_Chat_2\" title=\"BlueSpike PSN Chat 2\">2</a> • <a href=\"/cwcki/BlueSpike_PSN_Chat_3\" title=\"BlueSpike PSN Chat 3\">3</a> (<a href=\"/cwcki/BlueSpike_PSN_Chat_3.5\" title=\"BlueSpike PSN Chat 3.5\">3.5</a> • <a href=\"/cwcki/BlueSpike_PSN_Chat_3.7\" title=\"BlueSpike PSN Chat 3.7\">3.7</a>) • <a href=\"/cwcki/BlueSpike_PSN_Chat_4\" title=\"BlueSpike PSN Chat 4\">4</a><br/><b><a href=\"/cwcki/BlueSpike_Skype_Logs\" title=\"BlueSpike Skype Logs\">Skype Logs</a>:</b> <a href=\"/cwcki/BlueSpike_Skype_Logs_1\" title=\"BlueSpike Skype Logs 1\">1</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_2\" title=\"BlueSpike Skype Logs 2\">2</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_3\" title=\"BlueSpike Skype Logs 3\">3</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_4\" title=\"BlueSpike Skype Logs 4\">4</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_5\" title=\"BlueSpike Skype Logs 5\">5</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_6\" title=\"BlueSpike Skype Logs 6\">6</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_7\" title=\"BlueSpike Skype Logs 7\">7</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_8\" title=\"BlueSpike Skype Logs 8\">8</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_9\" title=\"BlueSpike Skype Logs 9\">9</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_10\" title=\"BlueSpike Skype Logs 10\">10</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_11\" title=\"BlueSpike Skype Logs 11\">11</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_12\" title=\"BlueSpike Skype Logs 12\">12</a> • <a href=\"/cwcki/BlueSpike_Skype_Logs_13\" title=\"BlueSpike Skype Logs 13\">13</a><br/><b>Other:</b> <a href=\"/cwcki/CWC_Cums_for_a_Cat\" title=\"CWC Cums for a Cat\">CWC Cums for a Cat</a> • <a href=\"/cwcki/Bob_Walks_In\" title=\"Bob Walks In\">Bob Walks In</a> • <a href=\"/cwcki/Bob_Walks_In_Aftermath\" title=\"Bob Walks In Aftermath\">Bob Walks In Aftermath</a> • <a href=\"/cwcki/Julie_Reveals_Herself:_The_Prequel\" title=\"Julie Reveals Herself: The Prequel\">Julie Reveals Herself: The Prequel</a> • <a href=\"/cwcki/Julie_Reveals_Herself\" title=\"Julie Reveals Herself\">Julie Reveals Herself</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Mumble\" title=\"Mumble\">Mumble</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mumble_1\" title=\"Mumble 1\">1</a> • <a href=\"/cwcki/Mumble_2\" title=\"Mumble 2\">2</a> • <a class=\"mw-selflink selflink\">3</a> (<a href=\"/cwcki/Mumble_3.5\" title=\"Mumble 3.5\">3.5</a>) • <a href=\"/cwcki/Mumble_4\" title=\"Mumble 4\">4</a> • <a href=\"/cwcki/Mumble_5\" title=\"Mumble 5\">5</a> • <a href=\"/cwcki/Mumble_6\" title=\"Mumble 6\">6</a> • <a href=\"/cwcki/Mumble_7\" title=\"Mumble 7\">7</a> • <a href=\"/cwcki/Mumble_8\" title=\"Mumble 8\">8</a> • <a href=\"/cwcki/Mumble_9\" title=\"Mumble 9\">9</a> (<a href=\"/cwcki/Mumble_9.5\" title=\"Mumble 9.5\">9.5</a>) • <a href=\"/cwcki/Mumble_10\" title=\"Mumble 10\">10</a> • <a href=\"/cwcki/Mumble_11\" title=\"Mumble 11\">11</a> • <a href=\"/cwcki/Mumble_12\" title=\"Mumble 12\">12</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Sarah_May\" title=\"Sarah May\">Sarah May</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Sarah_May_Skype_Logs\" title=\"Sarah May Skype Logs\">Sarah May Skype Logs</a> • <a href=\"/cwcki/Barb_almost_goes_off\" title=\"Barb almost goes off\">Barb almost goes off</a> • <a href=\"/cwcki/Supporting_Sarah_May\" title=\"Supporting Sarah May\">Supporting Sarah May</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Alec_Benson_Leary\" title=\"Alec Benson Leary\">Alec Benson Leary</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Alec_Benson_Leary_calls\" title=\"Alec Benson Leary calls\">Alec calls</a> (<a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_1\" title=\"Alec Benson Leary Phone Call 1\">1</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_2\" title=\"Alec Benson Leary Phone Call 2\">2</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_3\" title=\"Alec Benson Leary Phone Call 3\">3</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_4\" title=\"Alec Benson Leary Phone Call 4\">4</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_5\" title=\"Alec Benson Leary Phone Call 5\">5</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_6\" title=\"Alec Benson Leary Phone Call 6\">6</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_7\" title=\"Alec Benson Leary Phone Call 7\">7</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_8\" title=\"Alec Benson Leary Phone Call 8\">8</a> • <a href=\"/cwcki/Alec_Benson_Leary_Phone_Call_9\" title=\"Alec Benson Leary Phone Call 9\">9</a>)  • <a class=\"mw-redirect\" href=\"/cwcki/Matthew_Noble_call\" title=\"Matthew Noble call\">\"Matthew Noble\" call</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Vanessa_Saga\" title=\"Vanessa Saga\">Vanessa AIM chats</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vanessa_AIM_Chat_1\" title=\"Vanessa AIM Chat 1\">1</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_2\" title=\"Vanessa AIM Chat 2\">2</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_3\" title=\"Vanessa AIM Chat 3\">3</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_4\" title=\"Vanessa AIM Chat 4\">4</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_5\" title=\"Vanessa AIM Chat 5\">5</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_6\" title=\"Vanessa AIM Chat 6\">6</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_7\" title=\"Vanessa AIM Chat 7\">7</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_8\" title=\"Vanessa AIM Chat 8\">8</a> • <a href=\"/cwcki/Vanessa_AIM_Chat_9\" title=\"Vanessa AIM Chat 9\">9</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Liquid_Chris\" title=\"Liquid Chris\">Liquid Saga</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/SHOWDOWN:_The_TRUE_CWC_Confronts_The_FAKE\" title=\"SHOWDOWN: The TRUE CWC Confronts The FAKE\">SHOWDOWN</a> • <a href=\"/cwcki/Kacey_calls\" title=\"Kacey calls\">Kacey calls</a> (<a class=\"mw-redirect\" href=\"/cwcki/Kacey_Phone_Call\" title=\"Kacey Phone Call\">1</a> • <a href=\"/cwcki/Kacey_Call_1.5\" title=\"Kacey Call 1.5\">1.5</a> • <a href=\"/cwcki/Kacey_Call_2\" title=\"Kacey Call 2\">2</a> • <a href=\"/cwcki/Kacey_Call_3\" title=\"Kacey Call 3\">3</a> • <a href=\"/cwcki/Kacey_Call_4\" title=\"Kacey Call 4\">4</a> • <a href=\"/cwcki/Kacey_Call_5\" title=\"Kacey Call 5\">5</a> • <a href=\"/cwcki/Kacey_Call_6\" title=\"Kacey Call 6\">6</a> • <a href=\"/cwcki/Kacey_Call_7\" title=\"Kacey Call 7\">7</a> • <a href=\"/cwcki/Kacey_Call_8\" title=\"Kacey Call 8\">8</a> • <a href=\"/cwcki/Kacey_Call_9\" title=\"Kacey Call 9\">9</a> • <a href=\"/cwcki/Kacey_Call_10\" title=\"Kacey Call 10\">10</a> • <a href=\"/cwcki/Kacey_Call_11\" title=\"Kacey Call 11\">11</a> • <a href=\"/cwcki/Kacey_Call_12\" title=\"Kacey Call 12\">12</a> • <a href=\"/cwcki/Kacey_Call_13\" title=\"Kacey Call 13\">13</a> • <a href=\"/cwcki/Kacey_Call_14\" title=\"Kacey Call 14\">14</a> • <a href=\"/cwcki/Kacey_Call_15\" title=\"Kacey Call 15\">15</a> • <a href=\"/cwcki/Kacey_Call_16\" title=\"Kacey Call 16\">16</a> • <a href=\"/cwcki/Kacey_Call_17\" title=\"Kacey Call 17\">17</a> • <a href=\"/cwcki/Kacey_Call_18\" title=\"Kacey Call 18\">18</a> • <a href=\"/cwcki/Kacey_Call_19\" title=\"Kacey Call 19\">19</a> • <a href=\"/cwcki/Kacey_Call_20\" title=\"Kacey Call 20\">20</a> • <a href=\"/cwcki/Kacey_Call_21\" title=\"Kacey Call 21\">21</a> • <a href=\"/cwcki/Kacey_Call_22\" title=\"Kacey Call 22\">22</a> • <a href=\"/cwcki/Kacey_Call_23\" title=\"Kacey Call 23\">23</a> • <a href=\"/cwcki/Kacey_Call_24\" title=\"Kacey Call 24\">24</a>) • <a href=\"/cwcki/Father_Call\" title=\"Father Call\">Father Call</a> • <a href=\"/cwcki/Kacey_and_Liquid_Call\" title=\"Kacey and Liquid Call\">Kacey and Liquid Call</a> • <a href=\"/cwcki/The_End_For_Real_(Kacey_call)\" title=\"The End For Real (Kacey call)\">The End For Real</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Jack_Thaddeus\" title=\"Jack Thaddeus\">Jack Thaddeus</a> calls\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_Phone_Call\" title=\"Jack Thaddeus Phone Call\">1</a><b> • </b><a href=\"/cwcki/Jack_Thaddeus_Phone_Call_2\" title=\"Jack Thaddeus Phone Call 2\">2</a><b> • </b><a href=\"/cwcki/Jack_Thaddeus_Phone_Call_3\" title=\"Jack Thaddeus Phone Call 3\">3</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Jackie\" title=\"Jackie\">Jackie</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_Chat_1\" title=\"Jackie Chat 1\">1</a><b> • </b><a href=\"/cwcki/Jackie_Chat_2\" title=\"Jackie Chat 2\">2</a><b> • </b><a href=\"/cwcki/Jackie_Chat_3\" title=\"Jackie Chat 3\">3</a> • <a href=\"/cwcki/Jackie_Chat_4\" title=\"Jackie Chat 4\">4</a><b> • </b><a href=\"/cwcki/Jackie_Chat_5\" title=\"Jackie Chat 5\">5</a><b> • </b><a href=\"/cwcki/Jackie_Chat_6\" title=\"Jackie Chat 6\">6</a> • <a href=\"/cwcki/Jackie_Chat_7\" title=\"Jackie Chat 7\">7</a><b> • </b><a href=\"/cwcki/Jackie_Chat_8\" title=\"Jackie Chat 8\">8</a><b> • </b><a href=\"/cwcki/Jackie_Chat_9\" title=\"Jackie Chat 9\">9</a><b> • </b><a href=\"/cwcki/Lars_Call\" title=\"Lars Call\">Lars Call</a><b></b></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Andrew_Simmons_chat\" title=\"Andrew Simmons chat\">Andrew Simmons chat</a> • <a href=\"/cwcki/Car_Pranks\" title=\"Car Pranks\">Car Pranks</a> • <a href=\"/cwcki/Maggie_Thomas_call\" title=\"Maggie Thomas call\">Maggie Thomas call</a> • <a href=\"/cwcki/Prank_calls\" title=\"Prank calls\">Prank calls</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris-chan_Discusses...\" title=\"Chris-chan Discusses...\">Guru Larry</a> • <a href=\"/cwcki/Christian_Weston_Chandler_Interview\" title=\"Christian Weston Chandler Interview\">Christian Weston Chandler Interview</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Dark_Ages_era&amp;action=edit&amp;redlink=1\" title=\"Template:Dark Ages era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Dark_Ages_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Dark Ages era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Dark_Ages_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Dark_Ages_(20_March_2010_to_3_September_2014)\" title=\"Saga\">Dark Ages era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/July_25,_2014_Leaks\" title=\"July 25, 2014 Leaks\">July 25, 2014 Leaks</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/ThePCAssassins\" title=\"ThePCAssassins\">ThePCAssassins</a> • <a href=\"/cwcki/Rocky_Shoemaker_call\" title=\"Rocky Shoemaker call\">Rocky Shoemaker call</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Renaissance_era&amp;action=edit&amp;redlink=1\" title=\"Template:Renaissance era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Renaissance_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Renaissance era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Renaissance_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Renaissance_(3_September_2014_to_24_October_2017)\" title=\"Saga\">Renaissance era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a> / <a href=\"/cwcki/Colin\" title=\"Colin\">Colin</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<b>Catherine:</b> <a href=\"/cwcki/Date_with_Catherine\" title=\"Date with Catherine\">Date with Catherine</a> <br/> <b>Colin:</b> <a href=\"/cwcki/Colin_Chat_1\" title=\"Colin Chat 1\">Colin Chat 1</a><b> • </b><a href=\"/cwcki/Colin_Chat_2\" title=\"Colin Chat 2\">Colin Chat 2</a><b></b></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Marvin_DMs\" title=\"Marvin DMs\">Marvin DMs</a> • <a href=\"/cwcki/Misc_texts\" title=\"Misc texts\">Misc texts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Arthur_Spatchcock_Interviews\" title=\"Arthur Spatchcock Interviews\">Arthur Spatchcock Interviews‎‎</a> • <a href=\"/cwcki/BraveryJerk_Interviews\" title=\"BraveryJerk Interviews\">BraveryJerk Interviews</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/2014_Jail_calls\" title=\"2014 Jail calls\">2014 jail calls</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit&amp;redlink=1\" title=\"Template:Transcendental Awakening / The Rise eras (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit&amp;redlink=1\" title=\"Template talk:Transcendental Awakening / The Rise eras (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Transcendental_Awakening_/_The_Rise_eras&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Transcendental_Awakening_(August_2017_to_30_July_2021)\" title=\"Saga\">Transcendental Awakening</a> / <a href=\"/cwcki/Saga#Rise-N-Fall_(Mid_2018_-_31_July_2021)\" title=\"Saga\">Rise-N-Fall</a> eras</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Idea_Guys\" title=\"Idea Guys\">Idea Guys</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Misc_Idea_Guy_chats\" title=\"Misc Idea Guy chats\">Misc Idea Guy chats</a> • <a href=\"/cwcki/Gruppenfuhrer_Fegelein_chat\" title=\"Gruppenfuhrer Fegelein chat\">Gruppenfuhrer Fegelein chat</a> • <a href=\"/cwcki/The_Bad_Beginning\" title=\"The Bad Beginning\">The Bad Beginning</a> • <a href=\"/cwcki/Cryzel_Torture\" title=\"Cryzel Torture\">Cryzel Torture</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Guard_Dogs\" title=\"Guard Dogs\">Guard Dogs</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Null_DMs\" title=\"Null DMs\">Null DMs</a> • <a href=\"/cwcki/Captain_DMs\" title=\"Captain DMs\">The Captain DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Watchmen\" title=\"Watchmen\">Watchmen</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Watchmen_Chats\" title=\"Watchmen Chats\">Watchmen Chats</a> (<a href=\"/cwcki/Anaxis_DMs\" title=\"Anaxis DMs\">Anaxis DMs</a> • <a href=\"/cwcki/AquaDiamond8_DMs\" title=\"AquaDiamond8 DMs\">AquaDiamond8 DMs</a> • <a href=\"/cwcki/Kyle_DMs\" title=\"Kyle DMs\">Kyle DMs</a> • <a href=\"/cwcki/MKR_DMs\" title=\"MKR DMs\">MKR DMs</a> • <a href=\"/cwcki/Naught_DMs\" title=\"Naught DMs\">Naught DMs</a> • <a href=\"/cwcki/Spunky_DMs\" title=\"Spunky DMs\">Spunky DMs</a> • <a href=\"/cwcki/WCT_DMs\" title=\"WCT DMs\">WCT DMs</a>)</div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Ben_Saint\" title=\"Ben Saint\">Ben Saint</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Ben_Saint_-_Chatting_with_Chris-Chan\" title=\"Ben Saint - Chatting with Chris-Chan\">Ben Saint - Chatting with Chris-Chan</a> • <a href=\"/cwcki/Ben_Saint_DMs\" title=\"Ben Saint DMs\">Ben Saint DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/2020_Discord_leaks\" title=\"2020 Discord leaks\">2020 Discord leaks</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Other_chats_leaked_by_Naught_(April_2020)\" title=\"Other chats leaked by Naught (April 2020)\">April '20</a> • <a href=\"/cwcki/Other_chats_leaked_by_Naught_(May_2020)\" title=\"Other chats leaked by Naught (May 2020)\">May '20</a> • <a href=\"/cwcki/Other_chats_leaked_by_Naught_(July_2020)\" title=\"Other chats leaked by Naught (July 2020)\">July '20</a> • <a href=\"/cwcki/Other_chats_leaked_by_Naught_(August_2020)\" title=\"Other chats leaked by Naught (August 2020)\">Aug '20</a> • <a href=\"/cwcki/Other_chats_leaked_by_Naught_(September_2020)\" title=\"Other chats leaked by Naught (September 2020)\">September '20</a> • <a href=\"/cwcki/Other_chats_leaked_by_Naught_(undated)\" title=\"Other chats leaked by Naught (undated)\">undated</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Isabella_Loretta_Janke\" title=\"Isabella Loretta Janke\">Bella</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Bella_chats\" title=\"Bella chats\">Bella chats</a> • <a href=\"/cwcki/Incest_Call\" title=\"Incest Call\">Incest Call</a> • <a href=\"/cwcki/Incest_Texts\" title=\"Incest Texts\">Incest Texts</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Fiona_Cooper\" title=\"Fiona Cooper\">Fiona</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Fiona_DMs\" title=\"Fiona DMs\">Fiona DMs</a> • <a href=\"/cwcki/Fiona_Facetime_Videos\" title=\"Fiona Facetime Videos\">Fiona Facetime Videos</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/100MegaMeh\" title=\"100MegaMeh\">100MegaMeh DMs</a> • <a href=\"/cwcki/Bible_Enabler_DMs\" title=\"Bible Enabler DMs\">Bible Enabler DMs</a> • <a href=\"/cwcki/Bryanfrogboy_Chats\" title=\"Bryanfrogboy Chats\">Bryanfrogboy Chats</a> • <a href=\"/cwcki/Cedric_Eff_DMs\" title=\"Cedric Eff DMs\">Cedric Eff DMs‎‎</a> • <a class=\"mw-redirect\" href=\"/cwcki/Cirrusfire_DMs\" title=\"Cirrusfire DMs\">Cirrusfire DMs</a> • <a href=\"/cwcki/Copitz_DMs\" title=\"Copitz DMs\">Copitz DMs</a> • <a href=\"/cwcki/Desiree_Delightful\" title=\"Desiree Delightful\">Desiree Delightful DMs</a> • <a href=\"/cwcki/Dillin_Thomas_DMs\" title=\"Dillin Thomas DMs\">Dillin Thomas DMs</a> • <a href=\"/cwcki/Fan_visits\" title=\"Fan visits\">Fan visits</a> • <a href=\"/cwcki/Geno_Samuel_DMs\" title=\"Geno Samuel DMs\">Geno Samuel DMs</a> • <a href=\"/cwcki/Helena_DMs\" title=\"Helena DMs\">Helena DMs‎</a> • <a href=\"/cwcki/Justin_DMs\" title=\"Justin DMs\">Justin DMs</a> • <a class=\"mw-redirect\" href=\"/cwcki/Kai_DMs\" title=\"Kai DMs\">Kai DMs</a> • <a class=\"mw-redirect\" href=\"/cwcki/KwaiiSandbag_calls\" title=\"KwaiiSandbag calls\">KwaiiSandbag calls</a>(<a href=\"/cwcki/Chris_Chan_Psychic_Chat_1\" title=\"Chris Chan Psychic Chat 1\">1</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_2\" title=\"Chris Chan Psychic Chat 2\">2</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_3\" title=\"Chris Chan Psychic Chat 3\">3</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_4\" title=\"Chris Chan Psychic Chat 4\">4</a> • <a href=\"/cwcki/Chris_Chan_Psychic_Chat_5\" title=\"Chris Chan Psychic Chat 5\">5</a>) • <a href=\"/cwcki/Larry_Vaughn_DMs\" title=\"Larry Vaughn DMs\">Larry Vaughn DMs</a> • <a href=\"/cwcki/Midnight_Moonflower_DMs\" title=\"Midnight Moonflower DMs\">Midnight Moonflower DMs</a> • <a href=\"/cwcki/Opuscon789_DMs\" title=\"Opuscon789 DMs\">Opuscon789 DMs</a> • <a href=\"/cwcki/Sockness_DMs\" title=\"Sockness DMs\">Sockness DMs</a> • <a href=\"/cwcki/Sonichu_Mania\" title=\"Sonichu Mania\">Sonichu Mania Livestream</a> • <a href=\"/cwcki/Teen_Troon_Squad_chats\" title=\"Teen Troon Squad chats\">Teen Troon Squad chats</a> • <a href=\"/cwcki/Tings_Tingz_DMs\" title=\"Tings Tingz DMs\">Tings Tingz DMs</a> • <a href=\"/cwcki/Tlaw_DMs\" title=\"Tlaw DMs\">Tlaw DMs</a> • <a href=\"/cwcki/Toffee_Rosechu_DMs\" title=\"Toffee Rosechu DMs\">Toffee Rosechu DMs</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Discord\" title=\"Discord\">Discord</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Arbitarch_CWC_Alliance\" title=\"Arbitarch CWC Alliance\">Arbitarch CWC Alliance</a> • <a href=\"/cwcki/Blepcon\" title=\"Blepcon\">Blepcon</a> • <a href=\"/cwcki/Chess_Group_15\" title=\"Chess Group 15\">Chess Group 15</a> • <a href=\"/cwcki/Children_of_Kefentse\" title=\"Children of Kefentse\">Children of Kefentse</a> • <a href=\"/cwcki/Cwc_frens\" title=\"Cwc frens\">cwc frens</a> • <a href=\"/cwcki/CWCville_(Discord_server)\" title=\"CWCville (Discord server)\">CWCville</a> • <a href=\"/cwcki/Golden_Church_of_Sonichu\" title=\"Golden Church of Sonichu\">Golden Church of Sonichu</a> • <a class=\"mw-redirect\" href=\"/cwcki/Kaiyosh%27s_server\" title=\"Kaiyosh's server\">Kaiyosh's server‎‎</a> • <a href=\"/cwcki/Midnight%27s_Nightlings_and_Starettes\" title=\"Midnight's Nightlings and Starettes\">Midnight's Nightlings and Starettes</a> • <a href=\"/cwcki/Official_CWCki_Server\" title=\"Official CWCki Server\">Official CWCki Server</a> • <a href=\"/cwcki/Rowdy_Fuckers_Cop_Killers%27_ENDLESS_WAR\" title=\"Rowdy Fuckers Cop Killers' ENDLESS WAR\">Rowdy Fuckers Cop Killers' ENDLESS WAR</a> • <a href=\"/cwcki/Sonic_World_DX_Lounge\" title=\"Sonic World DX Lounge\">Sonic World DX Lounge</a> • <a href=\"/cwcki/Sonichu_Mania\" title=\"Sonichu Mania\">Sonichu Mania Plus Server</a> • <a href=\"/cwcki/The_group\" title=\"The group\">The group</a> • <a href=\"/cwcki/The_Knights_of_CWC\" title=\"The Knights of CWC\">The Knights of CWC</a> • <a href=\"/cwcki/The_Place\" title=\"The Place\">The Place</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_Chan_%26_Max_Mandu_LIVE_/_Leftovers_Tonight\" title=\"Chris Chan &amp; Max Mandu LIVE / Leftovers Tonight\">Chris Chan &amp; Max Mandu LIVE / Leftovers Tonight</a> • <a href=\"/cwcki/CopperCab\" title=\"CopperCab\">CopperCab</a> • <a href=\"/cwcki/Copitz\" title=\"Copitz\">Copitz</a> • <a href=\"/cwcki/Count_Dankula\" title=\"Count Dankula\">Count Dankula</a> • <a href=\"/cwcki/Discord_Q%26A\" title=\"Discord Q&amp;A\">Discord Q&amp;A</a> (<a href=\"/cwcki/Discord_Q%26A_1\" title=\"Discord Q&amp;A 1\">1</a> • <a href=\"/cwcki/Discord_Q%26A_2\" title=\"Discord Q&amp;A 2\">2</a> • <a href=\"/cwcki/Discord_Q%26A_3\" title=\"Discord Q&amp;A 3\">3</a> • <a href=\"/cwcki/Discord_Q%26A_4\" title=\"Discord Q&amp;A 4\">4 (call)</a> • <a href=\"/cwcki/Discord_Q%26A_5\" title=\"Discord Q&amp;A 5\">5</a> • <a href=\"/cwcki/Discord_Q%26A_6\" title=\"Discord Q&amp;A 6\">6</a> • <a href=\"/cwcki/Discord_Q%26A_7\" title=\"Discord Q&amp;A 7\">7</a> • <a href=\"/cwcki/Discord_Q%26A_8\" title=\"Discord Q&amp;A 8\">8</a> • <a href=\"/cwcki/Discord_Q%26A_9\" title=\"Discord Q&amp;A 9\">9 (audio)</a> • <a href=\"/cwcki/Discord_Q%26A_10\" title=\"Discord Q&amp;A 10\">10</a> • <a href=\"/cwcki/Discord_Q%26A_11\" title=\"Discord Q&amp;A 11\">11</a> • <a class=\"mw-redirect\" href=\"/cwcki/Discord_Q%26A_12\" title=\"Discord Q&amp;A 12\">12</a>) • Internet Dream Lounge (<a href=\"/cwcki/Internet_Dream_Lounge_4_-_Chris_Chan_(unused_version)\" title=\"Internet Dream Lounge 4 - Chris Chan (unused version)\">1</a> • <a href=\"/cwcki/Internet_Dream_Lounge\" title=\"Internet Dream Lounge\">2</a>) • <a href=\"/cwcki/Jackson_Dalton\" title=\"Jackson Dalton\">Jackson Dalton</a> • <a href=\"/cwcki/Pappy_Van_Poodle_Interview\" title=\"Pappy Van Poodle Interview\">Pappy Van Poodle Interview</a> • <a href=\"/cwcki/CLog_10042017_-_Q%26A_1\" title=\"CLog 10042017 - Q&amp;A 1\">Q&amp;A with Kiwi Farms</a> • <a href=\"/cwcki/Sachumo_Interview\" title=\"Sachumo Interview\">Sachumo</a> • <a href=\"/cwcki/The_Create_Unknown\" title=\"The Create Unknown\">The Create Unknown</a> • <a href=\"/cwcki/The_Chris_Chan_Conspiracy\" title=\"The Chris Chan Conspiracy\">The Making of an Internet Monster</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/KwaiiSandbag#Interviews_with_Kwaii\" title=\"KwaiiSandbag\">KwaiiSandbag Interview</a> • <a href=\"/cwcki/Lily#Interview_with_Lily\" title=\"Lily\">Lily Interview</a> • <a href=\"/cwcki/Aly_Hirschberg_DMs\" title=\"Aly Hirschberg DMs\">Aly Hirschberg DMs</a> • <a href=\"/cwcki/Bella_and_Fiona_chats\" title=\"Bella and Fiona chats\">Bella and Fiona chats</a> • <a class=\"mw-redirect\" href=\"/cwcki/Chess_Club_Chats\" title=\"Chess Club Chats\">Chess Club Chats</a> • <a href=\"/cwcki/Chris_Chan_Conservation_Collective\" title=\"Chris Chan Conservation Collective\">Chris Chan Conservation Collective</a> • <a class=\"mw-redirect\" href=\"/cwcki/Copitz%27s_Server\" title=\"Copitz's Server\">Copitz's Server</a> • <a href=\"/cwcki/Helena-WCT_DMs\" title=\"Helena-WCT DMs\">Helena-WCT DMs</a> • <a class=\"mw-redirect\" href=\"/cwcki/Incest_Leak_Interview\" title=\"Incest Leak Interview\">Incest Leak Interview</a> • <a href=\"/cwcki/The_Sons_of_the_Miscreants\" title=\"The Sons of the Miscreants\">The Sons of the Miscreants</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Silent_Years_era&amp;action=edit&amp;redlink=1\" title=\"Template:Silent Years era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Silent_Years_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Silent Years era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Silent_Years_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Silent_Years_(1_August_2021_-_16_October_2023)\" title=\"Saga\">Silent Years era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Central_Virginia_Regional_Jail\" title=\"Central Virginia Regional Jail\">Central Virginia Regional Jail</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jail_Communications\" title=\"Jail Communications\">Jail Communications</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Chats without Chris\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/March_2023_Praetor_Interview\" title=\"March 2023 Praetor Interview\">March 2023 Praetor Interview</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a class=\"new\" href=\"/w/index.php?title=Template:Second_Coming_era&amp;action=edit&amp;redlink=1\" title=\"Template:Second Coming era (page does not exist)\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"new\" href=\"/w/index.php?title=Template_talk:Second_Coming_era&amp;action=edit&amp;redlink=1\" title=\"Template talk:Second Coming era (page does not exist)\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Second_Coming_era&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Saga#Second_Coming_(16_October_2023_-_Present)\" title=\"Saga\">Second Coming era</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Miscellaneous chats\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Helena_DMs\" title=\"Helena DMs\">Helena DMs</a> • <a href=\"/cwcki/Lolcow_Live\" title=\"Lolcow Live\">Lolcow Live DM</a> • <a href=\"/cwcki/Ren_Ryghts_DMs\" title=\"Ren Ryghts DMs\">Ren Ryghts DMs</a> • <a href=\"/cwcki/Waltah_White_Calls\" title=\"Waltah White Calls\">Waltah White Calls</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Discord\" title=\"Discord\">Discord</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catboy_Ranch\" title=\"Catboy Ranch\">Catboy Ranch</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Chris_and_journalism\" title=\"Chris and journalism\">Interviews</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Keffals_videos\" title=\"Keffals videos\">The Chris Chan Interview</a> • <a href=\"/cwcki/The_Chris_Chan_Conspiracy\" title=\"The Chris Chan Conspiracy\">The Resurrection of Chris Chan</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Mumble_2\" title=\"Mumble 2\">Mumble Chat 2</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/Mumble\" title=\"Mumble\">Mumble Chats</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Mumble_4\" title=\"Mumble 4\">Mumble Chat 4</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251119203548\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.553 seconds\nReal time usage: 0.576 seconds\nPreprocessor visited node count: 4316/1000000\nPost‐expand include size: 101442/2097152 bytes\nTemplate argument size: 31424/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 650/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%  105.892      1 -total\n 87.13%   92.269      1 Template:FanChats\n 81.26%   86.049      6 Template:Navbox\n 11.73%   12.424      6 Template:Tnavbar\n  8.40%    8.891      1 Template:Infobox/Audiofile\n  3.70%    3.923      1 Template:Succession\n  2.43%    2.568      6 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:4230-0!canonical and timestamp 20251119203548 and revision id 317624. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Mumble_3&amp;oldid=317624\">http://sonichu.com/w/index.php?title=Mumble_3&amp;oldid=317624</a>\"</div></div>",
  "categories": [
    "Category",
    "Mumble chats"
  ],
  "links": [
    "Dec 31",
    "Harming others does not accomplish anything.",
    "change gender",
    "stress sigh",
    "proclaiming your love for men. how gay you are",
    "Jul 23",
    "BlueSpike",
    "slow wit",
    "Julie",
    "CWCville shopping center",
    "Midnight's Nightlings and Starettes",
    "Idea Guys",
    "Oct 16",
    "Crystal",
    "Bible Enabler DMs",
    "Sex in the City",
    "mother",
    "Vivian Gee",
    "America",
    "It ends with the usual amount of fail",
    "Reggie Fils-Aimé",
    "22",
    "Catherine",
    "Cirrusfire DMs",
    "lie",
    "Pappy Van Poodle Interview",
    "15",
    "Misc texts",
    "I'm smiling for you",
    "Christian Weston Chandler Interview",
    "Rocky Shoemaker call",
    "plenty of time",
    "The Bad Beginning",
    "Cole Smithey",
    "lose it",
    "Marvin DMs",
    "a video",
    "YouTube",
    "Ben Saint - Chatting with Chris-Chan",
    "Copitz's Server",
    "Lolcow Live DM",
    "Gruppenfuhrer Fegelein chat",
    "Molvanîa",
    "the Monticello",
    "Clyde Cash",
    "CWCville",
    "Tings Tingz DMs",
    "gun",
    "my mother",
    "Incest Call",
    "CopperCab",
    "The End For Real",
    "all-round",
    "a bit crowded in my kitchen in here",
    "MKR DMs",
    "cousin",
    "Rocky Shoemaker",
    "2",
    "Naught DMs",
    "Rocky",
    "Bob Walks In Aftermath",
    "ThePCAssassins",
    "Helena DMs",
    "March 2023 Praetor Interview",
    "Asperchu",
    "My brother",
    "11",
    "24",
    "my room",
    "Vanessa AIM chats",
    "Cogsdev",
    "Fiona",
    "2020 Discord leaks",
    "Jan 21",
    "Desiree Delightful DMs",
    "Alec",
    "April '20",
    "cup",
    "I do not deny it",
    "Colin",
    "Dillin Thomas DMs",
    "uncapable",
    "clean each other up in the bathroom",
    "Dec 22",
    "Midnight Moonflower DMs",
    "1980s",
    "Anaxis DMs",
    "Bella and Fiona chats",
    "Sarah... Panda",
    "Bob Walks In",
    "Supercalifragilisticexpialidocious",
    "14",
    "Andrew Simmons chat",
    "Chess Group 15",
    "even for minimum wage work.",
    "Piedmont Virginia Community College",
    "Simonla",
    "21",
    "anger management",
    "female friends",
    "9",
    "3.7",
    "Hitler",
    "Aug '20",
    "Sonichu Mania Plus Server",
    "5",
    "Chris Chan & Max Mandu LIVE / Leftovers Tonight",
    "Jackie",
    "September '20",
    "Oct 26",
    "Nov 26",
    "Justin DMs",
    "Official CWCki Server",
    "Kacey calls",
    "17",
    "4 (call)",
    "they are attracted to him",
    "The Captain DMs",
    "Barb almost goes off",
    "Cryzel Torture",
    "Ben Saint",
    "Sockness DMs",
    "children",
    "Jan 20",
    "Larry Vaughn DMs",
    "Jail Communications",
    "Incest Leak Interview",
    "18",
    "You really are a psychopath.",
    "Arbitarch CWC Alliance",
    "Toffee Rosechu DMs",
    "social security",
    "Kacey and Liquid Call",
    "Discord",
    "Mumble Chats",
    "Blepcon",
    "Principle of Nathanael Greene Elementary",
    "ED",
    "And drop a few pounds",
    "BraveryJerk Interviews",
    "gradulate",
    "Arthur Spatchcock Interviews‎‎",
    "the whole family",
    "Charlottesville",
    "Dating Education",
    "Fiona DMs",
    "Waltah White Calls",
    "Tlaw DMs",
    "Maggie Thomas call",
    "3",
    "7",
    "Copitz",
    "13",
    "Incest Texts",
    "stab",
    "Sonichu Guitar",
    "your brother",
    "Teen Troon Squad chats",
    "Skype Logs",
    "spreading it around",
    "Flame the Sunbird",
    "Jack Thaddeus",
    "Mumble 3.5",
    "Watchmen Chats",
    "recycling",
    "gay people?",
    "trolls",
    "The Chris Chan Interview",
    "Date with Catherine",
    "female",
    "Cedric Eff DMs‎‎",
    "Nathanael Greene Elementary.",
    "English",
    "Barb",
    "CWC Cums for a Cat",
    "20",
    "Ruckersville",
    "a video saying that he's gay",
    "my Father",
    "July '20",
    "father",
    "Interviews",
    "all the people",
    "Sonichu Mania Livestream",
    "Oct 24",
    "sigh",
    "Megan",
    "YOU DREW A PICTURE OF YOU HAVING SEX WITH HER.",
    "dick",
    "PSN Chats",
    "Golden Church of Sonichu",
    "I can obviously tell because uh- you definitely killed them with your c- with the carbon monoxide, because you are putting so much emphasis on accidental.",
    "Sydney Contacts",
    "mac and cheese",
    "Catboy Ranch",
    "Dec 27",
    "Ben Saint DMs",
    "Kyle DMs",
    "Clyde",
    "PandaHalo",
    "Children of Kefentse",
    "Nintendo",
    "Helena DMs‎",
    "Redmond",
    "Colin Chat 1",
    "Jan 2",
    "12",
    "Dec 13",
    "colored",
    "Sarah May Skype Logs",
    "Clyde's",
    "Awful horrible things",
    "up the butt",
    "July 25, 2014 Leaks",
    "tender honesty",
    "Dec 17",
    "human",
    "WCT DMs",
    "Virginia",
    "Skype Sex Logs",
    "Kai DMs",
    "Mumble Chat 4",
    "a second video after to say that the first was blackmail and that he's straight.",
    "The Making of an Internet Monster",
    "Wild",
    "salesman",
    "I am a warrior in my own rights",
    "random",
    "Sonic World DX Lounge",
    "Facebook",
    "sex",
    "Play with you.",
    "Bella",
    "Copitz DMs",
    "my cousin's name",
    "Jackson Dalton",
    "Ryan",
    "Sachumo",
    "The Resurrection of Chris Chan",
    "Jan 4",
    "Colin Chat 2",
    "Spunky DMs",
    "19",
    "Money",
    "Bella chats",
    "Guard Dogs",
    "Liquid Saga",
    "February 2009",
    "9 (audio)",
    "Rosechus",
    "take it back with another video!",
    "3.5",
    "Q&A with Kiwi Farms",
    "Mumble",
    "pic She Came For CWC",
    "Car Pranks",
    "The group",
    "\"Matthew Noble\" call",
    "masturbating",
    "23",
    "babysitter",
    "9.5",
    "2009",
    "crumple-lope",
    "Chris",
    "art",
    "KwaiiSandbag calls",
    "1",
    "Bluespike",
    "Pornography",
    "Prank calls",
    "medical papers",
    "May '20",
    "music",
    "Opuscon789 DMs",
    "Misc Idea Guy chats",
    "6",
    "Julie Reveals Herself",
    "book number ten",
    "IRC",
    "Guru Larry",
    "Vivitheg's AIM chat",
    "my cousin",
    "We can vi- we can videotape... I would like it if we could videotape our first time together.",
    "I'll haunt your dreams",
    "can’t understand why he’s single",
    "Sonichu Girls",
    "brother",
    "your mother",
    "Alec calls",
    "Bryanfrogboy Chats",
    "You can keep me emotionally sound... and secure.",
    "Helena-WCT DMs",
    "Dec 15",
    "Chris Chan Conservation Collective",
    "The Place",
    "Aly Hirschberg DMs",
    "YOU SAID IT IN YOUR VIDEOS",
    "autism papers",
    "100MegaMeh DMs",
    "that book",
    "Watchmen",
    "Ren Ryghts DMs",
    "Sonichu",
    "AquaDiamond8 DMs",
    "jerks",
    "Robert Simmons",
    "Guitar Hero",
    "worst parts",
    "Null DMs",
    "other things",
    "stress",
    "financial aid",
    "Britney Spears",
    "Mary Lee Walsh",
    "2014 jail calls",
    "4",
    "Fiona Facetime Videos",
    "Panda",
    "Central Virginia Regional Jail",
    "Supporting Sarah May",
    "The Knights of CWC",
    "Sarah May",
    "Chess Club Chats",
    "Wikipedia",
    "Alec Benson Leary",
    "cat poo",
    "8",
    "10",
    "cwc frens",
    "simultaneously overqualified for almost any position imaginable",
    "2008",
    "The Sons of the Miscreants",
    "The Create Unknown",
    "the video",
    "Lars Call",
    "Mumble Chat 2",
    "nudity",
    "I like your voice",
    "I'm able to recover.",
    "Dec 28",
    "Rowdy Fuckers Cop Killers' ENDLESS WAR",
    "PlayStation Eye",
    "Discord Q&A",
    "yesterday",
    "PlayStation Network",
    "Count Dankula",
    "1.5",
    "Vivian",
    "Kaiyosh's server‎‎",
    "Geno Samuel DMs",
    "Father Call",
    "virgin",
    "comic",
    "ED page",
    "Dec 18",
    "dating education",
    "humble",
    "Blanca",
    "Crumple-Lope",
    "two years",
    "16",
    "Jan 3",
    "Fan visits",
    "undated"
  ],
  "scraped_at": "2025-11-26T15:16:44.962270"
}