{
  "url": "http://sonichu.com/cwcki/Rainbows_Unicorns_and_a_Bluebird_of_Happiness_Chapter_4",
  "title": "Rainbows Unicorns and a Bluebird of Happiness Chapter 4",
  "display_title": "Rainbows Unicorns and a Bluebird of Happiness Chapter 4",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Rainbows Unicorns and a Bluebird of Happiness Chapter 4</b> is a video uploaded by Chris on 8 July 2016, and the last of the series of reading videos. Unfortunately Chris neglected to order the words correctly in the title of his video.\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 4</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/naQmhBTKvEY\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=naQmhBTKvEY\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/naQmhBTKvEY\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>8 <a href=\"/cwcki/July_2016\" title=\"July 2016\">July 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Handouts</span><a href=\"/cwcki/Chris_and_money#Begging\" title=\"Handouts\"><img alt=\"Handouts\" decoding=\"async\" height=\"20\" src=\"/w/images/5/5e/Handout_Template1.png\" width=\"20\"/></a> <a href=\"/cwcki/Chris_and_money#Begging\" title=\"Chris and money\">Handouts</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">The Shattered Heart</span><a href=\"/cwcki/File:White_Tomgirl_with_Heart.png\" title=\"The Shattered Heart\"><img alt=\"The Shattered Heart\" decoding=\"async\" height=\"21\" src=\"/w/images/0/0a/White_Tomgirl_with_Heart.png\" width=\"19\"/></a> <a href=\"/cwcki/Heart_level\" title=\"Heart level\">The Shattered Heart</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Unicorns_Rainbows_and_a_Bluebird_of_Happiness_Chapter_3\" title=\"Unicorns Rainbows and a Bluebird of Happiness Chapter 3\">Unicorns Rainbows and a Bluebird of Happiness Chapter 3</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Announcement_20160709\" title=\"Announcement 20160709\">Announcement_20160709</a>\n</td></tr></tbody></table>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">We still need more money to help us out round here\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Description\">Description</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The fourth part in a multipart series to read this story.\n<p>Donations still requested.\nPlease send donations directly to me via PayPal to my email address: ChrisChanSonichu@aol.com. Thank you.\n</p><p>If you don't know how, watch this video.\n<a class=\"external free\" href=\"https://youtu.be/wPYVhPe_PTQ\" rel=\"nofollow\">https://youtu.be/wPYVhPe_PTQ</a>\n</p><p>If you are unable to send via PayPal, please send a legal check with the amount to my home address.\n</p><p>Christine Chandler\n</p><p>14 Branchland Ct.\n</p><p>Ruckersville, VA 22968\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p>[<i>PS4 intro</i>]\n</p><p>[<i>Intro screen, username: \"sonichu\", Hatsune Miku profile picture</i>]\n</p><p>[<i>PS4 intro again</i>]\n</p><p>[<i>Playstation default music is playing</i>]\n</p><p>Hello everybody! This is Christine Chandler, coming to you live from home, once again, oh, I forgot the put the thing... heugh,\n</p><p>[<i>Puts something on with his remote</i>]\n</p><p>Alright there's that. Alright so anyway, huh, [<i>double sigh</i>], things are same old, same old. I still have, the orders to fill, and, unfortunately [<i>stress sighs again</i>] finances keep me, held back too.\n</p><p>Pfff, anyway we can still use some good, donations around here, if y'all would be so kind, please, [<i>stress sigh</i>] a really big, setback, that just, took me and my mom outta- outta nowhere.\n</p><p>Pff, I could do with a bleedin, mortgage and, well anyway, we took care of what needed taking care of recently that I asked, or, talked about earlier, it escapes my mind- I had to do... Oh yeah, mom's perscription, we did that, [<i>stress sighs</i>] but yeah we still need more money to help us out round here, so... I put down the instructions once again underneath this video, on how to donate.\n</p><p>But, with that, hm, uh, iwa- be uh, getting onto... chapter 4, of s- Rainbows, Unicorns, and a Bluebird of Happiness, [<i>sigh</i>] ok.\n</p><p>[<i>Moves PS4 controller whilst sighing</i>]\n</p><p>[<i>Muttering</i>] why am I showing this on camera? Heh, works for me\n</p><p>[<i>sigh</i>] Chapter 4, Suddenly life has a new meaning.\n</p><p>Kevin! It's time to <a class=\"mw-redirect\" href=\"/cwcki/WakeUpBrain\" title=\"WakeUpBrain\">wake uuuup</a>!\n</p><p>Kevin heard a soft, familiar voice as he lied in his large, pink bed. The mattress was pink, and although Kevin initially wanted the bad frame to be made of wood, it was painted pink, Queen Cynthia had convinced him to allow his bed frame to be <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">bade</a> with gold! Kevin opened his eyes and smiled as he was greeted with the sight of the familiar girl with yellow and red hair. Who was smiling at him from the end of his bed. She was wearing a pink dress, with blue ruby tipped frills. His favourite dress to see her wear! She had bright yellow wings purchee- protruding from her back, that seemed to shimmer as the morning light shoan on it. From the window of the room, and the red horn on her forehead perfectly blended with her hair.\n</p><p>\"What's the occasion?\"\n</p><p>Kevin asked, as he stepped out of the bed and stood up, he walked over to his closet wearing his pink jujamas, while the eyes of the girl followed his movements. The pink wings on his back stretched as he walked, and the white horn on his forehead glowed as he used his magic to open the closet door.\n</p><p>\"Kiiing Kevin! Aren't you aware that today is the day when all of the respective leaders of the sentient species, meet for dinner and discussion?\" \n</p><p>Sarah asked as shes- as a smile as- asked with a smile as Kevin pulled out th- his blue tuxedo, and his, pink pants.\n</p><p>\"Of course I'm aware of it! You, usually let me sleep in on those- sleep in on those days. That's why me and, Keyten, stayed up la- so late last night.\" \n</p><p>Kevin said with a smile on hisfacanbs moved his pjama shirt, and replaced it with, his tuxedo, while, thinking about the picnic that he and Keyten had shared- under the stars, the previous night. It always amazed Sarah, that Kevin could fit his wings through the hole, in the back of his clothing so effortlessly, which was something that even his mother had trouble doing.\n</p><p>\"Yes, I am aware that you remained outside for a full hour! Past your usual bedtime! So you're probably tired right now.\" \n</p><p>Sarah said with a blush on her face as Kevin removed his pjama pants and proceeded to replace them with his pink pants.\n</p><p>\"However, Queen Cynthia wishes to speak to you! And I don't want to make her waif[sic] any longer than necessary.\" \n</p><p>The girl said to Kevin, who smiled as he walked towards his dresser, and picked up his golden crown.\n</p><p>\"Well, I guess we shouldn't keep her waiting, then.\" \n</p><p>Kevin said as he placed his crown on top of his head, and walked towards the wooden door, that allowed visitors to enter his bedroom[?], he held the door open and Sarah walked through it, soon enough the door was closed, and the two of them were walking down the halls of the famous, EB castle.\n</p><p>\"Why exactly does she want to speak with me?\" \n</p><p>Kevin asked Sarah, with what could be described as an embarrassed expression on her face, as though she was uncomfortable answering his question. Hm.\n</p><p>\"She is- for lack of a better word- throwing a tantrum in her room, I think they- that you would be best- the best person to calm her.\" \n</p><p>Kevin smirked as soon as Sarah had finished speaking, as the thought of the normally composed Queen Cynthia throwing a temper tantrum and requiring him to calm her down.\n</p><p>\"Are you sure that Cynthia is the one throwing the tantrum? It could just be the knock-knock, getting angry again for some stupid reason\"\n</p><p>Kevin said as he thought of the childish, shape-shifting king, who often threw temper tantrums, although he, Cynthia, Sarah and Keyten had all seen his true form, most of the people the- land had no idea what it looked like. Most people had only see him- seen him, in another form.\n</p><p>\"This isn't my home!\"\n</p><p>\"Calm down, please, you're making a scene.\"\n</p><p>Kevin smiled to himself as he heard the voices coming from the room, as, he and Sarah arrived at the gold door, that lead to clean[sic] Cynthia's, room.\n</p><p>\"Hm, I see she's entertaining someone. should we embarrass her?\"\n</p><p>Kevin asks Sarah, who was smiling mischievously, as she nodded her head, and- and started to gently turn the silver knob.\n</p><p>\"HELLO CYNTHIA!!!\"\n</p><p>Kevin and Sarah said in synced as they opened the door, their happy expressions about playfully humiliating their mother turned to thoughts of confusion that Cynthia, was staring with a terrified expression on her face, and her companion, who had her arm, wrapped around her body, looked almost exactly like Sarah!\n</p><p>\"You shouldn't be alive, I murdered you!\"\n</p><p>Sarah said in a certain way that Kevin couldn't help but chuckle. Sarah didn't find the situation nearly as amusing, as she pointed at her doppelganger. \n</p><p>\"Who the hell is she?!\"\n</p><p>Sarah asked the girl, who was currently staring as intently at her as she was. The girl sighed and turned and hugged Cynthia instead of answering Sarah's question,\n</p><p>\"Um, I think we cast the wrong spell, I don't think we're, shaped, I don't think we're- I don't think we reshaped our world, we just teleported to a different world! Typl- Typical Jack! Giving me the wrong spell! I'll have to talk with him when I get home\"\n</p><p>The girl said with a smile, as she continued hugging Cynthia, who continued to stare at Kevin with a terrified expression that was making him feel uncomfortable.\n</p><p>\"That's pretty impressive magic, I've only known of a single person who could cast a spell, to transport two people, to another world\"\n</p><p>Sarah said to her doppelganger, as a smile appeared on her face, her doppelganger sighed as she continued hugging the girl, who Kevin was beginning to assume, might not be Cynthia, at least, not the Cynthia that he knew, hm.\n</p><p>\"She's pretty cute and, she has more magic within her than anyone else in our world. The only person, who only comes close to having as much anger- as much magic is her sister. Not anymore, though!\"\n</p><p>Sarah stopped looking at her and said to Cynthia's doppelganger as an expression of mourning appeared on her face and overtook her expression of fear temporarily.\n</p><p>\"Lucy!\"\n</p><p>Cynthia's doppelganger said with a frown, as the white on her forehead lit up with a bright, pink glow.\n</p><p>\"I want to go home now!\"\n</p><p>Cynthia's doppelganger said to Sarah's doppelganger, with a voice that was barely louder than a whisper, as the light from the from her horn seemed to envelope the two girls in a blanket of pink light. Sarah's doppelganger nodded her head, as the two girls started fading away into nothingness.\n</p><p>\"Goodbye! It was nice meeting yaTWO!\" \n</p><p>Sarah's doppelganger said with a, faint smile as she finished disappearing along with her friend, within a few seconds the two doppelda- doppelgangers disappeared, leaving Sarah and Kevin alone in the room. [<i>sigh</i>]\n</p><p>\"Well, if I made a list of the 50 strangest things I've seen within my life, that probably would not make the final draft.\"\n</p><p>Kevin said with a chuckle as he walked outside of the room, with Sarah following behind him.\n</p><p>\"Do you want to get some bekfast[sic] I think Lucinda is, cooking for her mom right now, so- we might get some steak if we ask nicely\"\n</p><p>Sarah said as the two walked down the hall, Kevin absent-mindedly nodded his head, as he walked alongside Sarah, down the familiar path, to the kitchen of the castle.\n</p><p>\"Did you notice the blood on her horn?\"\n</p><p>Kevin stared at the girl with a slightly confused expression.\n</p><p>\"Was that blood? I'm not entirely sure what it was. I thought it could have been, <a class=\"mw-redirect\" href=\"/cwcki/Navy\" title=\"Navy\">magic residue</a> or some kind of sauce\"\n</p><p>Sarah said to Kevin as he smiled and shook his head.\n</p><p>\"Uh, no, that was definitely blood, I've never really seen much more than a cut, or a nosebleed, so I'm not an expert, but my instincts tell me that Cynthia's doppelganger had blood on her horn, which meeeeeeans...\"\n</p><p>Kevin, paused dramatically, and Sarah rolled her eyes;\n</p><p>\"It means she's a killer, right?\"\n</p><p>Sarah asked Kevin, who chuckled in response.\n</p><p>\"No. I've seen her with that blood on her horn before and she did not kill anyone to get it on there\"\n</p><p>Kevin said as the two approached the large, wooden door. Leading into the castle's kitchen.\n</p><p>\"After you.\"\n</p><p>S- Kevin said with a smile, as he pushed the door open, and Sarah stepped through the door frame\n</p><p>\"You're such a gentleman why weren't you like this when we were courting?\"\n</p><p>Sarah asked the man, who shrugged his shoulders. [<i>Cough</i>] \n</p><p>\"If I like you I'll hold the door open for you, if I love you, I'll respect you enough to open the door yourself, you didn't enjoy my looove.\"\n</p><p>Kevin explained to the girl who approached the large table, made of glass, that had been coloured blue and sat down on one of the wooden chairs that had been painted red.\n</p><p>Hm. Uh.\n</p><p>\"Hello! My good knock-knock friends! How are knock-knock! You today on this on a knock-knock! This fine- this morn- this fine morning knock-knock!\"\n</p><p>Kevin and Sarah turned their heads to see what appeared to be a large, pink cube, with a pair of lips, and a set of eyes, on, one of it's, sides.\n</p><p>\"Hello knock!- Hello! Knock-knock!\"\n</p><p>Kevin said to the cube, who's lips contorted into a smile as it started transforming into a naked lady, with long, blue hair, that matched her blue tail, on her behind and her blue horn on her forehead.\n</p><p>\"Hello, King Kevin, knock-knock! It's been a knock-knock! Long time since knock-knock! We've had- any knock-knock! Fun together! Would knock-knock you like to knock-knock! Have a little knock-knock! Fun right now knock knock?\"\n</p><p>Knock said, with a smile, as HE completed his transformation and stared at Kevin with a suggestive smile on his face. Sarah chuckled as a blush appeared on Kevin's face- Kevin's face, that will never happen again.\n</p><p>\"Is there something you want to tell me?\"\n</p><p>A cu- a voice said from behind Kevin, who's blush intensified as he turned his head to reveal the REAL Lucinda's blue hair, blue tail, and see-through blue night gown, along with her orange l- uh, wings. It appeared as though she was about to go to her bedroom and sleep. \n</p><p>\"Uh, I may have done something in the past with knock-knock while he looked like you!\"\n</p><p>Kevin said to the girl\n</p><p>\"Oh, hm\"\n</p><p>Who looked at him with an amused expression on her face, before she walked towards the door, leading to the hallway that would lead her to the bedroom.\n</p><p>\"Dont! Look at my bum!\"\n</p><p>Lucinda said with a chuckle as she walked away. Leaving the inhabitants of the castle alone at the table.\n</p><p>Uuh, and that's it for chapter 4 right now, tune in next time, for chapter 5! Still a few chapters to go and I- try to be more- quick on getting the next one in.\n</p><p>Thank you everyone! And have a good, safe day! Hm, again, donations, please, we, really could use the help, and we're really serious about that right now.\n</p><p>[<i>Share factory outro logo turns to PS4 logo</i>]\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Unicorns_Rainbows_and_a_Bluebird_of_Happiness_Chapter_3\" title=\"Unicorns Rainbows and a Bluebird of Happiness Chapter 3\">Unicorns Rainbows and a Bluebird of Happiness Chapter 3</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Announcement_20160709\" title=\"Announcement 20160709\">Announcement_20160709</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<table align=\"center\" id=\"toc\" style=\"text-align:Left; clear:both;\" width=\"70%\">\n<tbody><tr align=\"center\" style=\"background:#ccccff\">\n<td><b>Chris's other videos</b>\n</td></tr>\n<tr>\n<td style=\"font-size:11px;\">\n<center>\n<p><a href=\"/cwcki/CWC_is_Angry\" title=\"CWC is Angry\">Stackhouse gunnery</a> |\n<a href=\"/cwcki/Tour_of_Chris%27s_House\" title=\"Tour of Chris's House\">Tour of Chris's house</a> |\n<a href=\"/cwcki/ShutUpBrain_and_WakeUpBrain\" title=\"ShutUpBrain and WakeUpBrain\">ShutUpBrain and WakeUpBrain</a> |\n<a href=\"/cwcki/CWC_Address_to_Unilever_About_AXE\" title=\"CWC Address to Unilever About AXE\">Stay Off Our AXE, you Homos!</a> |\n<a href=\"/cwcki/MEOW\" title=\"MEOW\">MEOW</a> |\n<a href=\"/cwcki/Fanmail_Reading\" title=\"Fanmail Reading\">Fanmail Reading</a> |\n<a href=\"/cwcki/Holiday_Greetings\" title=\"Holiday Greetings\">Holiday Greetings</a> |\n<a href=\"/cwcki/A_Sonichu_Day\" title=\"A Sonichu Day\">A Sonichu Day</a> |\n<a href=\"/cwcki/Shout_out_to_Fans_in_Hospital\" title=\"Shout out to Fans in Hospital\">Shout out to Fans in Hospital</a> |\n<a href=\"/cwcki/Christian_Love_Day_(video)\" title=\"Christian Love Day (video)\">Christian Love Day</a> |\n<a href=\"/cwcki/Magical_Man_Potion\" title=\"Magical Man Potion\">Magical Man Potion</a> |\n<a href=\"/cwcki/Happy_Sonichu_Day\" title=\"Happy Sonichu Day\">Happy Sonichu Day</a> |\n<a href=\"/cwcki/03212010_C-Ya_Later.MOV\" title=\"03212010 C-Ya Later.MOV\">See You Later</a> |\n<a href=\"/cwcki/Cleveland_Show_Voice_Rant\" title=\"Cleveland Show Voice Rant\">Cleveland Show Voice Rant</a> |\n<a class=\"mw-redirect\" href=\"/cwcki/Abstinence_Rant\" title=\"Abstinence Rant\">Abstinence Rant</a> |\n<a href=\"/cwcki/Michael_Snyder_is_ColdHearted_and_Mean\" title=\"Michael Snyder is ColdHearted and Mean\">Michael Snyder is ColdHearted and Mean</a> |\n<a href=\"/cwcki/04232010_-_Autism_Awareness_%26_Men_Should_NEVER_be_Topless\" title=\"04232010 - Autism Awareness &amp; Men Should NEVER be Topless\">Autism and men bras</a> |\n<a href=\"/cwcki/Greene_County_Conspiracy\" title=\"Greene County Conspiracy\">Greene County Conspiracy</a> |\n<a href=\"/cwcki/EXCLUSIVE_Manchester_High_School_2000_Reunion_Required_NOW\" title=\"EXCLUSIVE Manchester High School 2000 Reunion Required NOW\">EXCLUSIVE Manchester High School 2000 Reunion Required NOW</a> |\n<a href=\"/cwcki/ECV_00001\" title=\"ECV 00001\">Cherokee clan</a> |\n<a href=\"/cwcki/Pregnant_Act\" title=\"Pregnant Act\">Pregnant Act</a> |\n<a href=\"/cwcki/SonichuBabies\" title=\"SonichuBabies\">SonichuBabies</a> |\n<a href=\"/cwcki/PlayingHouse\" title=\"PlayingHouse\">PlayingHouse</a> |\n<a href=\"/cwcki/Wigwam\" title=\"Wigwam\">Wigwam</a> |\n<a href=\"/cwcki/DayOut\" title=\"DayOut\">DayOut</a> |\n<a href=\"/cwcki/ShowerClean\" title=\"ShowerClean\">ShowerClean</a> |\n<a href=\"/cwcki/SpaghettiRoutine\" title=\"SpaghettiRoutine\">SpaghettiRoutine</a> |\n<a href=\"/cwcki/HairDifference\" title=\"HairDifference\">HairDifference</a>\n</p><p>See also:\n<a href=\"/cwcki/Template:Captain%27s_Log\" title=\"Template:Captain's Log\">Captain's Log</a> |\n<a href=\"/cwcki/Template:CWC_on_TV\" title=\"Template:CWC on TV\">The DVD</a> |\n<a href=\"/cwcki/Template:The_Cwcivil_War_of_2009\" title=\"Template:The Cwcivil War of 2009\">Cwcivil War</a> |\n<a href=\"/cwcki/Template:Game_Videos\" title=\"Template:Game Videos\">Game videos</a> | \n<a href=\"/cwcki/Template:LeakedVideos\" title=\"Template:LeakedVideos\">Leaked videos</a> |\n<a href=\"/cwcki/Template:Music_Videos\" title=\"Template:Music Videos\">Music videos</a> | \n<a href=\"/cwcki/Template:Sweetheart_Videos\" title=\"Template:Sweetheart Videos\">Sweetheart videos</a> |\n<a href=\"/cwcki/Template:Troll_Videos\" title=\"Template:Troll Videos\">Troll videos</a> |\n<a class=\"mw-redirect\" href=\"/cwcki/Template:Videobooks\" title=\"Template:Videobooks\">Videobooks</a>\n</p>\n</center></td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250420164646\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.090 seconds\nReal time usage: 0.126 seconds\nPreprocessor visited node count: 301/1000000\nPost‐expand include size: 9253/2097152 bytes\nTemplate argument size: 2663/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   58.205      1 -total\n 82.68%   48.122      1 Template:Infobox/video\n 20.17%   11.737      1 Template:(Handouts)\n 14.87%    8.658      1 Template:Financhu_Crisis\n  9.51%    5.537     18 Template:Pipe\n  6.19%    3.602      1 Template:Reason\n  5.79%    3.370      4 Template:Icon\n  4.31%    2.507      1 Template:White_Tomgirl_with_Heart\n  4.20%    2.446      1 Template:Quotebox\n  4.20%    2.444      1 Template:Quote\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23398-0!canonical and timestamp 20250420164646 and revision id 267013. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Rainbows_Unicorns_and_a_Bluebird_of_Happiness_Chapter_4&amp;oldid=267013\">http://sonichu.com/w/index.php?title=Rainbows_Unicorns_and_a_Bluebird_of_Happiness_Chapter_4&amp;oldid=267013</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2016",
    "Videos Christian uploaded to YouTube",
    "Rainbows, Unicorns, and a Bluebird of Happiness"
  ],
  "links": [
    "Shout out to Fans in Hospital",
    "July 2016",
    "Wigwam",
    "Greene County Conspiracy",
    "A Sonichu Day",
    "Fanmail Reading",
    "ShowerClean",
    "Unicorns Rainbows and a Bluebird of Happiness Chapter 3",
    "magic residue",
    "bade",
    "Happy Sonichu Day",
    "Autism and men bras",
    "SonichuBabies",
    "SpaghettiRoutine",
    "Announcement_20160709",
    "Stackhouse gunnery",
    "See You Later",
    "wake uuuup",
    "Chris's videos",
    "Abstinence Rant",
    "Stay Off Our AXE, you Homos!",
    "Videos",
    "DayOut",
    "Christian Love Day",
    "Cherokee clan",
    "Holiday Greetings",
    "ShutUpBrain and WakeUpBrain",
    "MEOW",
    "EXCLUSIVE Manchester High School 2000 Reunion Required NOW",
    "Cleveland Show Voice Rant",
    "HairDifference",
    "Financhu Crisis",
    "Tour of Chris's house",
    "PlayingHouse",
    "The Shattered Heart",
    "Michael Snyder is ColdHearted and Mean",
    "Magical Man Potion",
    "Reason",
    "Pregnant Act"
  ],
  "scraped_at": "2025-11-26T21:36:37.127314"
}