{
  "url": "http://sonichu.com/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_2",
  "title": "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2",
  "display_title": "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2</b> is a video uploaded by <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> on 19 <a href=\"/cwcki/June_2016\" title=\"June 2016\">June 2016</a>.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/nkVtTB51z3A\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=nkVtTB51z3A\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/nkVtTB51z3A\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>19 <a href=\"/cwcki/June_2016\" title=\"June 2016\">June 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Handouts</span><a href=\"/cwcki/Chris_and_money#Begging\" title=\"Handouts\"><img alt=\"Handouts\" decoding=\"async\" height=\"20\" src=\"/w/images/5/5e/Handout_Template1.png\" width=\"20\"/></a> <a href=\"/cwcki/Chris_and_money#Begging\" title=\"Chris and money\">Handouts</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">Turquoise Tank Top</span><a href=\"/cwcki/File:TurquoiseTT.png\" title=\"Turquoise Tank Top\"><img alt=\"Turquoise Tank Top\" decoding=\"async\" height=\"22\" src=\"/w/images/5/5a/TurquoiseTT.png\" width=\"19\"/></a> <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">Turquoise Tank Top</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_1\" title='Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1'>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Women_Only_Need_Apply_-_No_STD%27s\" title=\"Women Only Need Apply - No STD's\">Women Only Need Apply - No STD's</a>\n</td></tr></tbody></table>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">I'll read another chapter again in the near future, meantime please donate via PayPal.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Description\">Description</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The second part in a multipart series to read this story.\n<p>I learned of, and cleared up, the block on my PayPal account last night. So, please, try donating again if you tried and was unable to. And, please donate, everyone who hasn't yet.\n</p><p>Donations still requested.\nPlease send donations directly to me via PayPal to my email address: ChrisChanSonichu@aol.com. Thank you.\n</p><p>If you don't know how, watch this video.\n<a class=\"external free\" href=\"https://youtu.be/wPYVhPe_PTQ\" rel=\"nofollow\">https://youtu.be/wPYVhPe_PTQ</a>\n</p><p>If you are unable to send via PayPal, please send a legal check with the amount to my home address.\nChristine Chandler\n14 Branchland Ct.\nRuckersville, VA 22968\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p>[PS4 intro]\n</p><p>[Music plays throughout. Chris is looking up at his PS4; once he notices that the recording has started, he puts down the controller and looks at the camera]\n</p><p>Hello, everybody, it's Christine Chandler coming to you live from home once again. Update on the, uh, donations... apparently, uh, there was a temporary block on the, uh, my Paypal account. But I have sume desolve-- I have resolved that, cleared that up, so, everybody can donate once again, safely and well, so please get to that right away, if you haven't been able to do that for the last day or two.\n</p><p>Also, if you do find difficulty in donating through Paypal... mmm, I will allow for you to send me... a... cer-- a certified... bank cheque, through the US mail to my home address. But mosssly, I want it direct to my Paypal account, please.\n</p><p>Anyway, with that, um... still got the, uh, buzz about from the electric company threatening to cut off our power, so... we desperatney need at least two hundred dollars. I say tha-- I s-- I state tha-- I quote that... amount... because not only do we need to pay the bill, but we're gonna need to be able to eat around here. Food's not gonna be around totally for about, well, for... [sigh] shoot... another... couple of weeks.\n</p><p>[sigh] Well anyway, aside from that, um... [Chris takes off his glasses] yes, please help us, we don't want to lose our electricity, or go hungry. Please. Donate now.\n</p><p>[Chris leans forward and stares into the camera for a few seconds, before leaning back and putting his glasses back on]\n</p><p>Mkay, anyway, so, with that, we read-- we started reading the next chapter of \"Unicorns, Rainbows, and Bluebirds [sic] of Happiness\". Chapter 2: Karaoke Night.\n</p><p>[high-pitched] \"Marco!\"\n</p><p>Sabrina the blue pigeon screeched tremulously into the microphone as she read the words on the screen at the bar. Only five creatures were at the bar at the moment. One of them was an employee who served the customers drinks. Two of them appeared to be ordinary humans who were having a conversation with each other. The other inhabitant of the bar was an orange and white hamster who was trying to best distract herself from the pigeon's singing.\n</p><p>Hmm. I don't know, might be... uh, shoot... what was her name, Edith? [long pause] Eh, anyway, moving on...\n</p><p>Alright, so... [mumbling]\n</p><p>[sounding <a href=\"/cwcki/DIRTY,_CRAPPED_BRIEFS\" title=\"DIRTY, CRAPPED BRIEFS\">constipated</a> ] \"Your girlfriend has a terrible singing voice, but at least she havin' fun!\" Mike the police officer said to the man who was currently wearing the blue tuxedo with the pair of pink jeans??? [Chris' intonation rises  all the way through this sentence. It sounds like a question.] Mike was currently wearing a plain white T-shirt with a black leather coat, and a pair of blue jeans. The man wearing the blue tuxedo shrugged his shoulders.\n</p><p>Hmm... mm.\n</p><p>[somewhat higher pitched] \"She gets so excited for karaoke. She's always asking me to buy her something so that she can sing karaoke at home. That's not going to happen anytime soon, so I just let her sing here every week.\"\n</p><p>[in Sabrina voice] \"Marco, Marco, Marco!\"\n</p><p>Bartender wearing the black dress that matched her black hair, said [sounding like an old lady] \"Huh, I wish you wouldn't sometimes!\" as she poured glasses of rum and coke for the two men.\n</p><p>Wait. [unclear -- \"hot dog this red\"???]\n</p><p>\"I wish that you wouldn't sometimes,\" as she po-- ssshe said as she poured glasses of rum and coke for the two men. Kevin smiled as he accepted his glass, while Mike planned on waiting until he finished his current glass of [singing] rum and coca-cola!\n</p><p>It's not rum and coke, it's coca-cola, from the Romans. Roman coca-cola! [more singing, unclear - \"drink it from the empty gala\"?]\n</p><p>Yeah, before he dr-- yeah... finished his current dra-- his gla-ss before he drank a second one.\n</p><p>[sounding congested] \"Ahh, so you're fermier [familiar] with the mutations, right?\" Mike asked Kevin as-- barked as he quickly drank all the liquid in his glass.\n</p><p>\"Uh, which one? The one that transforms people into giants? The one that gives them magic powers? The one that makes them fly? Eh, or the ones that makes animals talk?\" Kevin asked Mike, who stared at Kevin as he took a sip from his glass.\n</p><p>[congested] \"I can tell you're not taking this seriously,\" Kev-- said Ke-- said... Mike said to Kevin who contru-- who continued to smirk, and as the employee poured him another drink. \"As you know, mutations have etsisted for almost SITS HUNDRED YEARS. We don't know what cause dem, and we likely never will. However, within the past two hundred years, a strange combination of the-- two different mutations has appeared.\"\n</p><p>Kevin nodded his head as Mike paused to take a sip of his drink. \"Yes, some people have the horn on their forehead, it gives them magical powers, as well as the wings that let them flyyy.\" As the bartender finished pouring him another drink, Kevin asked, [in Mike's weird Kermit voice] \"So what?\"\n</p><p>Sabrina continued to shriek tunelessly through the speakers in the bar. \"Munko, munko, munko!\"\n</p><p>Mmm... zm...\n</p><p>\"For some reason the mutation makes the wings larger and the magic stronger, a fully grown magic user. I think most people call them unicorns.\" Ss-- Kevin said with a childish smile, which caused Mike to sigh.\n</p><p>[Mike's congested voice] \"UUUGH. A fully grown unicorn who spent their life studying and practicing magic can be-- can just barely reach the level of power a baby with a mutation can harness. A full grown person with wings--\"\n</p><p>Kevin interrupted Mike a second time. \"You mean a pegasus?\"\n</p><p>The police officer groaned in annoyance. \"EURGH. [Volleyball crengus] pegasus can barely fly at a third of the speed that a child with a mutation can. They're dangerous. But they're also very useful to us. The main problem that we have is that they can't increase their numbers.\" Mike said to Kevin, who chuckled as he started to sip the liquid from his glass.\n</p><p>\"I heard about that. When one of them is pregnant, the child ends up with the same mutation. The child sucks the life out of the mother while it's in is-- it's in the womb. Then the child is born, and the mother dies. What we're left with is a species that can reproduce, but their population either stays the same or decreases. Hmm, perhaps it's for the best, given how dangerous and unstable they are.\"\n</p><p>\"[shuddering noise]\" Kevin shuddered, as he thought of his time at Saint... Saint Anger's Mental Hospital, where he shared a room with a mutated person named Francine.\n</p><p>[Mike as Fozzy Bear] \"Ehhh, most of them end up in mental institutions because their mutations drive them insane. Only a few of them were able to function on a normal level.\" Mike said as a smile started to appear on his face. \"But imagine if there was a person with a mutation who wasn't completely crazy, who could potentially reproduce exponentially.\" Mike said to the man, who looked at him with a curious expression before he took another sip from his glass. \n</p><p>\"[something] simply... the girl and her twin sister.\"\n</p><p>And Mike nodded his head. Hmm. \"Her mother's pregnancy was the first case of a pregnant mutant conven-- conceiving twins. It was the first time that the population had increased since around one hundred years ago. But that's the-- that's not the most interesting part.\" Mike started to grin. Kevin's curiosity increased as the man reached into his pocket and pulled out a handful of photographs that he placed on the counter at the bar.\n</p><p>Mike pointed at a blurry photo of what appeared to be the insides of a young woman's womb. \"We've had our best unicorns watching these two for years. Imagine our surprise when we found one of them was pregnant, with twins.\"\n</p><p>Kevin stared at the photos.\n</p><p>\"The girls healed each other when they slept together. They provided the [life and magic needed?] for the offspring to grow inside of her. They were producing mutated children, and the mother didn't need to die when she gave birth. There was so much potential, and now...\" Mike paused, and Kevin stared at him intensely.\n</p><p>\"Now she's dead and her children are dead - what does this have to do with me?\" Kevin asked, and Mike shrugged his shoulders: \"Eh! Everything, you see we already found one of the babies in YOUR house! And your friend, Jack will die in about an hour when my friend pulls him over and finds the other baby in the trunk of his car! And those pink pandies you gave Edith to wash--\"\n</p><p>[Chris, making an aside to himself] I was right, her name was Edith--\n</p><p>\"are covered with the blood of the girl you murdered as well as your fingerprints!\"\n</p><p>\"Ha ha ha!\" Mike laughed at the end of his sentence as Kevin reached out and grabbed him by his throat, choking him as he held him up in the air and Kevin screamed:\n</p><p><b>\"You sunova bitch!\"</b>\n</p><p>The rest of the people in the bar turned their heads-- turned their heads to stare at the scene between the two men - \n</p><p>\"Ugh! The best thing to do right now is to turn yourself in! If you take one step out of the bar without me, you'll die! If you kill me, then you'll die!\" Mike explained to the man.\n</p><p>Kevin growled at the officer before he slammed Mike's face into the counter of the bar where his dran-- his drank sat.\n</p><p>The glass shard-- once his face was slammed onto it, and Mike yelled in pain as Kevin slammed his head repeatedly onto the counter, after a few hard hits, the man's body became limp.\n</p><p>[<i>Sniffs</i>]\n</p><p>Kevin walked away from the dead man's corpse and started to brush away any of the man's blood that remained on his clothes.\n</p><p>It didn't work very well and it might have caused the blood to spread throughout his clothing. Hmm.\n</p><p>\"I need to leave right now!\" Kevin said to his girlfriend, and the hamster who cleaned his clothes.\n</p><p>[Sonichu Baby voice]: \"[Mango/mongo]?\" The pigeon asked as she flew onto the man's shoulder.\n</p><p>\"[You/ he] was bluffing, he's working outside of the law right now [Inaudible], he planned-- he planted the evidence at our house and Jack's car, and he's probably sent some kind of anonymous tip to the police, they'll find it and then, they'll try to kill us!\"\n</p><p>\"We're safe now, but we won't be soon...\" Kevin said as he pulled his cellular phone out of his pocket.\n</p><p>\"Hey, Mr Jack, where're you at?\"\n</p><p>Kevin typed a message and sent it out to his friend; as he opened the door and walked out of the bar, with Sabrina on his shoulder and Edith clinging into the-- onto the leg of his pants.\n</p><p>I'm on the side of the freeway in my car, pig fucker pulled me over, and he's looking in my trunk right now.\n</p><p>Kevin read the message as he opened the door of his car, Edith and Sabrina either walked or flew into the back seat of the car whilst Kevin sat in the driver's seat and started the engine.\n</p><p>\"He's asking me to put my hands up and get out of the car.\" \n</p><p>Once the engine started, Kevin locked up- looked down on his phone and swore: <i>waaah.</i> He turned to Edith as his car started to move.\n</p><p>\"I'm sorry. Your boyfriend's dead.\" Kevin said sympathetically as Edith started to sob.\n</p><p>A tear started to run down Kevin's face as he the police sirens in the night as as he drove his car. [<i>Shakes finger</i>]\n</p><p>He heard the faint sound of someone screaming expletives, which were followed by a few loud gunshots. That disturbed the peaceful atmosphere of the night.\n</p><p>\"It's a shame that he didn't wait to die till seven in the morning.\" Kevin said quietly under his robe. \n</p><p>Edith continued to sob and [<i>incoherent mumbling</i>] quiet in her syit.\n</p><p>\"Stop the car!\" The man who continued to drive for- effeminate voice.\n</p><p>He looked into his rearview mirror- as he drove was surprised to see... To see what happened, what appeared to be a girl with wings and a white horn on her forehead.\n</p><p>\"Stop the car.\" \n</p><p>Her pink hair waving in the wind as she flew had him mesmerized was so focused on the car that he didn't notice the bottled magic that was currently travelling toward his car.\n</p><p>\"Uncle!\" The blue pigeon shrieked as the bottled magic hit the car, destroying the tires. The man crushed- cursed as as the door to the left of him in the car and licked out. Sabrina grabbed Edith and flew out of the open door before de car crashed into a tree on the side of the road.\n</p><p>\"You killed my sista!\" The girl yelled as she, charged towards the man, who smiled as he reached into his left pocket, pulled out a small pistol.\n</p><p>\"Don't comeanycloser.\" Kevin said with a smile as he pointed the gun at the girl, who continued to charge towards him. Before the man had time to pull the trigger, the eggirl had lift him up in the air and had her horn positioned near his neck.\n</p><p>\"I didn't kill your sister.\" Kevin said simply. Girl stared at him with eyes and expression that showcased how angry she was with the man.\n</p><p>\"Officer Mike said that you did.\"\n</p><p>\"Officer Mike is a liar.\" Said- Kevin said calmly as the girl continued to stare at him as she held him above her head.\n</p><p>\"Do you know who killed her?\" The girl asked Kevin who shook his head in response. \n</p><p>As soon as the man had finished shaking his head, the girl released him from her grip and impaled him on her horn.\n</p><p>[<i>Chris makes disgruntled face</i>]]\n</p><p>\"Uncle!\" Sabrina shrieked while Edith watched the man slide off the girl's horn with a shocked expression on her face.\n</p><p>\"I didn't kill your sister.\" The man said weakly to the girl who continued to stare at him as the blue pigeon flew on top of his stomach. The pigeon looked down on the dying man with a mournful expression on her face as tears started to slide down her face.\n</p><p>\"Don't cry. I've lived lond enough. Lived long enough. And don't be angry at her. I would have done the same thing.\" Kevin said calmly as his breathing became shallower. \n</p><p>\"I love you.\" Kevin said before his body became limp on the darkened street underneath the night sky. The pigeon turned her gaze from the dead man to the girl who appeared to regret her decision to murder man.\n</p><p>\"I'm sorry. I know how you feel.\" The girl said simply before she flew off into the night. \n</p><p>Well, I guess he's dead. Oh well. Well, I'll read another chapter again in the near future, meantime please donate via PayPal. Thank you very much, and uhh... Have a good day. \n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_1\" title='Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1'>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Women_Only_Need_Apply_-_No_STD%27s\" title=\"Women Only Need Apply - No STD's\">Women Only Need Apply - No STD's</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250420013259\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.083 seconds\nReal time usage: 0.094 seconds\nPreprocessor visited node count: 301/1000000\nPost‐expand include size: 7944/2097152 bytes\nTemplate argument size: 2879/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   32.464      1 -total\n 76.59%   24.864      1 Template:Infobox/video\n 18.63%    6.048      1 Template:(Handouts)\n 11.02%    3.579      4 Template:Icon\n  9.60%    3.116      1 Template:Financhu_Crisis\n  7.57%    2.458      1 Template:Quote\n  7.54%    2.447      1 Template:Succession\n  7.54%    2.447     18 Template:Pipe\n  7.49%    2.430      1 Template:Reason\n  7.36%    2.388      1 Template:Quotebox\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23365-0!canonical and timestamp 20250420013259 and revision id 326521. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_2&amp;oldid=326521\">http://sonichu.com/w/index.php?title=Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_2&amp;oldid=326521</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2016",
    "Videos Christian uploaded to YouTube",
    "Rainbows, Unicorns, and a Bluebird of Happiness"
  ],
  "links": [
    "constipated",
    "Financhu Crisis",
    "Chris",
    "Women Only Need Apply - No STD's",
    "June 2016",
    "Chris's videos",
    "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1",
    "Videos",
    "Reason",
    "Turquoise Tank Top"
  ],
  "scraped_at": "2025-11-26T21:36:33.399610"
}