{
  "url": "http://sonichu.com/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_1",
  "title": "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1",
  "display_title": "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:238px;\"><a class=\"image\" href=\"/cwcki/File:Seduction.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"258\" src=\"/w/images/2/20/Seduction.png\" width=\"236\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Seduction.png\" title=\"Enlarge\"></a></div>Chris, trying to seduce the already violated viewer into paying his bills.</div></div></div>\n<p><b>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1</b> is a video uploaded by <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> on 17 <a href=\"/cwcki/June_2016\" title=\"June 2016\">June 2016</a>.\n</p><p>The majority of the video, as suggested by the title, consists of Chris reading a chapter of a story, echoing his old <a href=\"/cwcki/Official_Videobooks\" title=\"Official Videobooks\">Official Videobooks</a> series for <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu</a> (except he is <a href=\"/cwcki/Chris_and_his_ego\" title=\"Chris and his ego\">far less enthusiastic</a> reading a story that is not his own). The video is punctuated at the beginning and end by Chris yet again <a href=\"/cwcki/Chris_and_money\" title=\"Chris and money\">soliciting donations</a>. Chris opens the video stating that his previous e-begging campaign in <a class=\"mw-redirect\" href=\"/cwcki/Donations_Requested,_Please.\" title=\"Donations Requested, Please.\">Donations Requested, Please.</a> was successful, resulting in the Chandlers receiving a \"generous amount\". Given his past claims on things like <a class=\"mw-redirect\" href=\"/cwcki/PS4#Chris_finally_gets_one\" title=\"PS4\">receiving a PS4 for his birthday</a>, coupled with the fact that no sane person would <i>actually</i> donate money to Chris, this claim is highly unlikely. Despite this, he then explains that he now needs more money to \"help us eat better\" and pay for an \"electric bill\" costing $200. At the end, Chris re-iterates this apparent need for donations with a painfully unsuccessful attempt at <a href=\"/cwcki/Chris_and_sex\" title=\"Chris and sex\">sex appeal</a>, pushing his manboobs together to <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl\" title=\"Tomgirl\">simulate cleavage</a> and speaking in what he believes is a seductive tone.\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 1</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/shf37GUT9tU\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=shf37GUT9tU\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/shf37GUT9tU\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>17 <a href=\"/cwcki/June_2016\" title=\"June 2016\">June 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Handouts</span><a href=\"/cwcki/Chris_and_money#Begging\" title=\"Handouts\"><img alt=\"Handouts\" decoding=\"async\" height=\"20\" src=\"/w/images/5/5e/Handout_Template1.png\" width=\"20\"/></a> <a href=\"/cwcki/Chris_and_money#Begging\" title=\"Chris and money\">Handouts</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">Turquoise Tank Top</span><a href=\"/cwcki/File:TurquoiseTT.png\" title=\"Turquoise Tank Top\"><img alt=\"Turquoise Tank Top\" decoding=\"async\" height=\"22\" src=\"/w/images/5/5a/TurquoiseTT.png\" width=\"19\"/></a> <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">Turquoise Tank Top</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Donations_Requested,_Please\" title=\"Donations Requested, Please\">Donations Requested, Please</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_2\" title='Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2'>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2</a>\n</td></tr></tbody></table>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">You wouldn’t want me to be without electricity or Wi-Fi, would you? Hmm?\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite>HMMMMM?!</cite>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Description\">Description</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>The first part in a multipart series to read this story.\n<p>Also, Thank You to the number of people who have donated; my mother has her asthma medication. But we still need money for the electric company, as well as to eat.\n</p><p>Donations still requested.\nPlease send donations directly to me via PayPal to my email address: ChrisChanSonichu@aol.com. Thank you.\n</p><p>If you don't know how, watch this video.\n<a class=\"external free\" href=\"https://youtu.be/wPYVhPe_PTQ\" rel=\"nofollow\">https://youtu.be/wPYVhPe_PTQ</a>\n</p>\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p>[<i>PS4 intro plays</i>]\n</p><p>Hello, this Christine Chandler coming to you live from home once again. I would firstly thank everyone for their donations. We've received a generous amount in the- my mom chose the term red flag... of distress, but anyway, she got her medication got her medication for her asthma so that's good... Very good. And uh, with a little bit of that I had to pull her bank account out of the red because of couple of automatic drafts. Anyway, we're still going to need- we're still needing money to help us eat better for the rest of the month, but also our electric bill came and it's due immediately, rounding up to about $200. So anyway, that's the detail right there, so I'll put the information below this video to let you know how to directly donate to my PayPal.\n</p><p>Anyway, in the meantime, we're beginning- I'm beginning a new series of a recommended story called \"Unicorns, Rainbows, and a Bluebird of Happiness.\" I have not read this thing, though I started to recently and it made my- but I, uh, checked with my friend who assures me that it all ends better- it all ends a lot better than it all sounds at first. So anyway, it'll be like a chapter per day, every other day or so, but anyway... Do this by mood, I mean, I might end up doing the darkness chapters as soon as tomorrow, but anyways we're doing this, um, we're going to start reading chapter one.\n</p><p>Alright so... \"Chapter One - Laundry Day.\" [<i>Chris begins reading</i>] \"Hmm... Let's see, do I have everything? Do I have everything?\" an average sized man with pink hair said with a smile as he stood in the center of his bedroom wearing a light blue tuxedo, as well as a pair of pink and blue checkered pants. His bedroom consisted of a little board, then a simple wooden bed, and a wardrobe where he kept all of his clothes. His walls were decorated with posters of various cartoon characters that he enjoyed. If one looked behind what- the posters, one would would find that his walls were covered in red paint, closer analysis revealed that the red paint was actually dried blood. The man was looking down at a basket of laundry, all of the clothes within the basket appeared to be covered in blood or some other type of bodily fluid. The pink-haired man had killed six people within the previous seven days, and he always took his victim's clothes as a souvenir of his crime. \n</p><p>\"I think I have everything,\" the man grinned as he lifted the basket and carried it out of his room. He looked down down at his basket of clothes and hummed a little song as he remembered the previous owners of the clothes in his basket. [<i>singing</i>] \"Everybody's got to die sometime,\" the man sang as he opened his front door and stepped outside. The heat from the warm afternoon sun greeted him as he walked towards his pink car. He never bothered locking his door when he left his home. Most people avoid entering his house because there was no reason to be in the house when he wasn't there. He didn't have anything worth stealing, as someone did steal his microwave or his gaming console, then he would most likely kill him or her. Hmm. Not that anyone knew that he would kill the criminals who stole from him. Everybody simply suspected that he would be very angry with anybody who stole from him. Nobody wanted to see what a man with pink hair who has wore a blue tuxedo and pink pants would do to a criminal. \n</p><p>The man placed the basket of laundry in the back of his car and continued humming the song that was playing in head as he sat in the driver's seat of his car and started the engine. Once the car started, he drove out of his driveway. \"I wonder if Edith will be happy to see me,\" the man mused to himself as he thought of the orange-and-white hamster who ran the laundromat where he went when he needed his clothes cleaned. The man had never purchased a washing machine, nor a dryer, or even a stove or a fridge. He had managed to live his life with little more than a bathtub, a sink, and a microwave. The to the laundromat was over quickly, and whilst the man found a parking space in front of the laundromat, he parked his car and stepped outside. Once he had removed the basket from his car and had begun to carry it towards the laundromat, he heard a very familiar voice, \"Marco! Marco!\" the voice cried out. The man smiled as the pigeon who had screamed the words landed on his shoulders and started nuzzling his neck. \n</p><p>\"I missed you too, darling,\"  the man said to the female pigeon who had landed on his shoulder. He and the pigeon had been dating for around four months and they had already been talking about marriage. \"Marco?\" the pigeon asked as she gestured her foot towards basket full of bloody clothes. The man continued to smile as he pushed the door leading into the laundromat open with his foot. \"Six people, my dear! I killed six this week! I haven't felt this motivated and happy in a long time!\" The man said as he stepped toward the counter in the laundromat and placed the basket next to the golden bell on top of the counter. \"I'm probably happy because you've disagreed (?) to have intercourse with me. Do you really think you're ready to have a child?\" The man asked the pigeon on his shoulder who attempted to smile. \"Marco!\" The pigeon said excitedly as she began nodding her head furiously in response to his question. The man continued to smile as began to pet the little bird on his shoulder with his index finger while ringing the bell on the counter with his other hand. Bing bing! \"Welcome to Edith's laundromat,\" a white hamster with orange spots said cheerfully as she leapt up from behind the counter with her eyes closed. \"Hello, Edith. How was your week?\" the man asked the hamster who opened her eyes and smiled at the man who visited her laundromat once a week for close to three years. The hamster knew that the man was a killer, but she enjoyed his company and his business. \"I had a wonderful week, although I'm sure my week wasn't as exciting as your hunting expedition! How many animals did you kill this week?\" Edis asked the man who smiled as he proudly began to put the laundry basket on the counter. \"I killed six animals this week, and next week, I might kill six more.\" \n</p><p>\"Marco!\" The pigeon sitting on the man's shoulder announced proudly as she started to nuzzle the man's cheek. Edith grinned as she began to walk towards the grey cash register on the counter. \"It sounds like you've been very busy,\" the hamster said as she started to press some buttons on the cash register. The man reached into his pocket and pulled out his bright pink wallet. \"I've been feeling a bit more motivated recently, and it's all because of this lovely lady right here,\" the man said with pride in his voice as he started to gently stroke the pigeon on his shoulder while placing his wallet on the counter. \"I'm glad you're so motivated. It's good for business if my best customer's motivated to continue bringing me work,\" the hamster said as she finished pressing the correct sequence of buttons on the register. \"Hmm... Those clothes will cost 120 dollars to clean, plus any applicable taxes,\" the hamster said with a chuckle as the man took out some bills from his wallet and placed them on the counter. \n</p><p>\"20$ per kill as always. Maybe I should stop killing for a while and save some money,\" the man said with a laugh that was returned by the hamster as she began counting his money and prepared to give him change from the cash register. \"Perhaps, but then the only reason you would have to talk with me is karaoke night.\" \"Marco!\" the pigeon on the man’s shoulder yelled as the hamster chuckled in synchronization with the matter. It was amusing seeing the slight agitation of the pigeon. \"I suppose game night is another reason he has to talk with me,\" the hamster said as she remembered the many times she had played video games with the man and his fiance. \"So will I see you tonight at karaoke night?\" the man asked the hamster who had started to move the clothes one at a time to the washing machine at the back of the laundromat. The hamster smiled as she carried a particularly bloody yellow shirt that had the smiling face of a cartoon pony on the front and the message claiming that the shirt's previous owner had survived cartoon con.\n</p><p>\"Of course!\" the hamster said to the man who was already walking towards the door. The man and his fiance smiled and waved goodbye as they left the establishment, leaving the hamster all alone with the bloody clothes. \"I wish I knew more serial killers. Three seems to be enough to keep me in business. If I knew a few more, I'd be rich!\" the hamster chuckled to herself as she walked toward the counter to get another article of clothing to wash. \"Some people ask me how I can walk the streets at night, knowing that there are damaged people out in the dark who would love to do terrible things to a cute little hamster like me. I tell them that those evil people are really nice when you get to know them,\" Edith mused to herself as she picked up a bloody pair of blue jeans and started carrying them towards the washing machine. \"Nobody will hurt me. My friends won't let them. Friendship is a powerful thing that makes life worth living and a business profitable, especially my business.\" Edith continued talking to herself as she placed the jeans into the washing machine. She was taken out of her thoughts when she heard the door to her laundromat open. She immediately went towards the counter and leapt on top to greet her customer. \"Welcome to Edith's laundromat!\" \"I read the sign,\" a man's voice spoke as she opened her eyes to see a fairly short man dressed in the red and blue uniform of the Abbeville police department.\n</p><p>The man had black hair and a black mustache that Edith didn't like. The hamster had never enjoyed the company of people with mustaches. The hamster gulped nervously has her eyes wandered towards the basket of bloody clothes the counter. \"I'm not going to arrest you, this is more of a personal visit. However, I imagine that more people are going to get suspicious if you continue leaving incriminating evidence like this in plain sight in a business open to the public,\" the man said with a dark chuckle where he was returned with a nervous chuckle from Edith. \"Maybe I should be a little more careful,\" Edith said simply and the man chuckled a second time as he picked up a pair of bloody pink, frilly panties from the basket. \"Or maybe you should simply learn to make friends with someone who can help you continue to run your business demands,\" he said as he placed the bloody panties into his back pocket. \"Kevin won't like that,\" Edith whispered to herself as she thought of the man who had recently paid her to wash the clothes in the laundry basket. Kevin Wright was one of her best friends as well as one of her best customers. He had the weird fascination with the color pink, but if Edith discriminated against her customers for such a small issue, she'd likely be out of a job.\n</p><p>\"All I want to do is ask you a few questions about your previous customer. I don't want to know his name, I don't want to know where he lives, I just want to know if he's related to the latest crime I'm investigating,\" the man said, seemingly ignoring Edith's whisper. The man reached into his left pocket and to retrieve a handful of pictures of what appeared to be a crime scene in a teenage girl's bedroom. The bloody corpse of a teenage girl could be seen on the bed next to a light blue smiling teddy bear. Edith examined the photos for a few minutes while the man appeared to study the bloody clothes. His eyes wandered towards a second basket filled with clean clothes near the dryer in the back of the laundromat. He absent-mindedly began to wonder if Edith cleaned clothes for other killers. “He’s not involved with this murder,” Edith said after a few minutes, and the man smiled as he retrieved his photos and placed them back into his pocket. “Well how do you know?” the man asked, and Edith chuckled nervously. “I’ve been cleaning his clothes for two years. I know how he works,” Edith said to the man, who raised an eyebrow in response. “He kills couples, not single victims,” Edith explained to the man who smiled and reached into his pocket again. He also steals his victims clothes and brings them to me to wash. He’s very protective of his souvenirs.” “Resist the victim’s sister, they were allegedly involved in a romantic relationship at the time of the murder. They were sleeping in the same bed,” the man explained to the hamster as he showed her a photo from his pocket. The hamster shook her head without even glancing at the pink haired girl in the picture. “He would have killed them together, he wouldn’t let her sister live,” Edith said to the man, who continued to smile. \n</p><p>“He was interrupted. The girl entered the room and allegedly scared him away,” the man explained to the hamster, who shook her head once more. “I know him better than anyone alongside from his girlfriend,” Edith said defiantly, “He did not kill that girl.” The man stared at her with an amused expression on his face. As they stared at each other, they heard the door leading to the laundromat open. As soon as they heard the sound of the door squeaking open, they turned their gaze to the person who dared to intrude on their conversation. “I was about to take a bath and Sabrina told me that a cop had decided to pay this place a visit,” Kevin Wright said from the entrance of the laundromat. The police officer smiled as he turned around so that his entire body was facing a man wearing a blue tuxedo and he held out his hand for the man to shake. “I’m very pleased to meet you,” the police officer said as his hand remained extended. “I’ve heard so much about you over the years.” After a few seconds of studying the man and his smiling face, Kevin help out his hand and shook the extended hand of the police officer. “My name’s Kevin, although I suspect you know that already. How may I help you?” Kevin asked the man who smiled cheerfully. \n</p><p>“My name’s Michael. I’m not sure if you this, but have a few murders recently to have been credited to the so-called “couples killer,” Mike explained as Kevin’s face brightened as the man mentioned the nickname the media had given him. “Of course, I’ve killed six people in the past week and I’m probably going to kill more next week.” We’ve credited you with seven murders this week ,” Mike explained. Once he was finished speaking, he and Edith noticed that Kevin’s face had started to twitch. “That’s impossible,” Kevin started slightly, which was a habit he had developed when he was either deep in thought or nervous. “That’s an odd numbered… number of- I hate odd numbers. I only kill in pairs,” Kevin explained, he his voice rising in volume and pitch as the thought of being credited for a single murder instead of a pair flash into his mind. “That’s it,” Kevin said coldly to the man who placed his hand upon his shoulder. “Of course that’s it, killers have to stick together, don’t we?” Mike said to k- I read that wrong… Mike said to Kevin, who looked at him for a moment before grinning mischievously. “I’ve always wanted a friend on the police force,” Kevin said to the man, whose hand continue to remain on his shoulder. “Did you say that you’re a killer?” Edith made her presence known from the place where she was standing on the counter, which surprised the two men, who forgot she was in the room with them. “Of course. Summer killer, young lady. If I wasn’t, then we wouldn’t be having this conversation,” the man said simply as he started walking towards the door leading to the world outside of the business owned by the hamster. “Until we meet again,” Kevin said as he opened the door. “Do you like karaoke?” Kevin asked, and Mike nodded his head. “Perhaps next time we meet we could be- perhaps next time that we meet can be at the bar on the end of the street.”\n</p><p>Alright, that’s the end of chapter one. Tune in next time for “Chapter Two: Karaoke Night” In the meantime, donations would still be very much appreciated, especially to help with the electric bill. You wouldn’t want me to be without electricity or Wi-Fi, would you? Hmm? Me and my mom, we got to keep our dogs fed here and everything. Alright, so tune in next time and I’ll read the next chapter. Have a good day. Thank you.\n</p><p>[<i>Outro</i>]\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Donations_Requested,_Please\" title=\"Donations Requested, Please\">Donations Requested, Please</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_2\" title='Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2'>Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250420020139\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.080 seconds\nReal time usage: 0.091 seconds\nPreprocessor visited node count: 317/1000000\nPost‐expand include size: 7947/2097152 bytes\nTemplate argument size: 2649/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   29.764      1 -total\n 74.89%   22.289      1 Template:Infobox/video\n 16.94%    5.043      1 Template:(Handouts)\n 10.82%    3.219      4 Template:Icon\n  8.91%    2.653      1 Template:Financhu_Crisis\n  8.36%    2.487      1 Template:Quote\n  8.23%    2.450      1 Template:TurquoiseTankTop\n  8.17%    2.432      1 Template:Reason\n  8.01%    2.384      1 Template:Succession\n  7.97%    2.372     18 Template:Pipe\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23361-0!canonical and timestamp 20250420020139 and revision id 299693. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_1&amp;oldid=299693\">http://sonichu.com/w/index.php?title=Reading_%22Unicorns,_Rainbows,_and_a_Bluebird_of_Happiness%22_Chapter_1&amp;oldid=299693</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2016",
    "Videos Christian uploaded to YouTube",
    "Rainbows, Unicorns, and a Bluebird of Happiness"
  ],
  "links": [
    "Financhu Crisis",
    "Reading \"Unicorns, Rainbows, and a Bluebird of Happiness\" Chapter 2",
    "Chris",
    "Turquoise Tank Top",
    "far less enthusiastic",
    "June 2016",
    "soliciting donations",
    "Chris's videos",
    "sex appeal",
    "simulate cleavage",
    "Videos",
    "Sonichu",
    "Reason",
    "Donations Requested, Please",
    "Official Videobooks",
    "Donations Requested, Please."
  ],
  "scraped_at": "2025-11-26T21:36:31.094448"
}