{
  "url": "http://sonichu.com/cwcki/A_Girl_Who_Brought_Down_The_World_3_and_4",
  "title": "Reading: \"A Girl Who Brought Down the World\", \"And Apparently Survived a Housefire\"",
  "display_title": "Reading: \"A Girl Who Brought Down the World\", \"And Apparently Survived a Housefire\"",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">as this Is the first time ever reading it, you will see fresh responses in my facial expressions.\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr>\n<tr>\n<td colspan=\"3\" style=\"font-size:smaller; padding:8px 36px; text-align:right;\"><cite>Chris</cite>\n</td></tr></tbody></table>\n<p><b>Reading: \"A Girl Who Brought Down the World\", \"And Apparently Survived a <a class=\"mw-redirect\" href=\"/cwcki/Fire\" title=\"Fire\">Housefire</a>\"</b> is a video uploaded 30 <a href=\"/cwcki/July_2016\" title=\"July 2016\">July 2016</a>, to an alternate YouTube account, in which Chris reads from <i><a href=\"/cwcki/A_Girl_Who_Brought_Down_the_World\" title=\"A Girl Who Brought Down the World\">A Girl Who Brought Down the World</a></i>, a 2008 novelette by <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> satirizing Chris's life and worldview which she sent him seven years prior. Chris claimed not to have been paid for doing this. On 7 August, Chris reuploaded the video to his CwcvilleGuardian account after his two-week ban from uploading videos expired, but misspelled the title as <b>Reading \"A Girl Who Fought the World\", and a House Fire as Well</b>. A second part appeared on 8 August, in which <a href=\"/cwcki/Clover_and_Snoopy\" title=\"Clover and Snoopy\">one of the Chandler dogs</a> can be heard barking in misery.\n</p><p>Despite what the video's title suggests, the titular girl of Vivian's novelette, Kid, is clearly not meant to represent Chris. The actual Chris analogue is the character of Christopher Winnfield Vega, which a less oblivious reader would have picked up on immediately.\n</p><p>Also of note, Chris and Barb still haven't unpacked all their boxes since moving back home a year and a half ago.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Chapter_1\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Chapter 1</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Transcript\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Transcript</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Chapter_2\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Chapter 2</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Transcript_2\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Transcript</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Chapter_3_and_4\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Chapter 3 and 4</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Chapter_1\">Chapter 1</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Reading: \"A Girl Who Brought Down the World\", \"And Apparently Survived a Housefire\"</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/Co2vuyVtHWM\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=Co2vuyVtHWM\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/Co2vuyVtHWM\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>30 <a href=\"/cwcki/July_2016\" title=\"July 2016\">July 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>, <i><a href=\"/cwcki/A_Girl_Who_Brought_Down_the_World\" title=\"A Girl Who Brought Down the World\">A Girl Who Brought Down the World</a></i>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">The Happy Hag</span><a href=\"/cwcki/File:Do_What_Makes_You_Happy.png\" title=\"The Happy Hag\"><img alt=\"The Happy Hag\" decoding=\"async\" height=\"26\" src=\"/w/images/1/13/Do_What_Makes_You_Happy.png\" width=\"21\"/></a> <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">The Happy Hag</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a class=\"mw-redirect\" href=\"/cwcki/Machine_Romans\" title=\"Machine Romans\">Machine Romans</a>\n</td>\n<td><b>next</b> <br/><a href='/cwcki/August_2016_Paid_Video_Requests#Singing_\"All_of_the_Lights\"' title=\"August 2016 Paid Video Requests\">Singing \"All of the Lights\"</a>\n</td></tr></tbody></table>\n<p><br/>\n<b>Description</b>\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Reading Chapter One\n<p>This is Not a Paid request; I genuinely have been curious in this near-decade old book, and I take any parodies with the grain of salt, regardless. And as this Is the first time ever reading it, you will see fresh responses in my facial expressions.\n</p><p>via YouTube Capture\n</p>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h3>\n<center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:3px outset #bb2222\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:CWCism-IllBreakYouDead.png\"><img alt=\"CWCism-IllBreakYouDead.png\" decoding=\"async\" height=\"113\" src=\"/w/images/0/05/CWCism-IllBreakYouDead.png\" width=\"150\"/></a>\n</td>\n<td><i> This media needs a <a href=\"/cwcki/CWCki:Transcription_Style\" title=\"CWCki:Transcription Style\">transcript</a>. Help CWCki by <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Reading:_%22A_Girl_Who_Brought_Down_the_World%22,_%22And_Apparently_Survived_a_Housefire%22&amp;action=edit\" rel=\"nofollow\">transcribing the content</a>. If the media is too long, transcribe select portions which are funny or informative.</i>\n</td></tr>\n</tbody></table></center>\n<p>[<i>Puts down camera</i>]\n</p><p>Hello everybody, this is Christine Chandler coming to you live [Takes off glasses then drops them] from home once again and I'm just fumbling with my glasses, [<i>Does a very crude fake laugh</i>]. Anyway, so yes we have been busy around here, we've been throwing out lots and lots of boxes, actually going through them since we moved back here, [<i>sighs</i>] Christma- uh no New years ev- New years eve today, today, to the following day  [<i>sighs</i>] in 2014. Which then turned to 2015 [Strokes hair backwards and puts glasses back on].\n</p><p>Anyway, among which I found a book that i have been curious about for a little- for a- little- for a while 'cuz I've actually never read it, and, I'm gonna start reading it, in a series. So pretty much, uh, <a href=\"/cwcki/A_Girl_Who_Brought_Down_the_World\" title=\"A Girl Who Brought Down the World\">A Girl Who Brought Down the World</a>, who survived a house fire [<i>Lifts up book and makes a \"pew\" noise</i>]. You know the one that the author had actually sent me, a proof copy, uh so anyways [<i>opens book</i>], I have been curious so, I'm gonna start reading it now. In a, video- in another video, series, so okay. This is on my own personal merit, nobody has paid me or asked me to do this [<i>Dogs bark in the background</i>].\n</p><p>Okay Chapter one, neighbours\n</p><p>[<i>Starts reading in a high pitched girly voice</i>], Hello my name is Kid, I'm just a cute girl, at least that's what everybody tells me, I don't have many friends in the city that i live in, my parents moved here because dad got a new job, I mean, it's only been 2 hours and I'm already lonely. Kid! Kid! Come on down it's time for dinner, called Mimi, Kid's Mom from downstairs. School doesn’t start until August so until then, I guess I’m going to be sad, huh? Oh well, at least sis is around to keep me company, Kid writes in her diary, Coming!\n</p><p>What’s this? asked Kid. It’s some frozen lasagna that Dad brought home from work, Mimi replied. What’s in it? Stuff that’ll kill you like soya lecithin, [<i>Makes a whining noise</i>] cracked Vivian, Kid’s older sister. I don’t want to die! Relax, Kid. Vivian, apologise, Vivian! apologise! demanded- oh I used the wrong voice- demanded Miles, the father. Fine. Don’t worry, Kid, this stuff won’t kill you, unless this was made in China! This was made from panda? Enough. Kid, just eat. It’s good,” Miles responded as he finished off his plate.\n</p><p>I guess I never finished explaining everyone in my family, did I? My Dad’s name is Miles, he works in nanotechnology. He got hi- this fancy job in this city and he gets paid a lot of money. He promised to throw a great birthday party with all the new friends I’ll make, but I don’t think I will ever get to fit in this place. I mean I just tried talking to the neighbor and he was really evil!\n</p><p>Sis, we should get ourselves acquainted with the neighbors. I have a feeling we’ll be able to find friends for you, explained Vivian. But Viv, all I’ve seen are adults in suits. I haven’t seen a single kid around here my age! Don’t worry; I’m sure they’re all hiding in their houses because of the city’s murder rate shooting up seven percent. Vivian! Stop scaring me! Dad told you to stop! Well, I…I’m sort of not making that up. Read this.\n</p><p>On the list of city figures, murder rate was listed as increasing by seven percent from 102 to 109. Viv…I don’t like this place. Oh come on, I mean, we’re not living in the slums where the homeless can get us. Besides, I’m too ugly to be raped. What’s raped? Nothing. Come on. Let’s meet our new neighbors.\n</p><p>The two approached the door. Kid looked as cute as she described herself. Vivian had not brushed her hair. As the door opened, their hearts stopped as a large, smelly man greeted them. Vivian hesitated, Yo, my name’s Vivian, and this is my sister Kid. We’re gonna be your new neighbors from now on. Kid, say something. S…something.\n</p><p>[<i>Chris does an impression reminiscent of his <a href=\"/cwcki/Monty_Python\" title=\"Monty Python\">Monty Python</a> impression</i>] Hello, my name is Christopher Winnfield Vega, but you can call me Christopher or Chris for short. Vivian replied, So, you got any kids? Something around her age? She’d like some new friends. Uh, wait... I would like to have a daughter of my own one day. I hope she might look just as cute as your sister but not like you, Vivian.\n</p><p>What? What is that supposed to mean!? I’m saying I hope my future daughter does not look like you. Vivian stared at him speechless. She could not think of anything to say to respond to such a blunt statement. I know I’m cute, thank you mister! squealed Kid. Would you two like to come in? Christopher asked.\n</p><p>Sure! exclaimed Kid.\n</p><p>Kid waltzed on in while Vivian, still speechless, followed her. At the entrance stood a few pictures of Christopher and a beautiful woman, one of them being a crudely drawn picture done with crayon. Woah, Chris, are you a garbage man? asked Vivian. No, I am unemployed at the moment.\n</p><p>The living room was full of empty pizza boxes, empty soda bottles with the front of the TV being the only part seemingly clear of any garbage. In contrast, the small kitchen looked like it had not been touched in ages. The sisters were lucky they kept their shoes on as they waded to what looked like a couch.\n</p><p>You shouldn’t sit there, Christopher warned, That’s just garbage [<i>Makes <a href=\"/cwcki/DIRTY,_CRAPPED_BRIEFS\" title=\"DIRTY, CRAPPED BRIEFS\">a short farting noise</a></i>]. They waded to what was actually a couch and sat down. There was a squishy noise as the two sat down on it. Vivian decided to crack a crude joke while Kid complained that she was getting scared. There’s nothing to be afraid of; although, there is something on my mind. Hey Chris, what was up with all those pictures? Is that your wife? Vivian asked.\n</p><p>Err No, she used to be a friend of mine until some jerks tore us apart, Chris angrily muttered. Oh, what happened? You would like to know? Of course, I’m intrigued.\n</p><p>Well, it all happened when I was sitting at the front of Waynesworth Enterprises. I was looking for a girlfriend to make into the perfect wife when a cop decided to have me move aside because I was \"attracting unwarranted attention”, he mimicked, Then I punched him in the face and I had to spend a day in jail because they enjoy kicking me around!\n</p><p>Uh. Wow, man but that didn’t answer my question about that girl though.\n</p><p>Oh, her name was Mel. We used to be great friends. She worked for Waynesworth Enterprises and we both shared an interest in playing Rocket Flingers- Huh, there's a pun there.  I was setting up my Rocket Flingers one day in front of the company and it turns out that she had her own set of Rocket Flingers to duel mine! I remember the first time we dueled; I had my Nuclear Spider attack her Rhino Rocket for 70 points of damage! It was a critical slam attack! She told me to meet her at Game Wars every Friday for a weekly tournament! I felt my heart rise every time I went to a tournament. Each time she won, I tried to hug her but she pushed me away. She said she could have me arrested. I asked why and she only said that it is a law. Only after I attempted to kiss her once, did a cop show up and tear us apart! That was not the end of my friendship though; those jerks thought they could stop me and her from experiencing the true love I felt! I remember once, I held her hand and it was the greatest moment of my life. She was crying on my shoulder and I will never forget that moment. I felt the emotional connection between us had reached a new level. It was going smoothly between us until those jerks showed up again. I remember being given a folder and told to never come to Game Wars ever again! I tried to fight those cops but they just beat me and kicked me! I tried once to get to Game Wars for old time’s sake, but those cops beat me again! I was so angry that I have not stepped outside my house since except for when I get hungry.\n</p><p>Holy shit, this guy is insane, thought Vivian. I’m thirsty; do you have anything to drink? Kid asked, breaking the awkward silence. Yes, I have my own brand of soda! Hold on, Christopher said as he struggled to reach the top of the refrigerator. As he handed the drink to Kid, Vivian slapped it out of his hands. I forgot…I had brought water! Right! Vivian explained as she whispered, Kid, never accept anything this guy gives you. Ever. Why? she whispered back.\n</p><p>Vivian struggled to come up with answer that would not expose Kid to the horrors of the real world. Kid, it’s time you learned the truth about Christopher. He’s really Santa Claus’s evil brother! He’s trying to trick you into getting onto his naughty list! So never accept anything from him or you will make Santa sad. Sheesh, that's a, cruel, bad lie.\n</p><p>Oh! I really want that hamster doll for Christmas. Thanks sis, I’ll make sure never to accept anything from evil Santa Claus. You hear me, evil Santa! You’ll never trick me! Kid screamed. Christopher had only been staring off at his ceiling ever since Vivian smacked the drink out of his hands. He had just been sitting patiently just watching the two whisper the entire time.\n</p><p>My name is not Santa, he replied, It is Christopher Winnfield Vega, but you can call me Christopher or Chris. And Kid, never bring up anything related to Christmas to him ever again! He might get suspicious and put you on the naughty list anyway! Vivian hastily explained. Oh, okay. I can see the evil in him. He really is fat enough to be Santa’s evil brother!\n</p><p>Vivian sighed for a breath of relief; however, the two still needed to make it out of his front door alive.Err I do not see the water that you said you had, Vivian, Christopher mumbled. Oh, that’s right! I left it at home! Come on, Kid, let’s go home!\n</p><p>My sister told me never to go over there ever again. She said he was about as bad as our old Chinese neighbors. I always liked them. They shouted funny words. My Mom’s name is Mimi. When she was younger, she used to have dreams about being a famous actress but was crushed when they told her she wasn’t pretty enough. I still think she is pretty. I tell her that everyday.\n</p><p>Hi Mom! Me and sis were just talking with evil Santa Claus! Don’t worry, I’m not going to be on the naughty list! Also, you look pretty today! Alright, Kid. Vivian, we need to talk. The two sat as Vivian attempted to explain the situation.Hmm [<i>Mumbles</i>] Which is why I say we should move, again. I do not want to live next to a maniac who will potentially [<i>Switches from girly voice to Gollum</i>] gut and rape me.\n</p><p>[<i>Goes back to regular girly voice</i>] Vivian! You always go around saying our neighbors are terrible people. This is why you need to learn people skills. Yeah, that’ll get you places in life, just like that acting career, huh Mom? I will speak to this Christopher first thing in the morning.\n</p><p>Mom always replies that one day she will make it big, but is happy being my mom. My sister’s name is Vivian. She goes to high school and gets in trouble a lot. I still really like her. I’m glad she’s my sister. One time, I accidentally broke the family vase and she took the blame for me. And just now, she warned me about evil Santa! Mom says that she is going to invite him for dinner tomorrow.\n</p><p>Oh, Hello, my name is Mimi, the mother of Kid and Vivian. I apologize for any hassle they may have brought to you Christopher. You are very pretty. What race are you? Christopher asked. Oh, many people mistake me for German, but I’m actually part Italian and part African. Christopher shuddered as soon as she finished her sentence.\n</p><p>Is something wrong, Christopher? Nothing, if you were different, you would fit in my standards. What do you mean? You see, I have been struggling…\n</p><p>Christopher went on to explain his crisis to Mimi.\n</p><p>Oh Christopher, one day you will find that special someone just like I did. Say, would you like to come in for dinner say at around seven? It has been a long time since anyone has asked me to do anything. Okay, thank you Mimi. I will show up at seven.\n</p><p>But it’s okay, because Vivian said she will protect me with her life. She is so nice. Anyway, that about wraps it up for everyone in my family. Oh, how could I forget Mittens, our cat! We brought her all the way to the city and she just seems to fit in fine. I can see her at my door right now! That’s all the time I have today, tomorrow, maybe I’ll talk about how that dinner went. I hope he doesn’t come! Love, Kid.\n</p><p>[<i>Puts book down and closes it</i>] Okay, well, huh [<i>Makes fart noise</i>] 2008 this book was written, huh, well tune in next time for when i read chapter 2. I'm still mixed feelings about it, in regards- aside from the parodies and... This is supposed to be a comedy as it says on the bottom left hand corner on the back, hmm. It doesn't sound so funny to me. Okay? There you go, have a good day. [<i>switches off camera</i>]\n</p>\n<h2><span class=\"mw-headline\" id=\"Chapter_2\">Chapter 2</span></h2>\n<p>Chris continues his reading of Vivian Gee's story. He looks extremely uncomfortable throughout the video. Notably, he replaces the name of the main villain (himself) to Christabelle. This is likely an immature tacit Chris uses to evade the blatant disparagement of his character. This is extremely bizarre, as his desire to separate himself from the story conflicts with his massive ego (he can't allow a fictional story to portray himself as his biological sex, despite it having been written before the Tomgirl Saga). Essentially, Chris tries to have his cake and eat it too.\n</p><p><br/>\n</p>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Reading A Girl Who Brought Down the World, Chapter 2</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/c-RtU7GWYeY\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=c-RtU7GWYeY\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/c-RtU7GWYeY\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>8 <a href=\"/cwcki/August_2016\" title=\"August 2016\">August 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>, <i><a href=\"/cwcki/A_Girl_Who_Brought_Down_the_World\" title=\"A Girl Who Brought Down the World\">A Girl Who Brought Down the World</a></i>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">The Shattered Heart</span><a href=\"/cwcki/File:White_Tomgirl_with_Heart.png\" title=\"The Shattered Heart\"><img alt=\"The Shattered Heart\" decoding=\"async\" height=\"21\" src=\"/w/images/0/0a/White_Tomgirl_with_Heart.png\" width=\"19\"/></a> <a href=\"/cwcki/Heart_level\" title=\"Heart level\">The Shattered Heart</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href='/cwcki/August_2016_Paid_Video_Requests#Singing_\"All_of_the_Lights\"' title=\"August 2016 Paid Video Requests\">Singing \"All of the Lights\"</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/August_2016_Paid_Video_Requests#To_Shelly\" title=\"August 2016 Paid Video Requests\">To Shelly</a>\n</td></tr></tbody></table>\n<p><b>Description</b>\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Reading Chapter Two\n<p>This is Not a Paid request; I genuinely have been curious in this near-decade old book, and I take any parodies with the grain of salt, regardless. And as this Is the first time ever reading it, you will see fresh responses in my facial expressions.\n</p><p>via YouTube Capture\n</p>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Transcript_2\">Transcript</span></h3>\n<center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:3px outset #bb2222\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:CWCism-IllBreakYouDead.png\"><img alt=\"CWCism-IllBreakYouDead.png\" decoding=\"async\" height=\"113\" src=\"/w/images/0/05/CWCism-IllBreakYouDead.png\" width=\"150\"/></a>\n</td>\n<td><i> This media needs a <a href=\"/cwcki/CWCki:Transcription_Style\" title=\"CWCki:Transcription Style\">transcript</a>. Help CWCki by <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Reading:_%22A_Girl_Who_Brought_Down_the_World%22,_%22And_Apparently_Survived_a_Housefire%22&amp;action=edit\" rel=\"nofollow\">transcribing the content</a>. If the media is too long, transcribe select portions which are funny or informative.</i>\n</td></tr>\n</tbody></table></center>\n<p>Hello everybody, Christine Chandler coming to you live from home once again.\nWith another exclusive part of this ser- of the... <a class=\"mw-redirect\" href=\"/cwcki/English\" title=\"English\">things...</a> exclusive to\nthis channel. Origin- origin- This video was uploaded on the... on my <i>other</i> channel, but that's because I had difficulty uploading to this one, but now we got that going.\nIt's going to be- all the main chapters'll be on this channel... and some of the\nuploads for... for the people, the customers, many requests... <a class=\"mw-redirect\" href=\"/cwcki/Stress_sigh\" title=\"Stress sigh\">Mmmm</a>... All things considered, they'll most likely end up on this channel, but...\nI think I'll probably end up putting them on the other channel, but that's to be determined later. \n</p><p>Anyway, for right now though, we'll read chapter two of A Girl Who Brought Down the World and Still Apparently Survived the Housefire. \n</p><p>Hmm, chapter two. Memories... [<i>Mumbles under breath and puts glasses on</i>], need my glasses. [<i>Starts reading in a high pitched girly voice</i>] Mom! Dad! We cannot let this man through our front door! Vivian exclaimed as the family was unpacking many of their belongings. He will kill us all, where the gun?! Vivian I know you've got trouble with guests just calm down Miles responds. This isn't an ordinary guest I- I- Vivian stuttered.\n</p><p>Vivian maybe you should talk with him again he does not seem to be that bad of a person. He just hasn't had- his run in with Lady Luck yet. I felt pretty crazy too sometimes until I met your father. Vivian just grunts and walks up the steps to the kids room- [<i>Makes a walking motion with his fingers</i>], to kids room. Kid we need to talk. [<i>Goes to an even higher pitched girly voice</i>], Sis can we do this some other time? It's about evil Santa. [<i>Gasps</i>] Kid gasps as she hears the name. Kid, we need to find out everything about him, he's coming for dinner and he will put you on the naughty list, you must not let this happen. But Sis you should- you say we shouldn't ever meet with him again! Right! Which is why he must go to Waynesworth Enterprises and find this Mel person. Maybe she can tell us more about [<i>Overemphasizes</i>] CHRISTOBEL. You should come it'll be fun.\n</p><p>My sis took me up to Waynesboro Enterprises today- Waynesworth Enterprises [<i>Makes a fart noise</i>] The city is so big, I've never been in a taxi before. It was fun, they drove real fast to our place. Viv said to run out of the car and into the building. That was fun! Sometimes I wish I could spend all my day- time with Vivian. Here we are Kid, Waynesworth Enterprises. Now to find Mel. There are so many people here. How will we find her? Huh, I really should think things through more sometimes. We’ll just ask that friendly person over there.\n</p><p>[<i>Using a cheesy formal voice</i>] Hello girls, are you lost? Asked the attendant. Yeah, we were supposed to meet up with Mel. She’s a family friend and she was supposed to give us a tour of the place for my sis’s s-school report, Vivian explained. Oh, Mel. That’s odd. She usually doesn’t have many visitors ever since the incident. Eh, just head up to floor 73 and I will have her meet you there. Thanks. Come on, Kid, let’s go.\n</p><p>The two stepped out and was greeted by an attractive girl that looked to be in her twenties. [<i>Speaking in a voice somehow even higher than all the others before.</i>] Hi, Mel! [<i>In a horrible British accent</i>] Who are you? Yo, my name’s Vivian and she’s Kid. We’re here to talk about Christ-o-bel. Vivian spoke, we just moved here yesterday and I have some questions I’d like to ask. [<i>Pauses and makes a strange noise while scanning the book</i>] Not him. Just, not him. Look, give me thirty minutes and I’ll be off work. Just sit tight over here and I’ll try to explain some things then. Vivian and Kid sat in Mel’s office cubicle. There was a picture of her and her brother on the wall. A few letters on the wall indicate that one of her best friends had died in Afghanistan and that her mother and father miss her terribly. In the trash laid a message from Christobel.\n</p><p>Dear Melanie, I miss you so much. I am sorry for what I did. Can you ever forgive me? Please? I love you, Mel. I love you more than life itself! I know what I did was wrong, it was just a mistake. I will never try to hurt your feelings again! Please, Mel! Please! Lub, Christ-o-bel. There were over seven crumpled up messages that were sent from Christobel in the trash. Staring back at the office, the phrase liberty bounced around the computer monitor. Alright, you two, come on. Let’s find a place to talk. After taking them out for ice cream, they all went to the park in a nice grassy area to discuss Christ-o-bel and his antics. I feel so free on the grass; my life has been so great ever since Christobel went away, Mel exclaimed. Ever since that day I decided to take more control of life, everything has gone my way.\n</p><p>So, what has led up to this, I guess, hippie lifestyle, mocked Vivian. It isn’t hippie, it’s just freer. Liberty. Isn’t that what we all strive for? Well Miss Melanie, I want to know about evil Santa, said Kid. What? Oh, Kid. Before this gets outta- Before this gets outta hand, Vivian explained, he isn’t evil Santa. He’s just a terrible person. Maybe I should expose you to the horrors of the real world. I’m sure a... [<i>Trails off, confused</i>] Wait... Vivian... Yeah Vivian... Maybe I should expose you to the horrors of the real world. I’m sure a nine year old can take it. So I’m still on the good list? Uh, yes. Yes, you are.\n</p><p>So why is Christobel a bad person? Let me explain, said Mel as she took out a piece of paper from her wallet. Hmm, this is called a restraining order. It is very useful for stalkers. Learn about them. The law is your friend. Sure, this might be against what you call my hippie ways, but the government is on my side for once. So, that’s why Christopher- So, that’s why Christobel kept getting stopped by the police, smirked Vivian.\n</p><p>Well, that’s not all. Maybe I should... start all the way from when I first met him. It all began when I got an internship at Waynesworth Enterprises. It was going fairly smoothly until I first saw him setting up a game of Rocket Flingers outside of the building. It was quite awkward seeing a grown man playing that silly game, but at the time, I was also pretty- I was also pretty weird because I also carried around a set. So I dueled him on the spot and I told him to meet me at Game Wars for tournament, then went to work and thought nothing of it. You know, I went to those tournaments just for fun even though it was kind of childish, but Christobel just could not keep his hands off me. Every time he got close to me, he sort of tried to grope me. I couldn’t stand that. Once, he tried to kiss me! So I called the police and had him arrested for sexual harassment. I mean, I had the regulars act as witnesses, they have all seen him act like a pervert. I guess I have a soft spot for idiots because once he was released from jail, he came back. I didn’t think of it too much until the robbery occurred.\n</p><p>[<i>The camera falls on its side</i>] I was so scared... when the gunman told us to all go into the backroom. I guess I had a meltdown on top of Christobel. He took that the wrong way and then attempted to, well, Kid, you’re too young to know about this. That was the final straw. I could not let this go on any longer. I filed a restraining order against him and decided to drop all means of communication from him. He still manages to send me creepy messages, as many as nine a day. And that’s all I can say about Christobel. I regret trusting him so much in the past. You two should not make that same mistake as I did.\n</p><p>That just twists an already twisted story, muttered Vivian. He said I was cute. He can’t be that bad, right? Questioned Kid. Oh Kid, you’re still too young to understand. There are MALES in this world who say things and don’t mean it, Mel attempts to explain. Why would he want to lie to me? I’m just a little girl. [<i>Pauses and tries to find his spot on the page while muttering under his breath</i>] Okay I think so far... There are some people in this world who know no moral boundaries. Some people in this world are unable to see things from another’s point of view. Some people in this world just aren’t meant for society. Some people have no hope for ever adjusting to what we call normal. Christobel is one of them. You two should have your parents do something. I’ll go talk to them.\n</p><p>I made a friend today! Her name was Mel. She is 24. She might not be a friend my age, but she still treats me nice. She took me out for ice cream! I love ice cream! She warned me about Christ-o-bel and his lying ways! I guess this is what we call growing up. Not everyone who appears nice is nice. It makes me sad to know that some people [<i>Pauses and quietly sighs</i>] who have to be evil. [<i>Mumbles under his breath</i>] That some people... who have to be evil. This is kind of a grammatical error right there I think. Hm.\n</p><p>Christ-o-bel watches outside his windows. The flies buzzing about his room do not deter him from just staring out the window. Watching. Waiting. What he hopes to achieve through his perseverance is unknown to everyone, even himself. It is four o’ clock. The dinner does not begin until six. He still has time to wait. Outside, Mel parks her car and she follows Vivian and Kid to their house. Christobel immediately stands up and breaks into a song.\n</p><p>[<i>Chris does a horrible impression of an opera singer</i>] My lovely maiden, Melanie, she is cute as any bumblebee. La da de da de day dee. She is my wonderful lady. He sits back down and watches as she disappears into the house. Hm, I'm trying to figure out who says this here... I think he says this one... I understand. They wanted to surprise me and have me and Mel get back together! Someone finally understands my plight. For far too long, people have kicked me around saying that I am too selfish. It’s not my fault I am too selfish. It’s your fault! It’s all your fault! I just want what I deseeeeeerve! Mel and I should be together and we should have our future daughter together for love and honesty prevails over those cops who tried to stop our love. I knew this day would come. I have to get ready. I have to look my best.\n</p><p>Christopher has a big grin on his face as he walks into the bathroom, preparing to shave... for the first time... in his life. Hm. Ever since my- Oh my god somebody says this. [<i>Pauses</i>] Oh! Ever since my parents died, I always have had- have had their help. While God may have taken them too soon from me, I will prevail with God’s will! Ah. Did you just hear cries of pain, Mimi? Mel asked. Yeah. Yes, odd, must be the television. Anyway, Melanie, it is nice to meet you. My children have said that they know more- you know more about our new neighbor. Yes, he should not be alive. He is a horrible person who has done so many things to me. It all began... [<i>Unintelligible</i>] And I ended it with the restraining order, Mel concluded.\n</p><p>[<i>Chandler dogs can be heard wailing in the background</i>] There must be something wrong with this man for that level of…I do not know where to begin to describe such behavior. I never asked. I honestly have no idea how he manages to live by himself, all alone in that house. I don't even know if he has a job. Well, Melanie, I will just say we have had a family emergency when he shows up for dinner then. I do not think I have what it takes to me- in me to lie, but I think I’ll manage. Good. To be honest, I don’t have any friends and they seem to be like me and my brother when we were younger. Always playing, always having fun.\n</p><p>Christobel steps outside of his bathroom, smelling of cologne. He looks at the clock, five and a half. He still has half an hour. He decides to pick out his best outfit. He looks through his jewelry case and finds his high school ring. He puts it on for good luck. Luck. It is what he needs to win back Melanie from the evil caps. He took the first pictures of him and Melanie. He looks at them. The first win at Game Wars. The victory dinner. The bowling game. And he drew a picture, a picture of him, Melanie and his future daughter. Drawn in crayon. He is especially proud of that drawing. Christobel looks at the clock, 15 minutes left. He decides to get a drink from the refrigerator. He looks at the choices he has, diet or regular. He takes two diets. When he closes the refrigerator door, a picture falls down. He replaces the magnet that held up that picture. The picture fits in nicely among the other drawings on the door.\n</p><p>He steps outside for the first time in ages and walks over to the neighbor’s door. He knocks. Oh, Christobel, we weren’t expecting you until seven. Look, we have had a family emerge- Hello. Melanie! Your sweetheart is here! Christobel announces unexpectedly. Christobel? [<i>Gasps</i>] Melanie gasps. [<i>Camera falls over again</i>] Doggoneit. This selfie stick. Oh well! Tune in next week or later this week as I'll read the next chapter. Thank you and have a good day. Da- [<i>Video ends</i>]\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Chapter_3_and_4\">Chapter 3 and 4</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>A Girl Who Brought Down The World 3 and 4</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/3x1sChcp_5g\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=3x1sChcp_5g\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/3x1sChcp_5g\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>23 <a href=\"/cwcki/August_2016\" title=\"August 2016\">August 2016</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>, <i><a href=\"/cwcki/A_Girl_Who_Brought_Down_the_World\" title=\"A Girl Who Brought Down the World\">A Girl Who Brought Down the World</a></i>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Financhu Crisis</span><a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\"><img alt=\"Financhu Crisis\" decoding=\"async\" height=\"20\" src=\"/w/images/a/ae/Financhu2.png\" width=\"41\"/></a> <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">Financhu Crisis</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td><span style=\"display:none\">Turquoise Tank Top</span><a href=\"/cwcki/File:TurquoiseTT.png\" title=\"Turquoise Tank Top\"><img alt=\"Turquoise Tank Top\" decoding=\"async\" height=\"22\" src=\"/w/images/5/5a/TurquoiseTT.png\" width=\"19\"/></a> <a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">Turquoise Tank Top</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/August_2016_Paid_Video_Requests#Singing_an_ol'_diddy\" title=\"August 2016 Paid Video Requests\">Singing an ol' diddy</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/I%27d_like_someone_with_a_3D_Printer,_Locally,_please\" title=\"I'd like someone with a 3D Printer, Locally, please\">I'd like someone with a 3D Printer, Locally, please</a>\n</td></tr></tbody></table>\n<p><b>Description</b>\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Reading Chapters Three and Four\n<p>This is Not a Paid request; I genuinely have been curious in this near-decade old book, and I take any parodies with the grain of salt, regardless. And as this Is the first time ever reading it, you will see fresh responses in my facial expressions.\n</p><p>via YouTube Capture\n</p>\n</td></tr></tbody></table>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href='/cwcki/August_2016_Paid_Video_Requests#Singing_\"All_of_the_Lights\"' title=\"August 2016 Paid Video Requests\">Singing \"All of the Lights\"</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a href=\"/cwcki/I%27d_like_someone_with_a_3D_Printer,_Locally,_please\" title=\"I'd like someone with a 3D Printer, Locally, please\">I'd like someone with a 3D Printer, Locally, please</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";background:#8cbd04;\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;background:#8cbd04;;border:none;;\"><a href=\"/cwcki/Template:BusinessList\" title=\"Template:BusinessList\"><span style=\";background:#8cbd04;;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:BusinessList\" title=\"Template talk:BusinessList\"><span style=\"color:#002bb8;;background:#8cbd04;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:BusinessList&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;background:#8cbd04;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> <a href=\"/cwcki/Chris_and_business\" title=\"Chris and business\">Business</a></span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Platforms\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/Cwcvilleshopping.com\" title=\"Cwcvilleshopping.com\">CWCville Shopping</a><abbr title=\"Defunct\">†</abbr>  • <a href=\"/cwcki/Cwclight\" title=\"Cwclight\">Cwclight</a> • <a href=\"/cwcki/EBay\" title=\"EBay\">eBay</a><abbr title=\"Suspended\">†</abbr>  • <a href=\"/cwcki/Etsy\" title=\"Etsy\">Etsy</a> (<a href=\"/cwcki/OfficialCWCmart\" title=\"OfficialCWCmart\">OfficialCWCmart</a>)  • <a href=\"/cwcki/Lulu\" title=\"Lulu\">Lulu</a><abbr title=\"Dormant\">*</abbr>  • <a href=\"/cwcki/Patreon\" title=\"Patreon\">Patreon</a><abbr title=\"Suspended\">†</abbr>  • <a href=\"/cwcki/Redbubble\" title=\"Redbubble\">Redbubble</a><abbr title=\"Dormant\">*</abbr>  • <a href=\"/cwcki/Paid_Video_Requests\" title=\"Paid Video Requests\">YouTube</a><abbr title=\"Dormant\">*</abbr></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Crafts\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Medallions\" title=\"Medallions\">Medallions</a> • <a href=\"/cwcki/Sonichu_Amiibo\" title=\"Sonichu Amiibo\">Sonichu Amiibo</a> • <a href=\"/cwcki/Twilight_Sparkle%27s_Secret_Shipfic_Folder\" title=\"Twilight Sparkle's Secret Shipfic Folder\">Twilight Sparkle's Secret Shipfic Folder</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Drawings\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\"><i>Sonichu</i> comics</a> • <a href=\"/cwcki/Original_Sonichu_and_Rosechu_Drawing\" title=\"Original Sonichu and Rosechu Drawing\">Original Sonichu and Rosechu Drawing</a> • <a href=\"/cwcki/Commissions\" title=\"Commissions\">Commissions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Videos\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Category:Interview_videos\" title=\"Category:Interview videos\">Interviews</a> • <a href=\"/cwcki/Paid_Video_Requests\" title=\"Paid Video Requests\">Paid Video Requests</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">eBay Sales listings\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/2008-2013_Sales_Listings\" title=\"2008-2013 Sales Listings\">2008–2013</a> • <a href=\"/cwcki/2014-2015_Sales_Listings\" title=\"2014-2015 Sales Listings\">2014–2015</a> • <a href=\"/cwcki/2016_Sales_Listings\" title=\"2016 Sales Listings\">2016</a> • <a href=\"/cwcki/2017_Sales_Listings\" title=\"2017 Sales Listings\">2017</a>  • <a href=\"/cwcki/2018_Sales_Listings\" title=\"2018 Sales Listings\">2018</a> • <a href=\"/cwcki/2019_Sales_Listings\" title=\"2019 Sales Listings\">2019</a> • <a href=\"/cwcki/2020_Sales_Listings\" title=\"2020 Sales Listings\">2020</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Commissions and Collaborations\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/Chris_Chan:_A_Prequel_Comic\" title=\"Chris Chan: A Prequel Comic\">Prequel Comic</a>  • <a href=\"/cwcki/ChuuChuuRocket\" title=\"ChuuChuuRocket\">Sonichu and Night Star Plushies</a>  • <a href=\"/cwcki/Shrek_Retold\" title=\"Shrek Retold\">Shrek Retold</a>  • <a href=\"/cwcki/Praetor\" title=\"Praetor\">Praetor</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Other\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a class=\"mw-redirect\" href=\"/cwcki/Autographed_photos\" title=\"Autographed photos\">Autographed photos</a>  • <a href=\"/cwcki/Etsy#Christian_Weston_Chandler..._Yep,_I'm_on_T.V._Two_DVD_Set\" title=\"Etsy\">Yep, I'm on T.V. Two DVD Set</a>  • <a class=\"mw-redirect\" href=\"/cwcki/Skylanders_avatar\" title=\"Skylanders avatar\">Skylanders avatar</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";background:#cad626;\">Managers\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Bryanfrogboy\" title=\"Bryanfrogboy\">Bryanfrogboy</a> • <a href=\"/cwcki/Caden_Peck\" title=\"Caden Peck\">Caden Peck</a> • <a href=\"/cwcki/Null\" title=\"Null\">Null</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251127004041\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.151 seconds\nReal time usage: 0.168 seconds\nPreprocessor visited node count: 1323/1000000\nPost‐expand include size: 41419/2097152 bytes\nTemplate argument size: 11300/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 1944/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   85.439      1 -total\n 44.85%   38.321      1 Template:BusinessList\n 40.14%   34.296      1 Template:Navbox\n 36.16%   30.891      3 Template:Infobox/video\n  6.28%    5.367      2 Template:Transcript\n  6.01%    5.131      3 Template:Reason\n  5.73%    4.897      1 Template:Tnavbar\n  4.78%    4.082      9 Template:Icon\n  4.10%    3.504      1 Template:Quote\n  3.93%    3.356      1 Template:Succession\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:23464-0!canonical and timestamp 20251127004041 and revision id 353208. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Reading:_%22A_Girl_Who_Brought_Down_the_World%22,_%22And_Apparently_Survived_a_Housefire%22&amp;oldid=353208#Chapter_3_and_4\">http://sonichu.com/w/index.php?title=Reading:_%22A_Girl_Who_Brought_Down_the_World%22,_%22And_Apparently_Survived_a_Housefire%22&amp;oldid=353208#Chapter_3_and_4</a>\"</div></div>",
  "categories": [
    "Chris-chan videos, 2016",
    "Videos Christian uploaded to YouTube",
    "Vivian"
  ],
  "links": [
    "Sonichu and Night Star Plushies",
    "July 2016",
    "2008–2013",
    "2014–2015",
    "Monty Python",
    "2017",
    "things...",
    "Shrek Retold",
    "Cwclight",
    "Redbubble",
    "Business",
    "OfficialCWCmart",
    "Autographed photos",
    "Paid Video Requests",
    "Sonichu comics",
    "Vivian Gee",
    "Twilight Sparkle's Secret Shipfic Folder",
    "Praetor",
    "Medallions",
    "one of the Chandler dogs",
    "Caden Peck",
    "eBay",
    "Lulu",
    "Mmmm",
    "Housefire",
    "a short farting noise",
    "Sonichu Amiibo",
    "Original Sonichu and Rosechu Drawing",
    "2019",
    "Skylanders avatar",
    "The Happy Hag",
    "Chris's videos",
    "A Girl Who Brought Down the World",
    "Null",
    "Videos",
    "2016",
    "YouTube",
    "Bryanfrogboy",
    "Turquoise Tank Top",
    "Etsy",
    "August 2016",
    "Financhu Crisis",
    "The Shattered Heart",
    "Machine Romans",
    "I'd like someone with a 3D Printer, Locally, please",
    "Patreon",
    "Commissions",
    "CWCville Shopping",
    "2018",
    "2020",
    "Reason"
  ],
  "scraped_at": "2025-11-26T21:42:15.817776"
}