{
  "url": "https://sonichu.com/cwcki/Saturday_Night_Special",
  "title": "Saturday Night Special",
  "display_title": "Saturday Night Special",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><i><b>Saturday Night Special</b></i> is an article written by <a href=\"/cwcki/Cole_Smithey\" title=\"Cole Smithey\">Cole Smithey</a> on his film critic blog.<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup> It mostly details his coming of age, but the last two paragraphs involve <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">Barb</a>. According to his recount, her recklessness almost killed him and certainly left a lasting impression.\n</p>\n<h2><span class=\"mw-headline\" id=\"Saturday_Night_Special\"><i>Saturday Night Special</i></span></h2>\n<p><b>My Childhood, Playing with Guns</b>\n</p><p>It wasn’t officially what the media called a “<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Saturday_night_special\" title=\"wikipedia:Saturday night special\">Saturday Night Special</a>.” Nevertheless, my <a href=\"/cwcki/Barbara_Chandler#Jerry_Harmon\" title=\"Barbara Chandler\">stepdad</a>, a professional magician in every sense of the phrase — he was a master of sleight-of-hand and just about everything else — referenced the term so many times that that was what I called the .25 caliber revolver he kept in his nightstand drawer. It wasn’t loaded, but that wasn't because he was an especially safety-conscious man. There was a box of bullets in the drawer too. Some were loose, rolling around the bottom of the drawer unencumbered by the presence of any other items that might impede a would-be user from quickly loading it. When I was somewhere between eight and ten years of age, I played with my stepfather's gun whenever he and my mom left me alone in our second-floor apartment at 1124 West Grace Street (apartment 7) adjacent to the campus of Virginia Commonwealth University in <a href=\"/cwcki/Chris%27s_homes\" title=\"Chris's homes\">Richmond</a>. Like many boys I wanted to become a man as quickly as possible. My dad’s stacks of Playboy and Penthouse magazines inspired me to aspire to be an oversexed version of James Bond from a young age — I remember watching a James Bond triple-feature at a drive-in (“From Russia With Love,” “Goldfinger” and “Thunderball”) with my folks. I fell asleep before the end of “Thunderball,” but “Goldfinger” made an impression. \n</p><p>An only child, I would spend Friday nights trying to keep awake all night because I imagined that passing this test would mean that I had the requisite stamina that being an adult required. Late-night horror movies — frequently starring Vincent Price or Boris Karloff — assisted in my weekly endeavor, as did an hourglass; alas, I accidentally broke the device and was naturally, typically and severely punished for it.\n</p><p>I’ll never forget the time I finally got up the courage to pull the trigger on the pistol. I had long before discovered that I didn’t possess enough hand strength to pull the trigger unless the hammer was already cocked. If you’ve never operated an old-school pistol, you may not be aware that you can pull the hammer back to a locked position that allows the trigger to be pulled easily. If you try to pull the trigger before first cocking the hammer, you have to pull the hammer back with the trigger, which takes more strength — adult strength — that I didn’t yet have.\n</p><p>It was a Saturday night. My parents were out who knows where doing God knows what. I wanted to see if I had the guts to put a gun that I was very sure wasn’t loaded to my head and pull the trigger. I kept rechecking the chambers of the revolver to make sure all six chambers were empty before committing to an action I intuited was one that only a confident adult — a “man,” of course — could do. Steve McQueen, Clint Eastwood, Charles Bronson were the kind of men I had in mind. I finally achieved my goal. The trigger fired into an empty chamber. I survived.\n</p><p>Obviously, you knew that.\n</p><p>My curiosity was sated. I never did it again.\n</p><p>Then came the night when a burglar tried to break in when my dad was out cheating on my mom. We had a steel front door. You don’t see many of those around unless you live — as I do — in a pre-war building in a big city. Some dirtbag was making no bones about trying to break down our front door. Richmond was the <a href=\"/cwcki/Chris_and_sex#Rape\" title=\"Chris and sex\">rape</a> capital of America at the time. The former capital of the Confederacy has always been a cesspool of violent crime, and still is. <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">My mother Barbara</a> left the living room for the adjacent bedroom where said pistol sat waiting. She returned with a fully loaded gun. I stood beside her about ten feet from the door where the would-be thief was still loudly at work trying to break down the front door. My mother pulled back the hammer, attempting to cock it. But she didn’t pull it back far enough for it to lock. BLAM! The gun fired. The bullet hit the floor, ricocheted onto the steel door, then onto the ceiling, before lodging in the plaster wall less than a foot to the left of my head. The would-be thief was scared off, so <a href=\"/cwcki/George_W._Bush\" title=\"George W. Bush\">mission accomplished</a> there, but I could easily have died. I remember sticking a pencil into the hole in order to measure how far the bullet had lodged after ricocheting so many times.\n</p><p>We never discussed what had happened that night, but I revisited the bullet hole in our living room wall anytime I wanted to remember the event. I’ll never forget the angle of the ricochet that nearly killed me.\n</p>\n<h2><span class=\"mw-headline\" id=\"See_Also\">See Also</span></h2>\n<ul><li><a href=\"/cwcki/Operation_Snowball\" title=\"Operation Snowball\">Operation Snowball</a></li></ul>\n<h2><span class=\"mw-headline\" id=\"Sources\">Sources</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\"><a class=\"external free\" href=\"https://web.archive.org/web/20140307024001/http://www.colesmithey.com/articles/2014/02/saturday-night-special.html\" rel=\"nofollow\">https://web.archive.org/web/20140307024001/http://www.colesmithey.com/articles/2014/02/saturday-night-special.html</a></span>\n</li>\n</ol></div>\n<!-- \nNewPP limit report\nCached time: 20230817231320\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.027 seconds\nReal time usage: 0.028 seconds\nPreprocessor visited node count: 32/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 562/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:19590-0!canonical and timestamp 20230817231320 and revision id 311002. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Saturday_Night_Special&amp;oldid=311002\">http://sonichu.com/w/index.php?title=Saturday_Night_Special&amp;oldid=311002</a>\"</div></div>",
  "categories": [
    "Category",
    "Historical Documents"
  ],
  "links": [
    "Operation Snowball",
    "Richmond",
    "Barb",
    "My mother Barbara",
    "Cole Smithey",
    "mission accomplished"
  ],
  "scraped_at": "2025-11-26T15:17:42.025352"
}