{
  "url": "http://sonichu.com/cwcki/SNT_Vs_Sonichu",
  "title": "SNT Vs Sonichu",
  "display_title": "SNT Vs Sonichu",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:185px;\"><a class=\"image\" href=\"/cwcki/File:SNT_Vs_Sonichu_cover.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"242\" src=\"/w/images/4/46/SNT_Vs_Sonichu_cover.png\" width=\"183\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:SNT_Vs_Sonichu_cover.png\" title=\"Enlarge\"></a></div>You've heard of Batman fighting Superman and Optimus Prime fighting Bumblebee, now, get ready for the truly and honestly greatest hero showdown of all time.</div></div></div>\n<p><b>SNT Vs Sonichu</b> is a fanfiction written by <a href=\"/cwcki/Opuscon789\" title=\"Opuscon789\">Opuscon789</a>, posted to Fanfiction.net and Wattpad.com. The plot is a crossover between <a href=\"/cwcki/ProjectSNT\" title=\"ProjectSNT\">ProjectSNT</a> and Chris. The story comprises three parts, each with multiple chapters. Opuscon began posting the story on 28 <a href=\"/cwcki/July_2018\" title=\"July 2018\">July 2018</a>.<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup> In <a href=\"/cwcki/April_2019\" title=\"April 2019\">April 2019</a>, ProjectSNT read several chapters in a livestream.<sup class=\"reference\" id=\"cite_ref-2\"><a href=\"#cite_note-2\">[2]</a></sup> Chris, obsessed over ProjectSNT, watched the stream. In <a href=\"/cwcki/February_2020\" title=\"February 2020\">February 2020</a>, Chris decided to do the same, recording <a href=\"/cwcki/Live_Reading_of_SNT_Vs_Sonichu,_Part_2\" title=\"Live Reading of SNT Vs Sonichu, Part 2\">Live Reading of SNT Vs Sonichu, Part 2</a>.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Plot\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Plot</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Chris's_response\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Chris's response</span></a></li>\n<li class=\"toclevel-1\"><a href=\"#References\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">References</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Plot\">Plot</span></h2>\n<p>The story begins in chapter 1 when ProjectSNT's Sonic <a href=\"/cwcki/OC\" title=\"OC\">OC</a> mysteriously finds herself in <a class=\"mw-redirect\" href=\"/cwcki/C-197\" title=\"C-197\">C-197</a>, where she is immediately ambushed by a hoard of <a href=\"/cwcki/Pok%C3%A9mon\" title=\"Pokémon\">Pokémon</a> after getting too close to <a href=\"/cwcki/CWCville\" title=\"CWCville\">CWCville</a> in an attempt to find civilization. After escaping her attackers, she is found by <a href=\"/cwcki/Sonichu\" title=\"Sonichu\">Sonichu</a>, or, in her eyes (and ours), a horrible abomination that seems to be a fusion between one of the Pokémon she fought and her dear friend <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a>. Sonichu explains to SNT how the world works and then <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\"> electrocutes</a> her. They then engage in a fight completely unlike the ones from the Sonichu comics. For example, the fight is written with relative competency and contains some actual tangible stakes. Another example of ways in which it is different is that Sonichu actually loses. After winning her fight, SNT gets away just before <a href=\"/cwcki/Chris_Chan\" title=\"Chris Chan\"> something even worse</a> appears. Sonichu beckons for aid from the freshly revealed Christian Weston Chandler, who prepares to make the hero of the story CWCville's public enemy number 1. After escaping from more angry Pokémon, SNT finds CWCville where she is almost immediately attacked by <a href=\"/cwcki/Son-Chu\" title=\"Son-Chu\"> Chris piloting a giant robot</a>. This fight ends quickly, and the closing dialogue concludes the first chapter. \n</p><p>That night, SNT takes a rest on a bench in the outskirts of CWCville to recover from getting repeatedly <a href=\"/cwcki/26_December_2014\" title=\"26 December 2014\"> assaulted by Chris</a> and his lackeys. SNT starts to remember how she got to this hell-world, but can only recall it had something to do with joining the Sonic character Tails on a trip to Angel Island, a somewhat important location in the franchise. Immediately, a city-wide announcement is made, requesting all citizens to aid the authorities in hunting down SNT. A <a href=\"/cwcki/Sonichu%27s_Edge\" title=\"Sonichu's Edge\">parkour</a> scene of SNT sprinting across the CWCville skylines ensues. Oh.. also due to some Sonic the Hedgehog stuff she collects one of the Choas Emeralds from the series, which she decides to collect \"just in case.\" Soon after falling to the ground, she is confronted by <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a>. The two then ponder the possibility that the two are nothing more than fictional characters before fighting. Uncharacteristically, Rosechu attacks SNT using moves from Sonic and Pokémon instead of her <a href=\"/cwcki/China\" title=\"China\">china</a>. After managing to get her tangled up in some wires, Rosechu nearly defeats SNT before beging shoved into a wall. It is implied that SNT escapes the wires to observe Chris rescue Rosechu in a helicopter and plot to figure out who created SNT in a plot to <a class=\"mw-redirect\" href=\"/cwcki/Love_quest\" title=\"Love quest\">attract a boyfriend-free girl</a>. The presumably still injured Rosechu is sent back to continue her chase after SNT. SNT collects yet another Chaos Emerald. Rosechu continues her pursuit, acting <a href=\"/cwcki/The_Incredible_Lioness\" title=\"The Incredible Lioness\">more like herself</a>. SNT escapes and makes it to the <a href=\"/cwcki/CWCville_Shopping_Center\" title=\"CWCville Shopping Center\">CWCville Mall</a> where she finds Chris eating a burger. Chris demands to know who created SNT, but is met only with confusion. She is then the victim of a cartoonish dropped-through-the-floor trap.\n</p><p>SNT, having fallen into CWCville sewer system. She spends the first part of chapter 3 swimming through the water, breathing in methane, and being attacked by more Pokémon, before escaping the underground and discovering a sewage plant ran by <a href=\"/cwcki/Bubbles_Rosechu\" title=\"Bubbles Rosechu\">Bubbles Rosechu</a>. In the plant, SNT remembers more about what happened before she got to CWCville, hunting for <a class=\"mw-redirect\" href=\"/cwcki/Robotnik\" title=\"Robotnik\">Dr. Eggman</a> (known by his alternate name \"Robotnik\" in the Sonichu comics) alongside Tails to stop his evil plan that involved digging to the Angel Island underground. After the flashback, SNT tries and fails to collect another Emerald and muses aloud <i>something is very wrong with the world she is stuck in</i> and imagines Sonic inviting her to take part in some <a class=\"mw-redirect\" href=\"/cwcki/Honest_content\" title=\"Honest content\">honest content</a>. Delving deeper into the plan, she finds a pool of fresh water from which Bubbles Rosechu emerges. SNT is met with a mix of electric and water moves, but uses the emeralds she has collected to defeat the blue Rosechu-recolor. Back in Chris Chan's vile lair, Chris announces to Sonichu and Rosechu that he has discovered SNT is an OC created by ProjectSNT, and declares that his new goal is to bring her to CWCville, yet refuses to explain how.\n</p><p>Chapter 4 begins with another flashback. SNT and Tails fight off Eggman's robots and discover his inter-dimensional portal device. Out of a portal comes a dragon, which snatches her and brings her into another <a class=\"mw-redirect\" href=\"/cwcki/Dimension\" title=\"Dimension\">dimension</a>. The morning after the fight with Bubbles, SNT decides she needs to speak to Chris so that she can get back to her homeworld. Meanwhile, Chris is speaking with Sonichu before they perform with the rest of the <a href=\"/cwcki/Christian_and_the_Hedgehog_Boys\" title=\"Christian and the Hedgehog Boys\"> Hedgehog Boys</a>, excited to play but worried that SNT will come along and mess up the show. Sonichu reaffirms Chris that Bionic is looking out for her. SNT finds a poster advertising that Christian and the Hedgehog Boys will be playing later that day at the CWCville Collisuem. At the stadium, SNT finds out that the band is made up of Chris and Sonichu, as well as three yet unmet Sonichus, <a href=\"/cwcki/Blake\" title=\"Blake\">Blake</a>, <a class=\"mw-redirect\" href=\"/cwcki/Wild\" title=\"Wild\">Wild</a>, and <a class=\"mw-redirect\" href=\"/cwcki/Punchy\" title=\"Punchy\">Punchy</a>, taking special note of <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Race\" title=\"Chris and Race\"> Punchy's eyes</a>. When making her way through the crowd of <s>brainwashing victims</s> <s>subjects of a dictatorship</s> \nadoring fans, she is nearly recognized by a CWCville citizen. When simply asked what this concert was, the citizen explains that what in the real world is <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Music\" title=\"Chris and Music\"> a series of bad song parodies trying to pass as original music</a> is to he and his fellow CWCvillians is state-mandated media and the only available music in addition to that of <a href=\"/cwcki/Jiggliami\" title=\"Jiggliami\">Jiggliami</a>. Some police notice SNT, and another chase ensues. In an attempt to find Chris, SNT makes her way into the men's dressing room, where she meets Bionic (who acknowledges both the story being a fanfiction and Sonic Underground non-canonical often forgotten TV show, making him not the only 4th-wall aware character, but the one with the best understanding of it). The actual fight with Bionic is over quickly, and SNT heads off to find Chris after <a href=\"/cwcki/Axe\" title=\"Axe\">taking a shower</a> to get rid of her sewer smell, albeit in a <a href=\"/cwcki/ShowerClean\" title=\"ShowerClean\">quite unsanitary stall</a>. SNT can hear the concert beginning, and notes that the music is actually really good until Chris starts singing, although thinks to herself it sounds pre-recorded. SNT crashes the show, finding herself right beside Chris. The two are forced by <a href=\"/cwcki/DJ_Jamsta\" title=\"DJ Jamsta\">DJ Jamsta</a> to have a karaoke competition to <a href=\"/cwcki/So_Need_a_Cute_Girl\" title=\"So Need a Cute Girl\">So Need a Cute Girl</a>. SNT quickly loses, having been spared the misfortune of hearing Chris Chan's music, but just before being penalized by potential death, she catches on to the song and begins to sing. The people of CWCville are then able to hear decent singing for the first time, causing Jamsta to reverse course and blowing Chris, Sonichu, and the rest of the Hedgehog Boys into the air. \n</p><p>In a forest, Chris wakes up to Sonichu asking if he is alright. Chris complains that his very own slaves had voted against him. Blake declares that he will handle the situation with Jamsta. Chris swoons over SNT before Rosechu mentions that they have 4 <a class=\"mw-redirect\" href=\"/cwcki/S-Chu_Balls\" title=\"S-Chu Balls\">S-Chu Balls</a> in the mayor's office, but they need to collect the rest in order to summon ProjectSNT to CWCville. Wild is then delegated to find and defeat SNT who arrives in the woods soon thereafter. SNT battles through more Pokémon and even collects another Chaos Emerald, but before she can make her way to Wild, another figure approaches her. The mysterious individual reveals herself to be <a class=\"mw-redirect\" href=\"/cwcki/Slaweel_Ryam\" title=\"Slaweel Ryam\">Slaweel Ryam</a> (who may be more familiar to some Christorians as Mary Lee Walsh.) Slaweel noticed that SNT was able to somewhat free the minds of the population of CWCville back at the concert, and after explaining that Chris uses C-197 as an escapist fantasy world and that she herself was created based off of a <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">real world Dean of Student Affairs</a>, which she only discovered by trying to learn more about SNT. Slaweel concludes that SNT was created by someone other than Chris, and that her presence in this world is causing people to become free of the control of Chris. Slaweel offers SNT the chance to join her and conquer the world. SNT did not simply want to take over CWCville, so a fight ensues. SNT defeats Slaweel quickly, but not without becoming the victim of a <a class=\"mw-redirect\" href=\"/cwcki/Curse-Ye-Ha-Me-Ha\" title=\"Curse-Ye-Ha-Me-Ha\">Curse-Ye-Ha-Me-Ha</a> and becoming a victim to Murphey's Law. Where normally she would only somewhat struggle to venture through the forest, now, she was dealing with constant situations as bad as nearly being eaten by a (<a class=\"mw-redirect\" href=\"/cwcki/Boulder-Dropping_Whale\" title=\"Boulder-Dropping Whale\">boulder-dropping?</a>) whale that was for some reason in a river running through the woods. She was, however, able to collect a Chaos Emerald. She finds Wild, who had already opened their fight with a surprise attack, hiding himself in a ball of vines while controlling other flora to attack SNT. She knocks the mysterious ball down and causing it to roll into a <a href=\"/cwcki/Brushfire_Video\" title=\"Brushfire Video\">forest fire</a>. Wild erupts out of the ball, revealing himself to SNT. The fight with Wild is won with more difficulty than the precious two battles. After being defeated, Wild uses the Pokémon move self-destruct, although SNT is able to escape the explosion. After, Wild admits to SNT that Chris is working on a \"secret project\" in the city, which SNT decides to go investigate. \n</p><p>Chris, Sonichu, and Rosechu are walking down the beach along with Blake when <a href=\"/cwcki/Zapina\" title=\"Zapina\">Zapina</a> approaches, announcing that <i><a class=\"mw-redirect\" href=\"/cwcki/Episode_17\" title=\"Episode 17\">the images</a> have been uploaded.</i> Rosechu celebrates before commanding Zapina to find SNT. The girls then decide that instead of defeating SNT, maybe they could get her to join their <a href=\"/cwcki/Women%27s_rights\" title=\"Women's rights\">feminist campaign</a>. Meanwhile, SNT finds herself <a class=\"new\" href=\"/w/index.php?title=Keepn%27_it_real_for_Spring_Break&amp;action=edit&amp;redlink=1\" title=\"Keepn' it real for Spring Break (page does not exist)\"> Episode 18</a>, surfing the waves while trying to escape from various fish Pokémon. A CWCvillian Pokémon trainer loyal to Chris sends a Guardevoir, but is swiftly beaten. After getting to the edge of the beach so she can enter the city again, Zapina shouts to her from above. She says that she will open a gate leading into CWCville if SNT joins her cause, informing our hero that the <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> that had victimized the Rosechus have already made their fanart of SNT. While SNT is not amused by the drawings, she seems to find herself as the mouthpiece of a higher being explaining the many flaws in Zapina's understanding of women's rights. This convinces Zapina that the original plan was a no-go and serves as a moderately challenging foe for SNT. After winning the battle, SNT questions why she felt like something else was speaking through her. She makes it into CWCville, only to find the city in disarray with a massive anti-CWC <a class=\"mw-redirect\" href=\"/cwcki/Sonic_Boom_Protest\" title=\"Sonic Boom Protest\">protest</a>. Unfortunately, this was not for the installation of any sort of free non-<a href=\"/cwcki/CWCville_Mayoral_Office\" title=\"CWCville Mayoral Office\">tyrannical</a> government, but instead a plot by Dr. Eggman to take control.\n</p><p>SNT confronts Eggman, who explains that the whole portal situation was caused by him wanting to leave the universe where he would always be defeated by the capable and competent Sonic and instead try and conquer a world whose greatest champion is a self described <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">virgin with rage</a>. SNT then recalled how when he used the aforementioned portal machine to achieve that goal, he accidentally dragged SNT and the seven Chaos Emeralds with him. Just like Slaweel, when Eggman noticed the population loosing their devotion to Chris in the music battle, he saw an opportunity to take over CWCville for himself. Eggman challenges SNT to defeat him on the <a href=\"/cwcki/Sonichu_8\" title=\"Sonichu 8\"> 66 + 6th floor</a> of the <a href=\"/cwcki/4-cent_garbage.com\" title=\"4-cent garbage.com\">4-Cent Garbage Building</a> (which in the universe of this story, is in CWCville and not Clarksville, Tennessee). SNT rushes into the building, and is forced to run up the stairs as the elevator was not working. Like Sonichu and Rosechu before, SNT was subject to seeing some disturbing imagery, as well as some slanderous comments toward Chris. However, the worst she got to see was some Sonichu honest content, and not the unholy parade of godless imagery that Chris included in the comic. Instead of Pokémon, SNT battles through Eggman's badnik robot minions on her way to the 66 + 6th floor. On the 33rd floor after collecting yet another Emerald, <a href=\"/cwcki/Magi-Chan\" title=\"Magi-Chan\">Magi-Chan</a> confronts SNT, stating that he was sent by Chris to take care of Eggman. Magi-Chan shows an unusual level of concern for SNT, and says that if SNT finds Chris, he will protect her from Eggman. SNT obviously refuses, leading to Magi-Chan challenging her to a fight, which SNT accepts. Magi-Chan proves to be SNT's most powerful foe to this point, but her slightly superior speed wins her the battle. The building begins to shake and collapse. SNT reluctantly leaves the defeated Magi-Chan. She collects another Choas Emerald, leaving her one short of all seven. Upon reaching her destination, Eggman reveals he has the last Emerald, which he used to tame the Pokémon Paldea and rip Sonic out of SNT's universe to turn him into a robot slave who attacks SNT. She tries to snap him out of it as she could not bring herself to fight him. SNT then has to dodge attacks from both Sonic and Paldea, but notices she can force them to attack each other. The Pokémon's attacks knock Sonic's robot parts off, and SNT is able to land a few hits on Eggman and steal the final emerald. SNT explains to Sonic that they are stuck in a world created by a manchild. Upon mentioning said manchild, Chris appears and shoots SNT with a ray. Chris explains that this was his Find Creator Ray. Meanwhile, in the real world, ProjectSNT (or Courtney) is sucked into a portal after finishing a chapter of <i>SNT Forces</i>. She is surprised to meet both SNT and Chris and worried that Chris was going to sue her over her [December 2019| Sonichu Redesigns]] before realizing that what was really happening was something much worse... \n</p><p>Chris and Courney (with varying levels of willingness to be there) were on a date in a CWCville amusement park. While Courtney was putting in no effort to hide her discomfort, Sonichu and Rosechu tried to convince her to take her place in the noble position as <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">sweetheart</a> to Chris. Luckily, SNT and Sonic arrive on the scene. SNT gets on a boat to follow the two into the Tunnel of Love and leaves Sonic to wait outside due to finding him \"too distracting.\" She finds Sonichu and Rosechu, who believe themselves to be alone and prepare to engage in some Sonichu #8 material. SNT, now probably needing centuries' worth of <a href=\"/cwcki/Chris_and_mental_healthcare\" title=\"Chris and mental healthcare\">therapy</a>, makes herself known and asks where Chris and Courteny are. Sonichu declares that he will not let SNT mess up the Love Quest and doesn't intend to hold back when fighting this time. Sonichu is eventually defeated, and Rosechu, instead of fighting, tends to her incapacitated mate. At about the same time, Courtney tries to get out of <a href=\"/cwcki/Chris_and_sex\" title=\"Chris and sex\"> the worst thing imaginable</a>. She then proceeds to explains that kidnapping people is bad begins a musical number about not wanting to fulfill the twisted desires of Chris. Chris, whose <a href=\"/cwcki/Heart_level\" title=\"Heart level\">heart level</a> had been smashed all the way down to -100%, fully gives in to his <a class=\"mw-redirect\" href=\"/cwcki/Tard_rage\" title=\"Tard rage\">virginal fury</a> decides he needs nothing more than a simple kiss and would throw away all of his morals to get it. SNT is able to hear some of the things going on and rushes to reach Courtney and Chris. Just as Chris is about to (literally) steal a kiss from a horrified Courtney, SNT successfully sneak-attacks Chris, knocking him into the water. Chris swears vengence on SNT, who both ruined his love quest and his world. The building begins to collapse as Magi-Chan beams Chris away. SNT and Courteny use the Chaos Emeralds to enter their super-forms and fly out of the building. They meet with Sonic, and then deactivate the Chaos Emeralds. Courtney fully explains how she created her as a self-insert Sonic character and did not believe her to actually exist, only to be stunned to realize that this means that Chris was actually correct about the existence of other dimensions. She then also realizes that whatever story is currently being written is not being made by her, nor is it being written by Chris (otherwise, SNT would have ended up being easily defeated and proclaiming that <a class=\"mw-redirect\" href=\"/cwcki/Jerkief\" title=\"Jerkief\"> her soul hurts</a>). She then realizes that she is in some other random person's fan-fiction <i>and that</i> somebody decided to write a scene where she is nearly kissed by Chris. Unfortunately, the time for philosophy ends when the ground underneath them explodes, since the world of C-197 is a product of the mind of Chris, which had just been completely broken. They find themselves in a zone mashed up of everywhere SNT had been in her adventure up to that point, officially called the Mental Madness Zone by Opuscon. The 3 find special running shoes for Courtney in the zone, where they must dodge obstacles and Pokémon. They then encounter Blake, ready to kill them. Still, like the other foes before him, he is defeated. After defeating the last recolor, they discover the Find Creator Ray. Courtney picks the device up and shoots the world itself with it. The scene cuts to Opuscon himself writing the very scene being described right now on a subway train. When his train arrives at the station, Opuscon walks through the exit door not into a train station, but right in front of SNT, Courtney, and Sonic in the broken reality that he had created. After Courtney confronts Opuscon and demands to be sent back to her room, Opuscon refuses since that would make for a <a href=\"/cwcki/Sonichu_14\" title=\"Sonichu 14\">bad ending</a>. He then wrote on his phone that he was back on the train and the device was sent away. The three heroes then make their way to an area described in the story as being full of video games liked by Chris, items from his room, and various things that Chris hates. Clips of Chris appeared all around them, only to be warped. Small Chris clones attack the trio, but are unable to stop them from finding Chris in the middle of a breakdown. SNT tries to comfort Chris, but Courtney reminds everyone of what she had just been through. Chris then transitions both his form into Chris Chan Sonichu as well <a href=\"/cwcki/Transgender\" title=\"Transgender\">as his gender, declaring himself to be Christine</a> (for the sake of consistency, he/him pronouns will continue to be used for the Chris character of this story as mandated on this wiki. For notes on this subject, see the page for Chris). SNT, Sonic, and Courtney team up on Chris, occasionally being transported into the memories of Chris and attacked by previous foes like Bionic and Slaweel. After a drawn out battle, the trio eventually win.\n</p><p>The three try to make their way to a portal, but are challenged by Chris-Chan Sonichu once again, who destroys said portal to a laser. Chris transforms again into his truly ultimate form, that of course being the form from his <a href=\"/cwcki/ECV_00002\" title=\"ECV 00002\">ECV 00002</a> video. Sonic takes the Choas Emeralds and volunteers to fight off Chris while the others go through the portal. Sonic takes his super form and begins to fight Chris. On the other side of the portal, SNT and Courtney find themselves in <a href=\"/cwcki/Chris%27s_room_(14_Branchland_Court)\" title=\"Chris's room (14 Branchland Court)\"> Chris's bedroom</a> in <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">14 Branchland Court</a> where they are confronted yet again by Dr. Eggman. SNT wants to go back for Sonic, but Courtney assures her that he will be fine. Then, from the window, a voice says that he will not, in fact, be fine, revealed to be Opuscon himself returned to the story. He reveals that Chris is going to beat Sonic, but SNT begs him to write the story to where Sonic wins. Opuscon explains that Sonic cannot win, as he is a character with weaknesses, but Chris is a <a class=\"mw-redirect\" href=\"/cwcki/Comic_Chris\" title=\"Comic Chris\">Mary Sue</a>. Opuscon and Courtney discuss, and then Opuscon explains that this fanfiction will now be exploring how he would have written the ending of <b>Pokémon Ranger and the Temple of the Sea</b>. Courtney expresses a desire to kill Opuscon, but as the writer, Opuscon claims she would not be able to do that. SNT asks Eggman to help them rescue Sonic, and he agrees. Sonic and Chris continue to battle, but Sonic notices himself running out of charge for his ring-based super form while Chris's power is apparently unlimited. He reverts to his normal form, and Chris stands above him, gloating. Chris invites Sonic to live the rest of his days as a CWCville citizen, but SNT challenges him to another fight while Courteny and Eggman rescue Sonic. Courtney then realizes that the only one who could hypothetically defeat Chris is SNT, as she is also a Mary Sue, and any flaws she does possess can be written away be the author easily. The others escape through the portal again.\n</p><p>The final battle begins. Chris launches a Curse-Ye-Ha-Me-Ha, but SNT dodges and headbutts Chris away. The two then begin uses their non-physical attacks, which are felt even by Courtney and the others. The fight transitions to a battle of punches and kicks, which Chris initially prevailed in until SNT catches on. Chris says that up to that point he was only using half of his power, but that now, he was going to go all out. Chris summons everything in the void world and crunches it together, and just before blasting it as a ball attack, monologued to SNT on how she should have relied on Sonic to win the fight because that is <a href=\"/cwcki/Chris_and_gender\" title=\"Chris and gender\">a woman's place in the world</a> (one may argue that it's bad writing to have Chris say that just after transitioning, but then again, hypocrisy is Chris's specialty.) Chris launches the ball, and SNT worries she has met her doom. She then hears Courtney call out to her, explaining that she just needs to forget her flaws so she can unlock her full power as a Mary Sue and show Chris that SHE IS WOMAN. HEAR HER ROAR. She pushes back Chris's ball attack, causing an explosion, reverting him back to his prior form and destroying both the <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_Medallion\" title=\"Sonichu Medallion\">Sonichu Medallion</a> and <a href=\"/cwcki/Amnyfest_Ring\" title=\"Amnyfest Ring\">Amnyfest Ring</a>. SNT tries to get Chris to come with her into the real world and escape the coming calamity, but Chris declares that he hates the real world and would rather stay in his dying fantasy. SNT narrowly escapes through the portal, and Chris presumably dies in the portal. The others sorrowfully accept that they cannot save Chris. Paldea then returns to the scene, sending everyone back to where they belong.\n</p>\n<h2><span id=\"Chris.27s_response\"></span><span class=\"mw-headline\" id=\"Chris's_response\">Chris's response</span></h2>\n<dl><dd><i>Main article: <a href=\"/cwcki/SNT_Vs_Sonichu_2.5-Plus\" title=\"SNT Vs Sonichu 2.5-Plus\">SNT Vs Sonichu 2.5-Plus</a></i> <i></i></dd></dl>\n<p>Of course, the plot summary you just read was based on a piece of trollsome slander created by the evil Opuscon. Luckily, <a href=\"/cwcki/Spirit_possession\" title=\"Spirit possession\">Sonichu himself</a> would later upload <i>SNT Vs Sonichu 2.5-Plus</i> to Wattpad to clear things up. You see, SNT was forced by Opuscon to travel not to Dimension C-197, but instead to N-641, which temporarily merged with C-197 in a nightmare premature merge. As for that dimension's Chris and Sonichu, they were tragically torn apart when a corrupt court of <a class=\"mw-redirect\" href=\"/cwcki/Believe_in_the_OCs_and_Deities\" title=\"Believe in the OCs and Deities\">gods</a> found Chris guilty of... something, punishing him by draining his imagination and sending him back to his Earthly home. Sonichu tries to intercede, but is held back by several unnamed gods, and is possibly killed when Chris loses his imagination.\n</p><p>Unfortunately, it seems our Sonichu may be facing an equally bad fate, as he is stuck being accused of being both \"lazy\" and \"shit.\" Luckily, he explains in the prose of the story that he is neither of those things, so that we reading the story do not fall for the wicked lies of the trolls. He reveals that he and Magi-Chan were aware of the events in N-641, but chose not to inform Chris in order not to distress him. Still, our Goddess Blueheart could tell something was wrong in the multiverse.\n</p><p>The Magi-Chan of N-641 was floating in a void, injured from his fight with SNT, but was rescued by 2 other Magi-Chans from unknown dimensions. They captured him in a Master Ball and took him to a ward to heal up. When he felt a bit better, he quickly realized he needed to get back to N-641. His reason to return so quickly? To repair his broken world? To find and rescue any survivors of the imagination-purge? No. It was the even more important goal of making sure that everyone recognizes him for what he is. It seems that even across universes, all sonichus really want the same thing.\n</p><p>At the end of the story (if you can call it that) it is actually revealed that the sucking out of Chris's imagination by the gods did nothing, as in the final exposition, some confusing lore is dumped about how N-641 Sonichu is actually fine and can go buy Sonichite at the the Sonichite store because SNT is currently collecting the S-Chu balls to convert them into Chaos Emeralds which become Sonichite and Rosechite and it's all because of you and me.  \n</p>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\"><a class=\"external free\" href=\"https://www.fanfiction.net/s/13017046/1/SNT-Vs-Sonichu\" rel=\"nofollow\">https://www.fanfiction.net/s/13017046/1/SNT-Vs-Sonichu</a></span>\n</li>\n<li id=\"cite_note-2\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-2\">↑</a></span> <span class=\"reference-text\"><a class=\"external free\" href=\"https://www.youtube.com/watch?v=sHNGXxt4zQQ\" rel=\"nofollow\">https://www.youtube.com/watch?v=sHNGXxt4zQQ</a></span>\n</li>\n</ol></div>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"60%\">\n<tbody><tr align=\"center\" style=\"background:#96daf6\">\n<td colspan=\"4\"><b><a class=\"image\" href=\"/cwcki/File:ProjectSNTIcon.png\"><img alt=\"ProjectSNTIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/f/fc/ProjectSNTIcon.png\" width=\"32\"/></a> <a href=\"/cwcki/ProjectSNT\" title=\"ProjectSNT\"><span style=\"color:white\">ProjectSNT Saga</span></a> <a class=\"image\" href=\"/cwcki/File:ProjectSNTIcon.png\"><img alt=\"ProjectSNTIcon.png\" decoding=\"async\" height=\"32\" src=\"/w/images/f/fc/ProjectSNTIcon.png\" width=\"32\"/></a></b>\n</td></tr>\n<tr>\n<th align=\"left\">The Players:\n</th>\n<th align=\"left\">The Games:\n</th>\n<th align=\"left\">The Prizes:\n</th></tr>\n<tr>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a></li>\n<li><a href=\"/cwcki/ProjectSNT\" title=\"ProjectSNT\">ProjectSNT</a></li>\n<li><a href=\"/cwcki/Opuscon789\" title=\"Opuscon789\">Opuscon789</a></li>\n<li><a href=\"/cwcki/Naught\" title=\"Naught\">Naught</a></li>\n<li><a href=\"/cwcki/Kyle\" title=\"Kyle\">Kyle</a></li>\n<li><a href=\"/cwcki/MKRNightVee\" title=\"MKRNightVee\">MKRNightVee</a></li>\n<li><a href=\"/cwcki/AquaDiamond8\" title=\"AquaDiamond8\">AquaDiamond8</a></li>\n<li><a href=\"/cwcki/Anaxis\" title=\"Anaxis\">Anaxis</a></li>\n<li><a href=\"/cwcki/Dillin_Thomas\" title=\"Dillin Thomas\">Dillin Thomas</a></li>\n<li><a class=\"mw-redirect\" href=\"/cwcki/Eschcal\" title=\"Eschcal\">Eschcal</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a href=\"/cwcki/ProjectSNT\" title=\"ProjectSNT\">Freakout over Wild Sonichu Redesign</a></li>\n<li><a href=\"/cwcki/Dungeons_and_Dragons\" title=\"Dungeons and Dragons\">Growing Interest in D&amp;D</a></li>\n<li><a class=\"mw-selflink selflink\">SNT Vs Sonichu</a></li>\n<li><a href=\"/cwcki/The_Place_chats_-_ProjectSNT_and_Opuscon789\" title=\"The Place chats - ProjectSNT and Opuscon789\">Ranting about SNT and Opuscon</a></li>\n<li><a href=\"/cwcki/Dillin_Thomas#ProjectSNT\" title=\"Dillin Thomas\">Coping to Dillin</a></li></ul>\n</td>\n<td valign=\"top\">\n<ul><li><a class=\"mw-redirect\" href=\"/cwcki/CS-89\" title=\"CS-89\">Dimension CS-89</a></li>\n<li><a href=\"/cwcki/Live_Reading_of_SNT_Vs_Sonichu,_Part_2\" title=\"Live Reading of SNT Vs Sonichu, Part 2\">Live Reading of SNT Vs Sonichu, Part 2</a></li>\n<li><a href=\"/cwcki/SNT_Vs_Sonichu_2.5-Plus\" title=\"SNT Vs Sonichu 2.5-Plus\">SNT Vs Sonichu 2.5-Plus</a></li></ul>\n</td></tr>\n<tr>\n<td colspan=\"3\"><b>Coinciding Sagas</b>: <a href=\"/cwcki/Template:ShipficSaga\" title=\"Template:ShipficSaga\"><span style=\"color:#5D3FD3\"><b>Secret Shipfic</b></span></a>, <a href=\"/cwcki/Template:SoftExileSaga\" title=\"Template:SoftExileSaga\"><span style=\"color:#c68120\"><b>TF2 Analysis</b></span></a>, <a href=\"/cwcki/Template:WatchmenSaga\" title=\"Template:WatchmenSaga\"><span style=\"color:#F3D64F\"><b>Watchmen</b></span></a>, <a href=\"/cwcki/Template:ListSaga\" title=\"Template:ListSaga\"><span style=\"color:#E34234\"><b>Chandler's List</b></span></a>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251005193939\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.131 seconds\nReal time usage: 0.144 seconds\nPreprocessor visited node count: 1232/1000000\nPost‐expand include size: 2839/2097152 bytes\nTemplate argument size: 387/2097152 bytes\nHighest expansion depth: 11/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 795/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   48.459      1 -total\n 69.51%   33.685      1 Template:SNTSaga\n 60.20%   29.174      4 Template:Saga\n 40.40%   19.576     16 Template:Saga/core\n 23.77%   11.521      4 Template:Color\n 16.34%    7.918      1 Template:Main\n 13.45%    6.517      1 Template:References\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:36267-0!canonical and timestamp 20251005193939 and revision id 342698. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=SNT_Vs_Sonichu&amp;oldid=342698\">http://sonichu.com/w/index.php?title=SNT_Vs_Sonichu&amp;oldid=342698</a>\"</div></div>",
  "categories": [
    "Category",
    "Things Chris hates"
  ],
  "links": [
    "Chris piloting a giant robot",
    "parkour",
    "Sonic the Hedgehog",
    "bad ending",
    "something even worse",
    "CWCville",
    "CWCville Mall",
    "Opuscon789",
    "Mary Sue",
    "Eschcal",
    "a series of bad song parodies trying to pass as original music",
    "Ranting about SNT and Opuscon",
    "protest",
    "4-Cent Garbage Building",
    "Punchy's eyes",
    "Naught",
    "assaulted by Chris",
    "Punchy",
    "ECV 00002",
    "SNT Vs Sonichu 2.5-Plus",
    "July 2018",
    "Slaweel Ryam",
    "Kyle",
    "Live Reading of SNT Vs Sonichu, Part 2",
    "Zapina",
    "Pokémon",
    "Magi-Chan",
    "DJ Jamsta",
    "forest fire",
    "Dimension CS-89",
    "honest content",
    "attract a boyfriend-free girl",
    "Dr. Eggman",
    "Hedgehog Boys",
    "trolls",
    "Sonichu himself",
    "more like herself",
    "virgin with rage",
    "Wild",
    "AquaDiamond8",
    "April 2019",
    "Rosechu",
    "Chris's bedroom",
    "Chris",
    "Amnyfest Ring",
    "Jiggliami",
    "quite unsanitary stall",
    "feminist campaign",
    "S-Chu Balls",
    "taking a shower",
    "real world Dean of Student Affairs",
    "Sonichu",
    "her soul hurts",
    "So Need a Cute Girl",
    "Anaxis",
    "Freakout over Wild Sonichu Redesign",
    "Blake",
    "MKRNightVee",
    "a woman's place in the world",
    "C-197",
    "therapy",
    "Dillin Thomas",
    "china",
    "tyrannical",
    "as his gender, declaring himself to be Christine",
    "gods",
    "ProjectSNT Saga",
    "heart level",
    "OC",
    "14 Branchland Court",
    "electrocutes",
    "boulder-dropping?",
    "66 + 6th floor",
    "ProjectSNT",
    "Curse-Ye-Ha-Me-Ha",
    "virginal fury",
    "the worst thing imaginable",
    "February 2020",
    "Sonichu Medallion",
    "the images",
    "dimension",
    "sweetheart",
    "Bubbles Rosechu",
    "Growing Interest in D&D"
  ],
  "scraped_at": "2025-11-26T21:34:43.519560"
}