{
  "url": "http://sonichu.com/cwcki/Sonichu_reads_and_critiques_a_Fanfic_by_The_Crimson_Libertarian",
  "title": "Sonichu reads and critiques a Fanfic by The Crimson Libertarian",
  "display_title": "Sonichu reads and critiques a Fanfic by The Crimson Libertarian",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center>\n<table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color:transparent; border:5px solid gold\">\n<tbody><tr>\n<td><a class=\"image\" href=\"/cwcki/File:January18SonichuBodyswapArt.jpg\"><img alt=\"January18SonichuBodyswapArt.jpg\" decoding=\"async\" height=\"54\" src=\"/w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/50px-January18SonichuBodyswapArt.jpg\" srcset=\"/w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/75px-January18SonichuBodyswapArt.jpg 1.5x, /w/images/thumb/a/a3/January18SonichuBodyswapArt.jpg/100px-January18SonichuBodyswapArt.jpg 2x\" width=\"50\"/></a>\n</td>\n<td><b>Delusion disclosure:</b> This article or section takes place during Chris's <a href=\"/cwcki/Spirit_possession\" title=\"Spirit possession\">phase of role-playing</a> as <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a>. He may refer to his <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christine Chandler</a> personality and physical body in the third person by using terms such as \"mama\".\n</td></tr></tbody></table>\n</center>\n<p><b>Sonichu reads and critiques a Fanfic by The Crimson Libertarian</b> is a video uploaded by Chris on 18 <a href=\"/cwcki/November_2020\" title=\"November 2020\">November 2020</a>. In it, Chris reads and criticizes a fanfiction about himself <a href=\"/cwcki/Spirit_possession\" title=\"Spirit possession\">while pretending to be</a> <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a>. Chris especially lashes out at the fanfic's references to his <a href=\"/cwcki/Obesity\" title=\"Obesity\">obesity</a>, his <a href=\"/cwcki/Autism\" title=\"Autism\">autism</a>, and his <a href=\"/cwcki/DIRTY,_CRAPPED_BRIEFS\" title=\"DIRTY, CRAPPED BRIEFS\">DIRTY, CRAPPED BRIEFS</a>. The Crimson Libertarian either deleted or privated their Twitter account not long after Chris posted this video.\n</p><p>The Crimson Libertarian can be viewed as a very minor yet successful <a href=\"/cwcki/Trolls\" title=\"Trolls\">troll</a> due to how upset Chris got while reading their fanfiction without active antagonization on their part. \n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Sonichu reads and critiques a Fanfic by The Crimson Libertarian</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/kE0wXoyNYlE\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=kE0wXoyNYlE\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/kE0wXoyNYlE\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>18 <a href=\"/cwcki/November_2020\" title=\"November 2020\">November 2020</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Fan Art</span><a href=\"/cwcki/Category:Fan_art\" title=\"Fan Art\"><img alt=\"Fan Art\" decoding=\"async\" height=\"32\" src=\"/w/images/3/34/Fanartn.PNG\" width=\"32\"/></a> Fanfiction\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Rage</span><a href=\"/cwcki/Chris_and_anger\" title=\"Rage\"><img alt=\"Rage\" decoding=\"async\" height=\"32\" src=\"/w/images/2/27/Rage.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">Rage</a>, <span style=\"display:none\">Reason</span><a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Reason\"><img alt=\"Reason\" decoding=\"async\" height=\"32\" src=\"/w/images/7/79/Reason.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_hypocrisy\" title=\"Chris and hypocrisy\">Reason</a>, <span style=\"display:none\">Crazy</span><a href=\"/cwcki/Autism\" title=\"Crazy\"><img alt=\"Crazy\" decoding=\"async\" height=\"32\" src=\"/w/images/1/10/Crazy.png\" width=\"32\"/></a> <a href=\"/cwcki/Autism\" title=\"Autism\">Crazy</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Shirt</b>\n</td>\n<td>A Sonichu and Rosechu's Valentine\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a href=\"/cwcki/Sonic_World\" title=\"Sonic World\">Sonic World</a>\n</td>\n<td><b>next</b> <br/><a href=\"/cwcki/Fan_visits#Aggravating_Art_(2021)\" title=\"Fan visits\">CHRIS CHAN DRIP OUT</a>\n</td></tr></tbody></table>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p><b>Chris</b>: Hey everybody, Sonichu here, still in... Mama Chris-Chan's body for over seven months now, and, in this particular recording, I'm gonna be taking look at a... rough draft of a fanfic... or, possib–or, possibly a retelling of... a past event. Anyway, it's... based on Mama's real life event, you know, finding <a class=\"mw-redirect\" href=\"/cwcki/Bionic\" title=\"Bionic\">Bionic the Hedgehog</a> back in high school days, and so forth, but anyway. I felt like this thing needed personal critiquing... and I can–I been–I just felt like I couldn't do it over...multiple number of tw–tweets or commen–comments. Anyway I found it on <a href=\"/cwcki/Twitter\" title=\"Twitter\">Twitter</a>, anyway, so... this is from... The Crimson... Libertarian, @hm... @hmarine59, that's on Twitter. \n</p><p>So... [<i>Chris sighs and adjusts his camera</i>] Huh, so this is kinda like an opening draft of his–of his fanfic called \"My Friend Sonichu; Based on the Life and Works of...\" \n</p><p>She doesn't go by Christian anymore, she goes by <a href=\"/cwcki/Transgender\" title=\"Transgender\">Christine</a>, alright, Christine Weston Chandler Sonichu is her full name. Y'might wanna fix that: \"Christine Weston Chandler <i>Sonichu</i>.\" Alright? \n</p><p>So anyway, [<i>sigh</i>] so this guy opens up with- uh... obviously it's past- it's past-tense right now, 'cause it opens up with- uh, a black screen with white text, \"Manchester Highschool, November 13th, 1996, Thursday\"- \n</p><p>Did you look at a calendar for this? I hope you looked at a calendar for this, you better double-check... November 13th, 1996... [<i>rotates smartphone</i>] Anyway, I'm just gonna rotate this horizontal and zoom in so I can... read this a little better. Umm- hmm, top of this page reads \"Dodge\"... why am I dodging? \n</p><p>\"Uh, fade in- uhh, internal Manchester High gymnasium, afternoon. The Manchester High School basketball team practiced in the gymnasium for... the up-and-coming Friday night game.\"\n</p><p>Did you look at the schedule for that year? Around that weekend?\n</p><p>\"They perform all sorts and maneuvers to ensure their victory against the away team of the rival local schools.\"\n</p><p>[<i>dog barks in the background</i>] Oh hey, between \"Nov and the,\" you've got [<i>holds up two fingers</i>] <b>two spaces</b>. Nice job over using those space there. [<i>dog barks in the background</i>]\n</p><p>\"All of this is set to the sounds of squeaking sneakers, the shouting of plays and cheers of encouragement from the student spectators. Transition shot over to the bleachers and stop on the guy in one of the sideline benches.\"\n</p><p>The 'guy'? Heh, I guess past-tense... [<i>snorts</i>] Excuse me. [<i>lets out a breath of air</i>]\n</p><p>\"Sitting on the bench wearing a sweatshirt displaying the Manchester High School Lancers team emblem is the... <a href=\"/cwcki/Obesity\" title=\"Obesity\">somewhat overweight</a>- even at that age waterboy... Chris.\"\n</p><p>Yeah, known as Christian back then, but... he was- she was NOT overweight at all, she was <b>actually</b> of slender... slim body type- she was not overweight, she not fat, remove that word- 'is the... <i>slender</i>- even at that age- waterboy Chris.' Alright? So there's your first edit right there... Well, second, counting the DOUBLE SPACE between the 'oven and the' which I pointed out just a moment ago. [<i>laughs</i>]\n</p><p>\"He sits there lookin' absolutely checked out... and looking off to the side at what was just a blank wall... Daydreaming of his video game characters- his favorite video game characters-\"\n</p><p>Mmm, I would say for the cons for the insigute- institution of this- um, she was actually reading a Fear Street novel from R.L. Stein- that's what she was doing at the time... Although I mean, yeah, you're basing it off of the- uh, event that happened in the book. I mean- but I mean, obviously, when she was reading that Fear Street book... sh- lookin' in the lockers and that's how she found <a href=\"/cwcki/Bionic_the_Hedgehog\" title=\"Bionic the Hedgehog\">Bionic</a> but- and you're just mesh- you're just meshing here for this fanfic. Anyway,\n</p><p>\"The camera starts to spin around him as the gymnasium reverts to a retro 16-bit landscape.\"\n</p><p>[<i>shakes head</i>] I wouldn't say it turns to retro <a href=\"/cwcki/Speech_impediment\" title=\"Speech impediment\">sisteen-bit</a>, especially for the context of this... it would turn into like a more realistic viewpoint of the area of which it was located on- it's like, you know, the actual grass of the upcoming thing which... I'll read about in just a moment, so I mean, it- it dosn- it doesn't look sisteen-bit-gamey, it's... y'know, like you'd see in an animation, a cartoon. Or like, you know, <a href=\"/cwcki/Sonic_the_Hedgehog_(film)\" title=\"Sonic the Hedgehog (film)\">CG-brought-to-life type of thing</a>. Anyway, mm,\n</p><p>\"Chris stands up from <a class=\"mw-redirect\" href=\"/cwcki/A-Log\" title=\"A-Log\">a log</a> that he was sitting on and walks through the brush where he eventually comes to a clearing. He gazes across the clearing, and there he sees the classic Green Hills Zone level.\"\n</p><p>-Green Hill Zone <b>area</b>, y'know, it's the area, it's not just a level. It's part of the whole entire area. [<i>snorts</i>]\n</p><p>-\"Classic Green Hill Zone level in the original Sonic the Hedgehog game-\" parentheses, \"(<i>yes</i>, really)\"-\n</p><p>REALLY? REALLY! YES! Really. <b>REALLY</b> really, YEAH, REALLY! [<i>holds hands out and cocks head, looking utterly deranged</i>]\n</p><p>Uhh, \"Chris fangasing- fang-gasm-ing th- f- fan- gasming...\" that's a word... FanGASMing... fangasming. \"'OH MY GOD OH MY GOD OH MY GOD OH MY GOD IT'S- as beautiful as it was ON THE TV! [<i>laughs</i>] Look at this!' Chris stared, mouth agape, but was suddenly distracted by something moving from left to right. Close up shot of the <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sega mascot</a> moving around at the speed of sound...\"\n</p><p>I wonder who this could be, yeah,\n</p><p>\"Sonic books it across the landscape, leaving a trail of sisteen-bit dust in his stride.\"\n</p><p>Not sisteen-bit dust, <b>actual</b> dust, like, you know, literal dust- like you would see [<i>adjusts camera</i>] in real life 'cause he's actually dirt- kickin' up dirt, dust and dirt. [<i>stares into camera</i>] Hello? Okay... here is a definite grammar error. \"He us through hoops\"... [<i>cocks head</i>] Us? Should be <b>goes</b>.\n</p><p>\"He <b>goes</b> through hoops, gathers rings, and defeats some badniks along the way; releasing their animal controllers.\" Alright. \"Ecstatic, Chris goes 'GO SONIC, GO!' [<i>Chris pumps his hand in the air</i>] Sonic continues throughout the level, and appears to get closer and closer to where Chris was watching from. Chris waving both his arms in the air like he just didn't care, gets more and more excited to finally meet his childhood hero. Everything comes to a... head, when suddenly, in slow-motion... [<i>Chris speaks in slow-motion</i>] 'heeeyyy Soooniiic,' Chris says, and then Sonic replied, 'Chriiis, waaatch ouuut!' Chris says, 'whaaat?' Quick pan over to- shot to <a href=\"/cwcki/Joseph_Herring\" title=\"Joseph Herring\">Joseph Herring</a> [<i>unintelligible, most likely a garbled restatement of \"Joseph Herring,\" or \"who's saying\"</i>]] 'Chris, watch out'- glances over the court, gets hit in the face [<i>palms face for emphasis</i>] with a basketball, which knocks him face-first into the ground. [<i>weird sound</i>] The team goes all- goes over to see if he's okay, and Chris begins to... spastically... begins to <a href=\"/cwcki/CLog_10042017_-_Q%26A_NO_MORE\" title=\"CLog 10042017 - Q&amp;A NO MORE\">spastically cry like an autistic baby</a>- the autistic baby...\"\n</p><p>[[<i>glares and shakes head</i>] DON'T INSULT MAMA LIKE THAT, DON'T INSULT HER LIKE THAT! [<i>sigh</i>] You could say, \"Chris begins to spastically cry.\" [<i>shakes hand in disapproval</i>] Just leave out the \"like the autistic baby he is.\" [<i>looks into the camera</i>] I'm lookin' at you.\n</p><p>\"He shifts from crying to a slight whimper as he sits on the sideline bench with an ice pack on his swollen forehead. The coach of the team kneels next to Chris- tries to comfort him- coach says, 'are you gonna be alright, Chris?'\"\n</p><p>Hang on, I gotta switch to the next tweet that has the next page of this thing. [<i>Chris messes with his phone</i>] Alright,\n</p><p>\"Chris says- is barely- is barely audible, 'yeah.' The coach says, 'Alright, that's good to know.' Coach stands up, does an arm back stretch, and gives an audible sigh of relief. [<i>sigh</i>] 'Well, practice is over for the day, so you can go ahead and get changed and go home.' aaand Chris nods, stands, and goes t- stands to go to the boy's locker room.\"\n</p><p>Umm, just a side- just to clarify, Mama didn't wear- didn't it- technically... change clothes. She pretty much wore what she wore throughout the day as normal- I mean, it's not like she had a basketball outfit to change into- neither did she change into her gym shirt and shorts- her gym clothes, okay? That- not during the basketball practice, 'cause, you know- mm, just doing her job as water... as manager, okay? Her job as manager. Anyway, so in this instance,\n</p><p>\"Chris nods and stands up to go to the boy's locker room, where a couple members of the team left without saying a word to Chris.\" Alright then, \"Internal Manchester High School boy's locker room day. Locker door transition. Chris stands there lookin' at his forehead, [<i>Chris touches his forehead</i>] bumping the locker door mirror as the air conditioner rattled off in the background.\"\n</p><p>'Ra<i>dd</i>led', you used d's instead of t's; it should be 'ra<i>tt</i>led', not raddled. RATTLE. <b>T</b>. R-a-t-t-l-e-d.\n</p><p>\"He pokes at it and gives an occasional sound of pain from the test [?] swelling.\" \n</p><p>[<i>explaining</i>] He pokes at his forehead [<i>Chris pokes at his forehead</i>] to that. [<i>sigh</i>]\n</p><p>\"Giving-\"\n</p><p>You could just say, \"giving a <i>sigh</i>\" Not \"giving an autistic sigh\". \"<i>Giving a sigh!</i>\" You don't need the au- you don't need the a- you don't need the autistic adjective. \"Giving a sigh.\"\n</p><p>\"Giving a sigh, he shuts the locker door. Suddenly out of the blue, standing behind the locker door, a three-foot-three bright orange anthropomorphic hedgehog... [<i>long pause</i>] Suddenly out of the blue, standing... behind the locker...\"\n</p><p>I hate \"the hedgehog\". What? Just... What? You need the word 'appears' at the end; \"The bright orange anthropomorphic hedgehog <i>appears</i>\", obviously revealed to be Bionic because my tagline, Bionic. \n</p><p>\"'Hello.' Chris is then startled and lets out an... <a href=\"/cwcki/12_October_2009\" title=\"12 October 2009\">autistic screech</a>.\"\n</p><p>'Lets out, <i>a</i> screech.' A <b>screech</b>. Remove the 'autistic'. \"...Lets out a screech of fear.\"\n</p><p>\"In the process of screaming and... <a href=\"/cwcki/DIRTY,_CRAPPED_BRIEFS\" title=\"DIRTY, CRAPPED BRIEFS\">defecating</a> on his-\"\n</p><p>[tapping phone screen] YOU DO NOT NEED THAT LAST PART!\n</p><p>\"In the process of screaming, Chris hits his head on a locker door by accident and falls to the locker room floor.\"\n</p><p>[<i>Chris leans forward</i>] I'm lookin' at you again. \"defecating on yourself\" [<i>shaking fist</i>] <b><a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">I'M GONNA PUNCH YOU IN THE FACE FOR THAT!</a></b>\n</p><p>[<i>Looks at phone again.</i>] “He rolls from side-to-side in the pain, but quickly returns his attention to the orange-colored figure. Chris, in pain and shock, ‘Who- who, uh, wha- what are you?’”\n</p><p>Okay, and this is where I’m definitely gonna give you some more commentary on. Alright so, in this instance, uh, Bionic would introduce himself- I mean, I’m gonna just pretty much play amnesia for the purposes of, play the- Bionic has amnesia, for the purposes of this fanfic. Buuut, in this case, it would’ve been like Bionic’s… tr– came in from the other dimension where he was in, after he had been… had dreamed he had become long lost from Sonic. Alright?\n</p><p>And had gone into the basketball dimension where he– and... and every – and all that, just as Mama said when she wrote that story about Bionic.\n</p><p>I mean, I real- I, even upon retrospect, I can see upon the realization that, that, that, that could use some improvement; but eh, what you gonna do? At least Bionic does have an interest in mechanical engineering and basketball. Does very well in basketball.\n</p><p>So, in this case, it’d be like, ya know, just for the fic purposes. This fanfic is like, let’s just say: Bionic’s suddenly had amnesia from tran- from suddenly coming from the dimension he was in... th-... alternate dimension he was in earlier with the alien-type creatures and basketball and mechanical opportunities and all that, so. Let’s go from there, so.\n</p><p>Um. [<i>Starts reading fic again as Bionic.</i>] \"'Me? Well, I’m a hedgehog and on the matters of WHO I am. Um, that I have no idea. I just popped into existence and now I’m talking to you, in this smelly, sweaty room that’s covered in tall, metal doors, for some reason. What is this place, by the way?'\"\n</p><p>And, uh, alright. So, on this note that- I mean, sure, you can say that, um, that – that Chris ended up, uh, having to just spell it out for Bionic at this point, buuuttt – in reality, it’s just, you know, it would’ve been an instant mind-link, just… on the – instant. Um, Mama would’ve literally just… within, within milliseconds read Bionic’s mind and gotten the general idea of everything. He – nnj, and pulled the remaining answers, literally, from the cosmos and everything, of all that instance[?]. \n</p><p>So. In this instance, you’re just– you’re just like… what, not really just… doing that and just… you’re saying she’s, you’re saying she’s pulling it out of thin air, but nope! She’s accessing the cosmos AND Bionic’s subconscious memories. Alright? That’s what we’re doin’- that’s what’s going on here. Alright, so. Alright.\n</p><p>[<i>Looks back at phone to read fic as Chris.</i>] \"'This is a lock—uh, wait a minute, what do you mean popped into existence? What does that even mean?'\"\n</p><p>I mean, sure, you can also play out that, uh, Mama was not yet learning about her abilities, at that time, so. Yeah. There’s all that. Anyway, umm .. f –  [<i>Chris mumbles to himself.</i>] Awh, I lost my place. Alright, here we go.\n</p><p>[<i>Starts reading again as Bionic.</i>] \"'Well, I feel it’s self-explanatory. I wasn’t here one moment and the next, I was! Anything other than my current memories? Uhh, pfft – nng, shh..  [<i>Rubs head, acting out Bionic’s mannerisms.</i>] Yup! I’m afraid I can’t say anything for sure.\"'- Eh- \"Chris looked at the – looked at the small figure with a sense of awe and began to have an inner monologue.\"\n</p><p>Actually yeah, that definitely goes with what I said, just a short moment ago. Having the inner monologue and all that. Just… reading the situation. \n</p><p>[<i>Starts reading again.</i>] \"Not knowing that everything he’s saying was being spoken out loud and right in front of this creature’s overly cartoonish, rodent-like faccceeee… \" [<i>Begins to make strange faces at the camera.</i>]\n\"Then Chris says: 'Huh. Well, this is weird. Never in my whole life have I ever experienced something so bizarre. This guy – this hedgehog, looks just like Sonic, but he’s all orange instead of blue. Could this have something to do with me getting hit in the head with that… basketball?' Then Bionic says: 'Um, what’s a Sonic?' 'What?' 'You just said that I look like Sonic. Who or what is that?'\"\n</p><p>And like I said, from this point on, that this point; quoted from the cosmos and from s – and from my s-memory, yeah. So, she – so, she knew that, that the two of them were brothers.\n</p><p>[<i>starts reading again</i>] \"'Alright, well, um. He’s your brother! Sonic the Hedgehog is your brother.'... 'Um, okay? That makes sense, I guess. Umm, I guess I’ll just take your word for it until I can confirm this or whatever.' [<i>Chris groans.</i>] 'So, whooo am I?' 'Wait, what?' 'Um, I was just wondering since you know who my brother was, that you know who I am.'\"\n</p><p>Again, pulling from my subconscious memories and the cosmos with her abilities, \n</p><p>'Oh right, your name.' sss- someth- somehow strange that I know this, <i>your name that I somehow happen to know</i>. The name you were born with, your birth name, your name by birth'\"-\n</p><p>I mean, what's up with all... belaboring- deh- what's up with all this belaboring [<i>pfft</i>] thinkin' [<i>breaking character as Sonichu</i>] <i>I</i> was making this- thinking <i>she</i> was making this up? No, [<i>waves finger</i>] she was not making this up! Hhhe's like,\n</p><p>\"'Wha? Biiionic.' 'Bionic? Bionic the hedgehog?' 'Yes.' 'What, am I like a cyborg-robot-thing?' 'No.' 'Then why Bionic?' 'Because you're Sonic's brother' 'Aaand? What else is there?' 'You're also a basketball player.'\"\n</p><p>Also the fact that she just LITERALLY READ YOUR MIIIIND! <b>Literally read Bionic's miiind at the time. So yeah, oh. Okay, </b>\n</p><p>\"'You're basketball- you're Sonic's brother and you're a basketball player. Your name is Bionic; you were born with that.' 'Wait. Oh. What?' 'BASKETBALL! You know, b-ball, [<i>Chris makes a dribbling gesture</i>] hoops [<i>pretends to shoot a hoop</i>] and other similar sounding words like that?' 'Am I any good at it?'\n</p><p>Eh. Wait a minute. Sarcastically? [<i>points at his phone screen</i>] shhh- [<i>shakes head</i>] No. Would not be said sarcastically.\n</p><p>\"'Oh, among which he has the best. Your stil- your skills are on-par with legends like <a href=\"/cwcki/Niggos\" title=\"Niggos\">Michael Jordan, Shaq</a>, and... that's about all the basketball people I know at this point, actually.' 'I dunno, am I really that good?' 'Well, why don't we test it out for ourselves? C'MON, dude, let's go hit the gym.'\" Alright. \"Internal Manchester High School gymnasium, afternoon: Chris escorted Bionic to the gymnasium and hoped... to God he's actually good at basketball... so I won't be caught out on his bullshit.\" [<i>Chris gives an eerie hundred-yard-stare into the camera, then points to his phone</i>]\n</p><p>I feel like that oughta be, \"Chris escorted Bionic to the gymnasium and hoped to God that he's actually good at basketball and [<i>taps head</i>] <b>is right</b>.\" I'm finding that out. You're not calling out bullshit. There's no bullshit to be called out! It's a <b>fact</b>. Alright? So that was a <b>stupid statement</b> to make.\n</p><p>\"But in a series of three-pointers, making shot after shot after shot, it turned out the little orange...\"\n</p><p>NOT A BASTARD! YOU'RE NOT A BASTARD! Don't say bastard!\n</p><p>\"It turned out the little orange <i>hedgehog</i> knows how to shoot.\"\n</p><p>Alright? [<i>shaking finger</i>] Let's take these ads[?] seriously; I'm giving them to you. Alright, \n</p><p>\"Almost like when Chris introduced the suggestion to Bionic, it became reality.\"\n</p><p>Because it was reality beforehand. DUUUH.\n</p><p>\"Chris, with a look of ecstatic on his face, cheered on as Bionic went above and beyond what Chris ever expected. And then cut to a set of gymnasium doors revealing Joseph Herring.\"\n</p><p>Eeeh, and one more page I gotta go down here. Alright, now on this note, it's like you're- you- you could call this a viewing from... <a href=\"/cwcki/Dimensions#1218\" title=\"Dimensions\">1218</a> into <a href=\"/cwcki/Dimensions#C-197\" title=\"Dimensions\">C-197</a>. You could- you could say it like that for this instance, alright? Aaand, it's like, you know, [<i>taps head</i>] mama Chris at this time was one of the very few who could see- who could initially see that. Obviously with Joseph Herring here, so. Yeah. Mm, it's not like he doesn't say, \"hey Chandler,\" He says, \"Hey Chris.\"\n</p><p>\"'Hey Chris, what're you doing? Practice is over. Why are you still here?' And Chris turns to face Joseph, 'Hey Joe, you need to see this, this is ama-' Chris is about to find out that Bionic has di- disappeared with only a basketball laying on the laminated floor.\"\n</p><p>Yeah, but in this instance, Bionic clearly interacted- he had just interacted with the basketball. So... Yeah, at this point... he was like, partially visible to everybody- to Christi- to mama Chris and to everybody around her, so, in that one instance, Joe would have literally seen him. Alright, for a split-second, but then- but at that point- since Bionic was still learning about himself at the time... Yeah, he would have the instance- instinct of running away from Joes- from Joseph in the situation. So, yeah, that's the reason, alright? So, anyway, my basketball laying on the laminated floor, alright,\n</p><p>\"In a confused whisper, 'Um- um, Bionic?' 'Um, okay- well come on, your mom's waiting for you outside in the car. Seeya tomorrow, Chris.' 'Yeah. Uh, see you tomorrow.' And Chris walks out of the gymnasium shutting off the lights on his way out through the set of doors.\"\n</p><p>Mmm, didn't need to shut off the lights because- duddn't know where the light switch is- didn't know where the light switch was. Wasn- a custodian takes care of that.\n</p><p>\"The short- the door shuts as the afternoon sun casts a shadow on the lone basketball from the gymnasium's window. Awkward silence, fade out.\"\n</p><p>Alright, so anyway, so that's my two bolts. You could do better on this, Crimson Libertarian. You could do better on this- take everything I said and apply it to your writing, alright? Anyway, thank you for sharing this, and- uh, have a good day. Be safe. Thank you.\n</p>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a href=\"/cwcki/Chris_Chan_Sonichu_Intro_animation\" title=\"Chris Chan Sonichu Intro animation\">Chris Chan Sonichu Intro animation</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a class=\"mw-redirect\" href=\"/cwcki/Aggravating_Art_Visit\" title=\"Aggravating Art Visit\">CHRIS CHAN DRIP OUT</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251113210255\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.118 seconds\nReal time usage: 0.132 seconds\nPreprocessor visited node count: 276/1000000\nPost‐expand include size: 6185/2097152 bytes\nTemplate argument size: 1740/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 648/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   35.906      1 -total\n 76.92%   27.620      1 Template:Infobox/video\n 17.56%    6.306      1 Template:Fanart\n 13.25%    4.757      4 Template:Icon\n 11.03%    3.959      1 Template:SonichuPossession\n 10.73%    3.852      1 Template:Succession\n  9.13%    3.277     15 Template:Pipe\n  8.44%    3.030      1 Template:Rage\n  8.33%    2.992      1 Template:Crazy\n  8.27%    2.971      1 Template:Reason\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:32085-0!canonical and timestamp 20251113210255 and revision id 353401. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Sonichu_reads_and_critiques_a_Fanfic_by_The_Crimson_Libertarian&amp;oldid=353401\">http://sonichu.com/w/index.php?title=Sonichu_reads_and_critiques_a_Fanfic_by_The_Crimson_Libertarian&amp;oldid=353401</a>\"</div></div>",
  "categories": [
    "Sonichu Possession",
    "Chris-chan videos, 2020",
    "Videos Christian uploaded to YouTube"
  ],
  "links": [
    "sisteen-bit",
    "defecating",
    "Rage",
    "Chris Chan Sonichu Intro animation",
    "November 2020",
    "Joseph Herring",
    "DIRTY, CRAPPED BRIEFS",
    "CHRIS CHAN DRIP OUT",
    "spastically cry like an autistic baby",
    "CG-brought-to-life type of thing",
    "obesity",
    "Christine Chandler",
    "Michael Jordan, Shaq",
    "phase of role-playing",
    "Christine",
    "autistic screech",
    "somewhat overweight",
    "Chris's videos",
    "Sega mascot",
    "Videos",
    "Sonichu",
    "autism",
    "troll",
    "Twitter",
    "Bionic the Hedgehog",
    "Bionic",
    "while pretending to be",
    "a log",
    "Crazy",
    "Sonic World",
    "I'M GONNA PUNCH YOU IN THE FACE FOR THAT!",
    "Reason"
  ],
  "scraped_at": "2025-11-26T21:29:26.248248"
}