{
  "url": "https://sonichu.com/cwcki/Story_of_My_Current_Days",
  "title": "Story of My Current Days",
  "display_title": "Story of My Current Days",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>\"<b>Story of My Current Days</b>\" is an account of <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Chris</a>'s <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a> first written in his <i><a href=\"/cwcki/Animal_Crossing\" title=\"Animal Crossing\">Animal Crossing</a></i> diary in October <a href=\"/cwcki/2004\" title=\"2004\">2004</a>. On 31 March <a href=\"/cwcki/2005\" title=\"2005\">2005</a>, Chris updated and renamed it \"<b>Story of My Love Quest Days</b>\". On 14 August <a href=\"/cwcki/2006\" title=\"2006\">2006</a>, he updated it again, changed the name back to \"Story of My Current Days\", and expanded it with additional material describing his relationships with <a href=\"/cwcki/Hanna\" title=\"Hanna\">Hanna</a> and <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>.\n</p><p>Chris announced on 22 <a href=\"/cwcki/October_2009\" title=\"October 2009\">October 2009</a> that it is \"[T]o be MAJORLY UPDATED with most current events; NOT ALL OPINIONS expressed in the story are <a href=\"/cwcki/Chris_and_English\" title=\"Chris and English\">can</a><a href=\"/cwcki/Honor_roll\" title=\"Honor roll\">non</a> to current opinions and views\". Normally, \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Canon_(fiction)\" title=\"wikipedia:Canon (fiction)\">canon</a>\" only refers to the continuity of a work of fiction, and not to reality, but then, <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">it's hard to sort those two out when you're dealing with Chris</a>.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Story_of_my_current_days\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Story of my current days</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Story_of_my_Love_Quest_days\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Story of my Love Quest days</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Sources\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Sources</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Links\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Links</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Story_of_my_current_days\">Story of my current days</span></h2>\n<blockquote>\n<hr/>\n<p>Story of My Current Days\n</p><p>By. Christian W. Chandler.\n</p><p>October 18, <a href=\"/cwcki/2004\" title=\"2004\">2004</a>\n</p><p>Updated: August 14, <a href=\"/cwcki/2006\" title=\"2006\">2006</a>\n</p><p><a href=\"/cwcki/Honor_roll\" title=\"Honor roll\">Four Score and over Three Years Ago</a>, I, <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christian Weston Chandler</a>, have been currently experiencing my own Lonesome and Sad <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">Depression</a>. This is due to the following conditions: \n</p>\n<ol><li>I am a <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">Frustrated Virgin</a></li>\n<li>I need a pretty 18-(my current age)-year old, <a href=\"/cwcki/Boyfriend-free_girl\" title=\"Boyfriend-free girl\">Boyfriend-Free Girl</a>.</li>\n<li>I am very shy in approaching the girls, for I FEAR that they are all already paired up with some <a href=\"/cwcki/JERKS\" title=\"JERKS\">JERK</a> (a MAN, other than myself, CWC, and my father, <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Robert Franklin Chandler, Jr.</a>), which I've dubbed the fear, <a href=\"/cwcki/Noviophobia\" title=\"Noviophobia\">Noviophobia</a>, after the <a class=\"mw-redirect\" href=\"/cwcki/Spanish\" title=\"Spanish\">Spanish</a> word for \"Boyfriend.\"</li></ol>\n<p>Where did it start? I started when my life-long friend, <a class=\"mw-redirect\" href=\"/cwcki/Sarah_Hammer\" title=\"Sarah Hammer\">Sarah Hammer</a>, a very pretty girl, was taken away from me by this Magician <a class=\"mw-redirect\" href=\"/cwcki/Jerk\" title=\"Jerk\">Jerk</a>, <a href=\"/cwcki/Wes_Iseli\" title=\"Wes Iseli\">Wes Iseli</a>. At first, I was <a href=\"/cwcki/Na%C3%AFve\" title=\"Naïve\">naive</a> about their relationship. Later on, in Spring of <a href=\"/cwcki/2003\" title=\"2003\">2003</a>, I tried to pick up a girl in a class I was taking at <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">Piedmont Virginia Community College</a>, but she told me right-off, that <a href=\"/cwcki/So_Need_a_Cute_Girl\" title=\"So Need a Cute Girl\">SHE HAD A BOYFRIEND!</a> And it was like that with every other girl who I talked to since then. Thus, I developed my Noviophobia (mentioned above). Since my fear-development, I realized that I needed to attract a <a class=\"mw-redirect\" href=\"/cwcki/BOYFRIEND-FREE_Girl\" title=\"BOYFRIEND-FREE Girl\">BOYFRIEND-FREE Girl</a>, by any means necessary, with limited resources. I was afraid to even say Hi to any girl, so I made <a href=\"/cwcki/Attraction_Sign\" title=\"Attraction Sign\">a simple sign</a> that stated, \"I am a (my age then)-Year Old, Single Male, seeking an 18-(my age then)-Year Old, Single Female Companion.\" I had the sign placed next to me, with an arrow pointing at me, and of course, I stood, or sat, next to the sign. Not only was I not able to attract any girls, but some <a href=\"/cwcki/Trolls\" title=\"Trolls\">Bullies</a> (Men and <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Old Woman</a>) did not approve my method of attraction. Also, I feel that they perceived me as a sweet, weak person, which I was then, but I am much, much <a class=\"mw-redirect\" href=\"/cwcki/Comeuppance\" title=\"Comeuppance\">saltier</a> now. So that female dog, <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>, tore up my sign; it <a href=\"/cwcki/Heart_level\" title=\"Heart level\">SHATTERED my heart</a>. But I kept on trying to attract, in the name of LOVE and TRUST! This brings us to today. Recently, I was suspended from <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">PVCC</a>, for trying to attract a Boyfriend-Free Girl. Then I got HANDCUFFED by the <a href=\"/cwcki/Jerkop\" title=\"Jerkop\">JERKOPS</a> of the <a class=\"mw-redirect\" href=\"/cwcki/Fashion_Square_Shopping_Center\" title=\"Fashion Square Shopping Center\">Fashion Square Shopping Center</a>, and kicked out, for trying to attract a Boyfriend-Free Girl (I did not go to Jail). And I am currently still trying to attract a BF-Free Girl, without a sign, at the campus of the <a href=\"/cwcki/University_of_Virginia\" title=\"University of Virginia\">University of Virginia</a> (of which I am not enrolled in). Though I do park in a in a garage, and I pay for the time I use in my <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">Love Quest</a> (which I am having much LESS success there). So, I ask you, with <a href=\"/cwcki/So_Need_a_Cute_Girl\" title=\"So Need a Cute Girl\">my own song lyric</a>:\n</p>\n<table style=\"margin:0.5em auto; max-width:50em;\">\n<tbody><tr>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:41px; padding:0 16px 0 0; vertical-align:top; width:20px;\">“\n</td>\n<td style=\"border:none; font-size:1.2em; font-style:italic; padding:0; vertical-align:middle;\">Tell me why, I'm stuck in a Sad, Lonely Cage.<br/>\n<p>Tell me why, I so need a cute girl my age.<br/>\nTell me why, I ain't ever wanna hear you say,<br/>\n\"I HAVE A BOYFRIEND.\"\n</p>\n</td>\n<td style=\"border:none; color:#B2B7F2; font-family:'Times New Roman',Times,serif; font-size:3em; font-weight:bold; line-height:11px; padding:0 0 0 16px; vertical-align:bottom; width:20px\">”\n</td></tr></tbody></table>\n<p>As for <a href=\"/cwcki/Wes_Iseli\" title=\"Wes Iseli\">Wes</a>, I blame all of these happenings on him. If he had not taken <a class=\"mw-redirect\" href=\"/cwcki/Sarah_Hammer\" title=\"Sarah Hammer\">my life-long friend</a> away from me, <a class=\"mw-redirect\" href=\"/cwcki/Naive\" title=\"Naive\">I might have a Pretty Girlfriend today</a>. And I would not have had to set out on endeavoring LOVE QUEST!\n</p><p>Since, October, <a href=\"/cwcki/2004\" title=\"2004\">2004</a>, I've learned new, disturbing things. Like that having the sign next to, on or around me, represents, in a Body-Language way, shows that I may have some sort of <a href=\"/cwcki/Autism\" title=\"Autism\">mental condition</a>, or that I was seeking a girl, only for <a href=\"/cwcki/Chris_and_sex\" title=\"Chris and sex\">Hanky-Panky</a>. Of which is <a href=\"/cwcki/Honest_Content\" title=\"Honest Content\">not true at all</a>; I need a Girlfriend, Solely for <a class=\"mw-redirect\" href=\"/cwcki/Lies\" title=\"Lies\">LOVE and TRUST</a>! Also, as of early November, I was reemitted into the Fashion Square Shopping Center, and since Mid-December, I totally left the UVA as an <a href=\"/cwcki/Attraction_Location\" title=\"Attraction Location\">Attraction Location</a>. I realized that I have no problem conversing with girls (as in Instant Message), but to approach a girl is much, much tougher for me.\n</p><p>Also, I've learned from Wes that Sarah left him, and got herself paired up with another JERK (of which I later learned that his name was <a class=\"mw-redirect\" href=\"/cwcki/William_Spicer\" title=\"William Spicer\">William</a>). And I am not sure how to get in touch with her now.\n</p><p>I've also figured out some NEW methods of attraction: <a href=\"/cwcki/The_Tale_Of_The_Crazy_Pacer\" title=\"The Tale Of The Crazy Pacer\">pacing back-and-forth</a> while watching a GBAVideo on either my <a href=\"/cwcki/Nintendo\" title=\"Nintendo\">Game Boy Advance SP or my Nintendo DS</a>. I did manage to catch the attention of some girls, but they were all already paired-up with a JERK, or otherwise were updatable, due to their <a class=\"mw-redirect\" href=\"/cwcki/Religion\" title=\"Religion\">religion</a>. But I did get a hug or two. I also started singing random <a class=\"mw-redirect\" href=\"/cwcki/Music\" title=\"Music\">songs</a> from memory now and then. It was not as successful as the GBAVideo. I also started listening to my GBAJukebox MP3 Player and sang along when I felt like it (I had the GBAJukebox inserted into my Nintendo DS, that had a removable, more appropriate sign attached to it, in my hand). Also, I did manage to get a FREE Personal Ad in the April, <a href=\"/cwcki/2005\" title=\"2005\">2005</a> issue of <a class=\"mw-redirect\" href=\"/cwcki/NP_magazine\" title=\"NP magazine\">Nintendo Power magazine</a>, but who really reads the personals anyway? I also displayed my best artwork in either my hand, or next to me; still not many reactions.\n</p><p>One day in March, <a href=\"/cwcki/2005\" title=\"2005\">2005</a>, I now go to Fashion Square, on Tuesdays, Thursdays, and Saturdays, with my Nintendo DS, GBAVideos, GBAJukebox, my <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_Scrapbook\" title=\"Sonichu Scrapbook\">Sonichu Scrapbook</a>, and I've brought up some courage to start saying \"Hello\" to the girls I find very pretty, and possibly Boyfriend-Free.\n</p><p>Earlier this week, <a href=\"/cwcki/Hanna\" title=\"Hanna\">a girl</a>, who shall remain nameless in this story, finally noticed and approached me. I was hoping for a moment like this. And she asked me to have a beverage with her and talk about things. I was very ESTATIC, and <a href=\"/cwcki/Heart_level\" title=\"Heart level\">my SHATTERED Heart</a> had a speedy recovery back to 100% We had a nice \"Mini-Date,\" I maintained <a class=\"mw-redirect\" href=\"/cwcki/The_Creepy_Stare\" title=\"The Creepy Stare\">Eye-Contact</a>, I was very attentive, and I took notes about her. I thought she was very pretty, I enjoyed her charming wit, and I found her to be a very nice and lovely girl. J But, later on, as I was figuring out steps for future dates, I learned from a couple of <a class=\"mw-redirect\" href=\"/cwcki/Gal-Pals\" title=\"Gal-Pals\">Gal-Pals</a>, that I have previously made at the Shopping Center, that my new girlfriend was not serious; she was setting me up for a prank. I could not believe it at first, so I found and asked her myself. Unfortunately it was true. I was shocked, and my heart was re-shattered down to being 15% tact.\n</p><p>Then, on my next visit to the mall, I felt seriously depressed about what had happened the other day; it killed my attraction time. But it was a blessing in disguise; after I had eventually recovered, my heart was on a major repair rise, all the way back up to 58% I figured that during my major depression, my soul was resting and healing itself, and when it woke up, I arose with much excitement as well!\n</p><p>Yet, I still am Girlfriend-Free, but I now have a new attitude, courage and methods of attraction. Also, I'm feeling much, much luckier now!\n</p><p>Mid-May, <a href=\"/cwcki/2006\" title=\"2006\">2006</a>, \"I re-write this story from the inspiration I get from a very special someone who I've been Thinkin' About a sweet deal, and kept her close to my heart.\n</p><p>After starting at <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">Piedmont Virginia Community College</a> in <a href=\"/cwcki/2000\" title=\"2000\">Y2K</a>, I've lied a somewhat neutral, care-free life as I did my school work, play my video games, and anything creative I felt like doing. A bunch of times, I've played Sonic Booms with <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">da hedgehog</a>, as well as my <a class=\"mw-redirect\" href=\"/cwcki/Electric-Hedgehog_Pokemon\" title=\"Electric-Hedgehog Pokemon\">Electric-Hedgehog Pokemon</a>, <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a>. My Mind was Freed Up, yet I didn't have many friends or acquaintances. During the Summer of <a href=\"/cwcki/2003\" title=\"2003\">Y2K3</a>, I've made a few attempts to get a Girlfriend; sadly, EVERY GIRL I TALKED TO already had a... BOYFRIEND (LOUSY, LUCKY JERKS! TAKING ALL THE PRETTY GIRLS, LEAVING ME WITH NONE TO CHOOSE FROM)!\n</p><p>Given that I So Needed a Cute Girl who was Boyfriend-Free, I didn't want just any B.F.-Free Girl, I wanted one who had a strong will, a sweet caring attitude and at least somewhat pretty; a real Super Girl. Some people said I was too picky, but that was only their opinions; not mine. I'm bound for a click similar to that between <a href=\"/cwcki/Yu-Gi-Oh!\" title=\"Yu-Gi-Oh!\">the Dark Magician and his Girl</a>.\n</p><p>So, as of August, Y2K3, I did the most logical, sensible and inexpensive idea I could think of, I made <a href=\"/cwcki/Attraction_Sign\" title=\"Attraction Sign\">a simple sign</a> that stated, \"I am a 21-year old and Single Male Seeking and 18-21-year old SINGLE FEMALE COMPANION\", along with a basic description of qualities I felt were best suited, due to the fact that it describe MOST every Boyfriend-Free, 18-21year old Girl. Sadly though, not a single one even gave me a glanced, a momentary pause or even an excuse-making throat clearing to read the sign or give me the time of day. And the few who noticed... That EVIL WITCH OF THE <a href=\"/cwcki/Private_Villa_of_Corrupted_Citizens\" title=\"Private Villa of Corrupted Citizens\">PrivateVilla of Corrupted Citizens</a>, <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>, a bunch of <a href=\"/cwcki/Jerkop\" title=\"Jerkop\">Non-Blue or Black impersonating JERKOPS</a>, <a class=\"mw-redirect\" href=\"/cwcki/Manajerk\" title=\"Manajerk\">Manajerks</a> and every other (only a few total) son/daughter of a #&amp;*.. MOCKED ME AND EVEN CRUMBLED MY EFFORTS AND THREW THEM INTO MY FACE! IT WAS SERIOUS HEART-SHATTERING INSULTS LIKE THAT WHICH LITERALLY SHATTERED MY HEART TO ALMOST NOTHING AND MURDERED MY SOUL! Like as if I didn't already understand that Love Can't be Hurried; but they ALL left a HUGE IMPRESSION among the general population that having a Sweetheart was ILLEGAL IN <a href=\"/cwcki/Virginia\" title=\"Virginia\">VIRGINIA</a> thus, <a href=\"/cwcki/Virginia_is_for_Virgins\" title=\"Virginia is for Virgins\">\"VIRGINIA IS FOR VIRGINS, NOT LOVERS!\"</a> was what I had thought for a long time with the Dark Forces that were forced into me, bedding with my torturing past with the jerks of the <a href=\"/cwcki/Greene_County_Conspiracy\" title=\"Greene County Conspiracy\">Greene County School System</a> during the childhood years of my life. Thank God for blessing me with many happy years at <a class=\"mw-redirect\" href=\"/cwcki/Providence_Middle_School\" title=\"Providence Middle School\">Providence Middle School</a> and <a href=\"/cwcki/Manchester_High_School\" title=\"Manchester High School\">Manchester High School</a> in Chesterfield; rounding my feelings and attitude out for today.\n</p><p>For days to weeks to months to years, I Felt So Lonesome and Incomplete. But I didn't <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Stop!_In_the_Name_of_Love\" title=\"wikipedia:Stop! In the Name of Love\">STOP! In the name of Love</a>, and the fact that there had to be a Boyfriend-Free Girl out there, somewhere, for me to get to know, grow a strong companionship with and make into a <a href=\"/cwcki/Sweetheart_from_the_Ground-Up\" title=\"Sweetheart from the Ground-Up\">Sweetheart from the Ground-Up</a>, so in later years, after the inevitability of my parents leaving me, I WON'T BE ALONE. And I can eventually realize my dream of being a good husband, and father of a pretty girl named <a href=\"/cwcki/Crystal_Weston_Chandler_(daughter)\" title=\"Crystal Weston Chandler (daughter)\">Crystal</a>.\n</p><p>Eventually, light a magical lighthouse that randomly shone its healing guiding light upon my previously Shattered Heart and tortured Soul, and mended them back to good shape and form, <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">one girl</a> walked into my life, like <a href=\"/cwcki/Sailor_Megtune\" title=\"Sailor Megtune\">z Sailor Soldier</a> having just vanquished a heart-snatcher. Bit by bit, I've noticed her shining lustrous hair, here shiny Blue <a class=\"mw-redirect\" href=\"/cwcki/Sonic\" title=\"Sonic\">Chaos Emerald</a>-like Eyes, and a personality strong, caring and true like a Buttercup bloom. I followed <a href=\"/cwcki/Heart_level\" title=\"Heart level\">my recovered heart</a>'s instincts and Followed Her. As I got to know her over the months to over a year, my heart was growing stronger as I was falling for her. I blushed more Strawberry Pink than I have ever before; everything around me was shining like <a class=\"mw-redirect\" href=\"/cwcki/Yellow_is_a_Mellow_Color\" title=\"Yellow is a Mellow Color\">the sun's Mellow Color, Yellow</a>. Ah, For Her I Would travel even A Thousand Miles, just to be with her. Fortunately, she lives only about one hour from my house, and I meet her once a week at a closer-to-home social. This feeling, It was, and still is, so pure and true, it was like as if I was Born to Love Her. When She Smiles, I feel like I'm Walking on Sunshine as I give my replying smile and gaze into her eyes. And her hair is the softest and most warm-tingling. Cloud Nine? I feel like I'm on Ten.\n</p><p>Yet, one can't stay on such sweet passionate feelings without a few speed bumps in the road of life. Even though I didn't mean to give the impression that I was being forceful; for heaven's sake I wouldn't ever dare to force her to do anything she didn't want to, but she reminds me times that she isn't ready for Love beyond Friendship. I have no feelings against her wish, and I respect her decisions and feelings. Oh, but even though she Doesn't Say it, or return it, I Love Her, and no matter what, those feelings wills stand strong as time itself. And Sometimes I would want to touch her shoulder or back, feel her hair or give her a hug. I hold those urges back, because I care about her. And to keep myself from flying crazily off the handle at a random time, <a href=\"/cwcki/Mass_debating\" title=\"Mass debating\">I keep my hormones in check at least twice a week by myself</a>. I Won't Hang Up on what can develop into the True Thing, because I don't just Think, I know that I Love Her. My Love for her is So Pure and true, that not even Every One Love Song can spell it out as well as I am writing it now.\n</p><p>Every once in a while, I take a look into my Mirror Mirror of life, check the things I've seen and heard of. I've seen the <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Jet_City_Woman\" title=\"wikipedia:Jet City Woman\">Jet City Women</a>, and frankly I'm not thrilled. I can't help but feel sorry for them; True Love is Priceless and rarely street-found. <a href=\"/cwcki/Aqua_Teen_Hunger_Force\" title=\"Aqua Teen Hunger Force\">Aqua Teen Hunger Force</a> is fun to watch, because it's so stupid, it's funny, as well as some of the Non-<a href=\"/cwcki/Anime\" title=\"Anime\">Anime</a> programs on <a href=\"/cwcki/Adult_Swim\" title=\"Adult Swim\">Adult Swim</a>; lucky there's a <a href=\"/cwcki/Family_Guy\" title=\"Family Guy\">Family Guy</a>. I'm happy that I am no longer in the Heart-Shattered, Tired Soul Times; I was often so depressed, I could have been a Sofa King. So many stupid Ways I Wanted; I don't have to care too much about those paths now, but back then, sometimes I Couldn't Sleep so bad, I could have Bounced Off the Ceiling. Reflecting on those past Things Makes Me Go Hmm...\n</p><p>I always come to the conclusion that my future is solid now that my Me Plus One has a gelatinous conclusion. The Answer is the girl in the uniform that I've grown to Love.\n</p><p>While I do have deep scarlet desires for the eventual Party For Two en <a href=\"/cwcki/La_Cocina_en_La_Casa_de_Casanova\" title=\"La Cocina en La Casa de Casanova\">La Cocina en La Casa de Casa-No-Duh</a> (basically the <a href=\"/cwcki/Kitchen\" title=\"Kitchen\">Kitchen</a> in <a href=\"/cwcki/14_Branchland_Court\" title=\"14 Branchland Court\">my House</a>), I am in no rush for a kiss on Rainbow Road; I can wait for the longest time; except when it comes to my stomach or bladder or course. I am capable of showing her a good time with a nice dinner for two at <a href=\"/cwcki/McDonald%27s\" title=\"McDonald's\">a nice restaurant</a>, taking her to a movie or even a moonlit (or sunlit) rendezvous at the park; most whatever her heart desires. As long as I am Together With Her, especially in all of the neutral social locations, I am happy. J\n</p><p>The first time I see her smiling face on any day, it's like seeing the Morning Moon, shining with radiance. The only thing that keeps us limited to once a week is our respective Signals in the Sky. Each time I leave her, I hope I've left her with a smile and a warm feeling in her heart, as I do. It's In My Impressions, as well as what happens that day. No one can come close to her, because to me she is The Most Beautiful, and Caring Girl in the World.\n</p><p>Good Night, Good Morrow, for now I walk from the End of our time together; I will always look forward to our next Staff Party For Two. Is the Love between us truly a Destiny or a Warp-Pipe Dream; Our <a href=\"/cwcki/Sailor_Moon\" title=\"Sailor Moon\">Sailor Stars</a> will guide us. In the meantime, I can enjoy the two of us E-Mailing to Each-Other's Hearts.\n</p>\n<center>There is no Fin; We're still Living.\"</center>\n<p>Yet, there was a Finish; she had a Boy-Crush in the Military; Seriously Killed that Romantic mood. So, now After August 3, <a href=\"/cwcki/2006\" title=\"2006\">2006</a>...it's been THREE LONG YEARS, and I still Do Not have a Sweetheart (or even <a class=\"mw-redirect\" href=\"/cwcki/Sweetheart_from_the_ground_up\" title=\"Sweetheart from the ground up\">a girlfriend to build up into one</a>).\n</p><p>So, given that Summer is almost finished, although I've graduated from PVCC, I will be hanging out at the <a href=\"/cwcki/University_of_Virginia\" title=\"University of Virginia\">University of Virginia</a>'s Alderman Library on Tuesday and Thursday afternoons, hoping to be found by a Boyfriend-Free, 18-(my current age)-year old, caring, <a class=\"mw-redirect\" href=\"/cwcki/Tobacky\" title=\"Tobacky\">smoke-free</a>, <a class=\"mw-redirect\" href=\"/cwcki/Alcohol\" title=\"Alcohol\">non-alcoholic</a> <a href=\"/cwcki/Chris_and_race\" title=\"Chris and race\">white</a> girl who would pick me among all others as the Unsold Special Fish in the lonely Sea of Life.\n</p><p>I can also be found at The End game center and <a href=\"/cwcki/The_GAMe_PLACe\" title=\"The GAMe PLACe\">the Game &amp; Hobby Place</a> on Wednesdays and Fridays/Saturdays (respectively) (look under Interests for times).\n</p>\n<center>Pretty Girl in the wait, please come find me for a soda and conversational date.</center>\n<hr/>\n</blockquote>\n<h2><span class=\"mw-headline\" id=\"Story_of_my_Love_Quest_days\">Story of my Love Quest days</span></h2>\n<p>By. Christian W. Chandler.\n</p><p>October 18, <a href=\"/cwcki/2004\" title=\"2004\">2004</a>\n</p><p>Updated: March 31, <a href=\"/cwcki/2005\" title=\"2005\">2005</a>\n</p><p>\tI, Christian Weston Chandler, am currently experiencing my own Lonesome and Sad Depression. This is due to the following conditions:\n</p><p>1.\tI am <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">a Frustrated Virgin</a>\n2.\tI need a pretty 18-(my current age)-year old, <a class=\"mw-redirect\" href=\"/cwcki/Boyfriend-Free_Girl\" title=\"Boyfriend-Free Girl\">Boyfriend-Free Girl</a>.\n3.\tI am very shy in approaching the girls, for I FEAR that they are all already paired up with some <a class=\"mw-redirect\" href=\"/cwcki/JERK\" title=\"JERK\">JERK</a> (a MAN, other than myself, CWC, and my father, <a class=\"mw-redirect\" href=\"/cwcki/Robert_Franklin_Chandler,_Jr.\" title=\"Robert Franklin Chandler, Jr.\">Robert Franklin Chandler, Jr.</a>), which I’ve dubbed the fear, “<a href=\"/cwcki/Noviophobia\" title=\"Noviophobia\">Noviophobia</a>,” after the <a class=\"mw-redirect\" href=\"/cwcki/Spanish\" title=\"Spanish\">Spanish</a> word for… “Boyfriend.”\n</p><p>Where did it start? I started when my life-long friend, <a class=\"mw-redirect\" href=\"/cwcki/Sarah_Hammer\" title=\"Sarah Hammer\">Sarah Hammer</a>, a very pretty girl, was taken away from me by this Magician Jerk, <a href=\"/cwcki/Wes_Iseli\" title=\"Wes Iseli\">Wes Iseli</a>. At first, I was <a href=\"/cwcki/Na%C3%AFve\" title=\"Naïve\">naïve</a> about their relationship. Later on, in Spring of <a href=\"/cwcki/2003\" title=\"2003\">2003</a>, I tried to “pick up” a girl in a class I was taking at <a href=\"/cwcki/Piedmont_Virginia_Community_College\" title=\"Piedmont Virginia Community College\">Piedmont Virginia Community College</a>, but she told me right-off, that <a href=\"/cwcki/So_Need_a_Cute_Girl\" title=\"So Need a Cute Girl\">SHE HAD A BOYFRIEND</a>! And it was like that with every other girl who I talked to since then. Thus, I developed my Noviophobia (mentioned above). Since my fear-development, I realized that I needed to attract a BOYFRIEND-FREE Girl, by any means necessary, with limited resources. I was afraid to even say “Hi” to any girl, so I made a simple sign that stated, “I am a (my age then)-Year Old, Single Male, seeking an 18-(my age then)-Year Old, Single Female Companion.” I had <a href=\"/cwcki/Attraction_Sign\" title=\"Attraction Sign\">the sign</a> placed next to me, with an arrow pointing at me, and of course, I stood, or sat, next to the sign. Not only was I not able to attract any girls, but some “<a href=\"/cwcki/Trolls\" title=\"Trolls\">Bullies</a>” (Male and Female) did not approve my method of attraction. Also, I feel that they perceived me as a sweet, weak person, which I was then, but I am much, much saltier now. So that female dog, <a href=\"/cwcki/Mary_Lee_Walsh\" title=\"Mary Lee Walsh\">Mary Lee Walsh</a>, tore up my sign; <a href=\"/cwcki/Heart_level\" title=\"Heart level\">it SHATTERED my heart</a>. But I kept on trying to attract, in the name of LOVE and TRUST! This brings us to today. Recently, I was suspended from PVCC, for trying to attract a Boyfriend-Free Girl. Then I got HANDCUFFED by the <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">JERKOPS</a> of the <a class=\"mw-redirect\" href=\"/cwcki/Fashion_Square_Shopping_Center\" title=\"Fashion Square Shopping Center\">Fashion Square Shopping Center</a>, and kicked out, for trying to attract a Boyfriend-Free Girl (I did not go to Jail). And I am currently still trying to attract a BF-Free Girl, without a sign, at the campus of the University of Virginia (of which I am not enrolled in). Though I do park in a in a garage, and I pay for the time I use in my Love Quest (which I am having much LESS success there). So, I ask you, with my own song lyric:\n</p><p>“Tell me why, I’m stuck in a Sad, Lonely Cage.\nTell me why, I so need a cute girl my age.\nTell me why, I ain’t ever wanna hear you say,\n‘I HAVE A BOYFRIEND.’”\n</p><p>\tAs for <a href=\"/cwcki/Wes_Iseli\" title=\"Wes Iseli\">Wes</a>, I blame all of these happenings on him. If he had not taken my life-long friend away from me, I might have a Pretty Girlfriend today. And I would not have had to set out on endeavoring LOVE QUEST!\n</p>\n<ul><li>As of October 18, <a href=\"/cwcki/2004\" title=\"2004\">2004</a> to today, March 31, <a href=\"/cwcki/2005\" title=\"2005\">2005</a>*</li></ul>\n<p>Since, October 18, I’ve learned new, disturbing things. Like that having the sign next to, on or around me, represents, in a Body-Language way, shows that I may have some sort of mental condition, or that I was seeking a girl, only for <a href=\"/cwcki/Chris_and_sex\" title=\"Chris and sex\">Hanky-Panky</a>. Of which is not true at all; I need a Girlfriend, Solely for LOVE and TRUST! Also, as of early November, I was reemitted into the Fashion Square Shopping Center, and since Mid-December, I totally left the UVA as an Attraction Location. I realized that I have no problem conversing with girls (as in Instant Message), but to approach a girl is much, much tougher for me.  \n</p><p>\tAlso, I’ve learned from Wes that Sarah left him, and got herself paired up with another JERK (of which I later learned that his name was <a class=\"mw-redirect\" href=\"/cwcki/William_Spicer\" title=\"William Spicer\">William</a>). And I am not sure how to get in touch with her now.\n</p><p>\tI’ve also figured out some NEW methods of attraction: <a class=\"mw-redirect\" href=\"/cwcki/The_Tale_of_the_Crazy_Pacer\" title=\"The Tale of the Crazy Pacer\">pacing back-and-forth</a> while watching a GBAVideo on either <a href=\"/cwcki/Nintendo\" title=\"Nintendo\">my Game Boy Advance SP or my Nintendo DS</a>. I did manage to catch the attention of some girls, but they were all already paired-up with a JERK, or otherwise were updatable, due to their <a class=\"mw-redirect\" href=\"/cwcki/Religion\" title=\"Religion\">religion</a>. But I did get a hug or two. I also started singing <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">random songs</a> from memory now and then. It was not as successful as the GBAVideo. I also started listening to my GBAJukebox MP3 Player and sang along when I felt like it (I had the GBAJukebox inserted into my Nintendo DS, that had a removable, more appropriate sign attached to it, in my hand). Also, I did manage to get a FREE Personal Ad in the April, 2005 issue of <a href=\"/cwcki/Nintendo_Power\" title=\"Nintendo Power\">Nintendo Power</a> magazine, but who really reads the personals anyway? I also displayed my best artwork in either my hand, or next to me; still not many reactions.\n</p><p>\tNow, we are brought to March 31, 2005: I now go to Fashion Square, on Tuesdays, Thursday s, and Saturdays, with my Nintendo DS, GBAVideos, GBAJukebox, my Sonichu Scrapbook, and I’ve brought up some courage to start saying “Hello” to the girls I find very pretty, and possibly Boyfriend-Free.\n</p><p>Earlier this week, <a href=\"/cwcki/Hanna\" title=\"Hanna\">a girl, who shall remain nameless in this story</a>, finally noticed and approached me. I was hoping for a moment like this. And she asked me to have a beverage with her and talk about things. I was very ESTATIC, and <a href=\"/cwcki/Heart_level\" title=\"Heart level\">my SHATTERED Heart</a> had a speedy recovery back to 100%! We had a nice “Mini-Date,” I maintained <a class=\"mw-redirect\" href=\"/cwcki/The_Creepy_Stare\" title=\"The Creepy Stare\">Eye-Contact</a>, I was very attentive, and I took notes about her. I thought she was very pretty, I enjoyed her charming wit, and I found her to be a very nice and lovely girl. But, later on, as I was figuring out steps for future dates, I learned from a couple of <a class=\"mw-redirect\" href=\"/cwcki/Gal-Pals\" title=\"Gal-Pals\">Gal-Pals</a>, that I have previously made at the Shopping Center, that my new girlfriend was not serious; she was setting me up for a prank. I could not believe it at first, so I found and asked her myself. Unfortunately it was true. I was shocked, and my heart was re-shattered down to being 15% in tact.\n</p><p>\tThen, on my next visit to the mall, I felt seriously depressed about what had happened the other day; it killed my attraction time. But it was a blessing in disguise; after I had eventually recovered, my heart was on a major repair rise, all the way back up to 58%! I figured that during my major depression, my soul was resting and healing itself, and when it woke up, I arose with much excitement as well!\n</p><p>\tYet, I still am Girlfriend-Free, but I now have a new attitude, courage and methods of attraction. Also, I’m feeling much, much luckier now!\n</p>\n<div style=\"clear:both;\"></div>\n<h2><span class=\"mw-headline\" id=\"Sources\">Sources</span></h2>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Links\">Links</span></h2>\n<ul><li><a class=\"external text\" href=\"http://archives.neohapsis.com/archives/fulldisclosure/2007-11/0104.html\" rel=\"nofollow\">full text also available here</a></li></ul>\n<table align=\"center\" id=\"toc\" style=\"text-align:left; clear:both;\" width=\"70%\">\n<tbody><tr align=\"center\" style=\"background:#ccccff\">\n<td><b>The <a href=\"/cwcki/Chris_and_writing\" title=\"Chris and writing\">writings</a> of <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Chris-Chan</a></b>\n</td></tr>\n<tr>\n<td style=\"font-size:11px; padding:5px 10px;\">\n<p><b>Poetry:</b>\n\"<a href=\"/cwcki/Valentines_Day_Hymn\" title=\"Valentines Day Hymn\">Valentines Day Hymn</a>\" |\n\"<a href=\"/cwcki/For_My_True_Love,_I_Would%E2%80%A6\" title=\"For My True Love, I Would…\">For My True Love, I Would…</a>\" |\n\"<a href=\"/cwcki/Hard_Love_Quest\" title=\"Hard Love Quest\">Hard Love Quest</a>\" |\n\"<a href=\"/cwcki/I_Want_a_Girlfriend_for_Christmas\" title=\"I Want a Girlfriend for Christmas\">I Want a Girlfriend for Christmas</a>\" |\n\"<a href=\"/cwcki/Saddest_Heart_in_the_World\" title=\"Saddest Heart in the World\">Saddest Heart in the World</a>\" |\n\"<a href=\"/cwcki/Song_of_Christian\" title=\"Song of Christian\">Song of Christian</a>\" |\n\"<a href=\"/cwcki/Sonichu%27s_Ode_to_Rosechu\" title=\"Sonichu's Ode to Rosechu\">Sonichu's Ode to Rosechu</a>\" |\n\"<a href=\"/cwcki/An_Inspired_Poem_for_Jackie\" title=\"An Inspired Poem for Jackie\">An Inspired Poem for Jackie</a>\" |\n\"<a href=\"/cwcki/PAIN_Enduring_since_October_29,_2013\" title=\"PAIN Enduring since October 29, 2013\">PAIN Enduring since October 29, 2013</a>\" |\n\"<a href=\"/cwcki/Ride_or_Die\" title=\"Ride or Die\">Ride or Die</a>\" |\n\"<a href=\"/cwcki/The_Knights_of_CWC_chats_(July_2021)#Weston_haiku\" title=\"The Knights of CWC chats (July 2021)\">Weston Haiku</a>\"\n</p><p><b>Prose:</b>\n\"<a href=\"/cwcki/How_the_Pok%C3%A9mon_Came_into_Our_Pok%C3%A9Balls\" title=\"How the Pokémon Came into Our PokéBalls\">How the Pokémon Came into Our PokéBalls</a>\" |\n\"<a href=\"/cwcki/A_Week_With_Christian_Chandler\" title=\"A Week With Christian Chandler\">A Week With Christian Chandler</a>\" |\n\"<a href=\"/cwcki/My_big_18th_party\" title=\"My big 18th party\">My big 18th party</a>\" |\n\"<a href=\"/cwcki/Bionic_the_Hedgehog_(short_story)\" title=\"Bionic the Hedgehog (short story)\">Bionic the Hedgehog</a>\" |\n\"<a href=\"/cwcki/Sonichu_%26_Rosechu%E2%80%A6_The_Genesis_of_the_Lovehogs\" title=\"Sonichu &amp; Rosechu… The Genesis of the Lovehogs\">Sonichu &amp; Rosechu… The Genesis of the Lovehogs</a>\" |\n<i><a href=\"/cwcki/Sonichu%27s_News_Dash\" title=\"Sonichu's News Dash\">Sonichu's News Dash</a></i> |\n\"<a href=\"/cwcki/Chris_%2B_Sarah%27s_Life-Shares\" title=\"Chris + Sarah's Life-Shares\">Chris + Sarah's Life-Shares</a>\" |\n\"<a class=\"mw-selflink selflink\">Story of My Current Days</a>\" |\n<a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_letter_to_Blanca\" title=\"Chris's letter to Blanca\">Chris's letter to Blanca</a> |\n\"<a href=\"/cwcki/The_High_School_Story\" title=\"The High School Story\">The High School Story</a>\" |\n\"<a href=\"/cwcki/A_Sonichu_and_Rosechu_Christmas_Story\" title=\"A Sonichu and Rosechu Christmas Story\">A Sonichu and Rosechu Christmas Story</a>\" |\n<a href=\"/cwcki/Chris%27s_Response_to_the_Terrorism_Attacks_in_Paris\" title=\"Chris's Response to the Terrorism Attacks in Paris\">Chris's Response to the Terrorism Attacks in Paris</a> |\n<a href=\"/cwcki/Chris%27s_letter_to_Cathy_Weseluck\" title=\"Chris's letter to Cathy Weseluck\">Chris's letter to Cathy Weseluck</a> |\n<a href=\"/cwcki/Chris%27s_letter_to_Kelly_Sheridan\" title=\"Chris's letter to Kelly Sheridan\">Chris's letter to Kelly Sheridan</a> |\n\"<a href=\"/cwcki/Sonichu_13\" title=\"Sonichu 13\">The Awakening of a CPU, AKA The Idea Guy Corruptions</a>\" |\n<a href=\"/cwcki/THE_DIMENSIONAL_MERGE_IS_HAPPENING_NOW!\" title=\"THE DIMENSIONAL MERGE IS HAPPENING NOW!\">THE DIMENSIONAL MERGE IS HAPPENING NOW!</a> |\n<a href=\"/cwcki/Psychic_California_Trip\" title=\"Psychic California Trip\">Psychic California Trip</a> |\n<a href=\"/cwcki/Sonichu_Journal_Pages\" title=\"Sonichu Journal Pages\">Sonichu Journal Pages</a> |\n<a href=\"/cwcki/Whispering_Spell_(Restore_Magic)\" title=\"Whispering Spell (Restore Magic)\">Whispering Spell (Restore Magic)</a> |\n<a href=\"/cwcki/Dimensional_Barrier_Shatter_Spell\" title=\"Dimensional Barrier Shatter Spell\">Dimensional Barrier Shatter Spell</a> |\n<a href=\"/cwcki/Goochland_Library_Sermon\" title=\"Goochland Library Sermon\">Goochland Library Sermon</a> |\n<a href=\"/cwcki/SNT_Vs_Sonichu_2.5-Plus\" title=\"SNT Vs Sonichu 2.5-Plus\">SNT Vs Sonichu 2.5-Plus</a> |\n<a href=\"/cwcki/Weston_Haiku\" title=\"Weston Haiku\">Weston Haiku</a> |\n<a class=\"mw-redirect\" href=\"/cwcki/Jail_letters\" title=\"Jail letters\">Jail letters</a> |\n<a href=\"/cwcki/Goddess_Log\" title=\"Goddess Log\">Goddess Log</a>  |\n\"<a href=\"/cwcki/Angelica_Rosechu%27s_Christmas_Play\" title=\"Angelica Rosechu's Christmas Play\">The Life and Times of Jesus Christ</a>\" |\n<a href=\"/cwcki/Breaking_the_Veil\" title=\"Breaking the Veil\">Breaking the Veil</a>\n</p><p><b>See Also:</b>\n<a href=\"/cwcki/Signature\" title=\"Signature\">Signature</a>  |\n<a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">Sonichu (comic)</a>\n</p>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20251022030803\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.078 seconds\nReal time usage: 0.087 seconds\nPreprocessor visited node count: 194/1000000\nPost‐expand include size: 2650/2097152 bytes\nTemplate argument size: 196/2097152 bytes\nHighest expansion depth: 4/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   19.258      1 -total\n 20.01%    3.853      1 Template:Writings\n 17.87%    3.441      1 Template:W\n 17.65%    3.399      1 Template:Quote\n 15.31%    2.948      1 Template:Articleofthenow\n 15.26%    2.939      1 Template:Clear\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:8094-0!canonical and timestamp 20251022030803 and revision id 328506. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Story_of_My_Current_Days&amp;oldid=328506\">http://sonichu.com/w/index.php?title=Story_of_My_Current_Days&amp;oldid=328506</a>\"</div></div>",
  "categories": [
    "Articles of the Now",
    "Historical Documents",
    "Journals",
    "Love Quest"
  ],
  "links": [
    "can",
    "the sun's Mellow Color, Yellow",
    "2003",
    "Chris's letter to Cathy Weseluck",
    "Y2K3",
    "Sailor Stars",
    "2005",
    "Non-Blue or Black impersonating JERKOPS",
    "Chris-Chan",
    "Megan Schroeder",
    "A Sonichu and Rosechu Christmas Story",
    "PAIN Enduring since October 29, 2013",
    "Spanish",
    "white",
    "PVCC",
    "it SHATTERED my heart",
    "Manchester High School",
    "z Sailor Soldier",
    "Goddess Log",
    "Attraction Location",
    "Psychic California Trip",
    "Hanky-Panky",
    "Piedmont Virginia Community College",
    "my Game Boy Advance SP or my Nintendo DS",
    "Greene County School System",
    "Whispering Spell (Restore Magic)",
    "Adult Swim",
    "Jail letters",
    "Frustrated Virgin",
    "smoke-free",
    "Crystal",
    "SHATTERED my heart",
    "Nintendo Power",
    "Nintendo Power magazine",
    "Noviophobia",
    "my own song lyric",
    "songs",
    "Kitchen",
    "University of Virginia",
    "Bullies",
    "my life-long friend",
    "William",
    "2004",
    "the sign",
    "Electric-Hedgehog Pokemon",
    "a nice restaurant",
    "random songs",
    "Sweetheart from the Ground-Up",
    "The High School Story",
    "Boyfriend-Free Girl",
    "a girl, who shall remain nameless in this story",
    "a simple sign",
    "Sonichu",
    "La Cocina en La Casa de Casa-No-Duh",
    "JERKOPS",
    "SHE HAD A BOYFRIEND!",
    "For My True Love, I Would…",
    "Four Score and over Three Years Ago",
    "a girlfriend to build up into one",
    "My big 18th party",
    "How the Pokémon Came into Our PokéBalls",
    "Fashion Square Shopping Center",
    "\"VIRGINIA IS FOR VIRGINS, NOT LOVERS!\"",
    "pacing back-and-forth",
    "Chris's letter to Blanca",
    "Love Quest",
    "Chris's Response to the Terrorism Attacks in Paris",
    "mental condition",
    "the Game & Hobby Place",
    "Goochland Library Sermon",
    "my House",
    "Mary Lee Walsh",
    "not true at all",
    "Sonichu Scrapbook",
    "Sonichu Journal Pages",
    "Bionic the Hedgehog",
    "Hanna",
    "Family Guy",
    "Sonichu's News Dash",
    "Ride or Die",
    "SHE HAD A BOYFRIEND",
    "my SHATTERED Heart",
    "VIRGINIA",
    "Gal-Pals",
    "Animal Crossing",
    "I keep my hormones in check at least twice a week by myself",
    "Weston Haiku",
    "non",
    "LOVE and TRUST",
    "Sonichu's Ode to Rosechu",
    "naïve",
    "non-alcoholic",
    "THE DIMENSIONAL MERGE IS HAPPENING NOW!",
    "Manajerks",
    "An Inspired Poem for Jackie",
    "PrivateVilla of Corrupted Citizens",
    "I Want a Girlfriend for Christmas",
    "Robert Franklin Chandler, Jr.",
    "my recovered heart",
    "Old Woman",
    "Aqua Teen Hunger Force",
    "Game Boy Advance SP or my Nintendo DS",
    "Christian Weston Chandler",
    "the Dark Magician and his Girl",
    "da hedgehog",
    "Valentines Day Hymn",
    "a girl",
    "Providence Middle School",
    "Breaking the Veil",
    "Chaos Emerald",
    "Sonichu & Rosechu… The Genesis of the Lovehogs",
    "Dimensional Barrier Shatter Spell",
    "it's hard to sort those two out when you're dealing with Chris",
    "saltier",
    "SNT Vs Sonichu 2.5-Plus",
    "religion",
    "Chris + Sarah's Life-Shares",
    "A Week With Christian Chandler",
    "The Awakening of a CPU, AKA The Idea Guy Corruptions",
    "Chris",
    "Sonichu (comic)",
    "Song of Christian",
    "Wes Iseli",
    "Depression",
    "Chris's letter to Kelly Sheridan",
    "BOYFRIEND-FREE Girl",
    "2006",
    "The Life and Times of Jesus Christ",
    "Jerk",
    "Wes",
    "Sarah Hammer",
    "October 2009",
    "naive",
    "Signature",
    "Hard Love Quest",
    "JERK",
    "Y2K",
    "Anime",
    "Eye-Contact",
    "I might have a Pretty Girlfriend today",
    "a Frustrated Virgin",
    "one girl",
    "Saddest Heart in the World",
    "writings"
  ],
  "scraped_at": "2025-11-26T15:52:46.326089"
}