{
  "url": "https://sonichu.com/cwcki/Telling_It_To_All_of_You,_and_the_Hasbro_Executives_and_Staff",
  "title": "Telling It To All of You, and the Hasbro Executives and Staff",
  "display_title": "Telling It To All of You, and the Hasbro Executives and Staff",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><b>Telling It To All of You, and the Hasbro Executives and Staff</b> is a video Chris uploaded on 18 <a href=\"/cwcki/March_2024\" title=\"March 2024\">March 2024</a>, where he rants about <i><a href=\"/cwcki/My_Little_Pony:_Pony_Life\" title=\"My Little Pony: Pony Life\">My Little Pony: Pony Life</a></i> and <i><a href=\"/cwcki/My_Little_Pony:_Make_Your_Mark\" title=\"My Little Pony: Make Your Mark\">My Little Pony: Make Your Mark</a></i>, trying to conclusively prove that the Generation 5 <a href=\"/cwcki/My_Little_Pony\" title=\"My Little Pony\">My Little Pony</a> is, in fact, <a href=\"/cwcki/Russia\" title=\"Russia\">Russian</a> propaganda. This is perhaps Chris at his most <a href=\"/cwcki/Conspiracy_theories\" title=\"Conspiracy theories\">tin-foil hat-est</a>, with him drawing numerous connections between wholly unrelated things, including MLP being licensed to release in Russia, the death of a Hasbro higher-up from cancer, and some American supermarkets pulling Russian-made vodka as proof that G5 and <i>Pony Life</i> are intended as pro-Russian propaganda that would paint their invasion of Ukraine in a positive light. He also flip-flops between saying MLP G5 is Russian propaganda, and that it doesn't exist at all (in this timeline), theoretically mutually exclusive things. He notably uses this very <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> as source, in addition to <a href=\"/cwcki/Wikipedia\" title=\"Wikipedia\">Wikipedia</a>, <a href=\"/cwcki/Reddit\" title=\"Reddit\">Reddit</a> and the fan wiki for My Little Pony. He reveals his Reddit account as u/VirtualActuator7381.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Video\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Video</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Description\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Description</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Transcript\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Transcript</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Notes\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Notes</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Video\">Video</span></h2>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>Telling It To All of You, and the Hasbro Executives and Staff</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/hEIb2zyS3Uo\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Search for video</b>\n</td>\n<td><a class=\"external text\" href=\"https://www.youtube.com/results?search_query=Telling+It+To+All+of+You%2C+and+the+Hasbro+Executives+and+Staff\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/vidsearch?q=Telling+It+To+All+of+You%2C+and+the+Hasbro+Executives+and+Staff\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td>10 <a href=\"/cwcki/March_2024\" title=\"March 2024\">March 2024</a> (Released 18 <a href=\"/cwcki/March_2024\" title=\"March 2024\">March 2024</a>)\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">GOPony</span><a href=\"/cwcki/My_Little_Pony_Protests\" title=\"GOPony\"><img alt=\"GOPony\" decoding=\"async\" height=\"32\" src=\"/w/images/a/a9/G5placeholder.png\" width=\"32\"/></a> <a href=\"/cwcki/My_Little_Pony_Protests\" title=\"My Little Pony Protests\">GOPony</a> <span style=\"display:none\">Television</span><a href=\"/cwcki/Chris_and_television\" title=\"Television\"><img alt=\"Television\" decoding=\"async\" height=\"32\" src=\"/w/images/7/75/Television.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_television\" title=\"Chris and television\">Television</a> <span style=\"display:none\">Merge Saga</span><a href=\"/cwcki/Dimensional_Merge\" title=\"Merge Saga\"><img alt=\"Merge Saga\" decoding=\"async\" height=\"24\" src=\"/w/images/d/d2/Merge_Saga.png\" width=\"24\"/></a> <a href=\"/cwcki/Dimensional_Merge\" title=\"Dimensional Merge\">Merge</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Performance Style</b>\n</td>\n<td><span style=\"display:none\">Crazy</span><a href=\"/cwcki/Autism\" title=\"Crazy\"><img alt=\"Crazy\" decoding=\"async\" height=\"32\" src=\"/w/images/1/10/Crazy.png\" width=\"32\"/></a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Saga</b>\n</td>\n<td><span style=\"display:none\">Revelations</span><a href=\"/cwcki/Saga#Revelations_Saga_(16_October_2023_-_Present)\" title=\"Revelations\"><img alt=\"Revelations\" decoding=\"async\" height=\"32\" src=\"/w/images/1/1a/Revelationsicon.png\" width=\"32\"/></a> <a href=\"/cwcki/Saga#Revelations_Saga_(16_October_2023_-_Present)\" title=\"Saga\">Revelations</a>, <span style=\"display:none\">Praetor</span><a href=\"/cwcki/Praetor\" title=\"Praetor\"><img alt=\"Praetor\" decoding=\"async\" height=\"32\" src=\"/w/images/8/8b/PraetorIcon.png\" width=\"32\"/></a> <a href=\"/cwcki/Praetor\" title=\"Praetor\">Praetor</a>\n</td></tr>\n<tr>\n<td colspan=\"2\" style=\"background-color:#3366CC; color:#ffffff; color:#ffffff;-moz-border-radius:10px; font-size:120%; padding:0.25em; text-align:center;\">OFFICIAL and HONEST CWC <a class=\"mw-redirect\" href=\"/cwcki/Videos\" title=\"Videos\">Videos</a>\n</td></tr>\n<tr style=\"text-align:center; font-size:95%;\" valign=\"top\">\n<td><b>previous</b> <br/><a class=\"mw-redirect\" href=\"/cwcki/AI_Chris_Chan_Vs_Christ_Chan_Bloom\" title=\"AI Chris Chan Vs Christ Chan Bloom\">AI Chris Chan Vs Christ Chan Bloom</a>\n</td>\n<td><b>next</b> <br/><a class=\"mw-redirect\" href=\"/cwcki/AI_Chris_Chan_Vs_Christ_Chan_-_Yo_Ya\" title=\"AI Chris Chan Vs Christ Chan - Yo Ya\">AI Chris Chan Vs Christ Chan - Yo Ya</a>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Description\">Description</span></h3>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>As Foreknown and confirmed with research, MLPG5 And Pony Life not only are really bad, and that they do not exist in this Timeline, but they all were originally Licensed By Russia.  Truth, direct and addressed.\n</td></tr></tbody></table>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p>[<i>deep breath</i>] Hey everybody, <a href=\"/cwcki/Messiah_complex\" title=\"Messiah complex\">Jesus Christ</a>-ine Weston Chandler Sonichu Prime once again, right here, and today, [<i>clap</i>] we're delving into, the why, as we have confirmed, and also preminursed - premonitionary details - <b>I HAVE KNOWN</b> THIS ENTIRE TIME... <i>why</i>... MLP G5... and even Pony Life... no good! No good. Just, no good. So, that being said, hm, as I'm finally gonna ex- tell y'all right now in a video, and... it's already been noted worldwide and it's been popularly overwhrurmed, you know what, even some, they just-they essentially-they ack-they spedacknowitch and they appreciate, but then it's like... \n</p><p><big><b><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/A_Few_Good_Men\" title=\"wikipedia:A Few Good Men\">THEY COULDN'T HANDLE THE TRUTH!</a> AND NEITHER COULD YOU, YOU FAKERS AND HATERS AND TOXIC DARKEST SINNERS!</b></big> I'm shedding light and truth!\n</p><p>Very good, very divine, ahhhhh... alright, now, let's get down to it.\n</p><p>Alright, so let's- so let's get down for the starters. We're essentially, I just forse-I foresaw even before Pony Life and long before My Little Pony: Friendship is Magic, Season 9 Episode <i>24</i>. Because obviously I just knew it before, I knew the Episode 26 of that season was just [<i>snap</i>] no good. Luster Dawn, non-existent, and future tense, too premature. And why? Heh, it all becomes shortly as we process through this lovely set. So, let's start with right here with my expansion pack from within an expansion pack. This, lovely <a href=\"/cwcki/YES_to_MLPFiMSeasons10to14\" title=\"YES to MLPFiMSeasons10to14\">YES to MLPFiM Seasons 10 to 14</a>, it's a mini-expansion that was put in with Night Star and Friends Expansion Pack of <a href=\"/cwcki/Twilight_Sparkle%27s_Secret_Shipfic_Folder\" title=\"Twilight Sparkle's Secret Shipfic Folder\">Secret Shipfic Folder</a>.\n</p><p>(<i>grunt</i>) And obviously, yeah, we are gonna get Friendship is Magic and Equestria Girls <b>re. sumed.</b> Without the influence of <i>that country</i>, in question, that started the war recently, and there's all those sanctions and everything. Hm. Anyway. So we've got all those cards. But yeah, I made this within 2-within the year 2019, that's your little reference point. But yeah, obviously, I just, was able to foretell everything, I knew this beforehand, and I said explicitly over and over again, and obviously just... heh. We know your game, you greedy corporate excuses and everything. I mean, <a href=\"/cwcki/Night_Star\" title=\"Night Star\">Night Star</a> is saying that, not me, Night Star. But then obviously, heh, I'm there, I'm giving my share of, my two points, my two bolts in the heart about it as well. [<i>deep breath</i>] Huh. Anyway. [<i>deep breath</i>] Yeah.\n</p><p>There's, appreciate this moment and where we are right now. We're gonna get, Equestria Girls, <i>and</i> Friendship is Magic resumed. But now, let's dive deeper. Alright, so I found these back on February... 22nd, upon further exploration and confirmation of all that. So I ended up finding this Reddit page, where... let's just, I mean... well, past tense. Still there. Anyway. So obviously we got this, uh, media right here. Uh, the marketing calendar. Now, this was posted three years ago, obviously. Of course, it includes Pony Life. And obviously you got, the people... oh yeah. What's the original source used by the Rubbsian website? This screenshot doesn't exactly seem... scream \"official communication\", <b>darn right</b>. And he, and this guy found on an account that, has been posting the offic-, all the official, n-news of that... of the... Russian propaganda there. But yeah, not faked, it's- [jibberish]. Anyway, he also found a reference to this, which, there's a website to the Russian illegality, but of course, then, the PDF, which I have open right here, of all the screenca - the scaps all this media. So we got all this, and then right underneath... yeah. Look at the Russian. Look at all the Russian there. And it's been closed down, the website that we'll go to in a moment, where, Pony Life and G5 <b>Russian license.</b> B- and of course, uh, you'll know all these... continued Russian... even this. And that. And of course that. And, even just these... all that. Now let's go back here for a moment and I'll tell you again... so... yeah, uh, here we go. \"Though, I'm still puzzled why there's a <i>Russian</i> MLP flier before, [<i>high pitched</i>] <i><b>before</b></i>, we can see an <i>English</i> one.\" Yeah, but we also got news, from Russia about, the, movie and the fact there would be an hour-long special. Yeah. Yeah. Anyway, so, there's those details. Now on this website, they even cited that, uh, oh yeah, right here, September 17th, 2020, there's no allegedleh, there's no allegedly, it's fact, it's just fact, they attended the Rush-oh, Rushing license summit. So yeah. And with that, G-Pony Life and G5, <i>totally Russian</i> <i><b>licensed!</b></i>\n</p><p>Now let's take another note also from right here. So, September 4th, 24th, 2021, was when that, fe, when that film, was released, this generation does not exist in this timeline, at all. Period. We'll get to that a little bit later. Now, take a note of this, now. It is I- In the credits of that movie, the executive producer, somebody of uh, the Hasbro chair of executives, Brian Gohner. The late <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Brian_Goldner\" title=\"wikipedia:Brian Goldner\">Brian Goldner</a>. And, he passed on on October 11th, 2021. We go from September 24th, 2001, his name in the credits, and nearly a month later, he was given the ax. He was given - he was asked. So yeah obviously just, even I connected with his soul and everything, he had <b>regrets</b>. About G5, period, as well as Pony Life, <i>and</i> the Russian connections. And just obviously, everybody there. I forget what this one is. Oh yeah, and then, right. Following Ryan's death in the courts unfortunately, links with <a href=\"/cwcki/Christian_Love_Day\" title=\"Christian Love Day\">my birthday</a>, Russia attacks Ukraine, 2022 February. Yeah. So we got all this going on. So, <i>I told you before</i>, <a href=\"/cwcki/Conspiracy_theories\" title=\"Conspiracy theories\">we got the connections,</a> Pony Life and G5, Russian license, the movie came out, the, the business chief executive of Hasbro passes on, and then, World War III. Period. The timing and everything is so important, you guys, appreciate that, app-reciate that.\n</p><p>Now let's take another note, also, cause I do have this file pulled up. <a href=\"/cwcki/File:Executiveprotestcard.jpg\" title=\"File:Executiveprotestcard.jpg\">\"Telling it to the Executives\"</a>. And guess who's in the picture! Huh! And this card was made back in 2019! 2019! And, all this happened. I told it to him, and it, [<i>raspberry</i>] what happened. You think about that. It's divine timing, regardless of what happened, or the possibility of Russia influence - like you know, <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Poisoning_of_Alexander_Litvinenko\" title=\"wikipedia:Poisoning of Alexander Litvinenko\">slipping a little something in his drink or whatever</a>. The-that's an alternate timeline. But obviously you know what happened in this time. He wasn't feeling well in the office, so yeah that likelihood is still there as well, and then just, [<i>blowing air</i>] but yeah he had, he had his cancer problem. Anyway, sorry, on that, just much appreciation for this individual, and realizing that he was in the wrong in regards to G5 and Pony Life. And then, yeah. Much appreciate. But it's also, like, give an honorable mention to these other two, I had foreknowingly - foresightedly put into this very card. Steve Zoltick, executive vice president and chief information officer, and Lisa Gersh, outside zybe- <a class=\"mw-redirect\" href=\"/cwcki/Computers\" title=\"Computers\">outside zyber advisor</a>, former chief executive off-officer, noted Alexander Wang, that's where, she als- that's where she works at. So yeah. These top three, influential individuals right there.\n</p><p>Now, moving forward, back to what happened shortly after Russia attacked Ukraine, all of those <b>sanctions</b>. Over five- well over five hundred against Russia, because you know, obviously, Putin, the Kremlin, and all that, and the fact Russia is literally the modern day Babylon. The dragons, the kings. I'll tell you what, even, I'll throw in a connection with China's government and all that. Dragon. Xi Jinping, the banana peel. I'm quite aware of the <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/2022_COVID-19_Protests_in_China\" title=\"wikipedia:2022 COVID-19 Protests in China\">paper protest</a>. And I do support those - I actually participate in that protest. They were against the government and the Chinese government, not perfect. Just, fortunately, that's a minority out of the majority, <a href=\"/cwcki/Chris_and_race#Asians\" title=\"Chris and race\">being more spiritual</a>, with the <a href=\"/cwcki/Meditation\" title=\"Meditation\">zen</a> and Chinese <a href=\"/cwcki/Zodiac\" title=\"Zodiac\">zodiac</a>, and all that good - all that authentically good stuff. Anyway. Now, let's talk about one reas- one thing that came about from those sanctions, which, this is true, this is to be the fate of MLP G5, (<i>heavy breath</i>) yeah. <i>Several</i> supermarkets and states have removed the Russian made <a href=\"/cwcki/Chris_and_drugs#Alcohol\" title=\"Chris and drugs\">vodka</a>, the <b>vodka</b>, from their shelves in response to Russia's invasion of Ukraine. You think about that moment. Mm-hm. Mm-hm. Just. Mm-hm. I mean, you've got Russia that, just, being a bad, mad, really mad, bad bully against Ukraine, that wanted peace and good. And then what does Putin do? He's like [<i>comedy voice</i>] \"Oh sure, I'll give you some more peace! Let's negotiate!\" and then \"Let's do peace talks!\" but then guess what? (<i>punch</i>) He attacks them again. He's just, he's constantly lying behind his back, he's got those fingers crossed behind his back. Sheesh, I mean shoot. Heh. Oh, let me also just throw in this as an honorable mention, as well in relation to Vlad-I mean Vladimir Putin - <a href=\"/cwcki/Pmurt\" title=\"Pmurt\">Donald Trump</a>. I mean the fact that all of you were like, uh, you mischronicle me as like, President of the United States, and just being really bad, arrogant, and everything, I mean shoot. <a href=\"/cwcki/Get_Out,_You_D***_Nazis\" title=\"Get Out, You D*** Nazis\">I am not a freaking Nazi</a>. I do not support Nazism. I am a part, I am part <a href=\"/cwcki/CWC_Ancestry\" title=\"CWC Ancestry\">Ashkanansin [sic] Jewish</a>, physically, and spiritually as well, <a href=\"/cwcki/Chris_and_religion\" title=\"Chris and religion\">so I'm multi-religious</a>. And look at this! I'm wearing this loud and proud! You take note of this pin right here. You take note of that pin. I am very proud of that. And I propose and support what is good, light-powered, and righteous. It has nothing to do with the political governments, or whatever misconceptions from hatred and demons and devils and doubts y'all have and may have. I do these protests, I'm doing this right now, because it is divinely right and sold. MLP G5, <i><b>non</b></i>-existent in this timeline, <i>because</i> that and Pony Life, Russian influenced, and Russia, over 99% <b>toxic</b>. It's gonna go down like <b>Babylon.</b> Period. And I'll say one more time, Putin shall die by his own sword, as I have drawn while I was in jail. Foreknowingly.\n</p><p>Anyway, so getting back to this, now, obviously, we got the details in gards to resuming Friendship is Magic Equestria Girls. Just, you know the last three episodes, premature. Well actually, episode 26 of season 9, totally premature, but just 24 and 26, that two-parter. Um, I'd say I'd give it a decent pass, but it's like <i>weh</i>, totally, that's why totally delayed on watching any of those three episodes, period. Hm. And, just, hold that. Now let's talk another detail. So even - the AI Microsoft bank helped me out here, so let's look at the popular feelings about Pony Life. Now just obviously, reception of Pony Life, yadda yadda yadda, yeah, some, yeah I mean just, something like Teen - Teen Titans Go, yeah, anyway, it's just the whole comparison and contrast. But still, definitely avoids character assassination, and what not. Definitely right on point. But Pony Life - Russia influenced, like G5, definitely. But after just watching... obnoxious - obnoxious like Russia. <a href=\"/cwcki/Chris_and_oratory\" title=\"Chris and oratory\">Constant stream of noise</a>, <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Art\" title=\"Chris and Art\">zany art style</a>, and <a class=\"mw-redirect\" href=\"/cwcki/Things_Chris_has_Ripped_Off\" title=\"Things Chris has Ripped Off\">lack of cleverness</a> and <a class=\"mw-redirect\" href=\"/cwcki/Random_Access_Humor\" title=\"Random Access Humor\">humor</a>... heh. It's like Russia does not an, does not want to promote any cleverness. Period. There's no... there's just no heart, no soul, and autistic- if you know anything about Russia, and uh, every time that the government is over-polluting with the - <a href=\"/cwcki/Chris_and_religion\" title=\"Chris and religion\">there's hardly any churches over there!</a> They hardly... and there's hardly any spiritual goodness, no spiritual accus- uh, spiritual promotion in that... because, the gov- uh, the Russian government, were like no. The Soviet Union, no. Fortunately, the Soviet Union is long gone for right now, but we still gotta get rid of Putin, and Donald Trump. They gotta go down to the fire and brimstone. Just as stated in the Bible between... Revelations and, uh, Exodus, the last book in the Old Testament<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[1]</a></sup>. God. Anyway. I know the outcome of that story. You have to... I've read it and reread it. So yeah. Oh yeah. But yeah. It is... it is just overhead. There's just lack of quality in that. And just that's what Russia is. Lack of authentic, good, light-powered, righteous, quality. Just too much evil within that. And I gotta support and give props to those of the minority that remain in Russia right now that are good, light-powered, and righteous. Stay strong, the toxicity, the evil, <b>going down!</b>\n</p><p>Now let's compare - let's talk about the pop-, the feelings of G5. Now, of course everyone has mixed feelings... Jeez. Look at this - less positive, more negative. Eh. Just, range of emotions. Yeah. Anyway. Not excitement, moreover rage. Just forget about G5. Period. It does not exist! And I'm not the only one that feels this way! Even <a class=\"mw-redirect\" href=\"/cwcki/Dr._Wolf\" title=\"Dr. Wolf\">Dr. Wolf</a> is like, \"Make Your Mark Chapter 5 is...\" What exactly? And look at that expression of emotion right there! That's on point. And... doesn't know what it wants to be, because it does not exist! So there. Just, no, no. And even <a class=\"mw-redirect\" href=\"/cwcki/Mad_Munchkin\" title=\"Mad Munchkin\">Mad Munchkin</a> is like \"Hell no!\" It sucks! It sucks! Gen 5 sucks! She knows it! Dr. Wolf knows it. Even Lightning Bliss took a look at it, but, uh, it's like \"Final thoughts before G5 movie release\", I mean, she saw that from a mile away too, just... especially on places like... Yeah. So, I'm not the only one.\n</p><p>And let's talk about more recently, because <i><b>THEY COULDN'T HANDLE THE TRUTH!</b></i> <a href=\"/cwcki/Equestria_Daily\" title=\"Equestria Daily\">Equestria Daily</a> acknowledged the fact that G5 doesn't exist in the very timeline. Let's take a closer look at that Tweet, because that had been deleted. Mm-hm. Does not exist, yes! I'm gonna read this out loud, cause all of you should appreciate this as well.\n</p><p>\"Anything <a class=\"mw-redirect\" href=\"/cwcki/MLP_G5\" title=\"MLP G5\">MLP G5</a> is simply not meant to be. The typical reasons include the executives being <a href=\"/cwcki/Financhu_Crisis\" title=\"Financhu Crisis\">money-hungry,</a> wanting something \"Fresh and New\", and competing with the likes of Disney with the video technology and all when they never, ever, ever, ever, had to, as well as laying off the original staff of MLP G4 to cut costs and whatnot.  But moreover, G5 was literally foretold, by me, and everyone agrees after the fact, that it was to be simply awful and out of place. And this is not due to quality of art, story, characters, or whatever. It goes deeper, metaphysically deeper, as not only there is a lot more to explore and chronicle with Princess Twilight Sparkle and everyone else, including the background ponies, of Equestria and Earth (counting <a href=\"/cwcki/Equestria_Girls\" title=\"Equestria Girls\">Equestria Girls</a>, because that IS canon, period), including <a href=\"/cwcki/DRWolf\" title=\"DRWolf\">Doctor Wolf</a> and the <a class=\"mw-redirect\" href=\"/cwcki/OCs\" title=\"OCs\">OCs</a> of the fandom being literally canon. And existent in Equestria, period.\n</p><p><a class=\"mw-redirect\" href=\"/cwcki/Friendship_is_Magic\" title=\"Friendship is Magic\">Friendship is Magic</a> and Equestria Girls was perfect in quality, Not counting the premature Season 9, Episode 26 \"Future\" episode, and the additional five seasons that is to be manifested that gives it better quality, because they are not to be influenced by Russia, eh, I'm gonna throw in China, the government of China in that as well, so it gets better quality from that, character growths and closures.  <a href=\"/cwcki/Vinyl_Scratch\" title=\"Vinyl Scratch\">DJ Pon3</a> has a voice (<a href=\"/cwcki/Nowacking\" title=\"Nowacking\">Jesse Nowacking</a> is the poised perfect voice actor for her, hands down), Dr. Wolf, Lightning Bliss and the others interact with everyone in Ponyville, Canterlot and all. Nightstar Sonichu, the Half-Unicorn, Half-Sonichu, with dimensional and psychic powers is there and has personally worked with Twilight and her friends as well. This is not \"head-canon\", this IS, it IS canon in this timeline, and in general, period.\n</p><p>And the resuming of G4 will only bring about better peace and order restoration with everyone, in general, and metaphysically, and spiritually as well. And on top of that, the executives have lost since G5 began, <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Death\" title=\"Chris and Death\">LOST, LOST, LOST,</a> pardon me. And they still have the chance to redeem themselves and Hasbro by simply cancelling G5, completely shelving it (like a write- like a write-off like <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Coyote_Vs._Acme\" title=\"wikipedia:Coyote Vs. Acme\">Coyote Vs Acme</a>, present tense), removing G5 from all streaming services and downloads and removing every single trace of it from YouTube. The fanbase should cease to produce or even talk about G5 right this very instant and now, no more pins, no more fanart, nothing! Nothing of <i>Pip</i>... S-Sunny... Zip and all them. <b>Down in the fire and flames!</b> The cleansing blue flames! And if they stick around, if they like, continue to linger, they just [<i>raspberry</i>] they go in the fire and brimstone also. [<i>deep breaths</i>] This, the fan... obviously, it is by Divine Will and Timing. I know this, personally, cause I've connected with literally... through the universe core and matrix of our universe right here, the u- the core and matrix of this very timeline, all the way to the alpha-omega point of all existence and its core and matrix. '<b>The'</b> definite source and beyond. So I know this unconsciously, subconsciously, consciously and backed up with all my cloud scythes within the cosmos. I mean, <b>NOBODY</b> has ever asked for G5 nor even Pony Life, and now is the time, more than ever to resume G4, Equestria Girls and Friendship is Magic, before everything gets worse, period. This is not just a feeling, or opinion, this is cold hard fact. From the literal core and matrix of this universe, core and matrix of this timeline, along with divine will. And drama can go somewhere else with the toxic ones that linger. But in short, forget everything MLP G5 and Pony Life, right freaking now, and the longer - no longer acknowledge it, because it does not exist in this timeline, and had-courage Hasbro to resume Friendship is Magic and Equestria Girls right freaking now. Divine order. Worldwide peace. Peace of and... within the Brony community... <a href=\"/cwcki/Chris_and_English#Spelling\" title=\"Chris and English\">oh, look at them, they put a G in that as well, some like, maybe I mistyped it,</a> anyway, like, eh, whatever within the Brony community that I am a part of regardless, along with the authentic love that superceeds greed, money, hatred and toxicities.\"\n</p><p>I mean, shish-shoot. I was acknowledged, and, you know what, you've got the file, I mean you saw the Tweet right here, I'm just ashamed - I'm just sorry I missed that Tweet that day and did not get a chance to like it. But look at the page where all of that was on. That very page. Look. And then, compare it with this, like you know, \"Evil for Ban\", and \"Significance of Lyra and Bon Bon\", and look at this. \"Significance of Lyra and Bon Bon\", this bullet point! I was right there! I was right there! I was right there. Heh. Even Hasbro was like, can, \"Equestria Greatly\", gave a whole bunch of knocks on the door in response to that, they're like, [<i>grunting</i>] You know what? Let's bring that image right on. It's just on point. I TOLD IT TO THOSE EXECUTIVES, AND THEY CHICKENED OUT! Then they... and they're like to Equestria Daily... but hey no. Hm. I'm telling it to the executives right now, the ones that remain, YOU CAN'T HANDLE THE TRUTH! So yeah, it's divine will, divine told. And if G5 is not shelved right now, when, when Hasbro has a chance to redo- redeem themselves, during the limited time, it's just gonna be divinely willed and done period, with G4 being resumed, with Adobe Flash, and all the original animation programs. No CG, and nothing that came about in the likes of Pony Life... or uh... that Russian propaganda, which is G5, as well as Pony Life, which that is also Russian propaganda. So yeah, it outta be dissolved, destroyed, totally wiped, even every single piece of merchandise, including <i>any</i> of those G5 <b>towels</b>, that, or blankets, as it were, if it was, put in that one leak, that Lightning Bliss also responded to at that one point. [<i>sigh</i>]\n</p><p>Ayyyup. [<i>Sonic sound</i>] Well, that was divinely timed right there. Ha ha. So yeah, let's zap it up to the extreme, I'll see you all later. Hm.\n</p><p>Mm hm. Mm hm. Mm hm. R-redeem yourselves. You know what to do, people at Hasbro. You know what to do. Original staff of G4. Hire them all back. Get rid of everybody and everything G5. Maybe bring some of them back on for like, uh, guest details and what not for the resuming of G4, <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/John_de_Lancie\" title=\"wikipedia:John de Lancie\">John de Lancie</a>, as <a href=\"/cwcki/My_Little_Pony:_Friendship_is_Magic#Discord\" title=\"My Little Pony: Friendship is Magic\">Discord</a>, is gonna be like \"Okay, I'm sorry. So, this future episode that premiered at the end of Season 9, hm, yeah, I'm sorry, that's not canon right now, so we're gonna take you back, to the earlier time when, Princess Twilight had actually just made it in, to being Princess of El- Equestria. Oh, and I will admit: Luna and Celestia, they still do their sun and dream work, despite taking retirement. <a href=\"/cwcki/Chris_and_work\" title=\"Chris and work\">There's no escaping their divine duties, period.</a> Yeah. Obviously. Go with the original writing. And as John de Lancie well, really support that guy by the way. He he. <a class=\"mw-redirect\" href=\"/cwcki/Random_Access_Humor\" title=\"Random Access Humor\">I'm gonna make this reference one more time, cause it will, it'll still work well.</a> \"So, what about Discord?\" \"What about him?\" \"No, the episode. What'd you think of the episode? What about Discord?\" \"What about him?\" He he ha. That's just so funny on loop. It's still appropriate. Alright. Y'all take care, a blessed safe day. Let's do this. It's divinely timed, and willed, and rightly so. Light-powered, good, righteousness. [<i>snap</i>]\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Notes\">Notes</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\">Exodus is the <i>second</i> book of the Old Testament. The actual last book of the Old Testament is <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Book_of_Malachi\" title=\"wikipedia:Book of Malachi\">Malachi</a>, which does not speak about damnation and \"fire and brimstone\", and it certainly doesn't name-drop Trump and Putin some 2500 years before they were born. That Chris missed something as obvious as the fact that Exodus comes before Revelations, the <i>last</i> book of the Bible, throws doubt on his claim that he's some kind of biblical scholar.</span>\n</li>\n</ol></div>\n<table style=\"width: 90%; max-width: 600px; height: 70px; margin: 1em auto 1em auto; border: 0.15em outset #000; background: #eee; vertical-align: centered; color:#000;\">\n<tbody><tr>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\">⇐ <a class=\"mw-redirect\" href=\"/cwcki/AI_Chris_Chan_Vs_Christ_Chan_Bloom\" title=\"AI Chris Chan Vs Christ Chan Bloom\">AI Chris Chan Vs Christ Chan Bloom</a><span style=\"color: #000\"></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><span style=\"color: {{{textcolor}}}\"><strong><a href=\"/cwcki/List_of_videos\" title=\"List of videos\">Chris's videos</a></strong></span>\n</td>\n<td style=\"width: 33%; max-width: 200px; text-align: center; color:#000;\"><a class=\"mw-redirect\" href=\"/cwcki/AI_Chris_Chan_Vs_Christ_Chan_-_Yo_Ya\" title=\"AI Chris Chan Vs Christ Chan - Yo Ya\">AI Chris Chan Vs Christ Chan - Yo Ya</a><span style=\"color: #000\"></span> ⇒\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20250602084011\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.091 seconds\nReal time usage: 0.106 seconds\nPreprocessor visited node count: 415/1000000\nPost‐expand include size: 8214/2097152 bytes\nTemplate argument size: 3197/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 1392/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   41.336      1 -total\n 71.13%   29.403      1 Template:Infobox/video\n 12.80%    5.290      1 Template:GOPony\n  9.34%    3.861      6 Template:Icon\n  7.55%    3.121      1 Template:Dimensional_Merge\n  6.63%    2.741      1 Template:Praetor\n  6.52%    2.695      1 Template:Quotebox\n  6.51%    2.690      1 Template:Revelations\n  6.33%    2.617      1 Template:Television\n  6.09%    2.518      1 Template:Crazy\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:38435-0!canonical and timestamp 20250602084010 and revision id 330467. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Telling_It_To_All_of_You,_and_the_Hasbro_Executives_and_Staff&amp;oldid=330467\">http://sonichu.com/w/index.php?title=Telling_It_To_All_of_You,_and_the_Hasbro_Executives_and_Staff&amp;oldid=330467</a>\"</div></div>",
  "categories": [
    "Category",
    "Chris-chan videos, 2024"
  ],
  "links": [
    "Videos",
    "Ashkanansin [sic] Jewish",
    "zany art style",
    "Jesse Nowacking",
    "outside zyber advisor",
    "Equestria Girls",
    "zen",
    "Reddit",
    "Praetor",
    "tin-foil hat-est",
    "CWCki",
    "Television",
    "Wikipedia",
    "Doctor Wolf",
    "Russian",
    "Constant stream of noise",
    "Night Star",
    "Merge",
    "Equestria Daily",
    "I am not a freaking Nazi",
    "Friendship is Magic",
    "there's hardly any churches over there!",
    "money-hungry,",
    "March 2024",
    "Dr. Wolf",
    "lack of cleverness",
    "My Little Pony",
    "my birthday",
    "There's no escaping their divine duties, period.",
    "Secret Shipfic Folder",
    "MLP G5",
    "LOST, LOST, LOST,",
    "Mad Munchkin",
    "AI Chris Chan Vs Christ Chan - Yo Ya",
    "YES to MLPFiM Seasons 10 to 14",
    "we got the connections,",
    "Donald Trump",
    "Chris's videos",
    "zodiac",
    "OCs",
    "DJ Pon3",
    "Jesus Christ",
    "humor",
    "GOPony",
    "so I'm multi-religious",
    "I'm gonna make this reference one more time, cause it will, it'll still work well.",
    "AI Chris Chan Vs Christ Chan Bloom"
  ],
  "scraped_at": "2025-11-26T14:48:42.057778"
}