{
  "url": "https://sonichu.com/cwcki/This_is_how_the_Trial_went",
  "title": "This is how the Trial went",
  "display_title": "This is how the Trial went",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Court-screenshot.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"168\" src=\"/w/images/thumb/7/7c/Court-screenshot.png/300px-Court-screenshot.png\" srcset=\"/w/images/thumb/7/7c/Court-screenshot.png/450px-Court-screenshot.png 1.5x, /w/images/thumb/7/7c/Court-screenshot.png/600px-Court-screenshot.png 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Court-screenshot.png\" title=\"Enlarge\"></a></div><a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> Circuit Court</div></div></div>\n<p><b>This is how the Trial went</b> is an account from two <a href=\"/cwcki/CWCki_Forums\" title=\"CWCki Forums\">CWCki Forums</a> users, Cyan and Indigo, on what happened during the 10 <a href=\"/cwcki/July_2012\" title=\"July 2012\">July 2012</a> arraignment of <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> and <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">Barb</a> in regards to the <a href=\"/cwcki/28_October_2011\" title=\"28 October 2011\">28 October 2011</a> charges. The text presented here is as it was posted on the CWCki Forums on 10 July, with slight modifications for wiki styling and linking.\n</p><p>Some of Cyan and Indigo's commentary regarding legal terminology is inaccurate. A trial did not occur as Chris and Barb had made plea bargains which the court accepted. Chris did not technically plead guilty - he made an Alford plea,<sup class=\"reference\" id=\"cite_ref-chriscase_1-0\"><a href=\"#cite_note-chriscase-1\">[1]</a></sup> a type of guilty plea in which a defendant simultaneously claims innocence but acknowledges that the evidence may result in a conviction.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Cyan's_account\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Cyan's account</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#The_Trial.\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">The Trial.</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Indigo's_account\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Indigo's account</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Initial_Observations\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">Initial Observations</span></a></li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#The_Pleas\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">The Pleas</span></a></li>\n<li class=\"toclevel-2 tocsection-6\"><a href=\"#Barbara's_Turn\"><span class=\"tocnumber\">2.3</span> <span class=\"toctext\">Barbara's Turn</span></a></li>\n<li class=\"toclevel-2 tocsection-7\"><a href=\"#Chris's_Turn\"><span class=\"tocnumber\">2.4</span> <span class=\"toctext\">Chris's Turn</span></a></li>\n<li class=\"toclevel-2 tocsection-8\"><a href=\"#The_Aftermath\"><span class=\"tocnumber\">2.5</span> <span class=\"toctext\">The Aftermath</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-9\"><a href=\"#Chris's_confirmation\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Chris's confirmation</span></a></li>\n<li class=\"toclevel-1 tocsection-10\"><a href=\"#Footnotes\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Footnotes</span></a></li>\n<li class=\"toclevel-1\"><a href=\"#Notes\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Notes</span></a></li>\n<li class=\"toclevel-1\"><a href=\"#References\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">References</span></a></li>\n</ul>\n</div>\n<h2><span id=\"Cyan.27s_account\"></span><span class=\"mw-headline\" id=\"Cyan's_account\">Cyan's account</span></h2>\n<p>Imma be nice and give you guys a darker colour for this wall of text. \n</p><p>Sorry for taking so long. <a class=\"mw-redirect\" href=\"/cwcki/Youtube\" title=\"Youtube\">Youtube</a> was being <a class=\"mw-redirect\" href=\"/cwcki/Autistic\" title=\"Autistic\">Autistic</a> and couldn't get a minute-long video uploaded very quickly...\n</p><p>First I'd like to prove we were there. The video isn't that exciting, just a newspaper with the date, the courthouse, and a little greeting for you guys. We are keeping ourselves anonymous. I know some of you somehow came under the impression that the video might be of Chris or the Trial. Sorry. Between being called a troll and an attention whore, I really just don't feel like getting arrested for you guys.  =T\n</p><p>Anyways, our little drive-by video. (No, the driver isn't <a href=\"/cwcki/DayOut\" title=\"DayOut\">holding the camera</a>. We aren't Chris.)\n<strike><a class=\"external autonumber\" href=\"http://www.youtube.com/watch?v=Jja-xjhLmsQ&amp;feature=youtu.be\" rel=\"nofollow\">[1]</a></strike> <i>(dead link, please replace)</i>\n</p><p>Better detail of the newspaper. My camera's shitty and it made the date fuzzy. Luckily it's still easily recognizable as the same newspaper.\n<a class=\"external autonumber\" href=\"http://i1147.photobucket.com/albums/o551/CyanandIndigo/100_1210.jpg\" rel=\"nofollow\">[2]</a>\n</p><p>And a screenshot of passing the courthouse, so you can clearly see where we are. Should be at 15-16 sec\n<a class=\"external autonumber\" href=\"http://i1147.photobucket.com/albums/o551/CyanandIndigo/Court-screenshot.png\" rel=\"nofollow\">[3]</a>\n</p>\n<h3><span class=\"mw-headline\" id=\"The_Trial.\">The Trial.</span></h3>\n<p>It was quite unlike what the majority speculated. There were some humorous moments, <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a> got to speak, and both he and <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">Barbra</a> pleaded guilty. \n</p><p>Barbra was the first to go. When the Judge began asking the usual questions, (such as \"do you fully understand the charges you face?\") Barbra asked if she could have <a href=\"/cwcki/Rob_Bell\" title=\"Rob Bell\">Bell</a> answer for her. The judge wasn't very patient with her, and Barbra seemingly attempted to protest. The Judge sharply told her, \"These questions are between you and me, you have to answer the questions yourself.\"\n</p><p>Barbra simply answered \"Yes\" to all of his standard questions, plead guilty, and sat back down. On an unrelated note, she seems to have <a href=\"/cwcki/Obesity\" title=\"Obesity\">lost some weight</a>. She isn't a very large woman.\n</p><p>The prosecution got to have a speech before it was Christian's turn to take the stand. I can't remember everything they said, but the important parts were that <a class=\"mw-redirect\" href=\"/cwcki/Snyder\" title=\"Snyder\">Snyder</a> didn't want Chris and Barb to be stuck with a felony charge, there was another witness that called the <a href=\"/cwcki/Jerkop\" title=\"Jerkop\">police</a>, (the manager of the nearby <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Staples_Inc.\" title=\"wikipedia:Staples Inc.\">Staples</a>), and that he hoped that the plea bargain would be accepted by the judge. \n</p><p>\nBell took a turn to speak, and wanted to formally introduce Chris to the Judge. He surprisingly introduced Chris as \"<a href=\"/cwcki/Autism\" title=\"Autism\">High-functionally Autistic</a>\" which is an outdated term and not part of the Autism spectrum. He also briefly told the Judge about Chris and Barbra's lives, and tried to explain the situation with the game place from the Chandlers' perspective. At one point he called Chris an \"Adult-autistic-child\", which Chris scowled at. He also made note that if the plea bargain was accepted, Chris would be assimilated into the world, taught how to contribute to society, and would get psychiatric evaluations and treatment. Chris mumbled something and seemed really distressed by all of this. </p><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:Chrisstrial_zpsb16cd19d.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"382\" src=\"/w/images/thumb/c/c3/Chrisstrial_zpsb16cd19d.png/300px-Chrisstrial_zpsb16cd19d.png\" srcset=\"/w/images/thumb/c/c3/Chrisstrial_zpsb16cd19d.png/450px-Chrisstrial_zpsb16cd19d.png 1.5x, /w/images/c/c3/Chrisstrial_zpsb16cd19d.png 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Chrisstrial_zpsb16cd19d.png\" title=\"Enlarge\"></a></div>Courtroom sketch by Cyan</div></div></div>\n<p>When Chris was brought to the stand, he stress-sighed first thing. He then repeated his mother's earlier question, in hopes to get Bell to speak for him. The judge shot him down the same way he did his mother, and proceeded to ask the questions.\n</p><p>This is where things got amusing.\n</p><p>\"Is your full name Christian Weston Chandler?\"\n</p><p>\"Yes, but my birthname is <a href=\"/cwcki/Christopher%27s_name_change\" title=\"Christopher's name change\">Christopher Weston Chandler</a>. Now it's Christian.\"\n</p><p>\"So your full name is Christopher Weston Chandler?\"\n</p><p>\"N-no. My name is Christian. My birth name was Christopher, but we changed it years ago.\"\n</p><p>\"Do you understand that you are to be charged the court fees, should you accept the plea bargain?\"\n</p><p>\"Yes. <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Money\" title=\"Chris and Money\">My mother will be taking care of that</a>.\"\n</p><p>\"Do you understand that you are to pay <a href=\"/cwcki/Michael_Snyder\" title=\"Michael Snyder\">Michael John Snyder</a> for his medical expenses?\"\n</p><p>\"Yes, but I don't think that THIEVING LIAR deserves a <i>red cent</i>!\"\n</p><p>The Judge dismissed this.\n</p><p>And finally, when asked if he willingly pleaded guilty and was his own conscious choice, Chris hesitated for a good five seconds.\n</p><p>\"...Yes.\"\n</p><p>There was more discussion from both Bell and the prosecution, mostly trying to convince the Judge to accept the guilty plea. The Judge did, and Barbra Chandler and Christian Chandler were both found guilty of fail to stop at the scene of an accident, and Barbra was charged with assault on an officer. Barbra was sentenced with <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Community_service\" title=\"wikipedia:Community service\">community service</a> and two years of <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Probation\" title=\"wikipedia:Probation\">probation</a>, and Chris was sentenced with community service, one year of probation, and must comply with all psychiatric treatment and evaluation. If he fails to do so, he faces jail time.\n</p><p>There's more details jotted down, and Indigo remembers more than I do, so you can expect a more detailed post from her. Probably on page six. I'll update with some detail of the October 28 incident (assuming the <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> doesn't have it) tomorrow when I find my notes.\n</p><p>A few answers to other questions: \n</p>\n<ul><li>If I paid the bill that comes with phones that access the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">internet</a> every month, I probably would never have left-over money, and couldn't afford this trip. Also, like <i>hell</i> I'm taking my laptop to VA to leave it unattended in my car while I sat in a courthouse. (My car is also not equipped with internet access, I don't know of many cars that are.)</li>\n<li>I couldn't get photos of Chris or his car. The <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a> area around the courthouse is actually quite busy, and there aren't any parking lots adjacent to the courthouse itself. Chris and Barbra could have parked anywhere. Besides, getting photos or video of him or his car could have put us at risk of being charged for stalking. The court members KNOW of his internet infamy.</li>\n<li>The Charlottesville Circuit Court doesn't keep real-time transcripts, and the ones they make upon request cost money. If somebody else wants to contact them and get the transcripts, I'm sure they'll eventually have them available.</li></ul>\n<p>EDIT!: I totally forgot that most of you guys don't know this. Snyder did get hit with the Chandler vehicle. Not once, but twice. Once by Chris, and then again by Barb when they switched places. That's why they both have the fail-stop felony charge.\n</p>\n<h2><span id=\"Indigo.27s_account\"></span><span class=\"mw-headline\" id=\"Indigo's_account\">Indigo's account</span></h2>\n<p>As Cyan writes the master post, I will type this out: my account of what occurred. We felt that both of us should describe it, as we both noticed different details just as we noticed the same ones. When put together, both of our stories should give you a fairly clear image of the trial.\n</p>\n<h3><span class=\"mw-headline\" id=\"Initial_Observations\">Initial Observations</span></h3>\n<p>Our dear CWC looked absolutely miserable to be there, his face set in an almost cartoonish pout. He was only sporting <i>some</i> of his now-signature <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl\" title=\"Tomgirl\">Tomgirl</a> look: the hair and make-up (restricted to light lipstick and eyeshadow) were present, but the clothes he sported were slacks and an unremarkable flannel shirt. I would probably be right in guessing that his subdued physical appearance was at the insistence of his lawyer.\n</p><p>Barbara looked as though she had lost significant weight, and another older woman was with them. ((It's been confirmed that she's <a class=\"mw-redirect\" href=\"/cwcki/Rocky\" title=\"Rocky\">Rocky</a>.))\n</p>\n<h3><span class=\"mw-headline\" id=\"The_Pleas\">The Pleas</span></h3>\n<p>This may surprise you, but Barbara and Chris did the smart thing for once and pleaded guilty . . . ah, but that's not quite all. Their lawyer explained that while they were choosing this course of action, they maintain that their version of events (their <a class=\"mw-redirect\" href=\"/cwcki/TRUE_and_HONEST\" title=\"TRUE and HONEST\">TRUE and HONEST</a> account of what occurred between themselves and Mr. Snyder) is the accurate story. In other words: \"we're guilty but not really lol.\"<sup class=\"reference\" id=\"cite_ref-2\"><a href=\"#cite_note-2\">[note 1]</a></sup>\n</p><p>The judge has the option of denying this type of plea-bargaining based on what occurs next. Keep this in mind.\n</p>\n<h3><span id=\"Barbara.27s_Turn\"></span><span class=\"mw-headline\" id=\"Barbara's_Turn\">Barbara's Turn</span></h3>\n<p>This portion was mostly unworthy of note, aside from Barbara nearly getting uppity at the start. She calmed down pretty quickly, though, and conducted herself rather politely through the judge's questions.\n</p><p>Meanwhile, Chris was busy completely disassociating himself from the situation. He fiddled around with his <a href=\"/cwcki/Pedo-Glasses\" title=\"Pedo-Glasses\">sunglasses</a> (making a few noises when they collided with the table every now and then), played with his ring, and didn't seem like he was paying much attention to dialogue he probably ought to be listening to.\n</p>\n<h3><span id=\"Chris.27s_Turn\"></span><span class=\"mw-headline\" id=\"Chris's_Turn\">Chris's Turn</span></h3>\n<p>Before Chris had his turn to speak, their lawyer stepped in to provide context to Chris's situation. It's all stuff we've heard before, though there were a couple of quotes worth noting:\n</p>\n<ul><li>He used \"high-functioning autistic\" to describe Chris, most likely at Chris's request. This is no longer used as any sort of technical term, so it sounded rather silly coming from a professional lawyer.</li>\n<li>Not long afterward, he goes on to describe Chris as an \"adult autistic child.\" <i>This</i> drew a notable reaction out of Chris. He went so far as to change his facial expression from severe pouting to as close to outrage as he dared show; he nearly interrupted his lawyer, but must have thought better of it and quieted whatever he was going to say into an intelligible mumble.</li></ul>\n<p>Finally, it was Chris's turn to answer the routine questions given by the clerk and the judge. Chris, due to not paying attention earlier, asked if his lawyer could answer on his behalf. He was met with a reminder that no, in fact, you <i>have to</i> answer these questions <i>all by yourself</i>. Perish the thought. \n</p><p>After the clerk finished her segment, Chris had the gall to interrupt the judge just as he was getting started with his round of questioning. Despite the rough start, Chris got the hint and kept his responses to \"yes\" and \"no\" and did fairly well answering them quickly . . . that is, until he was asked if he had pled guilty completely of his own free will. There was a LONG pause before he finally remembered that the \"correct\" answer was yes. Looks like he needed more rehearsal time to me.\n</p><p>Oh, and that's not all! Things got interesting when Mr. Snyder was brought up . . . \n</p><p>Chris was asked something along the lines of, \"do you understand that, by pleading guilty, you MUST pay the agreed amount to Mr. Snyder in damages?\" Chris confirmed that he understood . . . and then went on to say that, in HIS opinion, \"that thieving liar doesn't deserve a red cent!\" Oh, yes, folks, I kid you not: our beloved Mayor of <a href=\"/cwcki/CWCville\" title=\"CWCville\">CWCville</a> committed <i>public slander</i> in a COURT OF LAW. \n</p><p>I expected a harsh reprimand for such egregiously bad behavior (or, perhaps, even for his plea bargain to be denied) but alas, the judge pretty much let it go and continued on. Welp, another free pass for Chris, brought to you by The Autism Card!\n</p>\n<h3><span class=\"mw-headline\" id=\"The_Aftermath\">The Aftermath</span></h3>\n<p>The rest is pretty straight forward: the prosecutor, defense lawyer, and judge discuss the conditions that Barbara and Chris must comply with, whilst Chris gives an exaggerated, disapproving shake of his head whenever Mr. Snyder is brought up. \n</p><p>At one point, the lawyer suggests that Chris could start giving back to the community in an effort to reintegrate himself into society. The look on Chris's face is <i>priceless</i>.\n</p><p>((That's pretty much it. We couldn't obtain transcripts, as they don't provide them on the day of a trial if the trial in question is not a major trial or an appeal. If you want to obtain your own copies, you'll have to send in a request to the Circuit Court of Charlottesville and pay a fee.))\n</p>\n<h2><span id=\"Chris.27s_confirmation\"></span><span class=\"mw-headline\" id=\"Chris's_confirmation\">Chris's confirmation</span></h2>\n<p>On a 11 <a href=\"/cwcki/July_2012\" title=\"July 2012\">July 2012</a> <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> note, Chris confirmed their account:\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>Wednesday July 11, 2012\n<p>Yep, the trolls know most of what went on in the court room yesterday; it is confirmed that two of them were in there, going by the online names of \"Cyan\" and \"Indigo\". Rob recognized them both, and informed them that their trolling stupid presence is noted and known. I have also found their transcribed, personal reports on the Cwcki Forum, and they have a 23 second video on YouTube of them driving by the courthouse and holding up the day's \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/The_New_York_Times\" title=\"wikipedia:The New York Times\">New York Times</a>\" paper, titled \"CyanIndigo\", same as their account name. And they quoted me in calling Snyder \"thieving and lying\"; I had actually said \"Bribing and lying\".\n</p><p>Anyway, we ALL know of them, and they will be brought in regardless of currently being in Or outside of <a href=\"/cwcki/Virginia\" title=\"Virginia\">Virginia</a> or even the <a href=\"/cwcki/United_States_of_America\" title=\"United States of America\">United States of America</a>.\n</p>\n</td></tr></tbody></table>\n<p>While Cyan and Indigo confirmed that Bell did indeed confront them during the course of the trial, it should be noted that their only actions were to attend a court session that was open to the public and then report on the proceedings, neither of which are illegal. \n</p>\n<h2><span class=\"mw-headline\" id=\"Footnotes\">Footnotes</span></h2>\n<p>As thanks for Rob's defense succeeding in keeping both him and his mother out of jail <i>(which could have been devastating consequences for Chris in the long run)</i>, Chris called him a \"wuss\" on Facebook, either out of his <a class=\"mw-redirect\" href=\"/cwcki/Anger\" title=\"Anger\">anger</a> for being called an \"adult autistic child\" in court <i>(keep in mind that earlier on, Chris committed public slander)</i>, or for not entertaining Chris's bullshit when the latter demanded that the <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> who attended his court case be found and locked up.\n</p>\n<h2><span class=\"mw-headline\" id=\"Notes\">Notes</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-2\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-2\">↑</a></span> <span class=\"reference-text\">Chris made an Alford plea<sup class=\"reference\" id=\"cite_ref-chriscase_1-1\"><a href=\"#cite_note-chriscase-1\">[1]</a></sup></span>\n</li>\n</ol></div>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-chriscase-1\"><span class=\"mw-cite-backlink\">↑ <sup><a href=\"#cite_ref-chriscase_1-0\">1.0</a></sup> <sup><a href=\"#cite_ref-chriscase_1-1\">1.1</a></sup></span> <span class=\"reference-text\"><a href=\"/cwcki/File:CR12000096-01.png\" title=\"File:CR12000096-01.png\">File:CR12000096-01.png</a></span>\n</li>\n</ol></div>\n<!-- \nNewPP limit report\nCached time: 20250307013458\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.095 seconds\nReal time usage: 0.104 seconds\nPreprocessor visited node count: 128/1000000\nPost‐expand include size: 1345/2097152 bytes\nTemplate argument size: 899/2097152 bytes\nHighest expansion depth: 6/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 1/20\nUnstrip post‐expand size: 939/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   36.184      1 -total\n 58.30%   21.096      1 Template:References\n 20.25%    7.326      1 Template:Refn\n 11.35%    4.106      1 Template:Notes\n  8.77%    3.172      1 Template:Quotebox\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:19003-0!canonical and timestamp 20250307013458 and revision id 313908. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=This_is_how_the_Trial_went&amp;oldid=313908\">http://sonichu.com/w/index.php?title=This_is_how_the_Trial_went&amp;oldid=313908</a>\"</div></div>",
  "categories": [
    "CWCki Forums posts",
    "Eyewitness Accounts",
    "Events"
  ],
  "links": [
    "July 2012",
    "sunglasses",
    "internet",
    "lost some weight",
    "Chris",
    "CWCki",
    "Michael John Snyder",
    "Autistic",
    "CWCki Forums",
    "trolls",
    "Christopher Weston Chandler",
    "Virginia",
    "Tomgirl",
    "TRUE and HONEST",
    "Rocky",
    "Barb",
    "Charlottesville",
    "28 October 2011",
    "Barbra",
    "anger",
    "Facebook",
    "High-functionally Autistic",
    "holding the camera",
    "Bell",
    "Snyder",
    "police",
    "My mother will be taking care of that",
    "CWCville",
    "United States of America",
    "Youtube"
  ],
  "scraped_at": "2025-11-26T14:57:06.755041"
}