{
  "url": "https://sonichu.com/cwcki/Toucher_and_Rich_Segment",
  "title": "Toucher and Rich Segment",
  "display_title": "Toucher and Rich Segment",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:269px;\"><a class=\"image\" href=\"/cwcki/File:BaronHarkonnen.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"216\" src=\"/w/images/4/42/BaronHarkonnen.jpg\" width=\"267\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:BaronHarkonnen.jpg\" title=\"Enlarge\"></a></div>Chris in \"the David Lynch movie of your nightmares.\"</div></div></div>\n<p><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>'s 1 <a href=\"/cwcki/May_2009\" title=\"May 2009\">May 2009</a> video <a href=\"/cwcki/For_My_Sweetest_Ivy\" title=\"For My Sweetest Ivy\">For My Sweetest Ivy</a> was the focus of a segment of <i><b><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/The_Toucher_and_Rich_Show\" title=\"wikipedia:The Toucher and Rich Show\">The Toucher and Rich Show</a></b></i>, a Boston-area radio show, that aired on 12 <a href=\"/cwcki/May_2009\" title=\"May 2009\">May 2009</a>. There are some details that the hosts of the show get wrong, like the apparent confusion of <a href=\"/cwcki/Ivy\" title=\"Ivy\">Ivy</a> with <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Megan</a>, but this is understandable given that their knowledge of him is mostly second-hand.\n</p><p>This was one of the rare discussions of <a class=\"new\" href=\"/w/index.php?title=Post-Merge_Era&amp;action=edit&amp;redlink=1\" title=\"Post-Merge Era (page does not exist)\">Chris in</a> <a href=\"/cwcki/Chris_in_the_media\" title=\"Chris in the media\">the mainstream</a> and not by <a href=\"/cwcki/Trolls\" title=\"Trolls\">obsessives</a> on the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">Internet</a> prior to <a href=\"/cwcki/Jail_Saga\" title=\"Jail Saga\">August 2021</a>. Notice that no matter how much the hosts try to warp Chris's voice, the original is still the most disturbing. Also, this is apparently not the first time Chris has been discussed on the show, as they imply in the beginning of the segment that they had played <a href=\"/cwcki/I_Got_A_Fish\" title=\"I Got A Fish\">I Got A Fish</a> previously.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Transcript\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Transcript</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Chris's_response\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Chris's response</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#See_also\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">See also</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#External_links\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">External links</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<center><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/As95RqOQd04\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div></center>\n<p><b>Toucher:</b> Sometimes you don't realize how big something's getting on the Internet. We are Toucher and Rich -- Rich Shertenlieb, Crash Clark, Adolfo Gonzalez. My name is Fred Toettcher. Two ways to get involved with the show. Please feel free to instant feedback -- go to WBCN.com and click on \"Instant Feedback,\" or give us a call at 617-931-1041. 617-931-... 1041. Here is the deal: we got sent a e-mail from a guy who said, \"Look at, this is the most disturbing thing I've seen in a really long time. What the F is up with this guy?\" And he was the guy, do you have \"I Got A Fish?\"\n</p><p><b>Rich:</b> I got it right here, yeah. [<i>Plays clip from \"<a href=\"/cwcki/I_Got_A_Fish\" title=\"I Got A Fish\">I Got A Fish</a>:\"</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> I got a fish!<br/>Would ya like to make a wish?<br/>I got a fish!<br/>Would ya like to make a wish?<br/>I got a fiiiiiiiiish!<br/>Would ya like to make a wish?<br/></font></dd></dl>\n<p><b>Toucher:</b> And he is a grown man who is standing in a <a class=\"mw-redirect\" href=\"/cwcki/Chris%27s_room\" title=\"Chris's room\">room</a> full of <a class=\"mw-redirect\" href=\"/cwcki/Toys\" title=\"Toys\">toys</a>, and he is saying things, uh, this is him describing, do you have the description of what he likes, the spanking, he's kind of describing--\n</p><p><b>Rich:</b> Oh no, I don't have that. Do, do some of it.\n</p><p><b>Toucher:</b> Yeah, basically he's describing how he likes, uh, there's <a href=\"/cwcki/April_16_Fetish_Vids\" title=\"April 16 Fetish Vids\">pictures of him</a> that have been leaked on the Internet wearing <a href=\"/cwcki/Butt_garments\" title=\"Butt garments\">adult diapers</a>, uh, he likes being spanked, and that's because <a href=\"/cwcki/Captain%27s_Log,_Stardate_April_28th,_2009\" title=\"Captain's Log, Stardate April 28th, 2009\">that's what adults do</a>. Adults like feeling pleasure, uh, out of pain.\n</p><p><b>Rich:</b> Right.\n</p><p><b>Toucher:</b> Yeah, he is a disturbing young man. And I've been sent since then a bunch of links about this guy. And you know what, I don't remember his name and I don't care to; you'll be able to find him, don't worry about it. [<i>Laughs</i>] But, uh, he's got a million videos up on the Internet, and he also apparently has a <a class=\"mw-redirect\" href=\"/cwcki/Comic\" title=\"Comic\">comic</a> book that he draws and puts up on the Internet--\n</p><p><b>Rich:</b> Oh boy.\n</p><p><b>Toucher:</b> --which is, I don't even want to get into, but which I, which I, from what I, if what I read is true, it's <a href=\"/cwcki/Sonichu_10\" title=\"Sonichu 10\">horribly disturbing</a>. So anyway, he's kind of this manchild, he, uh, wears glasses, he looks a little bit like, for lack of a better description, <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Phillip_Seymour_Hoffman\" title=\"wikipedia:Phillip Seymour Hoffman\">Phillip Seymour Hoffman</a>, almost? Like if he was playing a deranged guy. [<i>Laughs</i>]\n</p><p><b>Rich:</b> [<i>Laughs.</i>] Right.\n</p><p><b>Toucher:</b> Alright. So anyway, so from what I've read, there's a whole big, like, there's something that's, uh, that's like Wipi-<a href=\"/cwcki/Wikipedia\" title=\"Wikipedia\">Wikipedia</a>, but it's like \"<a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Crapipedia</a>\" or something? [<i>Rich laughs.</i>] There's this big page about this guy, and I don't know if it's true or not, but they reference that <a href=\"/cwcki/JERKS\" title=\"JERKS\">he hates all men</a> because they, uh, have all the girls, all the girls he meets have girlfriends[sic], but there was one girl that he was friends with, that he fell madly in love with, and I guess that this is a, uh, an ode to her.\n</p><p><b>Rich:</b> It is. Now, in this video, unlike in the other one where he's just sitting down wearing his, like, flannel shirt, like, looking at the camera, he is standing up, he's extremely excited, you can tell because he's kind of bobbling from side to side, and he's wearing his normal outfit except on top of it a blazer. 'Cause he wants to look proper.\n</p><p><b>Toucher:</b> And he is nonchalantly holding his, uh, remote control. He always has a <a class=\"mw-redirect\" href=\"/cwcki/Video_game\" title=\"Video game\">video game</a> remote control on him. And once again, in his bedroom, with the toys and drawings and the cartoons.\n</p><p><b>Rich:</b> And here you go.  \n</p><p><b>Toucher:</b> He's obsessed with <a href=\"/cwcki/Sonic_the_Hedgehog\" title=\"Sonic the Hedgehog\">Sonic the Hedgehog</a>, too, from what I've read. And if I failed to mention it yet, he's probably close to forty. [<i>Plays clip from \"<a href=\"/cwcki/For_My_Sweetest_Ivy\" title=\"For My Sweetest Ivy\">For My Sweetest Ivy</a>\"</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> Hey Ivy! I'm doing this video for yoooou. Oh, we are gonna have so much fun together when you and I are together! Hmmm!</font></dd></dl>\n<p><b>Toucher:</b> Yeah right, dude! [<i>Rich laughs.</i>] Dude, dude, dude, enjoy, put the Nightmare Machine on, ladies and gentlemen. [<i>Plays a clip from \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Goodbye_Horses\" title=\"wikipedia:Goodbye Horses\">Goodbye Horses</a>,\" alluding to the Buffalo Bill dance scene in <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/The_Silence_of_the_Lambs\" title=\"wikipedia:The Silence of the Lambs\">The Silence of the Lambs</a>.</i>] I hope that you're not half-asleep with the snooze button listening to this guy, 'cause, welcome to the <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/David_Lynch\" title=\"wikipedia:David Lynch\">David Lynch</a> movie of your nightmares!\n</p><p><b>Rich:</b> If I saw this in a David Lynch movie, I would say, like, \"Alright, David Lynch is trying way too hard. Now he's like, making up stuff, that, this is too weird.\" [<i>Continues clip</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> You know, <a class=\"mw-redirect\" href=\"/cwcki/Barbara\" title=\"Barbara\">my mommy</a> and I--my, my family and I will come and meet you at the airport. And you know, your choice so--take you to your hotel or, uh, bring you back to...my house, hmmm.</font></dd></dl>\n<p><b>Toucher:</b> Ooh. These little-- [<i>Replays and imitates Chris's whimper and laughs, then plays the \"Goodbye Horses\" clip again, adding Chris saying \"Back to... my house\" and \"My mommy and I\" with his voice digitally lowered.</i>]\n</p><p><b>Rich(?):</b> \"My mommy and me...\" [<i>Plays music from Psycho</i>]\n</p><p><b>Toucher:</b> Even when adult women say \"mommy\" it's freaky--\n</p><p><b>Rich:</b> [<i>Laughing</i>] I know.\n</p><p><b>Toucher:</b> --let alone an adult man talking to somebody he, uh, obviously wants a relationship with. Ai-yai-yai. I hope you've had that cup of coffee, ladies and gentlemen, because [<i>Laughs</i>] it only gets worse. [<i>Continues clip.</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> I mean, uh, you know, we'd be hanging around so much and sharing so many fondful memories.  Hmm. And you know, I few--I know a few good places in <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville\" title=\"Charlottesville\">Charlottesville</a>, you know, I think it's, you know, I'll take you there, we'll get some good things to eeeeeat, and we’ll hang ooouut. We’ll have so much fun. I know a place that serves some great smoothies. And you know, we can enjoy a movie in the theater, or in--at home, or watch a television rerun. <i><a href=\"/cwcki/Family_Guy\" title=\"Family Guy\">Family Guy</a></i>! Heh.</font></dd></dl>\n<p><b>Toucher:</b> \"<i>Family Guy</i>!\" [<i>They laugh and play the Psycho music again.</i>] Tony, you're on Toucher and Rich.\n</p><p><b>Tony:</b> Oh my God, two hundred years ago, this guy would have been ostracized out of a village or a town or something like that. [<i>Toucher and Rich laugh.</i>] I mean, he <i>really</i> needs to be around normal humans. \n</p><p><b>Toucher:</b> Yeah, I guess there are videos, I've been told, where <a href=\"/cwcki/Christian_Weston_Chandler_Interview\" title=\"Christian Weston Chandler Interview\">his <i>mother</i> appears</a>, like--\n</p><p><b>Rich:</b> No!\n</p><p><b>Toucher:</b> --comes into the room while he's filming 'em.\n</p><p><b>Rich:</b> Oh man.\n</p><p><b>Toucher:</b> Yeah, I mean, there's a, you could spend a good, uh, horrifying evening, [<i>Rich laughs</i>] if you wanted to go, like, out to the old haunted house and play these things, you could probably do it for a couple of hours. [<i>Continues clip</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> <i>Family Guy</i>! Or, uh, <i><a href=\"/cwcki/I_Love_Lucy\" title=\"I Love Lucy\">I Love Lucy</a></i>, or I got some—I got the entire series of <i><a href=\"/cwcki/Gilligan%27s_Island\" title=\"Gilligan's Island\">Gilligan's Island</a></i>, hmmm. Hoo-hoo! Hmm, and we can make some music together... on <i><a href=\"/cwcki/Guitar_Hero\" title=\"Guitar Hero\">Guitar Hero</a></i>. Hmmm. Well, you can sing, I got a microphone. I'm thinking about getting drums. [<i>Makes a drum sound.</i>] Hm, yeah. And you know, I will see you in the--I look forward to the eventuality of, uh, you and me having our <a class=\"mw-redirect\" href=\"/cwcki/Sex\" title=\"Sex\">sex</a> time together.</font></dd></dl>\n<p><b>Toucher:</b> Aaaauugghhaaaaoooo! [<i>Plays clip of \"Goodbye Horses\" again</i>] I'm going to guess it never happened. [<i>Rich laughs.</i>] I'm going to guess that the lady saw this video and maybe thought-- [<i>Replays clip of Chris saying, \"I look forward to the eventuality of, uh, you and me having our sex time together.\"</i>]\n</p><p><b>Rich:</b> Oough.\n</p><p><b>Toucher:</b> Alan, you're on Toucher and Rich.\n</p><p><b>Alan:</b> Hey, guys, hey!\n</p><p><b>Toucher and Rich:</b> Hey!\n</p><p><b>Alan:</b> Um, make sure you save that videotape; <a class=\"mw-redirect\" href=\"/cwcki/Jerkops\" title=\"Jerkops\">the FBI</a> will want it for evidence.\n</p><p><b>Toucher:</b> I have a feeling that, if all this is real, that, uh, there are <a class=\"mw-redirect\" href=\"/cwcki//cwc/\" title=\"/cwc/\">several</a> <a href=\"/cwcki/CWCki\" title=\"CWCki\">organizations</a> that are just keeping an eye on the, uh, the doings of this gentleman.\n</p><p><b>Rich:</b> Yeah, the creepiest thing is that he, first of all, he talks like a little kid, like, \"my mommy,\" and then in his first video, he was saying, because that's what adults do sometimes, like he's talking and addressing children.\n</p><p><b>Toucher:</b> But I g--, this woman is an adult from what I've read, that he's addressing.\n</p><p><b>Rich:</b> Oh, oh, maybe, maybe it is, maybe it is, but the other videos that he's made, it just seems like--\n</p><p><b>Toucher:</b> He's very child-like and maybe he was relating to someone on a child-like level.\n</p><p><b>Rich:</b> Right.\n</p><p><b>Toucher:</b> That is a, that is an assumption. [<i>Continues clip</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> Hmmm, I'll do you so many, I'll, I'll do my best to pleasure you and keep you satisfied, my sweetest Ivy, just for you. Just for you! Hmmm!</font></dd></dl>\n<p>[<i>Rich laughs.</i>]\n</p><p><b>Toucher:</b> Who did you save all this skin for? [<i>Plays clip of \"Goodbye Horses\" again, adding Chris saying \"Just for you!\" three times, with the first iteration digitally lowered.</i>] Why is this dog-cage all set up? [<i>Repeats digitally-lowered \"Just for you!\" and adds the \"I look forward to the eventuality of, uh, you and me having our sex time together.\"</i>]\n</p><p><b>Toucher:</b> I mean, you don't even have to play it slow, you don't have to do anything, this is like a night-- I've never gone through the whole video, it's, it's so disturbing to me. [<i>Continues clip</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> I know a number of good positions and massages, hmm. Hmmm. And, you know, I know a number, uh, places we could walk around at, you know. We could walk about the mall!</font></dd></dl>\n<p><b>Toucher:</b> Ooh!\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> We could walk about the UVA grounds! Good places where there's plenty of green and sunlight.  Hmmmm, so, you know, wonderful memories! Wonderful memories! We're gonna have lots of fun. And I promise, I’ll remain your good boy forever and for always. Being a good boy just for you, Ivy.</font> [<i>Sound of disgust from one of the hosts</i>] <font color=\"#0033FF\">I love you so much, I love you so muuuuch! Hmmmm.</font></dd></dl>\n<p><b>Toucher:</b> Oulbggh! \n</p><p><b>Rich:</b> [<i>Laughs</i>] Oh yeah!\n</p><p><b>Crash:</b> It's making chills!\n</p><p><b>Rich:</b> [<i>Laughs</i>] I know!\n</p><p><b>Crash:</b> The chil-- he's a witch! [<i>Replays a slowed-down \"Being a good boy just for you, Ivy. I love you so much, I love you so muuuuch!\" and adds \"Just for you!\" and a slowed-down \"Look at me smile\" at the end.</i>] \n</p><p><b>Toucher:</b> [<i>Laughing</i>] \"Look at me smile!\" [<i>Replays \"I know a number of good positions and massages.\"</i>] Ohhhh. [<i>Continues clip</i>]\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> Hmmm, look at me smile, hmm. It's a nice smile. Because I love you, Ivy! I love you so much. I ran out of details. I don't know. I guess I'll sing you a song.</font></dd></dl>\n<p><b>Toucher:</b> No!\n</p>\n<dl><dd><font color=\"#0033FF\"><b>Chris:</b> It's a jolly ‘oliday<br/>With Ivy<br/>Ivy makes my heart so light<br/>When the skies are grey<br/>And ordinary<br/>Ivy makes the sun shine bright.<br/>It's a jolly holiday with Ivy<br/>No wonder that it's Ivy that I love.<br/>I love you so much Ivy. I love you! I love youuu. [<i>Blows a kiss to the camera.</i>] Talk to you later, sweetheart. And also to your <a class=\"mw-redirect\" href=\"/cwcki/Officer_Keino\" title=\"Officer Keino\">father the policeman</a>, I salute him with my Cub Scout salute.</font></dd></dl>\n<p><b>Toucher:</b> Ohhhhhhh ohh. [<i>Rich laughs.</i>] [<i>Plays circus music to \"I look forward to the eventuality of, uh, you and me having our sex time together,\" \"Oh, we are gonna have so much fun together when you and I are together!\" and \"Just for you!\"</i>]\n</p><p><b>Toucher:</b> I'm just hoping that they wouldn't let this guy on an airplane. Laura, you're on Toucher and Rich.\n</p><p><b>Laura:</b> Thanks a lot for making me have a new really colorful character for my nightmares. [<i>Toucher and Rich laugh.</i>]\n</p><p><b>Toucher:</b> E-especially for a woman.\n</p><p><b>Laura:</b> I'm just gonna sleep with the light on for the rest of my life, now.\n</p><p><b>Toucher:</b> Yes, indeed!\n</p><p><b>Laura:</b> Oh my God!\n</p><p><b>Toucher:</b> We should make a, we should make tapes of these specifically for certain people, just replace \"Ivy\" with \"Laura\"-- [<i>Replays \"We can make some music together on </i>Guitar Hero<i>\" and \"And I promise, I’ll remain your good boy forever and for always.\" while everyone laughs.</i>]\n</p><p><b>Toucher:</b> Well, Rich is obviously from a conservative Catholic family and, uh, something happened over the weekend that maybe made them think he was a little bit of a psycho.\n</p><p>[<i>Segment ends.</i>]\n</p>\n<h2><span id=\"Chris.27s_response\"></span><span class=\"mw-headline\" id=\"Chris's_response\">Chris's response</span></h2>\n<p>Troll goddess <a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a> saw fit to inform Chris about his radio presence via e-mail. Needless to say, Chris was less than receptive.\n</p>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #B48246; padding:5px; background-color:#FCC\">\n<tbody><tr>\n<td>http://www.youtube.com/watch?v=e5a7HN0pa0w&amp;feature=related\n<p>This was part of a radio show from a few months ago. It resurfaced recently and I had a listen.\n</p><p>If you wonder why this applies to you: skip to 7:00.\n</p><p>A woman comments about how YOU will be part of her nightmares now.\n</p><p>This is what normal people, not trolls, think of you. If you really think it's just trolls who have formed a bad opinion of you, think again. Just letting you know.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"border:1px dotted #4682B4; padding:5px; background-color:#F0F8FF\">\n<tbody><tr>\n<td>Well, I never asked for a reputation.‏\n<p>This WHOLE WORLD is becoming <a class=\"mw-redirect\" href=\"/cwcki/Autistic\" title=\"Autistic\">autistic</a> by gluing ALL of their attention \nto computers, <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">internet</a> and all that. I am a REAL LIFE MAN, and while I \ndo not appreciate or care much of the \"reputation\" that has been made \nagainst me on the crappy internet, the TRUE Reputation I would call my \nown is in REAL LIFE and from ACTUALLY HANGING OUT WITH ME IN PERSON.\n</p><p>Feel Free to Spread this Quote from me, \"If you REALLY want to make a \nReputation Of Me, then Hang Out With Me In Real Life. Quit hiding \nbehind your F***ing Computers and \"<a href=\"/cwcki/4-cent_garbage.com\" title=\"4-cent garbage.com\">Anonymous</a>\" Bu**S***.\"\n</p><p>Nobody is Perfect. But I AM a Good Person, and I do not have to be recorded to prove it.\n</p><p>Peace,\nChristian.\n</p>\n</td></tr></tbody></table>\n<p>Needless to say, the quote Chris manufactured for himself wasn't spread.\n</p>\n<h2><span class=\"mw-headline\" id=\"See_also\">See also</span></h2>\n<ul><li><a href=\"/cwcki/The_Kevin_and_Bean_Show_Segment\" title=\"The Kevin and Bean Show Segment\">The Kevin and Bean Show Segment</a></li></ul>\n<h2><span class=\"mw-headline\" id=\"External_links\">External links</span></h2>\n<ul><li><a class=\"external text\" href=\"http://www.mediafire.com/?vpk4uuca66b8i6y\" rel=\"nofollow\">Audio download</a></li></ul>\n<!-- \nNewPP limit report\nCached time: 20240720080523\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.077 seconds\nReal time usage: 0.087 seconds\nPreprocessor visited node count: 117/1000000\nPost‐expand include size: 1555/2097152 bytes\nTemplate argument size: 1205/2097152 bytes\nHighest expansion depth: 4/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 706/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   14.636      1 -total\n 25.98%    3.802      1 Template:W\n 23.39%    3.424      1 Template:Articleofthenow\n 21.76%    3.185      1 Template:Email\n 19.69%    2.882      1 Template:EmailReply\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:9864-0!canonical and timestamp 20240720080523 and revision id 318049. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=Toucher_and_Rich_Segment&amp;oldid=318049\">http://sonichu.com/w/index.php?title=Toucher_and_Rich_Segment&amp;oldid=318049</a>\"</div></div>",
  "categories": [
    "Articles of the Now",
    "Media that has been published in real life"
  ],
  "links": [
    "horribly disturbing",
    "Family Guy",
    "Ivy",
    "internet",
    "Chris",
    "organizations",
    "Wikipedia",
    "room",
    "pictures of him",
    "father the policeman",
    "he hates all men",
    "I Got A Fish",
    "The Kevin and Bean Show Segment",
    "Anonymous",
    "adult diapers",
    "comic",
    "autistic",
    "the FBI",
    "Charlottesville",
    "Guitar Hero",
    "video game",
    "several",
    "his mother appears",
    "May 2009",
    "I Love Lucy",
    "Gilligan's Island",
    "sex",
    "Internet",
    "the mainstream",
    "Crapipedia",
    "toys",
    "Sonic the Hedgehog",
    "Megan",
    "my mommy",
    "Vivian Gee",
    "August 2021",
    "For My Sweetest Ivy",
    "obsessives",
    "that's what adults do"
  ],
  "scraped_at": "2025-11-26T15:55:20.213906"
}