{
  "url": "http://sonichu.com/cwcki/User:Delabonte/Kellie",
  "title": "User:Delabonte/Kellie",
  "display_title": "User:Delabonte/Kellie",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><h2><span class=\"mw-headline\" id=\"Correspondence_with_Kellie_Andies\">Correspondence with Kellie Andies</span></h2>\n<p><i></i>\n<b>Please note:</b> There is no sister.<i> </i>\n</p><p><br/>\nHi,\n</p><p>This is going to come out of the blue, but my sister recently met an old friend of yours named Christian Weston Chandler. They became friends as she felt sorry for him, but recently he's started acting really aggressively towards her, such as feeling her inappropriately and trying to kiss her. My sister has tried to cut off contact but Chris just ignores this and deluges her with phone calls and emails. He's even sent her nudes of himself.\n</p><p>My sister says that Chris mentions you often, often obsessively, which is why I've tracked you down. What is up with this guy?? He doesn't seem all there, and wears a creepy medallion he claims gives him powers.\n</p><p>And what is the easiest way to get him to back off? If his harassment continues, we'll have no choice but to go to the police.\n</p><p><br/>\n<b>I went to high School with Christian. I havent seen him since. I really cant help you. I guess go to the police. He has autism. People with autism are very sensitive and almost feel as if they are shut off to the world. Just explain to him that you are only his friend. He will understand. But you have to explain it. Sorry I cant help.</b>\n</p><p>Thanks for your help. He's backed off a bit since but if he arcs up again to the police I will go. I only came to you because he claimed to have had a relationship with you before dumping you for someone called Sarah Hammer as recently as last year. I didn't know you haven't had contact for years. He makes it sound like you're still begging to be with him.\n</p><p><br/>\n<b>WOW,I never ever had a relationship with him. I am married and i have a son and a child on the way. I never liked Christian in that way. Christian is def. not my type nor has he ever been. But Im glad you guys are okay.</b>\n</p><p><br/>\n<b>UPDATE:</b> I later found out Kellie gave birth this day. Sorry Kellie. Seriously though, what a trooper.\n</p>\n<!-- \nNewPP limit report\nCached time: 20230122022433\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.003 seconds\nReal time usage: 0.003 seconds\nPreprocessor visited node count: 2/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:3799-0!canonical and timestamp 20230122022433 and revision id 93107. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Delabonte/Kellie&amp;oldid=93107\">http://sonichu.com/w/index.php?title=User:Delabonte/Kellie&amp;oldid=93107</a>\"</div></div>",
  "categories": [],
  "links": [],
  "scraped_at": "2025-11-26T21:40:23.630781"
}