{
  "url": "https://sonichu.com/cwcki/On_The_Captain",
  "title": "User:Hurtful Truth Level/On The Captain",
  "display_title": "User:Hurtful Truth Level/On The Captain",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center>\n<br/><div class=\"boilerplate metadata\" id=\"stub\"><table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color: transparent; border: 3px outset #999999\"><tbody><tr><td><a class=\"image\" href=\"/cwcki/File:Essay.png\"><img alt=\"Essay.png\" decoding=\"async\" height=\"35\" src=\"/w/images/9/96/Essay.png\" width=\"30\"/></a></td><td><div style=\"font-size:150%; font-family:comic sans ms\">This essay is an original work created by <b>a CWCki user</b>.</div>\n<hr/>\n<i>It reflects the opinion of its author and/or a minority viewpoint and does not meet <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> <a href=\"/cwcki/CWCki:Style\" title=\"CWCki:Style\">quality standards of encyclopedic value</a>. Reader discretion is advised.</i></td></tr></tbody></table></div>\n</center>\n<center>\n<br/><div class=\"boilerplate metadata\" id=\"stub\"><table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color: transparent; border: 3px outset #00FF00\"><tbody><tr><td><a class=\"image\" href=\"/cwcki/File:Essay.png\"><img alt=\"Essay.png\" decoding=\"async\" height=\"35\" src=\"/w/images/9/96/Essay.png\" width=\"30\"/></a></td><td><i>This essay has been completed. Do not expect any updates to it besides minor corrections.</i></td></tr></tbody></table></div>\n</center>\n<p>I've been thinking about writing this for awhile, to fill in some small gaps in public info. This is mostly based on my chats with <a href=\"/cwcki/The_Captain\" title=\"The Captain\">The Captain</a> many years ago.\n</p><p>The Captain and I started chatting in <a href=\"/cwcki/May_2018\" title=\"May 2018\">May 2018</a>. He said that his \"in\" with Chris stemmed from knowing both <a class=\"mw-redirect\" href=\"/cwcki/Megan\" title=\"Megan\">Megan</a> and <a class=\"mw-redirect\" href=\"/cwcki/Anna\" title=\"Anna\">Anna</a> personally. The Captain was able to influence Chris away from the <a href=\"/cwcki/Idea_Guys\" title=\"Idea Guys\">Idea Guys</a>, not just because he had bought the <a href=\"/cwcki/Amnyfest_Ring\" title=\"Amnyfest Ring\">Amnyfest Ring</a> and played along with Chris's fantasy, but also because Anna had vouched for him months before the Idea Guys saga even began. According to The Captain, buying the ring alone probably wouldn't have gotten Chris to trust him, but that and Anna's vouching was what got him there. Anna also found out that Chris was buying gift cards for what turned out to be the Idea Guys, so she contacted The Captain and asked if he could help intervene, which he successfully did.\n</p><p>The group which observers later dubbed the \"<a href=\"/cwcki/Guard_Dogs\" title=\"Guard Dogs\">Guard Dogs</a>\" formed. Anna and <a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a> were both involved with it. Anna helped, but there was a dispute over her wanting time to focus on her college finals before trying to report the Idea Guys to authorities (Captain was unwilling to wait). She left the group after Captain and <a href=\"/cwcki/Marvin\" title=\"Marvin\">Marvin</a> voted to bring <a href=\"/cwcki/Null\" title=\"Null\">Null</a> onboard, as she didn't trust Null. The Captain was angry at Anna for leaving the group, and last he mentioned it, they were no longer speaking to each other over it. LoveYouLongTime had a role partially in common with The Captain, of \"social aspects\" - both talking to Chris and getting him to stay off his accounts while the Idea Guys were being removed.\n</p><p>Chris thought well of The Captain and asked him at least three times to be his manager. But The Captain told me he was strongly opposed to doing that and that he just wanted to prevent harm to Chris. Chris kept asking The Captain's advice for common sense things and would call him just to say hello.\n</p><p>Chris has a habit of being generous towards people he trusts, and there was an incident where The Captain had sent him a photo of his own <a class=\"mw-redirect\" href=\"/cwcki/Amiibo\" title=\"Amiibo\">Amiibo</a> collection, and then Chris decided on his own to start gathering more to add to Captain's collection in early May, despite Captain having told him at least 10 times beforehand not to buy him anything. Captain was annoyed by that and said to me that if those arrived in the mail, they would be returned to sender.\n</p><p>Chris tried asking The Captain for money at least once. On 18 <a href=\"/cwcki/July_2018\" title=\"July 2018\">July 2018</a>, he asked Captain to loan him $200, but Captain replied with \"no\". Chris apparently called <a class=\"mw-redirect\" href=\"/cwcki/Jack_Z\" title=\"Jack Z\">Jack Z</a> and asked for money. This is not to say that Captain was indifferent to Chris's financial issues. Back in early May, when it was uncertain whether Chris would be able to pay the mortgage due to having sent money to the Idea Guys, the Guard Dogs, including Captain, were contemplating arranging a fundraiser if Chris couldn't come up with the mortgage money by mid-month. Captain only considered it due to the circumstance of Chris being exploited by the Idea Guys. As it turned out, a fundraiser was unnecessary since Chris managed to scrounge up money for the mortgage and even had enough left over to partake in a Lease One, Get One Free phone deal. \n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:202px;\"><a class=\"image\" href=\"/cwcki/File:GuardDogsDiscord.png\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"152\" src=\"/w/images/thumb/8/8f/GuardDogsDiscord.png/200px-GuardDogsDiscord.png\" srcset=\"/w/images/thumb/8/8f/GuardDogsDiscord.png/300px-GuardDogsDiscord.png 1.5x, /w/images/thumb/8/8f/GuardDogsDiscord.png/400px-GuardDogsDiscord.png 2x\" width=\"200\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:GuardDogsDiscord.png\" title=\"Enlarge\"></a></div>The Guard Dogs discuss Chris's upcoming meeting with Rocky (screenshot shared with me by The Captain).</div></div></div>\n<p>On 9 <a href=\"/cwcki/May_2018\" title=\"May 2018\">May 2018</a>, Chris met with <a href=\"/cwcki/Rocky_Shoemaker\" title=\"Rocky Shoemaker\">Rocky Shoemaker</a>. The Guard Dogs (Captain, Marvin, Null, and LoveYouLongTime) had thought it would be good if he talk to her and then both go to the local police to report the Idea Guys. Null emailed a copy of his FBI report on the Idea Guys to Rocky, and The Captain spoke with Rocky over the phone to explain in further detail and answer some questions she had. Captain told me she was very concerned over what had happened. He asked Chris to take a selfie with her and let him know how the meeting went. The meeting wound up delayed because Chris decided to stop at the post office first. According to the Guard Dogs I chatted with about what happened, Rocky wanted to take Chris to the Greene County community support center, <a class=\"mw-redirect\" href=\"/cwcki/Region_10\" title=\"Region 10\">Region 10</a>, and she thought the mental health staff there would help Chris file the complaint, which didn't really work out - the lady Chris used to talk to was on maternity leave at the time, and Chris didn't want to speak with anyone else. The Dogs were frustrated because Rocky didn't take Chris to the sheriff's office to file a report the day of the meeting. The Dogs thought that if Rocky's plans didn't include going there later, then Null would contact the police himself. He did so the following day over email. The Dogs also got <a class=\"mw-redirect\" href=\"/cwcki/Barb\" title=\"Barb\">Barb</a>'s phone number and were considering contacting her to encourage Chris to go to the police, though I don't know if they resorted to that. On 15 May, Chris personally went to the police by himself and claimed it went \"fine\", though The Captain noted that Chris had been somewhat iffy with him over the past couple days.\n</p><p>On 11 May, the Idea Guys attempted to get back into contact with Chris and resume some Stephen King roleplay, but Chris shut them down with his reply that he would consider doing it for $6,000.\n</p><p>Halfway through May, The Captain described himself and LoveYouLongTime as the gatekeepers to Chris. However, Captain wasn't really enjoying it and indicated he was thinking of possibly backing off after the reporting of the Idea Guys was resolved. The following month, Null had taken the lead within the Guard Dogs group, though The Captain remained in contact with Chris.\n</p><p>On 25 <a href=\"/cwcki/December_2018\" title=\"December 2018\">December 2018</a>, Chris's Twitter account posted a message from \"<a href=\"/cwcki/Magi-Chan\" title=\"Magi-Chan\">Magi-Chan</a>\" which doxed <a class=\"mw-redirect\" href=\"/cwcki/Lukas\" title=\"Lukas\">Lukas</a>. Lukas blamed The Captain for it, but that was inaccurate. It had actually been Marvin who did that. My understanding is that The Captain only helped gather info on Lukas and friends behind the scenes. \n</p><p>(As a side-note, I wasn't a direct party to dealings of the Guard Dogs. I was told about things after the fact. I'm a Kiwi Farms member who often posted updates about Chris. When I first read the post on Chris's Twitter, I assumed in error that the Teen Troon Squad had been infighting and so created a Kiwi Farms thread titled, <i>12/25 - The \"Teen Troon Squad\" reveals themselves, say they're behind the Merge</i>. I didn't find out until later what had actually happened.)\n</p><p>Later in December, content pertaining to Lukas's interactions with Chris was leaked on 8chan. The Captain mentioned to me that Eva and Devil had both blocked Chris and that Lukas was the one leaking, based on matching headers from phone screenshots, including one confirmed to have been sent from Lukas beforehand.\n</p><p>In a conversation from <a href=\"/cwcki/January_2019\" title=\"January 2019\">January 2019</a>, The Captain commented to me that dealing with Chris daily, even for 5-10 minutes, had been exhausting, and it was why he was beginning to pull back. Chris still maintained trust towards The Captain, as seen by a mention in this DM Chris sent to Marvin on 30 January (which Marvin shared with me):\n</p>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>I will think it over.  But, I did get an idea of One Thing I may do later; I might log in on my laptop, <a href=\"/cwcki/Twitter\" title=\"Twitter\">reset my number of followers by Blocking Everyone</a>, then after that, I’lll say “My Account was compromised! And I lost all of my followers! Please, re-Follow me.  Thank you.”\n<p>And I’ll Protect my account before allowing any new followers to come in.\n</p><p>And I’ll authorize you to log in and sort out the legit from the Bugbears.\n</p><p>Yes!  It’s the Perfect Plan!\n</p><p>Do not tell anyone, except Null and Captain.  I have work to “Hack” into now!\n</p>\n</td></tr></tbody></table>\n<p>Contact between Chris and The Captain continued being less frequent. By <a href=\"/cwcki/March_2019\" title=\"March 2019\">March 2019</a>, The Captain was checking in with Chris every 1-2 weeks and would update Marvin, Null and LoveYouLongTime if anything came up. He told me that month that he just got burnt out on dealing with Chris, and that his role at that point was just to be around in case Chris needed to reach out to someone he trusted if more trolling was happening. By that point, Marvin was the lead in what was left of the Guard Dogs group.\n</p><p>Also in March, Chris was penalized in the <a href=\"/cwcki/Therapeutic_Docket\" title=\"Therapeutic Docket\">Therapeutic Docket</a> court diversion program. According to The Captain, that was because Chris had missed too many required weekly meetings with the BOOST support group. Chris thought he'd met the requirement, but he neglected to confirm it.\n</p><p>The last time The Captain and I chatted was in April 2019. I assume that he continued his distancing from Chris and eventually ceased communication with him.\n</p><p>Lastly, I'll address some things <a href=\"/cwcki/Bryanfrogboy\" title=\"Bryanfrogboy\">Bryanfrogboy</a> and Jack Z have claimed about their interactions with The Captain.\n</p><p>At some point in mid-2018, Chris made an off-color joke about Bryan and his girlfriend, about joining their relationship. That caused Bryan to start ignoring Chris, in the middle of talks about publishing Bryan's <i>Prequel</i> comic. The Captain didn't want Chris to lose a potential income stream from <i>Prequel</i>, so he intervened by facilitating contact between them again. So he reached out to Bryan and said that Chris was in a bad situation (indirectly referencing the Idea Guys saga), that Chris was sorry for what he'd said, and that they need to talk it out because Chris would need the money. Bryan later made a video where he discussed that stuff. But The Captain told me that Bryan misrepresented his words and made things sound more exaggerated than they were and also that he hadn't explicitly mentioned the Idea Guys to Bryan.\n</p><p>Jack Z came up a few times during my conversations with The Captain. He summed up Jack Z as someone who gave money to Chris and is afraid of Null. In January 2020, Jack Z made a couple of Kiwi Farms threads about his own interactions with Chris. He'd had some contact with The Captain as well. However, during the course of one thread, he began making claims about The Captain's personal life being negatively affected by helping Chris or that The Captain was considering visiting Virginia to help Chris. I'm skeptical of those claims, because The Captain never mentioned anything to me about them. Captain briefly mentioned his personal life to me on a few occasions, but only to say he was doing well.\n</p>\n<!-- \nNewPP limit report\nCached time: 20251126055557\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.049 seconds\nReal time usage: 0.109 seconds\nPreprocessor visited node count: 95/1000000\nPost‐expand include size: 2060/2097152 bytes\nTemplate argument size: 626/2097152 bytes\nHighest expansion depth: 10/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   28.498      1 -total\n 62.93%   17.934      1 Template:Essay\n 43.65%   12.439      2 Template:Namespace_detect\n 23.47%    6.688      1 Template:Quotebox\n 12.92%    3.683      1 Template:CompleteEssay\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:40764-0!canonical and timestamp 20251126055557 and revision id 350162. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Hurtful_Truth_Level/On_The_Captain&amp;oldid=350162\">http://sonichu.com/w/index.php?title=User:Hurtful_Truth_Level/On_The_Captain&amp;oldid=350162</a>\"</div></div>",
  "categories": [
    "Theories and Essays",
    "Completed Essays"
  ],
  "links": [
    "Amnyfest Ring",
    "May 2018",
    "Marvin",
    "Amiibo",
    "January 2019",
    "Magi-Chan",
    "The Captain",
    "Guard Dogs",
    "Anna",
    "Jack Z",
    "CWCki",
    "reset my number of followers by Blocking Everyone",
    "Null",
    "Rocky Shoemaker",
    "Lukas",
    "Therapeutic Docket",
    "Barb",
    "Idea Guys",
    "Region 10",
    "July 2018",
    "Bryanfrogboy",
    "LoveYouLongTime",
    "December 2018",
    "Megan",
    "March 2019"
  ],
  "scraped_at": "2025-11-26T16:01:16.399169"
}