{
  "url": "http://sonichu.com/cwcki/User:SandwichSonichu/Defense_mechanisms",
  "title": "User:SandwichSonichu/Defense mechanisms",
  "display_title": "User:SandwichSonichu/Defense mechanisms",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center>\n<br/><div class=\"boilerplate metadata\" id=\"stub\"><table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color: transparent; border: 3px outset #999999\"><tbody><tr><td><a class=\"image\" href=\"/cwcki/File:Essay.png\"><img alt=\"Essay.png\" decoding=\"async\" height=\"35\" src=\"/w/images/9/96/Essay.png\" width=\"30\"/></a></td><td><div style=\"font-size:150%; font-family:comic sans ms\">This essay is an original work created by <b>a CWCki user</b>.</div>\n<hr/>\n<i>It reflects the opinion of its author and/or a minority viewpoint and does not meet <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> <a href=\"/cwcki/CWCki:Style\" title=\"CWCki:Style\">quality standards of encyclopedic value</a>. Reader discretion is advised.</i></td></tr></tbody></table></div>\n</center>\n<p>In Freudian theory, <b>defense mechanisms</b> are the way the brain lessens the difference between reality and one's <a href=\"/cwcki/Christian_Weston_Chandler_(comic_character)\" title=\"Christian Weston Chandler (comic character)\">internal self-image</a>. To use blunt terminology, they're how people cope with the fact they subconsciously know they're not as wonderful as they see themselves. While virtually all human beings will use defense mechanisms to an extent, Chris reads like a catalog of them.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Level_One:_Pathological_Mechanisms\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Level One: Pathological Mechanisms</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Level_Two:_Immature_Mechanisms\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Level Two: Immature Mechanisms</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Level_Three:_Neurotic_Mechanisms\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Level Three: Neurotic Mechanisms</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Level_Four:_Mature\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Level Four: Mature</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Level_One:_Pathological_Mechanisms\">Level One: Pathological Mechanisms</span></h2>\n<p><i>Pathological mechanisms allow someone to alter their perception of reality. Sometimes called delusional responses, a frequent abuser of pathological defenses will begin to appear disconnected from reality (sound familiar?).</i>\n</p>\n<ul><li><b>Denial</b>: Chris will adamantly refuse to accept basic facts if he doesn't want to acknowledge he is wrong. He will often bluntly deny a fact then refuse to hear any more on the subject to avoid weakening his denial.</li>\n<li><b>Delusional Projection</b>: Chris holds dear to the idea that <a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> are grossly flawed individuals. He often demands things of them (like \"getting a life\" or \"seeing a therapist\") that he himself needs.</li>\n<li><b>Extreme Projection</b>: Chris routinely acts as if his own autism is barely debilitating and quickly jumps on concepts related to autism he can use to glorify himself (such as savantism) all while hating other autistic individuals and calling them \"windows into Hell\".</li>\n<li><b>Distortion</b>: Chris will disregard <a href=\"/cwcki/Chris_and_reality\" title=\"Chris and reality\">reality</a> as it stands any time it suits him to.</li>\n<li><b>Splitting</b>: Chris views the world in a very tribal fashion, grouping people into inherently good and inherently evil groups. You're either a <a href=\"/cwcki/Gal_pal\" title=\"Gal pal\">friend</a>/<a href=\"/cwcki/True_and_Loyal_Fanbase\" title=\"True and Loyal Fanbase\">fan</a>/<a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">heartsweet</a> he trusts explicitly, or a villainous troll/homo fit only for extermination or re-indoctrination.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Level_Two:_Immature_Mechanisms\">Level Two: Immature Mechanisms</span></h2>\n<p><i>Immature responses, while possible in adults are best known for being \"gateway\" mechanisms for more serious neurotic issues, especially if used in excess and untreated during adolescence. Such conditions often beget worse conditions by creating alienation and other social detachment concerns, leading to the growth of worse conditions.</i>\n</p>\n<ul><li><b>Passive Aggression</b>: When Chris can't directly act out (such as when he used to deal with his father), he does so via passive-aggressive means. Procrastination is also an element of passive-aggression, one Chris often uses to get back at his fanbase and trolls by blaming them for his slow comic progress.</li>\n<li><b>Fantasy</b>: Perhaps one of Chris's most developed mechanisms, <a href=\"/cwcki/CWCville\" title=\"CWCville\">CWCville</a> is a textbook perfect example of a fantasy defense mechanism: a world where he can right wrongs done to him and wield the sort of absolute power and affection he craves.</li>\n<li><b>Idealization</b>: One of the reasons Chris is so easy to troll using fake girlfriends is that when Chris is in one of his many sweetheart flings, he strains logic to make the object of his affection perfect in his mind, disregarding evidence that he's being duped because his 'perfect' woman would never be a troll.</li>\n<li><b>Somatization</b>: Aggravation at the people he interacts with often cause Chris <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a> reactions far worse than most people experience. While the validity of such statements may be questionable, Chris has remarked that various offensive images made him physically ill. In a conversation with the sysop of <a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> Chris invoked near-death imagery to describe his reaction to seeing <a href=\"/cwcki/Pickle\" title=\"Pickle\">pickles</a> on the front page.</li>\n<li><b>Acting Out</b>: Chris routinely does socially unacceptable things. In some cases he's directly tried to justify his acting out with counters like his <a href=\"/cwcki/Virgin_with_rage\" title=\"Virgin with rage\">virgin with rage</a> status, as if such factors made them reasonable.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Level_Three:_Neurotic_Mechanisms\">Level Three: Neurotic Mechanisms</span></h2>\n<p><i>Neurotic mechanisms represent the bulk of defenses that cause problems for the user. Neurotic defense often require treatment and have been referred to as \"invisible scars\" do describe their severity. While many adults (indeed possibly most) utilize a neurotic mechanism or two, the danger is in constant reliance on them.</i>\n</p>\n<ul><li><b>Withdrawal</b>: Chris's first response to negative stimuli is to run away from it, in most cases by temporarily leaving whatever online outlet is causing him issues.</li>\n<li><b>Displacement</b>: Chris attempted to decapitate the <a href=\"/cwcki/Clown_Doll\" title=\"Clown Doll\">clown doll</a> to vent his frustration at <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>. He used a picture of <a href=\"/cwcki/Adam_Stackhouse\" title=\"Adam Stackhouse\">Adam Stackhouse</a> for target practice. The in-comic villains based on real people act as displacement targets as, compared to their real-life inspirations, they are powerless victims for Chris to vent his anger at their real-world counterparts on.</li>\n<li><b>Regression</b>: If a defense mechanism can be thought of as a drug, then regression is the one Chris mainlines 24 hours a day through an IV. Chris essentially lives in a permanent state of self-imposed childhood. His room filled with toys, games and cartoons acts as a sort of time capsule in which he can live without progressing.</li>\n<li><b>Isolation</b>: (Chris lives in a state of near-literal isolation, but psychological isolation could be described in layman's terms more as 'detachment'). Chris reacts to things like <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Death\" title=\"Chris and Death\">death</a> or causing a <a class=\"mw-redirect\" href=\"/cwcki/Ryan_Cash\" title=\"Ryan Cash\">suicide</a> with a sort of cold removal, though his outward mourning of <a href=\"/cwcki/Patti_Chandler\" title=\"Patti Chandler\">his dog</a> indicated Chris is capable of grief. It is alternatively possible that what appears to be an isolation mechanism is actually an autistic lack of correct emotional response.</li>\n<li><b>Disassociation</b>: One of the precious few neurotic mechanisms Chris doesn't engage in extensively, but one he has invoked (see above). While Chris's <a class=\"mw-redirect\" href=\"/cwcki/Tomgirl\" title=\"Tomgirl\">tomgirl</a> person represents a strong outward shift, his personality has only shown slight alteration. That said, 'tomgirl Chris' has demonstrated a degree more control and confidence than his traditional norm. It is unclear if this confidence stems from his new pseudo-persona or if is just hubris from his recent attempted blows against his trolls.</li>\n<li><b>Reaction Formation</b>: Chris spent an inordinate amount of energy combating homosexual claims leveled against him while wearing a bra in public. He now engages in crossdressing, an act socially regarded as partially homosexual if not blatantly so.</li>\n<li><b>Rationalization</b>: Chris is virtually the patron saint of making excuses for himself. He also tends to rationalize disagreements people have with him as being misinterpretations. He could not accept that making porn of Megan was wrong so he interpreted her disgust as a lack of experience with pornography.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Level_Four:_Mature\">Level Four: Mature</span></h2>\n<p><i>Mature reactions represent correct, (usually) healthy responses. Mature defenses represent lower level, unhealthy defenses that have been adjusted over time to be pleasurable as well as socially acceptable. Unsurprisingly, Chris demonstrates marked deficiencies in mature reactions.</i>\n</p>\n<ul><li><b>Altruism</b>: Chris is incredibly greedy and cannot comprehend giving without receiving. During the <a href=\"/cwcki/BlueSpike\" title=\"BlueSpike\">BlueSpike</a> saga, Chris could not work out whether he wanted to be with a woman who was in love with him or getting his PSN account back.</li>\n<li><b>Anticipation</b>: Despite viewing various major events as inevitable (finding true love, Sonichu becoming a media empire) Chris cannot muster the will to put any work into either, instead letting anxiety consume him.</li>\n<li><b>Humor</b>: Chris cannot take a joke, nor can he make fun of himself. Rare attempts at self-critical humor in the comic are padded with displays of god-like power to render them moot. When he does use humor to counter a threat, he does so by trying to mock or insult the threat.</li>\n<li><b>Identification</b>: Chris admires few people and those he does he admires for narrow traits rather than the person as a whole. He instead considers himself a paragon: not to be modified, but emulated by others.</li>\n<li><b>Introjection</b>: Chris rarely adopts a concept so wholly that it becomes part of his being. The few times he has done so, he is more motivated by the potential the concept or object has to provide him with excuses than he is with the concept itself. For example, Chris cherishes his identity as a high-functioning autistic and all the excuses his status gives him, but refuses to learn anything about the condition. He has open disdain for LGBT culture, but enjoys the support he gets online when he discusses his \"discrimination\" as a tomgirl.</li>\n<li><b>Sublimation</b>: Chris rarely rechannels negative energy in a positive fashion. Negative reinforcement generally causes him to shut down and positive reinforcement (like online girlfriends offering affection for various acts) have no psychological inertia. For example, Chris became cleaner, calmer and less spastic with <a href=\"/cwcki/Ivy\" title=\"Ivy\">Ivy</a>'s encouragement only to slide back down the moment the relationship ended.</li>\n<li><b>Thought Suppression</b>: As is common in autistics, Chris rarely suppresses what's on his mind to suit social norms. Instead he expects society to adapt to his demands.</li></ul>\n<!-- \nNewPP limit report\nCached time: 20250518143519\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.062 seconds\nReal time usage: 0.066 seconds\nPreprocessor visited node count: 75/1000000\nPost‐expand include size: 746/2097152 bytes\nTemplate argument size: 32/2097152 bytes\nHighest expansion depth: 10/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    7.317      1 -total\n100.00%    7.317      1 Template:Essay\n 46.56%    3.407      1 Template:Namespace_detect\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:19593-0!canonical and timestamp 20250518143519 and revision id 182421. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:SandwichSonichu/Defense_mechanisms&amp;oldid=182421\">http://sonichu.com/w/index.php?title=User:SandwichSonichu/Defense_mechanisms&amp;oldid=182421</a>\"</div></div>",
  "categories": [
    "Category",
    "Theories and Essays"
  ],
  "links": [
    "internal self-image",
    "friend",
    "reality",
    "Ivy",
    "CWCipedia",
    "tomgirl",
    "CWCki",
    "fan",
    "CWCville",
    "clown doll",
    "heartsweet",
    "Clyde Cash",
    "trolls",
    "BlueSpike",
    "death",
    "his dog",
    "pickles",
    "Adam Stackhouse",
    "stress",
    "virgin with rage",
    "suicide"
  ],
  "scraped_at": "2025-11-26T21:33:32.576245"
}