{
  "url": "http://sonichu.com/cwcki/User:Bystander/Liquid%27s_letter",
  "title": "User:Bystander/Liquid's letter",
  "display_title": "User:Bystander/Liquid's letter",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>Farewell\nIt was March of 2009 that I discovered Chris-Chan thanks to an anonymous source. Slowly, at first, and then knowing in horror the full extent; it was like watching an accident happen in slow motion and then all of a sudden the car explodes and the passengers’ burned carcasses are ejected onto a bridge, causing havoc and crashes and ultimately wrecking the bridge. That’s what Chris-Chan was like to my life.\n</p><p>But I still worked diligently and carried on with life as normal, as much as I possibly could, with the disturbing knowledge creeping silently in the back of my mind.\n</p><p>On June 21, 2009, I realized that I had a problem. I had some irrational crush on Hayden Panettiere. It was summer, I was stuck at home, there’d be no hope of going to L.A. and getting some fairy-tale like treatment and ending up together with her and living happily ever after. So I thought. What could I do to express my anguish at possibly never coming in contact with her or gaining her attention? I had to gain her attention. Do something… strange, and epic. Something that would dispel my boredom. I thought of the Chris-Chan impersonation I’d been doing off-and-online Left 4 Dead on Xbox live. \n</p><p>So I went into my guest room and typed up a script containing most of my favorite Chris-Chan lines. It wasn’t that great of a script, and it was a dumb idea. It was also one in the morning, which meant that if I talked louder than usual, my dad’d wake up with supersonic hearing and bust my ass and make me go to sleep. I obtained an awkward-looking brown and tan polo. I turned on the camera and I just let it all out.\n</p><p>About a week later, I saw that the creator of Sonichu: The Animated Series commented on the impression I’d posted. Though, in my mind, it was still more about Hayden Panettiere than getting recognized for a good impersonation. Still, I was quite surprised, to say the least. I quickly responded in kind and then put up another video, this time addressing him. He was impressed and asked me to start voicing Chris-Chan for the Animated Series.\n</p><p>I was honored and flattered that his crew didn’t reject my attempt at being funny. I made friends with the lot of them and then joined their production team, Stretch Douche. We talked quite a bit on Skype. It was the first time in a while I’d really felt involved with an internet community, so I kept it going.\n</p><p>Soon enough, one of the editors of the CWCki, Champthom, contacted me on my Youtube account. He asked if I’d make a specialized video talking about my Sonichu merchandise, since someone had told Chris that someone else was selling them at Otakon. Already knee-deep in the CWC stuff, I couldn’t refuse the offer.\n</p><p>Then, on July 22, Chris-Chan posted a video. Rage that he hadn’t shown since the days of Clyde Cash and Jimmy Hill. And it was all directed… at me. I woke up that morning, signed on Skype, and Spazkid instantly told me all about what happened. I went to check the video and I was stunned. Stunned would be an understatement. I’d realized that Hayden Panettiere was no longer relevant. I’d gotten Chris to respond to me. To me. A random Youtube user. It wasn’t ‘til later that I’d learn the Field Agents were more involved.\n</p><p>I’d applied to PVCC about a month earlier with the nickname “KneelToGeneralZod.” It got lost in the void and I never received a reply. Another Youtuber who described himself as “Bryan Bash” contacted me and offered to get me right into the PVCC. Already I felt like I’d accomplished enough, that this was as good as it was going to get and perhaps I should stop making videos for lord knows what could happen if everyone suddenly stopped playing along.\n</p><p>I went on the PVCC for the first time to find out how big of a deal it was; this was a much larger, active community than I’d ever expected. People who I’d never heard before were hailing my actions as heroic, and blessed them for producing a bounty of beautiful tard-rage. I made my first post, and people knew I was there.\n</p><p>It wasn’t long before I made another video. This time, I doubled down on CWC’s jealousy and showed off the “merch” I’d taken a couple hours to gather together beforehand. It was a hit. Obviously, “the man in the brown striped shirt” was getting to him.\n</p><p>Things were quiet. I enjoyed the Animated Series episodes remade with my own voice with ferocity. Then, I got an invitation from Yoko to join the Mumble chats. I’d heard only vaguely about Mumble, the things I did know were that Chris actually used the program to talk with Clyde Cash, and that it was a sister version of Skype. I followed Yoko’s instructions and fell through the rabbit hole.\n</p><p>It took me a second to realize who I was surrounded by. The only familiar faces were Yoko and Champthom. Everyone else was an enigma, until—near the bottom of the screen, NO, it couldn’t have been. Clyde Cash? The legend himself? I simply remember thinking that if this was indeed Clyde, then everyone else here was important. What had I stumbled upon? What had I gotten myself into? I don’t know any of these guys. I’m just some kid who did a Chris-Chan impersonation. And, yet, here I was in the central of the ‘inner circle,’ the ‘dedicated trolls.’\n</p><p>I couldn’t help but feel humbled. They accepted me as one of their own. I was in shock to meet, never mind befriend some extremely important people that I’d only just read about and admired. Clyde, Bluespike, Ivy, Emily, canine, and many others. Each with their own saga or contribution. This can’t be happening, I thought. But it did. And the story unfolded right before my very eyes. I collaborated with Clyde to make a fake Mumble chat. I tricked some hipsters who wanted to make money off of Chris-Chan. I got my own ED page with nothing but praise, eventually being featured on the front page for an entire day. Keep in mind, this ‘inner circle’ was with me the entire way. I can’t thank them enough.\n</p><p>Now, however, it’s time for me to make my long-overdue au revoir. People don’t know where I’ve been for the last two or three weeks. I haven’t talked to my best friend in three weeks. I’ve tried everything I could to manage my life and not look like a basement dweller. But it’s not who I am. The real me is an ambitious, overly-driven young man studying and working to become an M.D., eventually a surgeon. But I can’t have these dual lives and expect to have time for it all. I have to pick one, and I think it’s pretty clear which road I’m taking.\n</p><p>School for me starts soon. I’ve got time before then to catch up on my studies, but it’s not going to be easy. It is, however, necessary. And I hate to say it but even though I want to be around to find out what goes on behind the scenes after my “saga” is over, I can’t. \n</p><p>It’s been fantastic, invidious, terrifying, and gut-bustingly hilarious. But I’ve got to return to normal life. It’s simply gone on too long for me. And if you think that I’m being way too self-centered here, well, I am. And I’m sorry. But it’s the only way. I feel a certain sadness by leaving you all with no prior acknowledgement. However, it IS the only way. If I can say a few things before I’m gone, I’d like to.\n</p><p>Admins: Please ban my account after I post this message. I can’t be tempted to distraction, and it kills me that I won’t get to say goodbye to anyone individually after this whole ordeal.\n</p><p>PVCC, en generale: You’ve all been awesome to me. More than I deserve. Keep on doing what you’re doing, because you’re doing it right. I hope you’ll keep the spirit of how awesome this was alive.\n</p><p>Mumble: I’m sorry I can’t do as many CWC impersonations for you, whether reading emails, joking around, or tricking people or Chris himself. I do apologize for that. Well, you're cool people. You're the nerdiest fucking people that I've ever met in my life and my friends would disown me if they ever knew I was associating myself with you, but you’re just great.\n</p><p>My ego: I’m sorry that the gigantic boost has to end. But I can only keep a fine balance between humbleness and elitism, and you know that.\n</p><p>Clyde: I’m sorry we never got to debate politics. You seem quite progressive to me, a stark, conservative Republican. We’d have a hell of a time discussing history and policy. And I’ll get those audiobook lines to you, soon.\n</p><p>Gen: Thanks for being such a good sport. Your life is horrible and cursed, and I’m glad I could make it better for at least a bit.\nAnyone who put me in fan art: Thank you, thank you, thank you. I’m keeping all of it. \n</p><p>It’s hard to talk about all this like tomorrow will be the same. But I’m going now. Maybe you’ll hear about me pioneering some surgical technique or medical research. Maybe you’ll read my column in the paper or hear my radio show. I don’t know what the future holds, but trolling can’t be a part of it anymore, and I’m crushed to admit that.\n</p><p>I didn’t think I’d make nearly as many friends and acquaintances over the summer as I have right here, and on Youtube. It’ll be hard to leave you all like this. I didn’t think I’d make any new friends at all. But you have proven me wrong. \nI have one final request, for all of you that are reading this or have scrolled to the bottom since it’s tl;dr:\nPlease, if my true identity does get leaked (which it almost certainly will), I ask that you’ll do what you can to keep it under wraps.\n</p><p>Cover for me, if you will. Be vigilant. Believe. And thank you all so very, very much.\n</p><p>Sincerely,\nCChanSonichuCWC\n</p><p>PS: I JUST WON THE GAME :awesome:\n</p>\n<!-- \nNewPP limit report\nCached time: 20230122012224\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.013 seconds\nReal time usage: 0.014 seconds\nPreprocessor visited node count: 1/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 1/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:4075-0!canonical and timestamp 20230122012224 and revision id 37648. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Bystander/Liquid%27s_letter&amp;oldid=37648\">http://sonichu.com/w/index.php?title=User:Bystander/Liquid%27s_letter&amp;oldid=37648</a>\"</div></div>",
  "categories": [],
  "links": [],
  "scraped_at": "2025-11-26T21:39:00.547721"
}