{
  "url": "http://sonichu.com/cwcki/User:T_K_19/TVTropes",
  "title": "User:T K 19/TVTropes",
  "display_title": "User:T K 19/TVTropes",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p><br/>\nBackups from several Sonichu-related <a class=\"new\" href=\"/w/index.php?title=TV_Tropes&amp;action=edit&amp;redlink=1\" title=\"TV Tropes (page does not exist)\">TV Tropes</a> pages.  They were written for pmwiki originally, but our <a href=\"/cwcki/User:Tyranogre\" title=\"User:Tyranogre\">crack team of monkeys</a> fixed them to look better on MediaWiki.\n</p>\n<h2><span class=\"mw-headline\" id=\"Just_Bugs_Me\">Just Bugs Me</span></h2>\n<ul><li>As the comic has shown, Chris' portrayal in the comic is highly idealized to the point of being a complete <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/MarySue\" rel=\"nofollow\">Mary Sue</a>. Likewise, in the comic, Chris is essentially the mayor of his own City of Sue (<a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/JustForPun\" rel=\"nofollow\">The Suepreme ruler of the Sueniverse</a>, if you will) where anything he wants, goes...so why can't Chris' comic version find a boyfriend-free girl either? It's his universe - if he wanted, he could essentially create an entire harem for himself out of nowhere, and even then, being mayor of a city would probably give him better ways to find women than loitering around shopping malls waiting for someone to show up. And what kind of mayor does nothing but loiter around the city's shopping malls anyway?\n<ul><li>My guess: that's what you have when \"Write What You Know\" collides with \"The Nice Guy Syndrome\". He's so used to not being in a relationship that he just can't write a relationship even if his life depended on it. So he keeps his comic version pathetically single, but keeps throwing the \"it's not his fault\" card. That's just a guess from someone who used to have quite an Author-Sue in his (fortunately) never written neverending saga...\n<ul><li>Not that not being able to write a relationship has stopped him before, as far as Sonichu and Rosechu's romance goes...which also serves as proof why Chris should never write romance in the first place.</li>\n<li>Didn't he once say that he considers the romance to be the best part of <i>Sonichu</i>?</li>\n<li>Yes, the <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/RuleThirtyFour\" rel=\"nofollow\">\"ro</a><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DoNotWant\" rel=\"nofollow\">man</a><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/YouFailBiologyForever\" rel=\"nofollow\">ce\"</a></li></ul></li>\n<li>It is entirely possible that he portrays his author avatar as single in the hope that a female will read the comic, see that he's available, and track him down. If the fictional CWC was shown in a relationship, his readers would assume that the real-life CWC was in one as well, thus denying him a chance to grind up a girlfriend.\n<ul><li>Considering the comic itself is just one giant advertisement for himself on his Love-Quest, this sounds plausible...it's just that the comic doesn't exactly flatter Chris in the way he intended.\n<ul><li>Or in any other way, for that matter.</li></ul></li></ul></li>\n<li>It's also likely that he's so set on his \"Men can passively attract women\" mindset that he expects his comic characters to follow it as well. Notice that in pretty much every relationship in the comic, the guy doesn't really <i>do</i> anything to win the girl; as the CWCki points out, Rosechu pretty much just falls for Sonichu because he exists.\n<ul><li>Disregard the above: Looks like Lovely Weather is basically Chris' own make-believe wife now.</li>\n<li>Which he cheated on with Meg Griffin of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/FamilyGuy\" rel=\"nofollow\">Family Guy</a>, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SoYeah\" rel=\"nofollow\">So Yeah</a>....\n<ul><li>I think this could demonstrate that on the miracle chance Chris-chan actually got a girlfriend, he'd cheat on her without a second thought and not understand if she got angry.\n<ul><li>Good thing the odds are against that opportunity ever presenting itself. It's highly improbable CWC will ever have a TRUE and HONEST girlfriend, but the chances of him finding TWO women who are interested in him? Just ain't happening.</li></ul></li></ul></li></ul></li></ul></li></ul>\n<ul><li>Why did Chris record the part where Bob comes in for the \"This is my house video\".\n<ul><li>I don't think he's got video editing software.</li>\n<li>No, he definitely does. Have you seen his <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ParappaTheRapper\" rel=\"nofollow\">Parappa The Rapper</a> contest entry? It was full of camera effects and edits. Plus, if you watch the original there is a jumpcut. Why would he even bother recording something like this. He wasn't going to show it to anybody, he could've just deleted it. He appeared to turn something off when Bob came in. But apparently a camera was still running.\n<ul><li>I think he lost access to his video editing software.</li></ul></li>\n<li>Maybe he just turned off the TV and forgot to stop the recording? (This is Chris we're talking about, he's capable of doing something that improbably stupid.) In any case, it's a good thing that such a lulzfest managed to get caught on camera.</li>\n<li>I don't know. Something bugs me about this, it just seems unlikely.</li>\n<li>Accidentally recording it and then posting it seems likely, since I'm pretty sure Chris doesn't actually watch his videos before posting them online.</li>\n<li>Simple. Bob comes in mid-video and tells Chris to \"Shut that goddamn thing off!\", refering to the camera. Chris shuts off the TV, assuming that it will turn off the PSEye he was using. When he uploads the video, he looks at the mid-video still and sees Bob. He immediately deletes the video, edits it, then reuploads it. However, it's too late, trolls already have it archived.</li></ul></li></ul>\n<ul><li>In the infamous Sonichu 10, Ultra Sonichu meets Asperchu who asks him to \"cure\" him of his Aspergers and find a girlfriend, and Ultra Sonichu does so through a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/LargeHam\" rel=\"nofollow\">EXTREME ELECTRIC MAKEOVER</a><sup>tm</sup>, which somehow also gives him nice blue eyes, long blonde hair and a liposuction. If Ultra Sonichu has this power, why didn't he ever use it to, you know, help his \"father\"?\n<ul><li>You mean why Sonichu didn't \"cure\" Chris of his autism? Well... Maybe it's because autism is Christian's favourite excuse for refusing to do anything with his life, and thus Chris doesn't actually want to get rid of it. Or, more likely, it's because Chris <a class=\"external text\" href=\"http://www.cogsdev.org/cwcki/Sonichu_10#Ultra_Sonichu_and_Collosal_Chan\" rel=\"nofollow\">was too busy exacting his idiotic \"revenge\" on Alec Benson Leary</a> to be bothered with something as trivial as putting any thought into his writings.</li>\n<li>Not to mention he is convinced that he doesn't need any of that stuff: He thinks he's handsome because his mom says he is.</li></ul></li></ul>\n<ul><li>It bugs me that they didn't keep the guy who did Sonichu 11. Vivian is a fine riffer and all, but season 2 isn't really funny. Maybe it'll get better but this new comics just seems dull.\n<ul><li>At the time of this writing (5 June) fan-made Sonichu 11 is back on CWCipedia.</li></ul></li></ul>\n<p><br/>\n</p>\n<hr/>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Wild_Mass_Guessing\">Wild Mass Guessing</span></h2>\n<h2><span id=\"Mayor_and_frequent_loiterer_Christian_Weston_Chandler_is_Chris-Chan_Sonichu.21\"></span><span class=\"mw-headline\" id=\"Mayor_and_frequent_loiterer_Christian_Weston_Chandler_is_Chris-Chan_Sonichu!\">Mayor and frequent loiterer Christian Weston Chandler is Chris-Chan Sonichu!</span></h2>\n<p>It would explain why CWC is always hanging around with the Sonichus and Rosechus, why he wears that medallion around his neck, and why their names sounds so similar. They're the same person! (Sorry, I had to do this, tradition and all.)\n</p>\n<ul><li>Man, you crazy. You so crazy.</li></ul>\n<p><br/>\n</p>\n<h2><span id=\"CWC_.28the_comic_character.29_is_in_an_insane_asylum.2C_and_Sonichu_is_an_account_of_his_fantasies\"></span><span class=\"mw-headline\" id=\"CWC_(the_comic_character)_is_in_an_insane_asylum,_and_Sonichu_is_an_account_of_his_fantasies\">CWC (the comic character) is in an insane asylum, and Sonichu is an account of his fantasies</span></h2>\n<p>The comic can't seem to figure out what 'level' of reality it works on, as within the comic itself, Sonichu is a fictional character, an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AnimatedActors\" rel=\"nofollow\">Animated Actor</a> (being 'married' outside of 'the pages' but not within?), a real being, a being created though the will of CWC, and they can cross between CWCville and the 'real world' despite CWCville supposedly located in the real-world state of Virginia. The incongruities of the entire comic just screams madness.\n</p>\n<h2><span id=\"The_entire_comic_is_actually_how_Comic.21Chris_sees_the_world_of_Quickville\"></span><span class=\"mw-headline\" id=\"The_entire_comic_is_actually_how_Comic!Chris_sees_the_world_of_Quickville\">The entire comic is actually how Comic!Chris sees the world of <i>Quick</i>ville</span></h2>\n<p>Let's look at the facts. Allison Amber pretty much does everything a Mayor ought to do while Chris dicks around with hedgehog pokemon. Odds are, Comic!Bob was the previous mayor of the city, which is really named Quickville(He sees it as CWCville in his mind), and Allison lets him hang around her office and pretend to be mayor out of pity.\n</p><p>Chris likely follows Sonichu and company around and is certain that they all love him. He can't transform, but he wishes he could so he could be as awesome as his hero is. All the relationships have actual depth, but since Chris is the naive manchild he is in the real world, he assumes that they are all based around sex and proving your heterosexuality.\n</p><p>The retconning of Mary Lee Walsh to Slaweel Ryam? That's her actual name, Sonichu got sick of Chrissy calling her Mary and tried to explain that the two were different people. Chris being Chris, he took this to mean that Slaweel was impersonating Mary. Sonichu gave up after that.\n</p>\n<ul><li>But than, why did Darkbind help out against the \"Jerkops\"?\n<ul><li>Chris was actually loitering around an enemy base that he thought was a McDonalds inside a Wal-Mart. Darkbind had to save him from the three giant robots Slaweel had hidden there, and Chris later decided that the robots were the managers of said Wal-Mart. He then decided that he'd fought them all off. It explains why this is the only time \"Mecha-Jerkops\" appear.</li></ul></li></ul>\n<p><br/>\n</p>\n<h2><span id=\".22Solid_Chris.22.2C_.22Liquid_Chris.22_and_Solidius_Chris_.28better_known_as_David_Gonterman.29_are_all_clones_of_the_same_original_sample:_Ed_Wood\"></span><span class=\"mw-headline\" id='\"Solid_Chris\",_\"Liquid_Chris\"_and_Solidius_Chris_(better_known_as_David_Gonterman)_are_all_clones_of_the_same_original_sample:_Ed_Wood'>\"Solid Chris\", \"Liquid Chris\" and Solidius Chris (better known as <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DavidGonterman\" rel=\"nofollow\">David Gonterman</a>) are all clones of the same original sample: <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EdWood\" rel=\"nofollow\">Ed Wood</a></span></h2>\n<p>This one explains itself. Liquid Chris somehow got the better part of the deal. David Gonterman appears older due to advanced aging. Solid Chris appears to have a fondness for wearing panties, much like Ed Wood.\n</p><p>But why were clones of Ed Wood made? There are several possibilities:\n</p>\n<ul><li>The scientists involved were huge fans of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/MysteryScienceTheater3000\" rel=\"nofollow\">Mystery Science Theater 3000</a> and bad movies, and wished that bad movies on the level of Plan 9 would continue to be produced. It backfired, as none of them went into film.</li>\n<li>It was a government experiment to see if writing bad fiction was genetic. There may be more clones, and they're writing generic pulp fantasy and science fiction novels. <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UweBoll\" rel=\"nofollow\">Uwe Boll</a> may be one as well.</li>\n<li>It was actually <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/XanatosGambit\" rel=\"nofollow\">Ed Wood's plan</a> to have spare bodies for him to possess from beyond the grave. Chris's latest video (with him talking to himself in two different voices) seems to indicate that the plan has come to fruition.</li></ul>\n<p>Solid Chris seems to be affected by an advanced form of the FOXDIEYOU virus. In his appearances between 2007 and today his hairline has receded, he appears to have gained lots of weight and in general he just appears older.\n</p>\n<ul><li>Evidence against: Ed Wood was charming, hard-working, and by all accounts, a sweet guy who just had no talent. Considering how rarely Chris updates his comic, his hateful views on gay people (I don't know how he feels about transvestites like Wood, and remember, those panties were not his idea), and his generally asinine personality, he has little in common with Wood except lack of talent. If he is a clone of Wood, then that's all that carried across.\n<ul><li>Solid Chris is the <i>evil</i>, corrupted clone whose DNA sample was corrupted by the dark fizzy substance that is cherry cola, and had poor parenting who further warped the pitiful creature. Liquid Chris is the <i>good</i> clone, raised in a loving home and inherited Ed Wood's good qualities. Gonterman is somewhere in between. (additionally, Chris now wears a sports bra out of his own free will)\n<ul><li>Obviously, Solid Chris got all the recessive genes.</li></ul></li>\n<li>Perhaps Solidus Chris is <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/FanFic/ChristianHumberReloaded\" rel=\"nofollow\">Christan Humber</a> instead.\n<ul><li>But won't there still be a possibility of Solid Chris defeating Liquid.</li></ul></li></ul></li></ul>\n<h2><span id=\"Cly.28de.29_Cash_and_most.2C_if_not_all_the_trolls.2C_are_really_an_advanced-but-insane_A.I.\"></span><span class=\"mw-headline\" id=\"Cly(de)_Cash_and_most,_if_not_all_the_trolls,_are_really_an_advanced-but-insane_A.I.\">Cly(de) Cash and most, if not all the trolls, are really an advanced-but-insane A.I.</span></h2>\n<p>Clyde Cash and the other trolls are not real human beings, but rather an A.I. that's gone rogue, but instead of trying to take over the world, it just trolls people on the internet. For while its builders could build a brain for it out of microchips, they couldn't build it a heart.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Sonichu_is_part_of_Instrumentality_as_viewed_by_Chris.\">Sonichu is part of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NeonGenesisEvangelion\" rel=\"nofollow\">Instrumentality</a> as viewed by Chris.</span></h2>\n<p>It's presenting a world to him where he has absolute control, in an effort to get him to let down his AT Field. Like Shinji, Chris seems pretty good at being emotionally distance, so it's not working too well.\n</p>\n<h2><span id=\"Chris_isn.27t_real\"></span><span class=\"mw-headline\" id=\"Chris_isn't_real\">Chris isn't real</span></h2>\n<p>He's a character created by a talented artist depicting the life of a tormented autist. The Chris on the the videos? It's just an actor.\n</p>\n<ul><li>It's himself, but he's trolling everybody, pretending to be an aspie.\n<ul><li>Or he does have Aspergers, but is just playing up the stereotypical traits for laughs. So he is truly high-functioning, but just acts the opposite of it for humorous effect.\n<ul><li>Doesn't explain why he clearly lives with his parents in a trash-filled house.</li>\n<li>They could wreck the place before making a video, to make it look like a shithole?</li></ul></li></ul></li></ul>\n<ul><li>Unlikely. You have to be the greatest troll ever to Forge a psychological report, an entire history, and photos of a fictional person from babyhood to 27-28 yrs. old.\n<ul><li>This is WMG. \"Unlikely\" means nothing (or, alternatively, is the entire point).</li></ul></li></ul>\n<p><br/>\n</p>\n<h2><span id=\"In_a_continuation_of_the_last_theory.2C_Chris.27s_life_is_just_an_elaborate_hoax\"></span><span class=\"mw-headline\" id=\"In_a_continuation_of_the_last_theory,_Chris's_life_is_just_an_elaborate_hoax\">In a continuation of the last theory, Chris's life is just an elaborate hoax</span></h2>\n<p>All of the videos Chris posts are part of an ongoing <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/VlogSeries\" rel=\"nofollow\">Vlog Series</a> like <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Lonelygirl15\" rel=\"nofollow\">Lonelygirl15</a> or <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/KateModern\" rel=\"nofollow\">Kate Modern</a>; the videos that he takes down are archived on YouTube channels such as <a class=\"external text\" href=\"http://www.youtube.com/user/TheCWCvilleLibrary\" rel=\"nofollow\">TheCWCvilleLibrary</a> either by the creator himself or by an accomplice. The <i>Sonichu</i> comics? Not the product of a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/PsychopathicManchild\" rel=\"nofollow\">Psychopathic Manchild</a>, but of the ingenious creator wanting to give his series a distorted \"backstory\" of sorts. All the pictures from Chris's childhood? They're mostly real save for a few edits (some of the pictures were edited to include Bob and Barbra, Chris's parents), but they belong to either Chris's actor or a totally different kid who looked similar to him. Videos showing Chris IRL, such as the infamous <a class=\"external text\" href=\"http://www.youtube.com/watch?v=UFQrhp84jDo\" rel=\"nofollow\">Sonic the Hedgehog Watch &amp; Win Sweepstakes</a> <a class=\"external text\" href=\"http://www.youtube.com/watch?v=UGmYMGqnqL0\" rel=\"nofollow\">Pokemon</a> and <a class=\"external text\" href=\"http://www.youtube.com/watch?v=CtdX13t70vc\" rel=\"nofollow\">McIntire Park</a> news reports? The first and second are fake (or the former is real, but Chris's character is based on the child in the video (not my idea, someone came up with that theory in the video comments of either it or a mirror IIRC), while \"Chris\" walked into the third one for the lulz. Most of the major trolls, such as Clyde Cash, Vivian Gee and Liquid Chris? They're in on it. Everything else we know about Chris's life is also completely made up, and spread through sites such as <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EncyclopediaDramatica\" rel=\"nofollow\">Encyclopedia Dramatica</a> and CWCki to make the series all the more authentic.\n</p>\n<ul><li><ul><li>As much as I want to believe this (because it would be epic), how do you explain the two recorded-in-actual-legal-records arrests of CWC?\n<ul><li>They're real, Chris is just that dedicated.</li></ul></li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"The_Ghost_Buggy_shown_in_Sonichu_7_is_actually_Uboa\">The <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/FilmationsGhostbusters\" rel=\"nofollow\">Ghost Buggy</a> shown in Sonichu 7 is actually <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/YumeNikki\" rel=\"nofollow\">Uboa</a></span></h2>\n<p><a class=\"external text\" href=\"http://www.youtube.com/watch?v=YHW2dWMk2BU\" rel=\"nofollow\">lol</a>, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ShamelessSelfPromotion\" rel=\"nofollow\">Shameless Self-Promotion</a>.\n</p>\n<ul><li>It would explain the creepy dimension Sammy ends up going through.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Sonichu_will_end_with_a_Downer_Ending_due_to_Creator_Breakdown\"><i>Sonichu</i> will end with a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DownerEnding\" rel=\"nofollow\">Downer Ending</a> due to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/CreatorBreakdown\" rel=\"nofollow\">Creator Breakdown</a></span></h2>\n<p>One day, a troll will do something to affect Chris so drastically that he is sent into a deep depression. He takes out his sorrow on his dearest creation, his comic, and all the characters <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/KillEmAll\" rel=\"nofollow\">die in increasingly dark and depressing ways</a> (murder, suicide, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SickeninglySweethearts\" rel=\"nofollow\">because of a broken heart</a> and so on) until only Chris's <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AuthorAvatar\" rel=\"nofollow\">Author Avatar</a> is left. With his friends all gone, Comic!Chris is left with no choice but to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DrivenToSuicide\" rel=\"nofollow\">kill himself</a>. Basically, the ending will be like <a class=\"external text\" href=\"http://www.youtube.com/watch?v=o8xUfVy2POk\" rel=\"nofollow\">this</a>.\n</p>\n<h2><span class=\"mw-headline\" id=\"Alternative:_Sonichu_will_end_with_a_Downer_Ending_due_to_Creator_Backlash\">Alternative: <i>Sonichu</i> will end with a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DownerEnding\" rel=\"nofollow\">Downer Ending</a> due to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/CreatorBacklash\" rel=\"nofollow\">Creator Backlash</a></span></h2>\n<p>Chris either grows out of the whole <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ManChild\" rel=\"nofollow\">Man Child</a> thing (HA!) or ceases making comics due to the trolls like he threatened to do in a few of his videos. Out of either <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/OldShame\" rel=\"nofollow\">disgust at what he's created</a> or troll-induced spite, he <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/KillEmAll\" rel=\"nofollow\">ends all the characters' lives in brutal and over-the-top ways</a> and <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NukeEm\" rel=\"nofollow\">nukes CWCville</a>.\n</p>\n<h2><span class=\"mw-headline\" id=\"Sonichu_will_have_a_Gainax_Ending_that_combines_nearly_every_WMG_above_this\"><i>Sonichu</i> will have a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GainaxEnding\" rel=\"nofollow\">Gainax Ending</a> that combines nearly every WMG above this</span></h2>\n<p>It will be revealed that Chris is a clone of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EdWood\" rel=\"nofollow\">Ed Wood</a>, and he will fight Liquid Chris, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DavidGonterman\" rel=\"nofollow\">David Gonterman</a> (Solidus Chris), and later <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UweBoll\" rel=\"nofollow\">Uwe Boll</a> (Plasma Chris). Ivy will kill herself, believing that Chris had died in the battle with David Gonterman.\n</p><p>Liquid Chris will die, but kills Wild Sonichu and destroys the Sonichu Balls. Uwe Boll will manage to depower the Sonichu Medallion as a dying action, but the depowered Chris will brutally murder Uwe with a rusty pipe. Mary Lee Walsh (who is the attractive version the trolls use) mourns over Liquid's death, as she never got to tell him she loved him. Count Graduon approaches her with an offer of power.\n</p><p>Rosechu, Angelica and Bubbles will be killed by Silvana and the other evil Electric Hedgehog Pokemon; but Rosechu possesses Silvana, at last fulfilling her dream of having a pickle. Whether or not she gets to 'test drive' it is left up for debate.\n</p><p>Sonichu will give up his body, transferring his mind to a pickle (which grants him godhood somehow), to re-empower the Sonichu Medallion, so that Chris can defeat Count Graduon. However, this is not enough, and the Sonichu Medallion will be destroyed.\n</p><p>Mary Lee Walsh will refuse Count Graduon's control and absorbs his power instead, becoming a gigantic naked version of herself that starts absorbing the souls of everyone in the world, starting with CWCville. Most of the Electric Hedgehog Pokemon will be turned into fanta.\n</p><p>Pickle!Sonichu and Silvana!Rosechu will merge and become a divine, transcendent being named Godchu that enlightens Chris to his true nature of being Asexual; and that his Love Quest was really a Companionship Quest. Godchu then travels off to create a new universe.\n</p><p>With Chris' true nature revealed to himself, he loses his Virgin with Rage status, as he as always wanted... but not by losing his virginity, but rather his rage. This moment of enlightenment extends his consciousness across time and space and he contacts the various Electric Hedgehog Pokemon, including Sonichu and Rosechu (even though Sonichu and Rosechu no longer exist in the true sense). He asks for their power, but they tell him that he doesn't need their power... as he was the one who created them; he only forgot that he was God of CWC<i>World</i> due to his memory being altered by the AI Clyde Cash so that he was just the 'Mayor' of CWCVille in an effort to harness his awesome power. He is, however, still a clone of Ed Wood. We're not sure how this works.\n</p><p>With this, Chris' memory as a god of his fictional realm reawakened, and the answers all falling into place, he will transform into Collossal Chan, and battles the gigantic naked Mary Lee Walsh. Due to being asexual and knowing it finally, he is not distracted by MLW's <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Gainaxing\" rel=\"nofollow\">Gainaxing</a> and manages to destroy her... both both Chris and Mary Lee Walsh explode into millions of soul fragments, where they land, beautiful flowers grow, even on the surface of the moon. The land in which they battled becomes a literal sea of blood.\n</p><p>We are then treated to CWC's mental journey as he explores how he had selfishly twisted the world, and how he does not deserve his godhood, but neither wants to give it up, but also ponders cosmic suicide, and we never learn his decision.\n</p><p>At the end, Liquid Chris is lying on a beach at the edge of the sea of blood, confused as to why he's still alive when Wild had just killed him. The spirits of the other Clones appear, telling Liquid that he is now the True and Honest Christian Weston Chandler, as they all decided to give up their chance at resurrection to give him the gift of life; because he could play a real guitar as opposed to Guitar Hero. Mary Lee Walsh also appears from the sea of blood, and tells Liquid she loves him, and the True and Honest Christian Weston Chandler smiles; as his Love Quest is over.\n</p><p>Then there are twenty pages of the comic that are just solid blocks of color, but the last page is black with one white phrase printed on it:\n</p><p>\"...Ivy, I did it. I really did it.\"\n</p>\n<h2><span id=\"Someone.2C_somewhere.2C_will_write_.28or_has_already_written.29_a_David_Gonterman.2FCWC_Slash_Fic\"></span><span class=\"mw-headline\" id=\"Someone,_somewhere,_will_write_(or_has_already_written)_a_David_Gonterman/CWC_Slash_Fic\">Someone, somewhere, will write (or has already written) a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DavidGonterman\" rel=\"nofollow\">David Gonterman</a>/CWC <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SlashFic\" rel=\"nofollow\">Slash Fic</a></span></h2>\n<p>Think about how similar the two of them are: They're both infamous on the Internet for their <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/DarthWiki/Ptitlew9bltta3dv6n\" rel=\"nofollow\">So Bad It's Horrible</a> works and their bigoted natures. <sup>Okay, to give Gonterman credit he's improved on both aspects. Let's have the hypothetical ship be a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TimeParadox\" rel=\"nofollow\">Time Paradox</a> between past!Davy and present!Chris.</sup> Certainly, the two of them were made for each other. However, their love is not meant to flourish, as even the <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/PowersThatBe\" rel=\"nofollow\">Powers That Be</a> cannot handle the immense amount of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Squick\" rel=\"nofollow\">Squick</a>. If a fic with them as an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/OTP\" rel=\"nofollow\">OTP</a> were to be created, then the Internet, and maybe even the universe itself, would implode (and we won't/didn't notice). GodJesus help as all.\n</p><p>Also, if the above clone theory is true, said <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SlashFic\" rel=\"nofollow\">Slash Fic</a> would also be <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ScrewYourself\" rel=\"nofollow\">clonecest</a>. Huzzah!\n</p>\n<h2><span class=\"mw-headline\" id=\"Christian_will_become_a_national_celebrity.\">Christian will become a national celebrity.</span></h2>\n<p>The current business involving his possible eviction from his house will result in Chris finally backing up his threats of legal action and taking his situation to the courts as a harassment suit. Granted, the foundation for the case would be incredibly weak, but some slick, hotshot, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/JackThompson\" rel=\"nofollow\">Jack Thompsonesque</a> lawyer will manage to take the case all the way to the Supreme Court in a bid to win fame for tackling cyberbullying, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheNewRockAndRoll\" rel=\"nofollow\">the new threat to American society</a>. The case will be laughed out of court, but not before the media has spent months going over every sordid detail of Christian's life, spreading his infamy to the general public. After the case falls apart, Christian will be exploited by many tabloids, talk shows, used car commercials... basically, he'll be the new Gary Coleman. He will be a household name, forever remembered as that one guy you're glad you're not, a figure of self-parody who keeps digging himself deeper.\n</p><p>We expect to see terrible things from you, Mr. Chandler. Terrible, terrible things...\n</p>\n<h2><span id=\"Christian.27s_sexuality_is_Magi-chan.27s_plaything.\"></span><span class=\"mw-headline\" id=\"Christian's_sexuality_is_Magi-chan's_plaything.\">Christian's sexuality is Magi-chan's plaything.</span></h2>\n<p>Magi-Chan can bend anything; that includes sexuality.\n</p>\n<ul><li>Huh, that would explain why he doesn't have a heartsweet...</li></ul>\n<p><br/>\n</p>\n<h2><span id=\".22When.3F.22_said_the_moon.\"></span><span class=\"mw-headline\" id='\"When?\"_said_the_moon.'><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheProposition\" rel=\"nofollow\">\"When?\" said the moon.</a></span></h2>\n<p>Christian will shoot Naitsirhc to prevent him from telling schoolchildren that it is okay to be gay. Nait will quietly acknowledge \"You got me, Chris.\" Then, in his dying state, stumble outside, sit down on a small hummock, and watch the sunset. Chris, unable to deny pity for Nait, will mumble to the children \"I'm going to be with my brother.\" He will join Nait on the hummock and together they will watch the sun set. Nait will whisper \"What are you gonna do now, Chris?\" As Chris realizes that everything he knows is now gone and that he cannot think of an answer, Nait will slump to the ground, dead. Fade to black, and roll credits.\n</p>\n<h2><span class=\"mw-headline\" id=\"No_Ending\"><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NoEnding\" rel=\"nofollow\">No Ending</a></span></h2>\n<p>Due to all the STRESS in Chris' life, there's a good chance he will never finish it.\n</p>\n<ul><li>Well, he hasn't updated the comic since the end of February 2010. Supposedly he is \"<a href=\"/cwcki/100_2188\" title=\"100 2188\">not going to be on the internet much</a>\", because <s><a href=\"/cwcki/CWC_Blog#26_May_2010\" title=\"CWC Blog\">sitting on his dirty, crapped ass and playing video games</a></s> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BlatantLies\" rel=\"nofollow\">being active within his community</a> is more interesting. Since writing his comic requires more effort than filming himself raging or ranting, there's a good chance that we won't see Sonichu anymore...</li></ul>\n<h2><span class=\"mw-headline\" id=\"Sonichu_is_Videodrome\">Sonichu is <i><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Videodrome\" rel=\"nofollow\">Videodrome</a></i></span></h2>\n<p>The reading of <i>Sonichu</i> comics is in fact a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BrownNote\" rel=\"nofollow\">Brown Note</a>, causing brain tumours. It was specifically devised to attract the attention of internet trolls, give them the tumours, and kill them all, in order to protect the internet from getting \"too soft\". If we're lucky, Chris will be shot to death by Jason, causing his skull to erupt in cancerous growths. \"Death to Sonichu!\" Jason will shout, \"Long live the trolls!\" Jason will then stumble onto a derelict ship somewhere, where a TV message, ostensibly from Ivy but probably actually from Blanca, will tell him that he has nothing left but to commit suicide.\n</p>\n<h2><span id=\"The_people_of_CWCVille_burn_Chris_.28comics_version.29_as_a_virgin_sacrifice\"></span><span class=\"mw-headline\" id=\"The_people_of_CWCVille_burn_Chris_(comics_version)_as_a_virgin_sacrifice\">The people of CWCVille burn Chris (comics version) as a virgin sacrifice</span></h2>\n<p>Think about it. He's their \"king\". He's a virgin. He's a fool. The townsfolk have set the whole thing up as part of a springtime festival to trick him into being a sacrifice to ensure a plentiful harvest. They will lock him inside a gigantic <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheWickerMan\" rel=\"nofollow\">wicker effigy</a> and set it alight, while Sonichu himself leads the villagers in a chorus of \"So Need a Cute Girl\".\n</p>\n<ul><li>Where do the bees come in?</li></ul>\n<h2><span class=\"mw-headline\" id=\"Christian_is_the_horrifying_result_of_an_attempt_to_clone_David_Gonterman_and_The_Ultimate_Warrior\">Christian is the horrifying result of an attempt to clone <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DavidGonterman\" rel=\"nofollow\">David Gonterman</a> and <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ProfessionalWrestling\" rel=\"nofollow\">The Ultimate Warrior</a></span></h2>\n<p>We all know about the eerie similarities to Gonterman. But how else could we explain Chris's screaming, incoherent, homophobic, and occasionally violent YouTube rants than by assuming there's a little bit of The Ultimate Warrior in him, as well? And you know how Chris uses strange words or euphemisms in his comics and <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/RealLife\" rel=\"nofollow\">Real Life</a>? Well, any <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AtopTheFourthWall\" rel=\"nofollow\">Atop The Fourth Wall</a> or <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheSpoonyExperiment\" rel=\"nofollow\">The Spoony Experiment</a> fan can tell you that the Ultimate Warrior has, too, in <i>his</i> comics. (\"foked\", \"destrucity\", etc.)\n</p><p>Only one question remains: Who the hell would think combining those two was a good idea?\n</p>\n<ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheSpoonyExperiment\" rel=\"nofollow\">Dr. Insano</a></li>\n<li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UweBoll\" rel=\"nofollow\">Uwe Boll</a>?</li></ul>\n<h2><span class=\"mw-headline\" id=\"CWC_is_the_evil_counterpart_to_Stephen_Fry.\">CWC is the evil counterpart to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/StephenFry\" rel=\"nofollow\">Stephen Fry</a>.</span></h2>\n<p>Fry is funny, charming, intelligent, gay, and with an interest in technology that extends to amassing thousands of followers on Facebook. CWC is funny only by accident, repulsive, stupid (and not in an autistic way), homophobic, and whose interest in technology extends only to putting crap on the internet and downloading porn. The fact that Fry is British and CWC is American could be counted as another one, but that would have <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UnfortunateImplications\" rel=\"nofollow\">Unfortunate Implications</a>. Besides which, if he were really Fry's opposite, he'd be French.\n</p>\n<h2><span class=\"mw-headline\" id=\"CWC_is_the_evil_counterpart_to_Randall_Munroe.\">CWC is the evil counterpart to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/XKCD\" rel=\"nofollow\">Randall Munroe</a>.</span></h2>\n<p>Stronger similarities, including relations to a girl named Megan (which the haters have officially declared must be stalking related) and an overall lack of effort in their comics art. Munroe, however, used his influence to <a class=\"external text\" href=\"http://xkcd.com/481/\" rel=\"nofollow\">make the world a better place.</a>\n</p>\n<h2><span id=\"Chris.27_entire_life_is_a_defictionalized_version_of_Kafka.27s_Metamorphosis\"></span><span class=\"mw-headline\" id=\"Chris'_entire_life_is_a_defictionalized_version_of_Kafka's_Metamorphosis\">Chris' entire life is a defictionalized version of Kafka's Metamorphosis</span></h2>\n<p>Or, barring that, there are still lots of obvious parallels.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Christian_is_Porky_Minch_from_Mother_3\">Christian is Porky Minch from <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Mother3\" rel=\"nofollow\">Mother 3</a></span></h2>\n<p>Just look at the facts:\n</p>\n<ul><li>Both created a city centered entirely around their own ego (CWCville/New Pork City)</li>\n<li>Both created an artificial \"son\" as compensation for being unable to father one biologically (Sonichu/The Masked Man)</li>\n<li>Both surround themselves with mementos of an old \"friend\" that has long since abandoned them (Megan/Ness)</li>\n<li>Both are children trapped in an adult's body</li>\n<li>Both have neglectful and careless parents</li>\n<li>Both are chubby and somewhat overweight</li>\n<li>Both merge creatures together (The Chimera's/Sonichu)</li></ul>\n<ul><li><ul><li>As much as I like this theory, those symptoms are relatively common traits of nerdy, socially inept manchildren. (taken <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UpToEleven\" rel=\"nofollow\">Up To Eleven</a> in these cases, naturally)</li>\n<li>This theory is explored in more detail in <a href=\"/cwcki/User:Clydec/porkypasta\" title=\"User:Clydec/porkypasta\">this</a> copypasta.</li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"The_main_trolls_of_Christian_Weston_Chandler_are_the_heroes_from_Earthbound\">The main trolls of Christian Weston Chandler are the heroes from Earthbound</span></h2>\n<p>Ness is Cylde Cash, Paula is Vivian Gee, Jeff is Liquid Chris, and Poo is Jason Kendrick Howell.\n</p><p><br/>\n</p>\n<h2><span id=\"Alternatively.2C_they_are_the_heroes_of_Mother_3\"></span><span class=\"mw-headline\" id=\"Alternatively,_they_are_the_heroes_of_Mother_3\">Alternatively, they are the heroes of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Mother3\" rel=\"nofollow\">Mother 3</a></span></h2>\n<ul><li>Lucas=Clyde Cash</li>\n<li>Duster=Alec Benson Leary</li>\n<li>Kumatora=Vivian Gee</li>\n<li>Boney=???</li>\n<li>In that same vein, Claus could be Ryan Cash.</li></ul>\n<h2><span id=\"The_reason_he_wants_a_boyfriend-free_girl_is_because_he_doesn.27t_mind_a_girlfriend_with_a_girlfriend\"></span><span class=\"mw-headline\" id=\"The_reason_he_wants_a_boyfriend-free_girl_is_because_he_doesn't_mind_a_girlfriend_with_a_girlfriend\">The reason he wants a boyfriend-free girl is because he doesn't mind a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GirlOnGirlIsHot\" rel=\"nofollow\">girlfriend with a girlfriend</a></span></h2>\n<p>Just saying.\n</p>\n<h2><span id=\"The_Medallions_of_Fail_are_not_made_of_clay.2C_but_rather_psitanium\"></span><span class=\"mw-headline\" id=\"The_Medallions_of_Fail_are_not_made_of_clay,_but_rather_psitanium\">The Medallions of Fail are not made of clay, but rather <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/PsychoNauts\" rel=\"nofollow\">psitanium</a></span></h2>\n<p>Over the past several years, Chris-chan has become less and less sane. Psitanium makes the mentally unstable less stable. Simple as that.\n</p>\n<h2><span id=\"Alternatively.2C_The_Medallions_of_Fail_are_Horcruxes\"></span><span class=\"mw-headline\" id=\"Alternatively,_The_Medallions_of_Fail_are_Horcruxes\">Alternatively, The Medallions of Fail are Horcruxes</span></h2>\n<p>There are many <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/PlotCoupons\" rel=\"nofollow\">Plot Coupons</a> that can cause a person in possession of it to slowly lose their sanity, but Horcruxes can be disguised as retarded looking bling. Chris made the medallions long ago and they somehow got the pieces of someone's soul bound to them (seriously, who'd think to look for someone's soul in some fat moron's retarded medallion?). Ever since then they've been slowly causing Chris to lose more sanity from the limited amount he already had.\n</p>\n<h2><span id=\"No.2C_all_of_the_Relics_of_Fail_are_Horcruxes.\"></span><span class=\"mw-headline\" id=\"No,_all_of_the_Relics_of_Fail_are_Horcruxes.\">No, all of the Relics of Fail are Horcruxes.</span></h2>\n<p>Creating a Horcrux requires a murder. Chris murdered BILLY MAYS to make the Amnyfest Ring into a Horcrux. He caused Ryan Cash's death to make the Sonichu Medallion into a Horcrux. Mike Jackson -- the Gitar. Sarah May -- the Attraction Sign. Patti -- the <i>SailorMoon</i> poster. Presumably he just has to strangle Clyde Cash to make his PS3 into a Horcrux, and then take care of Liquid Chris to Horcrucise his Man-bra.\n</p>\n<h2><span class=\"mw-headline\" id=\"One_last_theory_about_the_Medallions\">One last theory about the Medallions</span></h2>\n<p>They have lead paint on them, which, if true, should probably explain everything.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Liquid_Chris_is_actually_Christopher_Thorndyke\">Liquid Chris is actually <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SonicX\" rel=\"nofollow\">Christopher Thorndyke</a></span></h2>\n<p>As <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/RescuedFromTheScrappyHeap\" rel=\"nofollow\">his role in Season 3</a> indicates, had Liquid not met Sonic &amp; company, he would have been just as annoying, if not more.\n</p>\n<ul><li><ul><li>He comes off as more bizarro-Chris; his parents aren't ridiculously rich but middle-class at best rednecks.</li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"TGWTG.com_is_going_to_team_up_against_Chris.\"><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ThatGuyWithTheGlasses\" rel=\"nofollow\">TGWTG.com</a> is going to team up against Chris.</span></h2>\n<p>We already know that two members of the site are \"fans\" of his: Guru Larry and Happy Harry. If more of the reviewers find out about Chris and become trolls as well, it could escalate into a second Brawl in which the Critics and Gamers (or at least the British ones, apparently) band together to defeat Chris once and for all.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_and_the_trolls_are_working_together.\">Chris and the trolls are working together.</span></h2>\n<p>Chris enjoys the attention, so he and other trolls have constructed this elaborate hoax to get onlookers.\n</p><p><br/>\n</p>\n<h2><span id=\"Chris_is_Bizarro.2FLiquid.2FEvil.2Fsome_other_kind_of_counterpart_Christian_Humber\"></span><span class=\"mw-headline\" id=\"Chris_is_Bizarro/Liquid/Evil/some_other_kind_of_counterpart_Christian_Humber\">Chris is Bizarro/Liquid/Evil/some other kind of counterpart <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/FanFic/ChristianHumberReloaded\" rel=\"nofollow\">Christian Humber</a></span></h2>\n<ul><li>Both go by Christian. One was given that name, the other took the name himself.</li>\n<li>Both are <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GiftedlyBad\" rel=\"nofollow\">Giftedly Bad</a>. One made something insane but never intended to release it to anyone else, the other uploaded it to the internet himself.</li>\n<li>Both write themselves in as a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GodModeSue\" rel=\"nofollow\">God Mode Sue</a>. One is completely unrestrained and over-the-top, the other originally started as a somewhat independent character but was eventually upstaged by the <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AuthorAvatar\" rel=\"nofollow\">Author Avatar</a>.</li>\n<li>One has an almost <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NoHuggingNoKissing\" rel=\"nofollow\">No Hugging No Kissing</a> setting, the other... <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Yiff\" rel=\"nofollow\">let's not</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/FanDisservice\" rel=\"nofollow\">go there</a>.</li>\n<li>One seems to have no internet presence whatsoever and may have even grown out of it, the other continues to cultivate a devoted <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Hatedom\" rel=\"nofollow\">Hatedom</a> and makes himself trollbait to this day.</li></ul>\n<p>The parallels are frightening.\n</p>\n<h2><span class=\"mw-headline\" id=\"Sonichu_is_The_King_In_Yellow\">Sonichu is <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheKingInYellow\" rel=\"nofollow\">The King In Yellow</a></span></h2>\n<p>Think about it.\n</p>\n<ul><li>Its creator is insane from exposure.</li>\n<li>It starts looking innocent, but becomes sinister and maddening, and the madness is only exacerbated by the way it looks innocent</li>\n<li>All who read it go mad, and become obsessed with bringing it down. One person committed suicide.</li>\n<li>Sonichu is yellow.</li></ul>\n<ul><li><ul><li>Well, damn, there goes my fanfic idea that Sonichu is really an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EldritchAbomination\" rel=\"nofollow\">Eldritch Abomination</a>!\n<ul><li>Then why isn't everyone else who read it gone insane? Then again, maybe only people who act it out or deeply analyze it are driven to insanity. Which explains why Vivian's commentary has gone from normal to insane <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Angrish\" rel=\"nofollow\">angrish</a>.</li></ul></li></ul></li></ul>\n<h2><span id=\"PVCC_can_get_away_with_all_the_property_damage.2C_destruction.2C_mayhem_and_murder_because_they_can_afford_it\"></span><span class=\"mw-headline\" id=\"PVCC_can_get_away_with_all_the_property_damage,_destruction,_mayhem_and_murder_because_they_can_afford_it\">PVCC can get away with all the property damage, destruction, mayhem and murder because they can afford it</span></h2>\n<p>The worst crime in CWCville is smoking, which has a 1500$ fine. If that's the worst crime there is, then with <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ScrewTheRulesIHaveMoney\" rel=\"nofollow\">enough money, they can do whatever they want</a>. Hell, their random destruction sprees may be what pays for the services around town.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_is_a_Real_Life_Black_Hole_Anti_Sue\">Chris is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/RealLife\" rel=\"nofollow\">Real Life</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BlackHoleSue\" rel=\"nofollow\">Black Hole</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AntiSue\" rel=\"nofollow\">Anti Sue</a></span></h2>\n<p>Think about it: In his childhood he was in the news <a class=\"mw-redirect\" href=\"/cwcki/IT_TOOK_A_TALKING_BEAR_TO_GIVE_THE_NAME_A_YOUNG_BOY_LOVES\" title=\"IT TOOK A TALKING BEAR TO GIVE THE NAME A YOUNG BOY LOVES\">at least</a> <a href=\"/cwcki/Sonic_the_Hedgehog_Watch_%26_Win_Sweepstakes\" title=\"Sonic the Hedgehog Watch &amp; Win Sweepstakes\">twice</a>, not to mention him being partially featured in <a class=\"external text\" href=\"http://www.youtube.com/watch?v=vcKsEo52kC8\" rel=\"nofollow\">another broadcast</a> as a teen, and in his adulthood he and his comic have gone from being obscure, insignificant pieces of filth amongst the putrid trash heap that is the Internet to, well, being \"famous.\" He also has <a class=\"mw-redirect\" href=\"/cwcki/White_knight#Reasons_against_white_knighting\" title=\"White knight\">more flaws</a> <a href=\"/cwcki/Chris_and_religion#Concept_of_sin\" title=\"Chris and religion\">than the</a> <a href=\"/cwcki/Chris_and_anger\" title=\"Chris and anger\">average</a> <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_his_Ego\" title=\"Chris and his Ego\">human being</a> (<a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Flanderization\" rel=\"nofollow\">or at least highly exaggerated ones</a>) and has a \"<a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Hatedom\" rel=\"nofollow\">fan base</a>\" composed solely of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/troll\" rel=\"nofollow\">Troll</a>s and <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Squick\" rel=\"nofollow\">disgusted</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BileFascination\" rel=\"nofollow\">but morbidly curious</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Troper\" rel=\"nofollow\">bystanders</a>, the majority of which enjoy watching his life <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ItGotWorse\" rel=\"nofollow\">get flushed down the toilet and dumped into a lake of lava in Hell</a>. So basically, the world really does revolve around Chris, just like he thinks; the spot light is on him, and all that's on stage are his faults.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_has_connections_with_a_certain_group\">Chris has connections with <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ChurchOfHappyology\" rel=\"nofollow\">a certain group</a></span></h2>\n<p>In one of his <a href=\"/cwcki/CWC_Blog#28_December_2009\" title=\"CWC Blog\">blog entries on CWCipedia</a>, he told Clyde Cash and Jack Thaddeus to \"Go Into F***ing Scientology.\" Of course, that could have just been an insult, but what if he really was asking them to join? Maybe not all of Chris's money comes from the \"monthly tugboat.\" Why anyone would bribe <i>Chris</i>, of all people, into finding them more followers is beyond me, though.\n</p><p>That, and their ad is showing on this page for some reason...\n</p>\n<h2><span id=\"Chris_is_a_Time_Lord.21\"></span><span class=\"mw-headline\" id=\"Chris_is_a_Time_Lord!\">Chris is a Time Lord!</span></h2>\n<p>And the Time Lords are in fucking despair that this is the case. They thought it couldn't get worse than that time he put his sonic screwdriver in his ass, but after that horrible incident with...urgh, no, it doesn't even bear thinking about. Suffice it to say that Chris' Sonichu medallion is the equivalent of Professor Yana's fob-watch and, if he ever works out how to open it, he will be restored with all his Time Lord powers and memories... and will probably kill himself there and then out of shame.\n</p><p><br/>\n</p>\n<h2><span id=\"Alternatively.2C_Chris_is_actually_Haruhi_Suzumiya\"></span><span class=\"mw-headline\" id=\"Alternatively,_Chris_is_actually_Haruhi_Suzumiya\">Alternatively, Chris is actually <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SuzumiyaHaruhi\" rel=\"nofollow\">Haruhi Suzumiya</a></span></h2>\n<p>Well, someone has to be and it's definitely not the inflatable sex doll.\n</p>\n<h2><span id=\"Chris_is_real...and_a_hoax.21\"></span><span class=\"mw-headline\" id=\"Chris_is_real...and_a_hoax!\">Chris is real...and a hoax!</span></h2>\n<p>Barbara &amp; Bob are scientists who set out to methodically raise the worst person imaginable. They either are continuing the experiment, or <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BecomingTheMask\" rel=\"nofollow\">went insane and became their characters.</a>\n</p>\n<h2><span id=\"Curse-ye-ha-me-ha_does.2C_in_fact.2C_work\"></span><span class=\"mw-headline\" id=\"Curse-ye-ha-me-ha_does,_in_fact,_work\">Curse-ye-ha-me-ha does, in fact, work</span></h2>\n<p>Unfortunately for Chris, it doesn't work the way he wants it to: every time he uses it to curse someone, it brings bad luck and extreme misfortune <b><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HoistByHisOwnPetard\" rel=\"nofollow\">to him</a></b> (though it's not clear whether he's using the attack wrong or it is specifically targeted at him to begin with). This is the real reason why everything in his life is going wrong.\n</p>\n<ul><li>So what does that make \"forgiveness blessings\"?\n<ul><li>Clearly they don't make his life better, so either he's using them right, and blesses people he tried to curse earlier, or he's using them wrong, and blesses completely random people.\n<ul><li>Now I understand where that fifty buck note on my pillow came from! Thank you, Chris!</li></ul></li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_has_moved_to_a_donut_shop_in_Oregon\">Chris has moved to a donut shop in Oregon</span></h2>\n<p>That's how he's able to make edits as 62.205.254.105! The Chandler family moved to Oregon and now own a donut shop, and Chris hasn't announced it yet, thinking the trolls won't be able to find him. <sup>But really guys, it's a troll. Chris would most likely use his name or a <i>Sonichu</i>-related handle (Reldnahc, Sonichu, etc.) if it really was him, or it'd at least be <i>extremely</i> obvious that it is. Also, I imagine him finding the <i>Sonichu</i> page would warrant a video or two (if he actually bothered to read through it, anyway; chances are, he probably wouldn't get to the end of the introduction).</sup>\n</p>\n<ul><li>62.205.254.105 isn't Chris, because he/she/it DOESN'T type Like This.</li></ul>\n<h2><span id=\"Chris_is_Nyarlatothep.27s_avatar\"></span><span class=\"mw-headline\" id=\"Chris_is_Nyarlatothep's_avatar\">Chris is Nyarlatothep's avatar</span></h2>\n<p>Clearly, old Nyarly plans to confuse people and create mass amounts of chaos on the internets by acting as this weird autistic failure of a man-child. why? For the ensuing Hilarity of course... Or something, I don't know how he thinks, but basically, he's BOTH a Troll and an Eldritch Abomination.\n</p>\n<ul><li>Holy crap, without even seeing this WMG I thought something like that. But instead Nyarlatothep was moonlighting as Kim Jong-il, too, doing the same thing in real life that Chris is doing on the internet.</li></ul>\n<p><br/>\n</p>\n<h2><span id=\"If_every_person.2C_place_or_thing_on_the_internet_was_a_civilization.2C_Chris_would_be_Egypt.\"></span><span class=\"mw-headline\" id=\"If_every_person,_place_or_thing_on_the_internet_was_a_civilization,_Chris_would_be_Egypt.\">If every person, place or thing on the internet was a civilization, Chris would be Egypt.</span></h2>\n<p>Think about it: He gets blasted by trolls and still comes back for more, just like how Egypt gets conquered constantly but always comes back.\n</p>\n<ul><li><ul><li>The trolls would be Vikings, then.</li></ul></li></ul>\n<p><br/>\n</p>\n<h2><span id=\"The_man_in_Chris.27_videos_isn.27t_a_troll\"></span><span class=\"mw-headline\" id=\"The_man_in_Chris'_videos_isn't_a_troll\">The man in Chris' videos isn't a troll</span></h2>\n<p>He's actually someone Chris hasn't managed to alienate. Yet.\n</p>\n<h2><span class=\"mw-headline\" id=\"Allison_was_blacklisted.\">Allison was blacklisted.</span></h2>\n<p>Something happened, like she got seriously injured in a shoot, and during her stint in the hospital, her investments tanked due to the economic collapse, her bills ate her surviving savings, and she couldn't sue the studio because during a painkiller induced bit of stupid thinking she made threatening calls against the director which she ultimately agreed to not sue in exchange for them not pressing charges for emotionally scarring his kid when he accidentally picked up. Anyways, sad background aside, she couldn't get any more work until she applied to be CWCville's mayor, and lied about her past because Chris is an idiot and would fall for it.\n</p>\n<h2><span id=\"Chris_is_an_Alternate_Universe_version_of_Doctor_Frankenstein.3B_Sonichu_is_the_monster.\"></span><span class=\"mw-headline\" id=\"Chris_is_an_Alternate_Universe_version_of_Doctor_Frankenstein;_Sonichu_is_the_monster.\">Chris is an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AlternateUniverse\" rel=\"nofollow\">Alternate Universe</a> version of Doctor Frankenstein; Sonichu is the monster.</span></h2>\n<p>Chris is basically a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/MadScientist\" rel=\"nofollow\">Mad Scientist</a> without the Scientist part, and created the Sonichus and Rosechus by cobbling together parts of other characters. Sounds like Doctor Frankenstein to me alright.\n</p>\n<ul><li><ul><li>That means that Sonichu killed Ivy: \"I will be with you on your wedding night\".</li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"There_are_multiple_realities_that_all_of_this_is_occuring_in.\">There are multiple realities that all of this is occuring in.</span></h2>\n<p>The first is the one everyone is familiar with- the one that I'm writing this and you're reading it in.\n</p><p>The second reality is the reality of the comics, a bizarre universe where nothing makes any sense. It also includes other entirely fictional creations such as Family Guy, Pokemon, Transformers, and god only knows what else. This is essentially Chris's utopia and the kind of world he wishes to live in, but he has so much trouble seperating the first level of reality from that of the comics that whenever something upsets him, it forces it's way into his fictional universe.\n</p><p>The third reality lies somewhere between the first two, and encompasses the second like the first encompasses the other two. It's linked very closely with Chris' thought process. Here the characters seen in the second reality (that of the comics) are thier \"real\" selves- essentially actors. The comics, except for a few blurbs where the 'actors' break character (similar to how Superman used to shill for fruit pies), are considered to be a fictional creation that the characters make as part of thier job, like a play or television show, just told in comic form. Similar to Chris, though, the 'actors' have trouble keeping thier creations and thier reality seperated, leading to a large degree of crossover. While the characters don't exist in the real world (except as godawful comics), they ARE aware of it and what happens to Chris in it. Whenever they act like they're not, they're doing it for the sake of Expospeak.\n</p><p>Chris' mind and the two sub-universes are basically the same thing, as evidenced by him pretty much just putting down a bunch of stream-of-consciousness stuff and calling it a comic. To him, all three universes are equally real, but he finds himself stuck in this one and seems to beleive that getting a girlfriend and losing his virginity will make his real life essentially the same as that of the comics (or maybe he thinks something entirely different, but I'm pretty sure he beleives that getting laid will solve all of his problems instantly.)\n</p><p><br/>\n</p>\n<h2><span id=\"Chris-Chan.27s_nightmare_of_people_being_destroyed_in_a_factory_ISN.27T_a_nightmare.2C_but_a_subconscious_desire.\"></span><span class=\"mw-headline\" id=\"Chris-Chan's_nightmare_of_people_being_destroyed_in_a_factory_ISN'T_a_nightmare,_but_a_subconscious_desire.\">Chris-Chan's nightmare of people being destroyed in a factory ISN'T a nightmare, but a subconscious desire.</span></h2>\n<p>Given the brutality in his recent comics, it's likely Chris would like to see everyone he sees as undesirable destroyed. Yes, he claims it's a nightmare, but he was looking on. And considering how little he cares for anyone beside himself, it's hard to see him horrified by the sight, especially if he really felt that this was simply justice being done.\n</p><p>And really, the person running the factory would be Chris himself.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris-Chan_is_a_Genius\">Chris-Chan is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GeniusTheTransgression\" rel=\"nofollow\">Genius</a></span></h2>\n<p>An Unmada, to be precise. He probably catalyzed as a Neid or a Stauren, depending on whether he catalyzed after winning the Sonic the Hedgehog contest, or sometime after making Sonichu. The reason he hasn't made any Wonders yet is beacuse he's too lazy to actually study any of the Axioms: The peerage isn't supid enough to let Chris learn Metatropi or Katastropi (or anything else, really), and the few Lemurians who even know about Chris are probably trolls anyway. In fact, the Numerologists might have even set up the CWC wiki and the ED page on purpose to try and drive Chris to suicide, because Chris represents everything they stand against; Idiots with too much free time mucking around on the internet.\n</p>\n<ul><li>Does that make the trolls his Manes?</li>\n<li>Bull Honkey. If anything, Christian is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EmptyShell\" rel=\"nofollow\">Clockstopper</a>. Specifically, he has the ability that makes art and music impossible to understand within his aura. The good news is, continuing to upgrade that skill will make it impossible for him to understand <i>written language</i>, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AndThereWasMuchRejoicing\" rel=\"nofollow\">keeping him off the internet forever</a>. The bad news is... picture someone like him being <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ImmuneToBullets\" rel=\"nofollow\">Immune To Bullets</a> or able to whip up <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TorchesAndPitchforks\" rel=\"nofollow\">an angry mob</a>.\n<ul><li>Whup up an angry mob, yes, that sounds like something Chris-Chan would do. But control it? Remember, a Dramatic Failure would cause the mob to turn on the caller... Also, let's remember that Chris has proven incapable of learning <i>anything</i>. He's probably stuck with whatever powers he has unless a Numerologist decides to do something stupid.</li></ul></li>\n<li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DavidGonterman\" rel=\"nofollow\">David Gonterman</a> could be a Neid though, given his love of science fiction. If he actually creates <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AndIMustScream\" rel=\"nofollow\">the kind</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UnwillingRoboticisation\" rel=\"nofollow\">of stuff</a> he fantasizes about, though, he will be <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/JumpingOffTheSlipperySlope\" rel=\"nofollow\">Jumping Off The Slippery Slope</a> very quickly.</li>\n<li>Guys, guys, guys, It's very obvious that Chris-Chan is actually a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ChangelingTheLost\" rel=\"nofollow\">True Fae</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AngelUnaware\" rel=\"nofollow\">Charlatan</a>\n<ul><li>...<i><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/OhCrap\" rel=\"nofollow\">Oh fuck</a></i>.</li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"Sonichu_is_actually_a_prediction_of_the_future\">Sonichu is actually a prediction of the future</span></h2>\n<p>Perhaps CWCville was built upon the remains of Ruckersville, Virginia <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AfterTheEnd\" rel=\"nofollow\">after the end</a>, when Chris declared himself \"mayor\" (see: \"dictator\"). When Chris found the portal in his room to future CWCville, he decided to warn people in the present so we can prevent the end of the world. In fact, Pokemon and Sonic characters may have been introduced to the real world as a strange effect of the apocalypse; furthermore, the end of the world may have significantly altered the laws of physics enough to make it so everything in Sonichu could actually happen. Chris-chan is our savior, and we must take his advice soon or he will be the one to have the last laugh, ruling over all who didn't believe him in the totalitarian empire known as \"CWCville\".\n</p>\n<h2><span class=\"mw-headline\" id=\"The_next_villain_in_Sonichu_will_be_based_on_CWCki\">The next villain in <i>Sonichu</i> will be based on CWCki</span></h2>\n<p>Chris recently discovered it, and they not only mock him, but it seems that they also interfered with his Love Quest. Chris simply <i>can't</i> leave this unavenged.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_is_actually_the_basis_for_the_for_Bioshock\">Chris is actually the basis for the for Bioshock</span></h2>\n<ul><li>Chris is actually Andrew Ryan (The egotistical, selfish, cruel, power hungry, creator)</li>\n<li>Cwcville is actually Rapture (The Crazy dystopia that has \"Free will\" but eventually ends up with only a few business chains and eventually goes to hell...)</li>\n<li>Naitsirhc is Frank Fontaine ( The equally cruel and power hungry Rival to Chris/Andrew)</li>\n<li>Mary Lee Walsh is Sofia Lamb ( She wishes to change said dystopia in her image and promotes the common good, came to help Chris/Andrew initially, but eventually turns everything upside down)</li>\n<li>Various Sonichus are Splicers (Genetically modified that are different types of Body Horror , each having unique abilities do to their creator ( Plasmids and tonics could make an electric hedgehog techincally...))</li>\n<li>Sonees (Those grotesque offspring of the sonichus) are little sisters, I can't support this but the lack of how often they appear they could be harvesting dead corpses</li>\n<li>Rosechu is Rosebud, an antagonizing splicer that follows you through part of the game (both lose their babies to becoming Sonee/Little sisters and go mad from it)</li>\n<li>Bill the scientist is Dr. Tenenbaum (initially works for Naitsirhc, helps in creating the <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EldritchAbomination\" rel=\"nofollow\">Other Sonichus</a> but inevitably wants to reform)</li>\n<li>Jasmine Jolene is ANY GODDAMN TROLL THE MORON PICKS UP (Love interest to Chris/Andrew but inevitably betrays him.</li></ul>\n<p>And Last but not least\n</p>\n<ul><li>You, the reader, unsung hero in this mess are Jack Ryan, the protagonist in Bioshock (The silent protagonist, (You can type but i can't here you) must slug your way through a hell of which is unknown to some mere mortals, it is a frightening journey to the center of the egotistical twit's mind. but you may survive if you keep your wits. And you may/may not be related to the psychopath that made this.\n<ul><li>Alternatively, Jack is Cole Smithey, who is a fairly normal, if impressive, guy, just wants to avoid contact with Chris (in other words, return to the surface), and is related to him, half-brothers in this case. Also, eventually becomes unsure of who his father really is.</li></ul></li></ul>\n<p>My Question: Who'd be the big daddies?\n</p>\n<ul><li><ul><li>Good theory, now we need a Delta and Elenor. Also, does this mean I eventually get to smash Chris' face in with a golf club?</li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"Magi-chan_is_a_Bizarro_Universe_version_of_Commander_Khan\">Magi-chan is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BizarroUniverse\" rel=\"nofollow\">Bizarro Universe</a> version of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EliteBeatAgents\" rel=\"nofollow\">Commander Khan</a></span></h2>\n<p>Mostly because the two of them are known to monitor their general area, and Magi-Chan has, on occasion, told the heroes where to go and what do do.\n</p>\n<h2><span id=\"Of_all_the_people_to_partake_in_the_executions_of_the_Asperpedia_trolls.2C_Kel_was_the_only_one_to_express_remorse.\"></span><span class=\"mw-headline\" id=\"Of_all_the_people_to_partake_in_the_executions_of_the_Asperpedia_trolls,_Kel_was_the_only_one_to_express_remorse.\">Of all the people to partake in the executions of the Asperpedia trolls, Kel was the only one to express remorse.</span></h2>\n<p>I mean, look at her in the picture she's shooting Shawn! She looks like she's doped up on something. I think they actually drugged an underaged girl so she could partake in the senseless slaughter.\n</p><p><br/>\n</p>\n<h2><span id=\"Chris_is_leaving_for_good.2C_but_not_on_his_own_accord.\"></span><span class=\"mw-headline\" id=\"Chris_is_leaving_for_good,_but_not_on_his_own_accord.\">Chris is leaving for good, but not on his own accord.</span></h2>\n<p>In order to pay for the hospital bills, or so that his son doesn't keep humiliating them on the Internet, or both, Bob finally chopped down Chris' Internet. The likelihood that he moves out and gets his own Internet is likely non-existent.\n</p>\n<ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Jossed\" rel=\"nofollow\">Jossed</a>, <a href=\"/cwcki/Cleveland_Show_Voice_Rant\" title=\"Cleveland Show Voice Rant\">unfortunately</a>. That being said, it's very likely that someone else (his pastoral counselor, mysterious \"Young Adult Social Group\"?) made him do <a href=\"/cwcki/03212010_C-Ya_Later.MOV\" title=\"03212010 C-Ya Later.MOV\">his previous video</a>... but <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AttentionWhore\" rel=\"nofollow\">Chris being Chris</a>, as soon as he was left without supervision, simply couldn't stop himself from making another video.</li></ul>\n<h2><span id=\"We_all_live_in_the_comic._The_comic_is_our_window_to_what_is_actually_the_.22real.22_world._Chris_is_god.\"></span><span class=\"mw-headline\" id='We_all_live_in_the_comic._The_comic_is_our_window_to_what_is_actually_the_\"real\"_world._Chris_is_god.'>We all live in the comic. The comic is our window to what is actually the \"real\" world. Chris is god.</span></h2>\n<p>Well... It would be one hell of a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/MindScrew\" rel=\"nofollow\">mind screw</a> if it was so, no?\n</p>\n<ul><li><ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BigNo\" rel=\"nofollow\">NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO</a>\n<ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/OverlyLongGag\" rel=\"nofollow\">OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO</a></li></ul></li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_is_a_less_dangerous_version_of_Michael_Meyers\">Chris is a less dangerous version of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Halloween\" rel=\"nofollow\">Michael Meyers</a></span></h2>\n<p>He hasn't (yet) killed anyone (that we know of) and wasn't institutionalized when he was a kid. As a result he was allowed to slowly grow wider and less dangerous until he finally reached the point where he is now physically unable to do anything near what Meyers can do. His (possibly eventual) killing spree won't claim the lives of anyone who can run 10 feet without passing out.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris-chan_is_just_a_character_created_by_a_Psychology_professor_and_is_using_us_to_study_the_effects_of_Mobthink.\">Chris-chan is just a character created by a Psychology professor and is using us to study the effects of Mobthink.</span></h2>\n<p>Everyone in the mythos of Sonichu has been asked to act. Chris really isn't the way he acts: it's part of an experiment on how far mobthink can go, and if so, what causes you to be an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/AcceptableTarget\" rel=\"nofollow\">Acceptable Target</a>? Hence the creation of CWC. Sonichu is really drawn by his younger children and the porn was provided by other outside influences. He's tried to end the experiment (hence the Leaving Teh Intarwebz videos) but <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/ForScience\" rel=\"nofollow\">For Science</a> he still keeps the research ongoing. In short, he's being a Jane Goodall for the trolls- studying them over a lengthy period of time in order to better understand them. He's been doing it ten years- the experiment's almost at its conclusion.\n</p>\n<h2><span class=\"mw-headline\" id=\"Christian_is_actually_being_detained_at_the_SCP_Foundation.\">Christian is actually being detained at the <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SCPFoundation\" rel=\"nofollow\">SCP Foundation</a>.</span></h2>\n<p>The most probable reason is for the creation of a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BrownNote\" rel=\"nofollow\">Memetic Hazard</a>, though him being a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/RealityWarper\" rel=\"nofollow\">Reality Warper</a> who created his own demented little universe isn't out of the question. The Foundation operatives are possibly unaware of the fact that he is publishing his webcomic.\n</p>\n<ul><li><ul><li>I was just about to write something similar to this.</li></ul></li></ul>\n<h2><span id=\"Christian_is_not_only_autistic.2C_he_is_also_schizophrenic.\"></span><span class=\"mw-headline\" id=\"Christian_is_not_only_autistic,_he_is_also_schizophrenic.\">Christian is not only autistic, he is also schizophrenic.</span></h2>\n<p>Let's examine some key points to my theory.\n</p>\n<ul><li><ul><li>He thinks God told him his life's mission was to have sex.</li>\n<li>He says a man in a Teddy Bear costume told him to change his name to Christian.</li>\n<li>He constantly creates violent fantasies depicting the torture and death of his rivals.</li>\n<li>He thinks he is the ruler of his own world where cartoons exist.</li></ul></li></ul>\n<p><br/>\n</p>\n<h2><span id=\"Chris_is_a_L.27cie_and_getting_laid_is_his_Focus\"></span><span class=\"mw-headline\" id=\"Chris_is_a_L'cie_and_getting_laid_is_his_Focus\">Chris is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/FinalFantasyXIII\" rel=\"nofollow\">L'cie</a> and getting laid is his Focus</span></h2>\n<p>That would explain so much,isn't it?\n</p>\n<ul><li><ul><li>His fictional daughter's name is Crystal... L'Cie turn into crystal if they fulfill their focus. I think we can bet on him becoming a Cieth though.</li></ul></li></ul>\n<h2><span id=\"Christian.27s_PS3_was_confiscated_by_his_parents.2Fpastoral_counselor.2F.22Young_Adult_Social_Group.22\"></span><span class=\"mw-headline\" id=\"Christian's_PS3_was_confiscated_by_his_parents/pastoral_counselor/&quot;Young_Adult_Social_Group&quot;\">Christian's PS3 was confiscated by his parents/pastoral counselor/\"Young Adult Social Group\"</span></h2>\n<p>They realized that while making Chris limit his Internet activities made it harder for trolls to troll him, it didn't make Chris reform himself because he was just spending all the time playing video games. So they confiscated his PS3 hoping that without games and with nothing to do, he would have motivation to actually go out and socialize. Chris most likely has a full-blown game addiction by now so when he got cut off from his games <a href=\"/cwcki/Michael_Snyder_is_ColdHearted_and_Mean\" title=\"Michael Snyder is ColdHearted and Mean\">he made an attempt to get himself unbanned from The GAMe PLACe</a> out of desperation, and when that failed <a class=\"external text\" href=\"http://www.cogsdev.org/cwcki/File:AskMichaelSnyder.jpg\" rel=\"nofollow\">he ordered his TRUE and LOYAL fanbase to help get him unbanned</a>.\n</p>\n<ul><li>Well, I guess this is <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Jossed\" rel=\"nofollow\">Jossed</a> now: <a href=\"/cwcki/I_Pimp_My_Ride.MOV\" title=\"I Pimp My Ride.MOV\">he bragged about removing part of his PS3</a>, so apparently he still has access to it.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_is_mentally_retarded\">Chris is mentally retarded</span></h2>\n<p>This is not a joke theory, looking at Chris over the years, his lack of progress and his inability to learn from ANYTHING, I must conclude he is literally and severely retarded. Autism makes it difficult to understand people and socialise and cause some other problems. However autism does not impair one's ability to learn from mistakes, or not to do the same stupid things over and over again.\nIntelligence is in part a measure of how much and how fast you learn, as well as your ability to reason and deduce things. Chris has shown no ability for this, and takes years to learn life lessons that a child would be expected to grasp.\nIn all areas of Chris's life he does not improve and he does not learn. Despite drawing regularly, as a 20 something year old manchild, he drawings are on par with an 8 year old's, despite constant practice. Despite having been trolled and tricked over the years, he still takes every single letter in his mail bag seriously. Despite being the constant target of trolls everywhere he has not learned to deal with trolls or understand them. Despite seeing that they feed off his ridiculous overacting, he still continues doing so. Etc.\n</p>\n<ul><li>I doubt it. I think he just finds it inconvenient to improve himself at all, and is the biggest case of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/SmallNameBigEgo\" rel=\"nofollow\">Small Name Big Ego</a> the internet has ever seen. Thus, he thinks his stuff is great and refuses to change something that in his view is perfect.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_will_cross_over_Sonichu_with_another_webcomic\">Chris will cross over Sonichu with another webcomic</span></h2>\n<p>Since Chris is lazy he will probobably want to not work on Sonichu ever again. But one day he will finally decide to release issue 11, (or 12, it depends on whether or not he will remember the whole \"10 Year Aniversery\" thing) he will want to create a great cross over for his return. So another artist who either doesn't know of him, takes pity on him, wants to teach him to be better and uses this turtoring excersise, or is trolling him will decide to let him help with a crossover. Since Sonichu is an action comic (in the loosest since of the word0, and chris hates losing at anything ever he will blow up when the other author says he wants Sonich to lose one fight or says he doesn't like the way his characters are portrayed in Chris's comic. Than the trolls will sit back and watch as the other author gets his or her character's stolen by chris and files a lawsuit. In it, more details will come to light to the general public about CWC, and eventually he will be forced by sega or nintendo to stop Sonichu. NOTE: I don't expect this to actually happen. I've just put it up here cause I'd like to see how it would play out.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_would_understand_the_end_of_Neon_Genesis_Evangelion\">Chris would understand the end of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NeonGenesisEvangelion\" rel=\"nofollow\">Neon Genesis Evangelion</a></span></h2>\n<p>His superior capacities is exactly what is needed to understand what is happening at the end. Only <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheChosenOne\" rel=\"nofollow\">he</a> can do it!\n</p><p>Wait...he would also witnesses <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Squick\" rel=\"nofollow\">Shinji just over the bed</a> <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HighOctaneNightmareFuel\" rel=\"nofollow\">and OH MY GOD</a>!!! Forget it!!!\n</p>\n<ul><li>Hate to break it to you, but <a href=\"/cwcki/Anime#End_of_Evangelion\" title=\"Anime\">he watched End,</a> and I don't think he understood much.</li>\n<li>Maybe we could go with <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HigurashiNoNakuKoroNi\" rel=\"nofollow\">something else then...</a></li></ul>\n<h2><span id=\"Chris_knows.2C_on_some_level.2C_that_the_trolls_aren.27t_out-and-out_villains\"></span><span class=\"mw-headline\" id=\"Chris_knows,_on_some_level,_that_the_trolls_aren't_out-and-out_villains\">Chris knows, on some level, that the trolls aren't out-and-out villains</span></h2>\n<p>The fact that he constantly invokes <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/CreateYourOwnVillain\" rel=\"nofollow\">Create Your Own Villain</a> got me wondering...what if he <i>knows</i> the trolls aren't really the evil masterminds he makes them out to be, but just random people on the Internet who like to poke fun at him? What if he's elevating them to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/BigBad\" rel=\"nofollow\">Big Bad</a> status on purpose? Think about it - a good chunk of his view of the world is based on video games and cartoons. He likes to depict himself as a typical heroic type, who always gets the girl and saves the day. So, what does every hero need? A villain, of course! Perhaps on some level, he knows that people who lecture him or troll him aren't really criminals or villains - but, for him, it makes things more interesting if he thinks they are. Hell, he's been doing this ever since the whole Mary Lee Walsh incident.\n</p>\n<ul><li>If he's been doing this since then, wouldn't he have left Mary Lee Walsh's name in the comic after she didn't except his apology.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_is_some_sort_of_Adept.\">Chris is <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UnknownArmies\" rel=\"nofollow\">some sort of Adept</a>.</span></h2>\n<p>Chris would be right at home in the Occult Underground. He's got the unhealthy obsession with his craft that all Adepts have, and the inability to interact with normal people that comes with it. If the rumor that he is an elaborate actor is true, then he may be an Iracimancer, a magician who gets their power from being hated. We cannot allow him to become any more well-known, or he may gather enough power to do something terrible.\n</p>\n<ul><li><ul><li>Iracimancers are forbidden from becoming angry themselves, which Chris fails at. What you are thinking of is a Personamancer, someone who gains power from other people believing his disguise. <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Understatement\" rel=\"nofollow\">He's pretty good</a>.</li>\n<li>Alternatively, maybe he is some sort of Avatar. I can't really think of any good one right now, but I am sure that whatever he is, he is unbelievably close to Ascension. Drastic measures must be taken now, for the sake of whole humanity. If there is someone out there who should really, really, REALLY stay out of the Invisible Clergy, that's Chris.</li></ul></li></ul>\n<h2><span id=\"The_sysop_was_directly_responsible_for_not_just_uploading_but_drawing_and_writing_the_.22fan.22-created_Sonichu_11_pages.\"></span><span class=\"mw-headline\" id='The_sysop_was_directly_responsible_for_not_just_uploading_but_drawing_and_writing_the_\"fan\"-created_Sonichu_11_pages.'>The sysop was directly responsible for not just uploading but drawing and writing the \"fan\"-created Sonichu 11 pages.</span></h2>\n<p>If you've seen them, they're a pretty decent imitation of Chris's own art style, even though the background coloring is off. Who else has spent enough time around Chris's scribbling to be able to copy it that well? Yeah, WikiSysop was <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/EvilAllAlong\" rel=\"nofollow\">Evil All Along</a>.\n</p>\n<ul><li>I've been thinking that for a long time, considering I stumbled into a conversation asking Chris if he would make Sonichu sprites for a <i><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Doom\" rel=\"nofollow\">Doom</a></i> WAD.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_Chan_will_become_a_character_on_The_Venture_Brothers\">Chris Chan will become a character on <i><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TheVentureBrothers\" rel=\"nofollow\">The Venture Brothers</a></i></span></h2>\n<p>It's a show about failure. Where else can we find such concentrated fail?\n</p>\n<ul><li>Remember the overweight former Wonder Boy in the Boy Adventurer Support Group Rusty goes to? Remove any importance he ever had and you have Chris-Chan.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_Chan_will_become_an_Infernal_Exalted\">Chris Chan will become an <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Exalted\" rel=\"nofollow\">Infernal Exalted</a></span></h2>\n<p>They get offered the chance after trying to accomplish something and failing. When has he <i>not</i> failed?\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_made_the_comic_bad_ON_PURPOSE.\">Chris made the comic bad ON PURPOSE.</span></h2>\n<h2><span id=\"Christian.27s_PS3_isn.27t_bugged.\"></span><span class=\"mw-headline\" id=\"Christian's_PS3_isn't_bugged.\">Christian's PS3 isn't bugged.</span></h2>\n<p>Trolls make him believe it is, because at the very least it will make him suffer from <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>, and at best Chris will permanently damage his precious \"<a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">life upgrade</a>\" while attempting to remove the nonexistent bug.\n</p>\n<ul><li>That this is a <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/XanatosGambit\" rel=\"nofollow\">Xanatos Gambit</a> to get the PS3 destroyed is fairly obvious, and ostensibly the reason his account gets hacked so often is his passwords are too obvious or he gives them out too often.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_really_can_haunt_dreams\">Chris really can haunt dreams</span></h2>\n<p>You know how he sometimes likes to threaten people that he (or the soul of Patti) will get them in their dreams, like in <a href=\"/cwcki/Asperchu_is_a_Horrendous_Joke\" title=\"Asperchu is a Horrendous Joke\">these</a> <a href=\"/cwcki/Surfshack_Tito_(video)\" title=\"Surfshack Tito (video)\">videos</a>? He indeed has the power to do so, but like the curse-ye-ha-me-ha/forgiveness blessing WMG above it doesn't work the way he wants it to, instead giving nightmares to <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Troll\" rel=\"nofollow\">innocent bystanders</a> (I've heard of a few \"fans\" having Chris-chan related dreams, myself included)... Either that, or they get these nightmares <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NightmareFuel\" rel=\"nofollow\">the old-fashioned way</a>.\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_is_The_Master.\">Chris is <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/DoctorWho\" rel=\"nofollow\">The Master</a>.</span></h2>\n<p>Think about it. Chris' medallion of Fail could have worked like the watch did. When he... <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/NauseaFuel\" rel=\"nofollow\">augghh...</a> he activated his Time Lord Memories. Also: check it out, <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">Davros</a> emailed him once!\n</p>\n<h2><span id=\"Chris.27_Quest_For_Sex_will_be_adapted_into_a_Law_.26_Order:SVU_episode\"></span><span class=\"mw-headline\" id=\"Chris'_Quest_For_Sex_will_be_adapted_into_a_Law_&amp;_Order:SVU_episode\">Chris' <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/QuestForSex\" rel=\"nofollow\">Quest For Sex</a> will be adapted into a Law &amp; Order:SVU episode</span></h2>\n<p>CWC will in fact play himself, convinced that appearing in TV, no matter how, will bring him a preciously deserved China.\n</p>\n<h2><span id=\"Jughead_and_Chris-Chan_are_rivalling_gods.2C_and_both_the_Sonichu_and_Archie_worlds_are_the_two.27s_attempts_to_make_a_perfect_world.\"></span><span class=\"mw-headline\" id=\"Jughead_and_Chris-Chan_are_rivalling_gods,_and_both_the_Sonichu_and_Archie_worlds_are_the_two's_attempts_to_make_a_perfect_world.\">Jughead and Chris-Chan are rivalling gods, and both the Sonichu and Archie worlds are the two's attempts to make a perfect world.</span></h2>\n<p>And Chris pretty much failed with his.\n</p><p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_will_lose_his_virginity_to_a_transexual\">Chris will lose his virginity to a transexual</span></h2>\n<p>There are many kinds of trolls, willing to \"stress\" Chris in a variety of ways, eventually a transsexual troll will try to break Chris by sleeping with him and than revealing they used to be a guy...or at least it would happen in our twisted fantasies...\n</p>\n<ul><li>You underestimate the nature of the trolls. A transexual is a good idea for screwing with Chris, but trying to get him involved in a gay orgy is more their style.</li></ul>\n<p><br/>\n</p>\n<h2><span id=\"Chris_will_actually_take_a_white_knight.27s_advice.2C_and_in_the_process_forge_a_stable_friendship_with_the_white_knight.\"></span><span class=\"mw-headline\" id=\"Chris_will_actually_take_a_white_knight's_advice,_and_in_the_process_forge_a_stable_friendship_with_the_white_knight.\">Chris will actually take a white knight's advice, and in the process forge a stable friendship with the white knight.</span></h2>\n<p><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/KickTheDog\" rel=\"nofollow\">Then Chris lashes out against said white knight for something that was actually Chris' doing and destroys their friendship.</a>\n</p>\n<h2><span class=\"mw-headline\" id=\"Chris_will_lash_out_and_attempt_to_get_the_cwckipedia_back.\">Chris will lash out and attempt to get the cwckipedia back.</span></h2>\n<p>I figure he still cares about Sonichu and wants to get rich off this franchise, and still goes on the internet. Somebody he trusts will tell him that Alec and Vivian \"Own\" Sonichu now. I believe that he will come back with a video raging about the trolls again. Whether or not they give the website back depends on if they want him to continue with the angry videos. The way I see it, he'll be back soon.\n</p>\n<ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/TemptingFate\" rel=\"nofollow\">I do hope he proves me wrong and ignores it though.</a></li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_actually_does_make_more_money_from_welfare_checks_than_he_would_with_an_actual_job.\">Chris actually does make more money from welfare checks than he would with an actual job.</span></h2>\n<p>I doubt he could really hold a job for more than a few days, thus meaning the chance of even getting a paycheck is quite small. Therefore, the welfare checks give more money on average. I know it isn't crazy, but I had to get the theory out there somewhere.\n</p>\n<ul><li>Actually, <a class=\"mw-redirect\" href=\"/cwcki/Wendys\" title=\"Wendys\">Chris briefly worked at Wendy's for a month and a half.</a>He made about five hundred dollars there and he gets 750 a month from Social Security. If he was smart, he would have gotten a job at 20 hours a week and STILL keep his Social Security checks.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_is_a_failed_attempt_to_make_another_Grant_Morrison\">Chris is a failed attempt to make another <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/GrantMorrison\" rel=\"nofollow\">Grant Morrison</a></span></h2>\n<p>Some <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/OmniscientCouncilOfVagueness\" rel=\"nofollow\">Omniscient Council Of Vagueness</a> decided that they needed more of DC's crazed writer, so they decided to take a kid and slowly influence him to take the path of the God of All Comics. However, it went awry and they could only influence him to mimic Grant's actions in a few ways. Thus, he had all of the insanity but none of the quality.\n</p>\n<h2><span class=\"mw-headline\" id=\"This_whole_thing_is_an_Alternate_Reality_Game...\">This whole thing is an Alternate Reality Game...</span></h2>\n<p>Except it's all gone <i>very, very, very wrong</i> and everyone has actually managed to lose.\n</p><p><br/>\n</p>\n<h2><span id=\"Chris_will_finally_.22straighten.22_HIS_life\"></span><span class=\"mw-headline\" id='Chris_will_finally_\"straighten\"_HIS_life'>Chris will finally \"straighten\" HIS life</span></h2>\n<p>Chris has lost Sonichu's COPYRIGHTS and the cwcipedia, he won't update THE comic and he will LEAVE the internet FOREVER (not likely but still), so he will FINALLY learn from his mistakes, he will meet REAL people and he will become \"active\" in his community as he said... There's a slim chance of him FIGHTING to get the cwcipedia back (although begging sounds MORE likely.) You might call it <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/IncrediblyLamePun\" rel=\"nofollow\">Sonichu's finale?</a>\n</p>\n<ul><li><ul><li><a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/LittleNo\" rel=\"nofollow\">No.</a></li></ul></li></ul>\n<h2><span class=\"mw-headline\" id=\"Chris_is_actually_the_spawn_of_Nurgle\">Chris is actually the spawn of <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/Warhammer40000\" rel=\"nofollow\">Nurgle</a></span></h2>\n<p>Think about it: he's a disgusting, out of shape, diseased, filthy, deformed bag of fat who seeks to spread his love to people, wither they want it or <i>not</i>.\n</p><p>Then again, <a class=\"external text\" href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/InsultToRocks\" rel=\"nofollow\">I really don't want to offend Nurgle by comparing him to Chris.</a>\n</p>\n<ul><li><ul><li>I am ordering Exterminatus. It is the only way, brothers.</li></ul></li></ul>\n<!-- \nNewPP limit report\nCached time: 20240113071654\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.085 seconds\nReal time usage: 0.087 seconds\nPreprocessor visited node count: 290/1000000\nPostexpand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip postexpand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:11891-0!canonical and timestamp 20240113071654 and revision id 164959. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:T_K_19/TVTropes&amp;oldid=164959\">http://sonichu.com/w/index.php?title=User:T_K_19/TVTropes&amp;oldid=164959</a>\"</div></div>",
  "categories": [],
  "links": [
    "life upgrade",
    "twice",
    "these",
    "unfortunately",
    "not going to be on the internet much",
    "average",
    "at least",
    "his previous video",
    "he made an attempt to get himself unbanned from The GAMe PLACe",
    "stress",
    "videos",
    "Chris briefly worked at Wendy's for a month and a half.",
    "this",
    "he bragged about removing part of his PS3",
    "human being",
    "Davros"
  ],
  "scraped_at": "2025-11-26T21:33:35.049108"
}