{
  "url": "http://sonichu.com/cwcki/User:Clydec/porkypasta",
  "title": "User:Clydec/porkypasta",
  "display_title": "User:Clydec/porkypasta",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>Chris-chan would become Porky if he was given the same power. Think about it.\n</p><p>He'd create horrible monsters out of rats and hedgehogs to create Sonichu chimeras.\n</p><p>He's never had any true friends, they always end up being trolls. He'll never have kids. So he'd make one, like Porky did. A robotic \"son\" who follows only his commands. He'd destroy the world and make it in his image--only him, and his boyfriend-free girl.\n</p><p>He'd create CWCVille and bring people to it, but when he realizes how small it is, he'd make robot people to fill his city and make his delusions of being a grand leader, a mayor of a hustling city, seem true. Just like Porky.\n</p><p>He'd fill his cities with memories of his past--if you notice, he's pretty preoccupied with his past. Just like Porky. He'd fill it with all the shit he won from that Sonic contest, he'd make it with toys and child-like imagery, but in the end, everything is fake and cardboard.\n</p><p>Porky and Chris-chan are the same. They both live in worlds they crafted for themselves, to keep themselves children forever and ignore aging. The differences are simply one's world exists physically and the other's mentally.\n</p><p>That, and Porky has Lucas to stop him. No one will stop Chris-chan. That's the single difference. Chris-chan can never be truly defeated, much like Porky. He cannot be knocked down, as he'll just get right back up.\n</p><p>We need to get this faggot into an Absolutely Safe Capsule, stat.\n</p><p><br/>\n</p><p>Also, Pokey compensated for his shitty parents by making that restaurant full of robots resembling his mother who made your favorite food. It was Ness's mom who made favorites, not his. Pokey coulda turned out alright if not for his parents, whom he nonetheless worships in spite of how horrible they are.\n</p><p>Chris-chan would probably do the same exact thing if separated from his parents for a long time, or forever.\n</p><p><br/>\n</p><p>ED THINKS they can defeat him.\n</p><p>He'll just get back up. He's ALWAYS just gotten right back up after being trolled. He'll send Cole Smithey to us with a little notice in a month or so, telling us he'll get his revenge with a light \"Spankety spankety spankety!\" for good measure.\n</p>\n<!-- \nNewPP limit report\nCached time: 20230122201803\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.013 seconds\nReal time usage: 0.013 seconds\nPreprocessor visited node count: 1/1000000\nPost‐expand include size: 0/2097152 bytes\nTemplate argument size: 0/2097152 bytes\nHighest expansion depth: 1/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    0.000      1 -total\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:8916-0!canonical and timestamp 20230122201803 and revision id 64509. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Clydec/porkypasta&amp;oldid=64509\">http://sonichu.com/w/index.php?title=User:Clydec/porkypasta&amp;oldid=64509</a>\"</div></div>",
  "categories": [],
  "links": [],
  "scraped_at": "2025-11-26T21:44:30.967030"
}