{
  "url": "http://sonichu.com/cwcki/User:Champthom/Paper",
  "title": "User:Champthom/Paper",
  "display_title": "User:Champthom/Paper",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><center>\n<br/><div class=\"boilerplate metadata\" id=\"stub\"><table cellpadding=\"5\" cellspacing=\"0\" style=\"background-color: transparent; border: 3px outset #999999\"><tbody><tr><td><a class=\"image\" href=\"/cwcki/File:Essay.png\"><img alt=\"Essay.png\" decoding=\"async\" height=\"35\" src=\"/w/images/9/96/Essay.png\" width=\"30\"/></a></td><td><div style=\"font-size:150%; font-family:comic sans ms\">This essay is an original work created by <b>a CWCki user</b>.</div>\n<hr/>\n<i>It reflects the opinion of its author and/or a minority viewpoint and does not meet <a href=\"/cwcki/CWCki\" title=\"CWCki\">CWCki</a> <a href=\"/cwcki/CWCki:Style\" title=\"CWCki:Style\">quality standards of encyclopedic value</a>. Reader discretion is advised.</i></td></tr></tbody></table></div>\n</center>\n<center>\n<p><b>HETEROSEXUAL HOMOEROTICISM IN INTERNET SUBCULTURES:</b><br/>\n<b>A CASE STUDY</b>\n</p><p>by<br/>\nIgnatius J. Reilly, PhD.<br/>\n<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/University_of_New_Orleans\" title=\"wikipedia:University of New Orleans\">University of New Orleans</a><br/>\nDepartment of Gay and Lesbian Studies<br/>\n</p>\n</center>\n<h2><span class=\"mw-headline\" id=\"Abstract\">Abstract</span></h2>\n<p>The advent of the <a class=\"mw-redirect\" href=\"/cwcki/Internet\" title=\"Internet\">Internet</a> and the emergence of Internet subcultures has tremendously opened heterosexual people up to each other; for example, to discuss issues such as sexual orientation used to be somewhat taboo in mainstream society, until the internet opened an avenue for totally open homosexual expression. In this paper, the author looks at one remarkable case of a sexually confused young man, <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">Christian Weston Chandler</a>, author of the popular <a href=\"/cwcki/Sonichu_(comic)\" title=\"Sonichu (comic)\">\"Sonichu\" comics</a> who manages to place homoerotic themes throughout his seemingly heterosexual comic. In this effect, he manages to create a comic that manages to capture the essence of the homoerotic urges a homosexual man must repress in modern Western culture and proves to be an inspiring work for the GLBT audience.\n</p>\n<h2><span class=\"mw-headline\" id=\"Paper\">Paper</span></h2>\n<p>Focusing upon the author Christian Weston Chandler. Due to the fact that as a young child he was often left with a <a href=\"/cwcki/Abusive_babysitter\" title=\"Abusive babysitter\">baby-sitter</a> as his parents went out, we can assume he never went through the Oedipus complex, due to the frequent absence of his father figure, <a class=\"mw-redirect\" href=\"/cwcki/Robert_Chandler\" title=\"Robert Chandler\">Robert Chandler</a> Junior. As stated in <a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Sigmund_Freud\" title=\"wikipedia:Sigmund Freud\">Sigmund Freud</a>'s Psychoanalytical theory this is the time where a son is supposed to gain an attraction for his mother but hates his father due to knowledge that he is more powerful. The child is supposed to then identify with his father and his role as a male and thus seek another woman. Chris exhibit's a desire for a girlfriend but he still seems to show a desire for his mother sharing several times cuddling together but only while Bob is away which would lead to that he is still in the complex.\n</p><p>A very likely explanation for Chris's desire for a female stems from denial or possibly trying to conform to society despite the emotional strains he puts upon himself as a sacrifice to show himself as a heterosexual. However Chris seems to project his gay desires into the characters of his Sonichu Comic; a very common occurrence for people in a situation like his.\n</p><p>As mentioned before Chris is in the Phallic stage of the psychosexual stages quite a lot of his comic contains a lot of Phallic imagery, a notable example being the <a class=\"mw-redirect\" href=\"/cwcki/Target\" title=\"Target\">Target</a> cup with the straw in <a href=\"/cwcki/Sonichu_8\" title=\"Sonichu 8\">Sonichu 8</a>.\n</p>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:152px;\"><a class=\"image\" href=\"/cwcki/File:Chris-Straw.jpg\"><img alt=\"Chris-Straw.jpg\" class=\"thumbimage\" decoding=\"async\" height=\"131\" src=\"/w/images/thumb/0/00/Chris-Straw.jpg/150px-Chris-Straw.jpg\" srcset=\"/w/images/thumb/0/00/Chris-Straw.jpg/225px-Chris-Straw.jpg 1.5x, /w/images/0/00/Chris-Straw.jpg 2x\" width=\"150\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:Chris-Straw.jpg\" title=\"Enlarge\"></a></div></div></div></div>\n<p>A full discussion of the \"Sonichu\" phenomenon cannot exclusively fixate on Chris, however. The reaction of the GLBT community, and GLBT-friendly heterosexuals, in accordance with postmodern concepts of the \"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Death_of_the_Author\" title=\"wikipedia:Death of the Author\">Death of the Author</a>\", has brought about a collective interpretation of the work by the fan community which brings clarity and a coherent social message in sharp contrast to the personal confusion evident on the part of the author.\n</p><p>For example, the popularity of the comparatively new <a class=\"mw-redirect\" href=\"/cwcki/Silvana\" title=\"Silvana\">Silvana</a> character is drastically at odds with the apparent intent of the character. Chandler clearly intends hir to fill a Wounded Antagonist archetype, hir formative years in isolation in the presence of the phallic <a href=\"/cwcki/Count_Graduon\" title=\"Count Graduon\">Count Graduon</a> having turned hir into a hermaphrodite, which in Chandler's construction of homosocial ethics renders her incapable of personal psychosexual satisfaction and long-term life fulfilment. The fan community's embrace of hir, however, interprets hir not as a distorted or mutilated individual doing evil through abuse, but a bold genderqueer figure whose renegade activities reflect hir willingness to confront heteronormative social norms. The cross-dressing activities of the Team Rocket character James in \"<a class=\"mw-redirect\" href=\"/cwcki/Pokemon\" title=\"Pokemon\">Pokemon</a>\", a source text for the postmodern collage of Sonichu, provides some precedent for this, but in Silvana it reaches a peak.\n</p><p>As a metamorph, Silvana has transcended and overcome all social expectations and boundaries with regards to gender and sexual roles, and this is embraced by the fanbase, most notably by the \"Silvana team\" who are a controversial and prominent element within the Sonichu fanbase at anime and furry conventions. A group of people, each costumed as Silvana, makes themselves sexually available to Sonichu fans who wish to lose their virginity, a process regarded almost as an initiatory within the hardcore Sonichu fanbase. However, a fan who takes them up on their offer never knows whether they will end up sleeping with a man, woman, or transperson, whether their partner will take the active or passive role, whether their partner will penetrate or offer themselves up for penetration. The experience is reputed to be extremely cathartic, almost religious in nature. Many Sonichu fans, having had their \"Silvana moment\", have either come out as gay or bisexual, or feel more comfortable in their heterosexuality as a result.\n</p><p>\"Even if your Silvana moment isn't with someone of your preferred gender, they find ways to make it work,\" said R.W., a Sonichu fan interviewed at Anthrocon <a href=\"/cwcki/2009\" title=\"2009\">2009</a>. \"They're really talented, and it does make you think. Most Sonichu fans agree that it can be very positive for a heterosexual person to have a pleasing and fulfilling homosexual experience, or vice versa... I mean, <a href=\"/cwcki/Blake\" title=\"Blake\">Blake</a> is straight in the comics, but he had his walk on the wild side under the pier with Silvana, and that was a key moment in his redemption and his acceptance by the other <a class=\"mw-redirect\" href=\"/cwcki/Electric_hedgehog_pokemon\" title=\"Electric hedgehog pokemon\">electric hedgehog pokemon</a>, and it's generally accepted that there was something going on between Rosechu and <a href=\"/cwcki/Kel\" title=\"Kel\">Kel</a> before Sonichu showed up - not a relationship, but just friends giving friends what they need.\"\n</p><p><br/>\n</p>\n<!-- \nNewPP limit report\nCached time: 20250518024122\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.055 seconds\nReal time usage: 0.058 seconds\nPreprocessor visited node count: 57/1000000\nPost‐expand include size: 746/2097152 bytes\nTemplate argument size: 32/2097152 bytes\nHighest expansion depth: 10/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    6.928      1 -total\n100.00%    6.928      1 Template:Essay\n 45.44%    3.148      1 Template:Namespace_detect\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:3934-0!canonical and timestamp 20250518024122 and revision id 160539. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Champthom/Paper&amp;oldid=160539\">http://sonichu.com/w/index.php?title=User:Champthom/Paper&amp;oldid=160539</a>\"</div></div>",
  "categories": [
    "Category",
    "Theories and Essays"
  ],
  "links": [
    "Internet",
    "Target",
    "Silvana",
    "2009",
    "Blake",
    "Robert Chandler",
    "electric hedgehog pokemon",
    "\"Sonichu\" comics",
    "CWCki",
    "Christian Weston Chandler",
    "baby-sitter",
    "Pokemon",
    "Kel",
    "Count Graduon",
    "Sonichu 8"
  ],
  "scraped_at": "2025-11-26T21:33:36.899393"
}