{
  "url": "http://sonichu.com/cwcki/User:Anaxis/Regarding_Fiona",
  "title": "User:Anaxis/Regarding Fiona",
  "display_title": "User:Anaxis/Regarding Fiona",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>I was <a href=\"/cwcki/User_talk:Anaxis#With_Regards_to_Fiona\" title=\"User talk:Anaxis\">asked by a fellow editor</a> to give my perspective on Fiona's personality and character, since I'd spoken with her before, and what I wrote wound up being the size of a small essay because I just had that much to say. <a class=\"mw-redirect\" href=\"/cwcki/The_Lainchu_Manifesto\" title=\"The Lainchu Manifesto\">Go figure.</a> To prevent bloating my talk page, I decided to post my response here.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#The_Question\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">The Question</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Fiona,_the_Suitress_Policy,_and_Autism\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Fiona, the Suitress Policy, and Autism</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#How_Fiona_Gets_Misunderstood\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">How Fiona Gets Misunderstood</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Fiona_and_the_CWCki_Server\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Fiona and the CWCki Server</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Fiona_and_the_Knife\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Fiona and the Knife</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#Fiona's_Crush_on_Chris\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Fiona's Crush on Chris</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Notes\"><span class=\"tocnumber\">7</span> <span class=\"toctext\">Notes</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"The_Question\">The Question</span></h2>\n<p>Hello Anaxis, I've been meaning to clean up <a class=\"mw-redirect\" href=\"/cwcki/Fiona\" title=\"Fiona\">Fiona</a>'s page for a while now, like I have been with <a class=\"mw-redirect\" href=\"/cwcki/Bella\" title=\"Bella\">Bella</a>'s, but I also didn't feel I should be editing her page too much unless I actually had a proper understanding of her character and her role in Christory, as most other people that talk about her appear to have some sort of lean towards her, even more so that Bella, I'd argue. People either viewed her as some innocent victim or were just flat out A-logs. At most, I've changed any instances of \"the Suitress\" to her first name, made footnotes to clarify usage of the codename, and tried to remove all direct references to her being autistic I came across. I especially felt that people putting so much focus on her being autistic was part of what led to some of the false views and drama surrounding her. (See the movie <i><a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Music_(2021_film)\" title=\"wikipedia:Music (2021 film)\">Music</a></i> to see what I'm talking about) I don't expect you to have all of the answers, but I do think you'd be a good source of information, too, as you've talked to her both in DMs, and in the Knights server to know what she might have been like to some extent. \n</p><p>I'm also going to preface this by saying that I do not wish to reiginite any old drama, and that I do not intend any harm to befall on Fiona, nor do I intend to drag her back into Christory, especially since she appears to have long since matured and moved on. My intent in asking you is purely for clarity, since I don't think you really talked about her character all that much.\n</p><p>Something that's kind of been bugging me since I've read your Manifesto is that conversation that you had with Snoo/Fiona, where you warned her NOT to contact Chris. Setting aside the obvious fact that she ignored your warning entirely, in that DM, she talks about how she wanted to \"befriend\" and \"help\" Chris, and had no intention of weening. But yet in some of her other posts, she also appears to demean and talk about Chris negatively, and going on these <a href=\"/cwcki/Fiona_Posts\" title=\"Fiona Posts\">weird A-loggy rants</a>, where she only talked about wanting to hate/pity fuck him, and deeming him as an \"anti-role model\" of sorts, akin to other lolcows she mentioned. You also mention that Snoo was particularly quiet around you when she was in the Knights Server with you, likely because she knew she could get in trouble, as you already warned her about Chris.\n</p><p>With all that said, how would you personally characterize Snoo, and would you necessarily say she had trollish intent in mind? \n</p><p>Edit: I forgot to mention, though he was against the Suitress policy due to the many problems it presented, <a href=\"/cwcki/The_Place_chats_(October_2020)#Val_Tries_to_Face-Dox_Snoo_on_the_CWCki_Server_&amp;_Gets_Kicked\" title=\"The Place chats (October 2020)\">Anaxis was also AGAINST Fiona getting doxed</a> by the Watchmen, even when some of them told him to \"fuck off\", so that gives me more reason to believe he wouldn't say what he'd say out of some sort of spite, and would likely provide an unbiased answer. <a href=\"/cwcki/User:PsychoNerd054\" title=\"User:PsychoNerd054\">Psycho 🐧</a> (<a href=\"/cwcki/User_talk:PsychoNerd054\" title=\"User talk:PsychoNerd054\">talk</a>) 09:44, 16 April 2025 (EDT)\n</p>\n<h2><span id=\"Fiona.2C_the_Suitress_Policy.2C_and_Autism\"></span><span class=\"mw-headline\" id=\"Fiona,_the_Suitress_Policy,_and_Autism\">Fiona, the Suitress Policy, and Autism</span></h2>\n<p>First of all, I'd like to say that I'm glad to see/hear that you're making such a great effort to remove every remnant instance of the Suitress policy that's been left on the CWCki. You've clearly committed yourself to the task, and I applaud you for that.\n</p><p>While I do think it's important to acknowledge how Fiona's autism affected her overall behavior and views towards Chris, I do think you're right to deemphasize it as much as possible. Something that really frustrated me when seeing a lot of the discourse around Fiona in the immediate aftermath of the incest leaks was how much her having autism was treated as though it was the same as her <a class=\"mw-redirect\" href=\"/cwcki/Slow-in-the-mind\" title=\"Slow-in-the-mind\">having a developmental disability</a>, and that she couldn't be held accountable for her actions for that reason. This is the same community that offers zero excuses or leeway towards Chris on account of his autism (though often rightfully so) now turning around and doing that exact thing on behalf of Fiona, and I found it to be incredibly hypocritical. Even when looking at <a href=\"/cwcki/Fiona_Posts\" title=\"Fiona Posts\">her publicly documented posts</a>, it's obvious that she's intelligent, coherent, and well-spoken, in full control of her actions the entire time, despite what her reputation might otherwise suggest. The only parts of her character that outwardly might be affected by autism are a bit of social awkwardness and lack of a filter.\n</p><p>Regardless, we must do what we can now in order to mend the damage caused by the Suitress policy and the emphasis on Fiona's autism, and I appreciate that you're participating in that.\n</p>\n<h2><span class=\"mw-headline\" id=\"How_Fiona_Gets_Misunderstood\">How Fiona Gets Misunderstood</span></h2>\n<p>As for Fiona's character, I can't promise that I have a full picture of her personality or her psyche, but I will share what I have theorized and experienced firsthand from my interactions with her.\n</p><p>I think the principal misunderstanding that most people tend to have about Fiona is the notion that she can only be one of two things: a hapless victim of circumstance who can't take responsibility for her actions, or a malicious actor bent on manipulating Chris and everyone else around her for her own gain. In reality, I actually think the true answer is that she's <i>both</i>.\n</p><p>Fiona did indeed come off as very naïve in a lot of conversations that she had with others, <a href=\"/cwcki/Na%C3%AFve\" title=\"Naïve\">but contrary to how Chris defines the word</a>, naïve is <i>not</i> the same as stupid. From what I've gathered, she's actually quite adept at masking her intentions and understanding what kind of front to put up for a given audience. Like with me, she acted remorseful about her actions, claiming she had no intentions of wrongdoing and merely wanted to help Chris. But meanwhile, as you said, she'd act a-loggy in other spaces where it was safer for her to express her true feelings without getting berated by others who knew better. I think that Fiona is actually rather two-faced, and masks her true intentions by putting on a persona of innocence, and I'd even go so far as to say that she was better at doing this than Bella was (though that's not to say that Fiona was generally more malicious than Bella). Clearly, this served her very well once her involvement in leaking the <a href=\"/cwcki/Incest_Call\" title=\"Incest Call\">Incest Call</a> was revealed, being able to take advantage of how the community perceived her to make herself look like a victim, rather than a perpetrator.<sup class=\"reference\" id=\"cite_ref-1\"><a href=\"#cite_note-1\">[footnote 1]</a></sup>\n</p>\n<h2><span class=\"mw-headline\" id=\"Fiona_and_the_CWCki_Server\">Fiona and the CWCki Server</span></h2>\n<p>Something that <a href=\"/cwcki/User:Anaxis/The_Lainchu_Manifesto#The_Suitress_and_Associates\" title=\"User:Anaxis/The Lainchu Manifesto\">I didn't mention on the Manifesto</a> was exactly <i>why</i> Fiona was banned from the CWCki Server. I skimmed over it since the drama was fairly unrelated to the rest of the story, but I think it does elucidate more about her character.\n</p><p>As I had mentioned, a group of users in the server had at one point begun harassing Fiona in an attempt to turn her into a lolcow, and once the mods discovered this, we worked to dismantle the group, banning its members and telling Fiona to block them. This was unfortunately not a one-off occurrence, especially before I became server owner, as it's common for online spaces dedicated to lolcow discussion to attract similarly strange people who wind up becoming halal cows due to their behavior.\n</p><p>It wouldn't be long before this happened again, this time with a young male user as the target, only now Fiona was <i>participating</i> in the trolling. This group was even more toxic than the previous one targeting Fiona, forming a small Discord server for themselves where they would encourage the young man to do humiliating and injurious things to himself on camera and on his personal livestreams for their own amusement. At the time, the mods believed that the users leading the group were actively malicious and were the ones egging all of this on, while other members, including Fiona, were just going along for the ride. Because of this, I DMed her a warning to stop participating with this group or to face the consequences, and she seemed apologetic and willing to back down. However, it was reported by insiders soon after that she shared our DMs with the trolling group, something that I did not look kindly upon after I had gone fairly easy on her.\n</p><p>I let her know that she was on thin ice and that leaking DMs was not acceptable, and again, she apologized and swore she wouldn't do so again. Then the very next day, she did the same thing with a different mod, who had had much more private and personal conversations with Fiona about her behavior in an attempt to help her, and it was at this point that I'd had enough. After a discussion and vote, we banned the members of this trolling group from the CWCki Server, including Fiona and the male victim (who had committed egregious rule violations of his own).\n</p><p>This event was what catalyzed my rise to server owner, as the mods were frustrated with my predecessor's lack of competence when it came to handling this issue and for letting it get this far, and wanted a change in leadership. One of the first things I did when becoming owner was clamp down on the potential for this to happen again, disallowing members from turning on their cameras in the server and restricting the amount of personal information that could be publicly shared. I'm happy to report that we never had to deal with any similar incidents while I was owner, at least not to the same extent as this event.\n</p>\n<h2><span class=\"mw-headline\" id=\"Fiona_and_the_Knife\">Fiona and the Knife</span></h2>\n<p>Needless to say, none of this paints a particularly flattering picture of Fiona. I'd like to think that we gave her a lot of chances, verbally warning her multiple times while holding the belief that she isn't that bad of a person, just young and misguided; but we were fooled every time. She knew the right things to say to me in order to make me think she was sorry and get me to back off from punishing her, but behind closed doors where she thought nobody could see, she'd be flippant and very obviously continued violating rules if she thought she could get away with it. This was why none of the mods were particularly willing to accommodate her when she returned to the server under an alt, with no acknowledgement or seeming remorse for what she'd done to get banned in the first place.\n</p><p><b>We repeatedly showed her mercy, and she rewarded us by sticking the knife in our backs again and again.</b> And we wouldn't tolerate it anymore.\n</p><p>Unfortunately, the biggest deception she wound up pulling off was making us believe that she wouldn't be determined enough to contact Chris, and we know how <i>that</i> eventually turned out.\n</p><p>As you suggested, it is possible that she was quieter in the Knights server because she recognized my profile and now knew not to piss me off, but it is equally possible that she just didn't recognize me and spoke the same amount she otherwise would have. I have no way of knowing the answer to that one at the end of the day.\n</p>\n<h2><span id=\"Fiona.27s_Crush_on_Chris\"></span><span class=\"mw-headline\" id=\"Fiona's_Crush_on_Chris\">Fiona's Crush on Chris</span></h2>\n<p>I do think that Fiona's crush on Chris was genuine, but it was also very complicated. This is nothing more than armchair psychoanalysis, but to me, she seems to have had a sort of psychosexual view about Chris, seeing parts of herself in him that she both loved and hated, and I think that might account for her mixed reactions towards him that she expressed in different online settings. Like I said, she knows how to present herself towards different audiences in order to get the reactions she wants, so if she's with a more a-loggy group, then she's more prone to a-logging. But if she's with someone who encourages her desires, like Bella, then she's more willing to openly express them.\n</p><p>I don't think Fiona intended to troll Chris; in fact, I don't think she really had a plan at all. She had a vague desire to meet Chris at Everfree and engage him in romantic or sexual pursuits, but who knows if her mind might have changed when faced with the real thing before her instead of her idealized fantasy?\n</p><p>But like I said, it'd also be wrong to view Fiona as a perfect victim, given how persistently manipulative she'd proven to be. In fact, I think I'd even disagree with your assessment that she's necessarily grown up or learned her lesson, when considering the fact that she attempted that Reddit AMA shortly after she was given such a perfect out. Instead she read the sympathy around her as a way to get attention, only to find that she miscalculated, and I'd venture to say that the reason she left the community for good was not out of personal maturation, but out of pragmatism.\n</p><p>Obviously a lot can change in the 4 years since then, especially for someone still coming into their own as an adult like her, and I do truly hope that she has been able to mature and move on from the CWC community, and become a better person out of her experiences. Because even after everything that happened, I don't wish ill upon her, and I think she does deserve to move forward with her life, in whatever form that may take on. I'd like to assume that that's the case if we never hear from her again.\n</p>\n<h2><span class=\"mw-headline\" id=\"Notes\">Notes</span></h2>\n<div class=\"mw-references-wrap\"><ol class=\"references\">\n<li id=\"cite_note-1\"><span class=\"mw-cite-backlink\"><a href=\"#cite_ref-1\">↑</a></span> <span class=\"reference-text\">While I am willing to acknowledge that Fiona was a victim of Bella's attempts to frame her, I will not do the same when it comes to Chris. Fiona meeting Chris and suffering the ensuing blowback of that was nobody's fault but hers.</span>\n</li>\n</ol></div>\n<!-- \nNewPP limit report\nCached time: 20250501003029\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.038 seconds\nReal time usage: 0.051 seconds\nPreprocessor visited node count: 72/1000000\nPost‐expand include size: 142/2097152 bytes\nTemplate argument size: 267/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 521/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   10.449      1 -total\n 73.03%    7.631      1 Template:Refn\n 25.85%    2.701      1 Template:W\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:39929-0!canonical and timestamp 20250501003029 and revision id 338109. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=User:Anaxis/Regarding_Fiona&amp;oldid=338109\">http://sonichu.com/w/index.php?title=User:Anaxis/Regarding_Fiona&amp;oldid=338109</a>\"</div></div>",
  "categories": [],
  "links": [
    "Bella",
    "Fiona",
    "her publicly documented posts",
    "but contrary to how Chris defines the word",
    "Go figure.",
    "weird A-loggy rants",
    "having a developmental disability",
    "Incest Call"
  ],
  "scraped_at": "2025-11-26T21:40:10.170955"
}