{
  "url": "https://sonichu.com/cwcki/White_knight_E-mails",
  "title": "White knight E-mails",
  "display_title": "White knight E-mails",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><p>These <b>white knight emails</b> are from people trying to help <a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>, whether they be <a class=\"mw-redirect\" href=\"/cwcki/White_knight\" title=\"White knight\">white knights</a>, counter-<a href=\"/cwcki/Trolls\" title=\"Trolls\">trolls</a> or even misguided souls who actually think Chris will listen to them. Chris's replies are in blue.\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#November_2007_—_ED_alert\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">November 2007 — ED alert</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#June_2008_—_Gaiafag\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">June 2008 — Gaiafag</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#September_2008_—_Chris_denies_being_fat_and_sexist\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">September 2008 — Chris denies being fat and sexist</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Evaluation\"><span class=\"tocnumber\">3.1</span> <span class=\"toctext\">Evaluation</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#17_April_2009_—_Harbal\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">17 April 2009 — Harbal</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#29_April_2009_—_We_are_watching\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">29 April 2009 — We <i>are</i> watching</span></a></li>\n</ul>\n</div>\n<h2><span id=\"November_2007_.E2.80.94_ED_alert\"></span><span class=\"mw-headline\" id=\"November_2007_—_ED_alert\">November 2007 — ED alert</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p><b>I have a warning for you dude.</b> from Samuel to Chris on Mon, 5 Nov 2007 7:28 am\n</p>\n<hr/>\n<p>Normally I don't care for what my peers at <a class=\"mw-redirect\" href=\"/cwcki/4chan\" title=\"4chan\">4chan</a>.org do. but I bring you some news the people over at /v/ (aka the video game board) are making fun of you and made the <a class=\"external free\" href=\"http://www.encyclopediadramatica.com/Chris-chan\" rel=\"nofollow\">http://www.encyclopediadramatica.com/Chris-chan</a> site, which you already know, but I left them to it as I couldn't care less what they did but now they have hit a new low and one is planning of <a class=\"mw-redirect\" href=\"/cwcki/Blanca\" title=\"Blanca\">pretending to be girl</a> in hopes of getting you to send <a href=\"/cwcki/Nudes\" title=\"Nudes\">nude pictures</a> to them. As I said normally I dont care what Anon does but I find this sad and immature and so I feel I must give you a heads up on anonymous's plans to ridicule you on the interwebs..\n</p><p>also if you are going to quote any of this I'd much appreciate you hide my Identity (email address etc)\n</p>\n</td></tr></tbody></table>\n<p>Chris ignored this and promptly emailed <a href=\"/cwcki/Nudes\" title=\"Nudes\">nudes</a> regardless.\n</p>\n<h2><span id=\"June_2008_.E2.80.94_Gaiafag\"></span><span class=\"mw-headline\" id=\"June_2008_—_Gaiafag\">June 2008 — Gaiafag</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p><b>Please Read This</b> by Brittany to Chris on Wed, 25 Jun 2008 10:02 am\n</p>\n<hr/>\n<p>Dear Mr.Chandler,\n</p><p>Before I get to what I want to say in this e-mail, let it be known that this is NOT a hate e-mail, nor is it intended for the sole purpose of being mean to you. However, I will say that I am going to be blunt and tell you straightfoward what I want to say, which may in turn hurt you. It is up to you whether or not you would want to read this.\n</p><p>With that said, I want this e-mail to help you with some advice on <a href=\"/cwcki/Love_Quest\" title=\"Love Quest\">your current \"quest\"</a>, as you put it, for love.\n</p><p>First off, it is not your fault you were born with <a href=\"/cwcki/Autism\" title=\"Autism\">Autism</a>. I feel sympathy because it makes it all that more difficult to land you a girl. However, you must realize that not everyone will feel oh-so sympathetic or understand your troubles. The most saddening part of life is that not everyone will like you or the things you do, but you must move away from them and realize there are plenty of like-minded people like you.\n</p><p>Now, even though you have Autism, this doesn't mean that you are destined to live a horrible lonely life, but you should know that you can't use \"autism\" as an excuse for everything. Blaming a disorder for all the troubles in you life will not get you far. If you want others to look past your autism, you must do so as well. You must see yourself as you, regardless of what disorder you have.\n</p><p>I have plenty of friends with <a class=\"mw-redirect\" href=\"/cwcki/Asperger%27s\" title=\"Asperger's\">Asperger's</a> and high-functioning autism. One of my close friends Alex has to deal with autism standing in his way of fitting in at school, yet he has a <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">great talent of singing</a>. He took that good thing about him and won <a href=\"/cwcki/SingStar_Challenge\" title=\"SingStar Challenge\">the talent show</a>, and gained friends. You should take the very best talent you have and expand it to the best of your ability.\n</p><p>Now on to your <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">girlfriend</a> troubles..\n</p><p>I think at this moment in your life, you goal shouldn't be just scoring with a chick, but making friends. If I'm correct, you have a <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a>. Try finding people in your area that share you like for <a class=\"mw-redirect\" href=\"/cwcki/Video_games\" title=\"Video games\">video games</a>. Be it a <a class=\"mw-redirect\" href=\"/cwcki/Jerks\" title=\"Jerks\">guy</a>, don't ignore him. After all, he does have his friends, some of who may be <a class=\"mw-redirect\" href=\"/cwcki/Boyfriend-free_girls\" title=\"Boyfriend-free girls\">single girls</a>.\n</p><p>You also need to not set your expectations so high. I'm not saying you should go off and date the nearest <a href=\"/cwcki/Obesity\" title=\"Obesity\">obese</a> <a href=\"/cwcki/Niggos\" title=\"Niggos\">black</a> lady. However, what you need most is dating experience. After having been through various relationships, you can get past that akward \"approaching\" phase with confidence. Think of meeting a girl as a friend, not as a <a href=\"/cwcki/Lovely_Weather\" title=\"Lovely Weather\">future</a> life partner.\n</p><p>Also, I do not mean to offend, but the whole <a class=\"mw-redirect\" href=\"/cwcki/Sign\" title=\"Sign\">sign</a> thing has to go. If it hasn't worked for the past 8 or so years, it probably won't work now. To us females, it shows you as someone who lacks the confidence to go up to someone. Women want someone who can have the courage to break the ice and start a conversation. Maybe if you see a nice girl with a dog in the park, start with something simple like complimenting how cute/burly/adorable <a href=\"/cwcki/Chris_and_sex#Bestiality\" title=\"Chris and sex\">her dog</a> is. Then you can go on and start a conversation about <a class=\"mw-redirect\" href=\"/cwcki/Patti\" title=\"Patti\">your dog</a> and what it looked like, etc... Any compliment about her can most likely be used as a convo starter, aside from pick-up lines and the plain creepy.\n</p><p>Another thing you may want to work on is...<a href=\"/cwcki/Chris_and_fashion\" title=\"Chris and fashion\">your wardrobe</a>. I have to say that you I feel as if it's trapped in <a href=\"/cwcki/1980s\" title=\"1980s\">the 80's</a>. Also, your <a class=\"mw-redirect\" href=\"/cwcki/Sonichu_medallion\" title=\"Sonichu medallion\">Sonichu medallion</a>..oh man, this really hurts to break it to you, but...it'd be best left at home. Sorry man, but it's like <a href=\"/cwcki/Christian_Weston_Chandler\" title=\"Christian Weston Chandler\">one giant pussy deflector</a>. That's all I can say about it, and I'm trying my best not to be harsh about it here.\n</p><p>You may want to revise your <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a> profiles and such a bit. When you talk about marrige [sic] and the like in your profile, it'd tend to ward off women, for they'll feel that if they even talk to you that they'd be all of a sudden committed. Talking about marrige [sic] should wait when you and her feel it's right.\n</p><p>I hope this will help you in your \"girlfriend\" quest. I know that <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> will keep their article up about you, but if you move on and not bother talking about it or vandilize [sic] it, it'll soon be forgotten. Anonymous feeds off of you being upset over the article. Once you move on and forget about it, the sooner you can live a better life.\n</p><p>Please Reply Soon, Some Random Gaiafag\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"September_2008_.E2.80.94_Chris_denies_being_fat_and_sexist\"></span><span class=\"mw-headline\" id=\"September_2008_—_Chris_denies_being_fat_and_sexist\">September 2008 — Chris denies being fat and sexist</span></h2>\n<p>This is a white knight from /v/, according to <a class=\"mw-redirect\" href=\"/cwcki/Clyde\" title=\"Clyde\">Clyde</a>.\n</p>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>I know why you're failing at your quest.\n</p><p>If you plan on listening to me, I, a female, can teach you how to properly attract women.\n</p><p>This is not a joke or an attempt to troll you, I will offer honest advice about what girls want from a real girl's perspective.\n</p><p>If you're interested, email me back or something.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Chris to white knight\n</p>\n<hr/>\n<p>Okay, I'll loan you can ear; if you were teaching a \"<a class=\"mw-redirect\" href=\"/cwcki/Date_Ed\" title=\"Date Ed\">Date Ed</a>\" class (even though the idea sounds dated), AKA \"Dating 101\", in lengthy detail, and IN PERSON ONLY; NOT OVER THE INTERNET, in a step-by-step process, how would you well-advise the men in your class to ask a woman out on his <a href=\"/cwcki/Emily\" title=\"Emily\">FIRST DATE EVER</a>?\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>I don't do classes. This is not a group thing. To tell you a bit about myself, I am highly interested in <a class=\"mw-redirect\" href=\"/cwcki/Psychology\" title=\"Psychology\">psychology</a>, and intend to be a therapist when I grow up. I enjoy listening to people's problems and offering advice on a private, personal level that cannot be achieved in large, public type classes. This means I will help you personally to attract women, not just offer generalized advice that won't help.\n</p><p>Let's not start with the first date--attracting a woman's attention happens long before that. First impressions are a very big deal, and happen at the first moment of contact, when you first lay eyes on each other, or first speak to each other, etc... After all, she has to say \"yes\" before the first date can even begin.\n</p><p>Before I offer you any advice on that subject, I need to know a few things about you besides what the online hate sites have to offer:\n</p><p>First off, I need to know how you've been previously trying to attract women, second of all, what type of woman you expect you will get (and include why you'd expect this type of woman to be attracted to you), and thirdly, as much as you know about women.\n</p><p>You can describe all of these things in as few or as many words as you like. I am a patient listener.\n</p><p>Dating is NOT a step-by-step process, and it is very wrong of you to think of it as such. Women are people after all, not machines programmed to act in certain ways when you do or say something. We are all unique--you could say something to one girl and it would make her smile, and that same thing could make another woman upset. All human beings are unique individuals with unique feelings based on their own, unique personalities. Despite this, I can still help, if you want me to, that is.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Chris to white knight\n</p>\n<hr/>\n<p><a href=\"/cwcki/June_2010\" title=\"June 2010\">AGES AGO</a>, I'd have a sign by my side stating, \"I am a \"X\"-Year Old Male, Seeking an 18-\"X\"-Year Old Single Woman\", sit, hope, pray and wait to be found by a Boyfriend-Free Woman who would be interested in me. Currently, I ONLY sit, hope, pray and wait to be found by that woman. SIMPLY PUT, I'd like an 18-29-Year Old Boyfriend-Free, <a href=\"/cwcki/China\" title=\"China\">Caring</a>, Smoke-Free, Non-Alcoholic, <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Race\" title=\"Chris and Race\">white</a> (Optionally <a href=\"/cwcki/Virginia_is_for_Virgins\" title=\"Virginia is for Virgins\">virgin</a>) Woman to make into a <a href=\"/cwcki/Sweetheart_from_the_Ground-Up\" title=\"Sweetheart from the Ground-Up\">Sweetheart from the Ground-Up</a>. I AM AFRAID to make the First Move, because of the PROVEN <a href=\"/cwcki/Infinitely-High_Boyfriend-Factor\" title=\"Infinitely-High Boyfriend-Factor\">INFINTELY-HIGH BOYFRIEND-FACTOR</a>, <a href=\"/cwcki/Noviophobia\" title=\"Noviophobia\">fear of Rejection</a>, Lack of Self-Confidence, and my Screwed-Up, Fucking Life-Long Autism Curse. I DO NOT KNOW WHY I would expect ANY woman to be Attracted to me, IN PUBLIC, except for the fact that <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_his_Ego\" title=\"Chris and his Ego\">I am Handsome</a>, as my mother constantly reminds me, yet every time she tells me how handsome I am, I ask her, <i>\"Well, how come I don't have a Girlfriend?\"</i>, and that I am a Frustrated, Lonely Virgin? After watching a life's worth of Variety of Television Shows and Romantic Comedies, Having A Bunch of Circles of <a class=\"mw-redirect\" href=\"/cwcki/Gal-Pals\" title=\"Gal-Pals\">Gal-Pals</a> in my lifetime up to my crappy Adulthood, I think I have a <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_Sex\" title=\"Chris and Sex\">WIDE knowledge</a> of <a class=\"mw-redirect\" href=\"/cwcki/Women%27s_Rights\" title=\"Women's Rights\">Women in General</a>.\n</p><p>If I appear to be stressed from the typing of this message, well I am stressed from the Bastards of that slanderous Webpage at <a class=\"external free\" href=\"http://www.encyclopediadramatica.com/Chris-chan\" rel=\"nofollow\">http://www.encyclopediadramatica.com/Chris-chan</a> POSTING \"Fanart\" that MOSTLY FEATURE WOMEN/my Rosechu Character with an UNNATURAL, UNREQUIRED, DISGUSTING, <a href=\"/cwcki/Pickle\" title=\"Pickle\">DICK</a>!!!!!!!\n</p><p>*sigh* Oh, my life.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>Chris, I unfortunately have some bad news for you: romantic comedies don't tell you very much about real women, as much as reading about comic superheroes will tell a girl about what real life men are like. The women in those movies are just characters.\n</p><p>All women are individual people with individual likes and dislikes. Some girls like shopping, some find it to be boring like a chore. Some girls are in to video games and comics, some are not. Some girls like pink, others hate it. it depends on the individual person. You will never know what a girl will like or dislike before talking to her and getting to know her: most importantly, never, ever, ever assume that she will like something \"because she is a girl\". Most women find sexism appalling and highly unattractive.\n</p><p>The best way to get to know people is not to sit down and wait for someone to find you. There is no one out there searching for you in specific--no one searches for a specific person like that. To meet people, you have to make yourself active in social things. You could try joining clubs or classes, and be sure to talk to any girls you find attractive--but do not ever ask them out right at this point. Most girls feel more comfortable with a guy if they are friends first. Make it something you enjoy, so that way you will already have a common interest. Common interests are very important, they give you things to talk about besides yourself, so the conversation is less awkward. Most people in general don't like to open up to strangers, and find it awkward when strangers talk intimately about themselves with them. Instead, reveal bits and pieces of yourself after you have known each other for a short while.\n</p><p>Secondly, I'd like to add that while <a href=\"/cwcki/Barbara_Chandler\" title=\"Barbara Chandler\">your mother</a> may find you attractive, not every woman will. In your pictures, you appear to be a bit overweight--when you look at girls, do you only look at women who are very slim? If so, I'd suggest looking at women who are closer to your own body type. Just because a woman is a bit chubby doesn't mean she is not a caring, nice person. Perhaps, also, you could look at women who are maybe a couple years older than you. Age doesn't mean much so long as there is great chemistry. I don't mean go look at really really old women--just don't limit yourself to only women who are younger than you, perhaps someone who is a couple years older.\n</p><p>However, even if a woman finds you handsome, that is never enough to start a relationship. There is no such thing as love at first sight. Your personalities have to click as well, or there is no chance at anything more than a one night stand.\n</p><p>Also, I have been listening to the audiobooks of some of your comics. Your <a href=\"/cwcki/Rosechu\" title=\"Rosechu\">Rosechu</a> character's personality seems to be very stereotypical of what some men think women are like. For example, when she meets up with the Jigglypuff character (<a class=\"mw-redirect\" href=\"/cwcki/Amy_Rose\" title=\"Amy Rose\">I forgot her name</a>) all they do is talk about their boyfriends, and then you make a mean joke about how it does in to <a href=\"/cwcki/Sonichu_1#Episode_6:_Sonic_.26_Sonichu_.22Black_Metal_Combat.22\" title=\"Sonichu 1\">\"girl talk time\" and that will take forever</a>. Most women would find this sexist and offensive.\n</p><p>This is because most women do not sit around and talk about how they have to look pretty for their boyfriends. Most women have their own goals and lives--their boyfriends are just another part of their lives. Also, when Sonichu had to keep Rosechu from spending too much money--that was also an offensive sexist joke, suggesting that women always spend too much money, which is just as bad as saying a <a href=\"/cwcki/Niggos\" title=\"Niggos\">black person</a> will always steal from you. it [sic] just isn't true.\n</p><p>One big tip I have to offer is that if you start to see women as friends first and a romantic sweetheart second, you will learn more about them, learn to talk better with them, and meet them. When you assume sexist things about women, it only distances yourself, because women do not want to be around guys who, rather than listening to what the woman has to say and caring about her opinion and thoughts, assumes stupid things based on stereotypes. For example, if you had a black friend, you wouldn't say \"Hey, I'm going to the supermarket. I'll buy you some fried chicken because you're black.\" Instead you would say \"Hey, I'm going to the supermarket, what did you want me to buy?\" In the same way you should not assume a girl will like or dislike things because she is a girl.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Chris to white knight\n</p>\n<hr/>\n<p>Well, [name], while the Movie Women are \"Just Characters\", Rosechu is playing as her own \"Character\" as well. Also, there is MORE THAN ONE Rosechu; Why do you think I've dubbed them respectively \"<a href=\"/cwcki/Bubbles_Rosechu\" title=\"Bubbles Rosechu\">Bubbles Rosechu</a>\", \"<a class=\"mw-redirect\" href=\"/cwcki/Angelica_Rosechu\" title=\"Angelica Rosechu\">Angelica Rosechu</a>\", and recently introduced, \"<a href=\"/cwcki/Lolisa_Rosechu\" title=\"Lolisa Rosechu\">Lolisa Rosechu</a>\", of whom her Boyfriend, \"<a class=\"mw-redirect\" href=\"/cwcki/Jamsta_Sonichu\" title=\"Jamsta Sonichu\">Jamsta Sonichu</a>\", was the one who Interviewed <a class=\"mw-redirect\" href=\"/cwcki/Blanca\" title=\"Blanca\">Blanca</a> and her <a href=\"/cwcki/Jiggliami\" title=\"Jiggliami\">Jiggliami</a> on Radio Station, <a href=\"/cwcki/KCWC\" title=\"KCWC\">KCWC</a>. Anyway, this is NOT about any of my <a href=\"/cwcki/Electric_Hedgehog_Pok%C3%A9mon\" title=\"Electric Hedgehog Pokémon\">Electric-Hedgehogs</a>, so do not bring them up in this discussion about my search for a Potential <a href=\"/cwcki/Sweetheart\" title=\"Sweetheart\">Sweetheart</a>.\n</p><p>Also, Tell me something I DID NOT Already Know; I already knew everything you've stated in your message. Also, Those \"<a href=\"/cwcki/Audiobooks\" title=\"Audiobooks\">Audiobooks</a>\" are NOT OFFICIAL Sonichu &amp; Rosechu Product; the ONLY HONEST AND OFFICIAL Method of Reading the Sonichu Comics is page-by-page on my OFFICIAL AND ORIGINAL SONICHU &amp; ROSECHU SITE at Sonichu.net.\n</p><p>One more thing, I AM NOT OVERWEIGHT!!!!!!!!!\n</p><p>So, I recommend re-reading your previous message, and telling me something WAY DIFFERENT from what you've already typed that I've already known before you typed it.\n</p><p>I apologize again for typing this message through another stressful moment, but I do mean what I have said.\n</p><p>Peace,\n</p><p>Christian C.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>Well, you do appear to be <a href=\"/cwcki/Obesity\" title=\"Obesity\">overweight</a>. I can tell by looking at your pictures--you seem to be in denial about this.\n</p><p>And I was only drawing from your comics because a person's stories can often reveal quite a bit about their own personalities. I was simply saying that you seem to be incredibly sexist. This is why you can't get a date. The way you portray your female characters in a story that is obviously very close to your heart is what reveals this sexist nature about yourself.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p><b>Another thing.</b> from Chris to white knight\n</p>\n<hr/>\n<p>You didn't even take to consideration my LACK OF SELF-ESTEEM, my AUTISM, the <a href=\"/cwcki/Infinitely-High_Boyfriend-Factor\" title=\"Infinitely-High Boyfriend-Factor\">infinitely-high BOYFRIEND-FACTOR</a> my SHYNESS, the possible REJECTIONS, etcetera, etcetera, etcetera from my <a href=\"/cwcki/MySpace\" title=\"MySpace\">MySpace</a> page, my <a href=\"/cwcki/Facebook\" title=\"Facebook\">Facebook</a> page or my \"About the Author\" page on Sonichu.net.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>That's because you can't jsut [sic] say \"Hey, despite all these things you can get a girlfriend.\" Because that's a lie. In order to get a girlfriend, you need to change yourself--currently I can't think of a single woman who would date you. NOT because of your autism, not because of your low self esteem, and not because of having a boyfriend--I don't know a single woman who would date you because you are a sexist and because your personality sticks [sic].\n</p><p>The \"boyfriend factor\" you keep talking about is retarded. Just go meet single women, like, say, at a singles bar. How do you think all of those other boyfriends got their girlfriends?\n</p><p>And, your autism shouldn't limit you from dating entirely. There are plenty of autistic people who can still get date. You jsut [sic] have incredibly high standards, and you're extremely sexist. Plus you refuse to talk to women, is the main thing. If you grow some self confidence and maturity, and maybe move out of your mom's house, maybe you could get a date.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#E6F2FF; border:1px dotted #A3B1BF; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>Chris to white knight\n</p>\n<hr/>\n<p>Look, no offense, but I am NOT \"sexist\", I CARE and RESPECT about the feelings, needs and individual rights of all women. And all you just did in labeling me as such, and telling me that I stink, well that only makes me feel irritated and angry. You should not Judge me by such crackpot theories, and laveling [sic] someone based on that is Wrong. You're ignorant.\n</p>\n</td></tr></tbody></table>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td>\n<p>White knight to Chris\n</p>\n<hr/>\n<p>I'm sorry, but I do not make claims from nothing. I only base my opinions off of evidence, therefore I am not ignorant. You are in denial, you just don't want to be labeled as sexist because you've tried so hard not to be. But you are one, I can see it plain as day. It's not a crackpot theory, I am a sane and rational person.\n</p><p>I did not say you stink, merely that your personality does. I say this because you get offended by everything I say, and respond defensively, rather than considering and respecting my opinions like you say you do before forming a rational (rather than emotional) response. If you could offer evidence as to why your personality does not stink, I would be happy to see it. You do not seem to read what I say, instead you only pick certain points and respond repetitively with answers you already gave and I already addressed.\n</p><p>Also, I say you are a sexist because of the crude jokes made against women you make in your comic. If you are not a sexist, why would you make those crude jokes against women? Please explain this.\n</p><p>If you could offer some evidence, and show me, rather than tell me, how you are not a sexist, again I would be more than happy to see it. You said that you \"respect and care\" about women. Clearly, this shows you to be a sexist--a sexist is a person who values one sex over the other. Whether this means you think women are better than men or men are better than women doesn't make a difference. Either way, you are a sexist. You seem to view women as being extra special people who should be put on a pedestal and worshiped--this is simply not so. A non-sexist person places value and respect on all people equally, not just women, and not just men.\n</p><p>Now remember, I can help you get a girlfriend. I don't need to do this for you. You should be grateful, you shouldn't attack my every standpoint. I say women find you sexist and that's why you can't get a date. I'm probably right, too. Instead of getting offended, you should go \"Oh, I never realized I was a sexist.\" I am giving you honest advice straight from a woman's opinion, and there would be plenty of men very grateful for this advice. I warned you that you would not like most of my advice, well, it hurts but the truth does that sometimes. You will just have to take it like a strong, rational person, which I know you can be if you try. Remember, I am on your side, here to explain to you what you're doing wrong and how you can fix it, but my advice only works if you keep an open mind--I can't tell you the truth if you won't listen to it.\n</p>\n</td></tr></tbody></table>\n<h3><span class=\"mw-headline\" id=\"Evaluation\">Evaluation</span></h3>\n<ul><li>Chris responds similarly to how he responded to <a class=\"mw-redirect\" href=\"/cwcki/Vivian\" title=\"Vivian\">Vivian</a> in <a href=\"/cwcki/Vivitheg%27s_AIM_chat\" title=\"Vivitheg's AIM chat\">their AIM chat</a>--unreceptive, defensive, and repetitive. He also dodges questions. Rather than acknowledging that girls don't like him because he is thoroughly unpleasant, he blames his lack of female companionship on <a class=\"mw-redirect\" href=\"/cwcki/Stress\" title=\"Stress\">stress</a>, <a href=\"/cwcki/Autism\" title=\"Autism\">autism</a>, <a href=\"/cwcki/Infinitely-High_Boyfriend-Factor\" title=\"Infinitely-High Boyfriend-Factor\">infinitely-high boyfriend-factor</a>, fear of rejection, and his shyness.</li>\n<li>Interestingly enough, he is either in denial about his weight or he truly sees himself as a slimmer, younger version of himself as seen in his high school photos. Not only is he in denial about (or blind to) his weight problem, but he will not or cannot see himself as a sexist, despite overwhelming evidence to the contrary.</li>\n<li>The Krapple thread containing these emails served as a killer of troll's remorse.</li></ul>\n<h2><span id=\"17_April_2009_.E2.80.94_Harbal\"></span><span class=\"mw-headline\" id=\"17_April_2009_—_Harbal\">17 April 2009 — Harbal</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td><b>Chris, I hope this helps</b> from <b>Harbal</b> to <b>Chris</b> on 17 <a href=\"/cwcki/April_2009\" title=\"April 2009\">April 2009</a> 7:13 PM\n<hr/>\n<p>Christian, good morning. Or good afternoon. Or evening. Well, whatever time of day it is for you, hello. My name is also Chris. Christopher, though, not Christian. I'm hoping that what I have to say to you is useful to you and that you haven't heard it before. If the latter is the case, then please disregard this e-mail.\n</p><p>I'd like you to understand that what I have to say is true. I'm going to be honest with you. So I'm going to be up front about myself. I am a troll. I have been for a good deal of years now, before the term trolling was even coined for what I did. I tell you this rather than hide it from you so that you understand that I will tell you the truth. Let me ask you though, do you fully know what a troll is? In short, a troll is someone who derives enjoyment from the emotional and mental pain of others, specifically those they cause that pain to, no matter who it is. I tell you this so that you understand my intentions.\n</p><p>I was thinking the other day. I was thinking about you and the trolls in charge of doing things to you and I had a revelation. You are one person. Just one. The people in charge of trolling you are many. So to benefit my amusement, wouldn't it be more prudent to turn my attention away from you and toward those who troll you? Wouldn't it make more sense to get my kicks out of many people as opposed to just one? As a matter of fact, yes. Yes it would. \n</p><p>So I want to out them all to you. A troll's enjoyment only lasts so long as the person or people they troll gives the proper emotional response. Unfortunately for you, you give into exactly what they want every time you do something. So wouldn't it benefit you if you knew who they were? Where they conspired and planned? That's why I'm writing to you.\n</p><p><a class=\"external free\" href=\"http://cogsdev.110mb.com/pvcc/index.php\" rel=\"nofollow\">http://cogsdev.110mb.com/pvcc/index.php</a>\n</p><p>It's the PVCC, a term you're no doubt familiar with. The <a href=\"/cwcki/Private_Villa_of_Corrupted_Citizens\" title=\"Private Villa of Corrupted Citizens\">Private Villa of Corrupted Citizens</a>. That link is to a forum dedicated to you. Everything about you; your history, your life now, your family, your gal-pals, your sweethearts, your art, your comics, your characters, your ideas. When I say it's dedicated to everything about you, I mean everything. Now that's not a good thing. This is a forum dedicated to making fun of everything about you. I know, I'm a member there. They do a real good job of it. These are the people that troll you. It's not <a href=\"/cwcki/Encyclopedia_Dramatica\" title=\"Encyclopedia Dramatica\">Encyclopedia Dramatica</a> and it's not <a class=\"mw-redirect\" href=\"/cwcki/4chan\" title=\"4chan\">4chan</a>. Let me emphasize, it's not Encyclopedia Dramatica. They can't even keep up with everything you do, these days. They're missing a lot of information.\n</p><p>http://cogsdev.110mb.com/cwcki/index.php/Main_Page\n</p><p>Since the PVCC is dedicated to discussing everything about you, the CWCiki is dedicated to cataloguing [sic] everything about you. It's like Wikipedia, except every article there is related to you. Again, this is not a good thing. It's all related to making fun of you.\n</p><p>If you sign up on the PVCC, you'll be able to get the list off all members there. If you do in fact sign up, may I suggest using a name not related to you or Sonichu. If you sign up, do not register with an e-mail relating to you or Sonichu. These people know everything about you. They'd be able to recognize something about you or you've created.\n</p><p>When you sign up, the members who have a red name are the admins. They're the ones that plan a lot of what happens to you. They're the ones in charge. They're the ones that matter to you. The ones in green, the \"Men in the Pickle Suits\", and every of the other colors, they're all irrelevant. They're basically just members of the forum, they don't do much.\n</p><p>They also have an IRC channel. irc.rizon.net #sonichu. For the record, if you ever get an invite to an IRC channel on rizon.net, it's a troll channel. There is only one rule on #sonichu. If you wish to participate there, you must provide a picture of your penis. It's a ridiculous rule, and they enforce it.\n</p><p>Let me say a little bit about <a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>. Clyde is one of the admins on the PVCC. I know you hate him. I know despise him. And I know you're not going to believe this, but he is trying to help you get your life on track. The methods he uses you don't like, and that's why you think he's out to get you. It's just not true, he's not. He does want to see you succeed. He wants to see you be worthy of getting a sweetheart, of getting married, of having kids because at this point, he feels you're not ready. Now Clyde's not as important as you make him out to be. He hardly does anything. He's basically just a figurehead while other people do all the work. You're the one who gives him credit for everything. The image of Clyde you were given, by the way, is not Clyde at all, actually. It's of some guy named Lee Hotti. Google that name, you'll see it to be true. As a side note, a lot of the phone calls you've received from \"Clyde\" recently have not been Clyde at all, just someone using his name.\n</p><p><a class=\"external free\" href=\"http://themiscreants.110mb.com/\" rel=\"nofollow\">http://themiscreants.110mb.com/</a>\n</p><p>Now maybe you remember this website. I believe during one of your chats using Mumble you visited this link. As you can see, since then it's been updated a lot. The Mumbles are every chat you've had with your \"fans\" who were in fact trolls. The PSN chats are all the chats you had with BlueSpike. The \"LoveDoll\" is the video of you fucking Kimmi screaming out JULLAAAAY. (JULLAAAAY is actually a meme now among some circles.) \"Bob Walks In\" is the audio of your father interrupting your masturbation and threatening to cut down your internet. (We actually really like your father, by the way. We call him Lumberjack Bob because he threatened to \"cut down\" the internet, like a lumberjack would a tree, and we're very interested in learning more about him.) \"Robert Simmons and Church\" is an audio of the \"Jew in the Pickle Suit\" going to church with you, posed as Robert Simmons. \"Emily's Date\" should be self-explanitory. You see Emily was a troll all along and wore a wire during the entire date. (We really enjoyed this audio because we got to learn more about your father listening to him talk.) \"Emily and Clyde (Post-Date)\" is a short audio of Emily talking to you, telling you she's gone to live with Clyde, and then Clyde telling you he sent you prostitutes. \"Fanta: Semen Flavor\", \"Spank Dat Ass\", and \"How NOT to take a shower\" are the most recent videos we've gotten. I believe you know who you sent them to.\n</p><p>Which brings me to my final point. <a href=\"/cwcki/Ivy\" title=\"Ivy\">Ivy</a>. You've heard this before and you don't believe it, but I'm going to say it anyway. Ivy is a troll. If you read the PVCC enough, you'll see proof of it. And if you still don't believe it, take a moment and think. Blanca, Panda, Sarah May, Julie, Emily, you've all defended them in the past stating that they're not trolls, but what happened? Every single one of them ended up being a troll. And Ivy will too. I really wish you would believe me when I tell you this. \n</p><p><a class=\"external free\" href=\"http://krapplekomputerkompany.com/_cwc/\" rel=\"nofollow\">http://krapplekomputerkompany.com/_cwc/</a>\n</p><p>That's the last link I have to give you. That is an image board, much like 4chan, that is dedicated to you. With exception for the PVCC, this forum is where you get talked about the most. There is information on this board that is not on the PVCC. \n</p><p>Chris I implore you to research the links I gave you thoroughly so that you can confirm that everything I've said is true. Look at every thread that relates to you, read every post. Please. I am a troll, yes, but I really am trying to help you. If you're able to believe what I've told you and accept it, I promise you it'll make it that much easier for you to not be fooled by them. It'll make you so much harder to get at because you've researched their information, you've read up on them, you'll know what to expect. If you don't believe what I've said, then I've wasted my time. If you don't believe me, I'd hope some day you do.\n</p><p>Stay frosty, Chris.\n</p>\n</td></tr></tbody></table>\n<h2><span id=\"29_April_2009_.E2.80.94_We_are_watching\"></span><span class=\"mw-headline\" id=\"29_April_2009_—_We_are_watching\">29 April 2009 — We <i>are</i> watching</span></h2>\n<table class=\"{{{2}}}\" style=\"background:#F2CECE; border:1px dotted #BFA3A3; color:black; padding:3px; margin-bottom:8px\">\n<caption align=\"top\" style=\"caption-side: top; text-align: left\"><b><span style=\"color:black\"></span></b><span style=\"color:black\"></span>\n</caption>\n<tbody><tr>\n<td><b>Christian W. Chandler</b> from <b>John</b> to <b>Chris</b> on 29 <a href=\"/cwcki/April_2009\" title=\"April 2009\">April 2009</a> 11:08 PM\n<hr/>\n<p>Hello Christian W. Chandler,\n<br/>I write to you as a potential benefactor, should you choose to listen to my warnings. You call me John. It is not obvious, my name is fictionalized, as well as my location and any personal information. It is not of importance, but if you wish to dismiss me as a so-called \"troll\" now, you may.\n</p><p>If you wish to hear my advice, continue and do as I say.\n</p><p>Delete this e-mail when you are done reading it. If you reply, make sure to delete the reply from your Sent folder.\n</p><p>For a long time now I have sat by as a neutral party. You obviously require help in your current situation.\n</p><p>Nothing posted on the internet remains private. I'm sure that's evident by now...especially to you. I am sorry your most recent YouTube account has been located by individuals, but that is inevitable, is it not? Anything on the internet available to the public will be found by the public.\n</p><p>You can not fight over the internet. They are a hate machine. They feed from the anger they generate.\n</p><p>Do not threaten them with violence.\n</p><p>Do not yell, swear, or scream.\n</p><p>Do not pay attention to them. They do not deserve a response.\n</p><p>Most importantly: do not threaten them with ending your comic. They are not threatened by this. They are only pleased.\n</p><p>I am unable to tell if your current state is built upon genius or fault. You are acting unpredictable and...starnger [sic] ...than one would expect of you. Stranger than anything they could achieve in their goading. Your most recent actions have been of questionable nature. In the event this is truly for a girl, as you claim, I must warn you she is undoubtedly one of them.\n</p><p>I am about to disclose some things that may make you upset or angry. Please do not stop reading.\n</p><p>Homosexuality is not wrong, nor is it a sin. It is completely natural for some individuals. I am not saying you are \"gay\" or ahomosexual[sic]. But if you feel those tendencies, you shouldn't displace your hatred on other homosexual individuals. You should accept it for who you are. I realize sin is a concept based on faith and personal viewpoints, but I assure you any religion that regards homosexuality asa [sic] sin has an equally disgusted opinion on your frequent masturbation, lust for women, and unfettering wishes to premaritally lose your virginity.\n</p><p>The <a class=\"mw-redirect\" href=\"/cwcki/Man_in_the_pickle_suit\" title=\"Man in the pickle suit\">man in the pickle suit</a> is not a real person. He is a character being driven by many anonymous individuals.\n</p><p>Eating your semen does not replenish anything in your body. Your ejaculate only contains trace amounts of minerals. The sperm cells will not live outside of the body for more than a few hours, ensuring their inevitable demise regardless of your actions. Once ingested, they will be dissolved in the digestive fluids of your stomach. They will never contribute to your supply of sperm. Whoever suggested anything of that sort was lying.\n</p><p>I believe I have said all that is needed at this time. I hope that you will trust my word.\n</p><p>If you wish, you may contact me. I do not require nor ask that you do. Alternatively, you can make some reference that you have received this message to reduce the electronic paper trail. It is your decision. And remember your instructions: delete this e-mail. If you reply, delete the reply from your Sent folder.\n</p><p>They are watching.\n</p><p>They continue because you continue to make it entertaining.\n</p><p>I am watching.\n</p><p>John\n</p>\n</td></tr></tbody></table>\n<p class=\"mw-empty-elt\">\n</p>\n<table cellspacing=\"0\" class=\"navbox\" style=\";\">\n<tbody><tr>\n<td style=\"padding:2px;\">\n<table cellspacing=\"0\" class=\"nowraplinks collapsible mw-collapsed mw-collapsible\" style=\"width:100%;background:transparent;color:inherit;;\">\n<tbody><tr>\n<th class=\"navbox-title\" colspan=\"2\" style=\";\"><div style=\"float:left; width:6em;text-align:left;\"> <span class=\"noprint plainlinksneverexpand\" style=\"white-space:nowrap; font-weight:normal; font-size:xx-small; ;;border:none;;\"><a href=\"/cwcki/Template:Emails\" title=\"Template:Emails\"><span style=\";;border:none;;\" title=\"View this template\">v</span></a> <span style=\"font-size:80%;\">•</span> <a href=\"/cwcki/Template_talk:Emails\" title=\"Template talk:Emails\"><span style=\"color:#002bb8;;;border:none;;\" title=\"Discussion about this template\">d</span></a> <span style=\"font-size:80%;\">•</span> <a class=\"external text\" href=\"//sonichu.com/w/index.php?title=Template:Emails&amp;action=edit\" rel=\"nofollow\"><span style=\"color:#002bb8;;;border:none;;\" title=\"You can edit this template. Please use the preview button before saving.\">e</span></a> </span>  </div> <span style=\"font-size:110%;\"> Emails</span>\n</th></tr>\n<tr style=\"height:2px;\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Misc. early emails\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Chris_emails_2004-2006\" title=\"Chris emails 2004-2006\">2004‒06</a> • <a href=\"/cwcki/Chris_emails_2007\" title=\"Chris emails 2007\">2007</a> • <a href=\"/cwcki/Chris_emails_2008\" title=\"Chris emails 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Megan_emails,_2005-2006\" title=\"Megan emails, 2005-2006\">2005‒06</a> • <a href=\"/cwcki/Megan_emails,_Jan-July_2007\" title=\"Megan emails, Jan-July 2007\">Jan‒July 2007</a> • <a href=\"/cwcki/Megan_emails,_Aug-Dec_2007\" title=\"Megan emails, Aug-Dec 2007\">Aug‒Dec 2007</a> • <a href=\"/cwcki/Megan_emails,_2008\" title=\"Megan emails, 2008\">2008</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Vivian_Gee\" title=\"Vivian Gee\">Vivian Gee</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Vivian_Gee_E-mails,_2007-2008\" title=\"Vivian Gee E-mails, 2007-2008\">2007‒08</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2009\" title=\"Vivian Gee E-mails, 2009\">2009</a> • <a href=\"/cwcki/Vivian_Gee_E-mails,_2010\" title=\"Vivian Gee E-mails, 2010\">2010</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Blanca_Weiss\" title=\"Blanca Weiss\">Blanca Weiss</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Blanca_Emails,_August_2008\" title=\"Blanca Emails, August 2008\">Aug</a> • <a href=\"/cwcki/Blanca_Emails,_September_2008\" title=\"Blanca Emails, September 2008\">Sept</a> • <a href=\"/cwcki/Blanca_Emails,_October_2008\" title=\"Blanca Emails, October 2008\">Oct 2008</a> • <a href=\"/cwcki/Chris%27s_Letter_to_Blanca\" title=\"Chris's Letter to Blanca\">Letter</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Clyde_Cash\" title=\"Clyde Cash\">Clyde Cash</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Gregg_Mays_E-mails\" title=\"Gregg Mays E-mails\">Gregg Mays</a> • <a class=\"mw-redirect\" href=\"/cwcki/Miyamoto_Saga\" title=\"Miyamoto Saga\">Miyamoto Saga</a> • <a href=\"/cwcki/Reggie_Fils-Aim%C3%A9\" title=\"Reggie Fils-Aimé\">Reggie Fils-Aimé</a> • <a href=\"/cwcki/Clyde_E-mails\" title=\"Clyde E-mails\">Clyde E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/PS3\" title=\"PS3\">PSN Hacking</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">Jack Thaddeus</a> (<a href=\"/cwcki/Jack_Thaddeus_E-mails\" title=\"Jack Thaddeus E-mails\">1</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_2\" title=\"Jack Thaddeus E-mails Part 2\">2</a> • <a href=\"/cwcki/Jack_Thaddeus_E-mails_Part_3\" title=\"Jack Thaddeus E-mails Part 3\">3</a>) • <a href=\"/cwcki/Samantha_Thaddeus_E-mails\" title=\"Samantha Thaddeus E-mails\">Samantha Thaddeus</a> • <a href=\"/cwcki/Katie_Bay\" title=\"Katie Bay\">Katie Bay</a> (<a class=\"mw-redirect\" href=\"/cwcki/Katie_Bay_e-mails_1\" title=\"Katie Bay e-mails 1\">1</a> • <a href=\"/cwcki/Katie_Bay_E-mails_2\" title=\"Katie Bay E-mails 2\">2</a> • <a href=\"/cwcki/Katie_Bay_E-mails_3\" title=\"Katie Bay E-mails 3\">3</a> • <a href=\"/cwcki/Katie_Bay_E-mails_4\" title=\"Katie Bay E-mails 4\">4</a> • <a href=\"/cwcki/Katie_Bay_E-mails_5\" title=\"Katie Bay E-mails 5\">5</a> • <a href=\"/cwcki/Katie_Bay_E-mails_6\" title=\"Katie Bay E-mails 6\">6</a>) • <a href=\"/cwcki/Regina_e-mails\" title=\"Regina e-mails\">Regina e-mails</a> • <a href=\"/cwcki/Clyde_and_Tito_PS3_E-mails\" title=\"Clyde and Tito PS3 E-mails\">Clyde and Tito PS3 E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/CWCipedia\" title=\"CWCipedia\">CWCipedia</a> <a href=\"/cwcki/Mailbag\" title=\"Mailbag\">Mailbag</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Mailbag_1\" title=\"Mailbag 1\">1</a> • <a href=\"/cwcki/Mailbag_2\" title=\"Mailbag 2\">2</a> • <a href=\"/cwcki/Mailbag_3\" title=\"Mailbag 3\">3</a> • <a href=\"/cwcki/Mailbag_4\" title=\"Mailbag 4\">4</a> • <a href=\"/cwcki/Mailbag_5\" title=\"Mailbag 5\">5</a> • <a href=\"/cwcki/Mailbag_6\" title=\"Mailbag 6\">6</a> • <a href=\"/cwcki/Mailbag_7\" title=\"Mailbag 7\">7</a> • <a href=\"/cwcki/Mailbag_8\" title=\"Mailbag 8\">8</a> • <a href=\"/cwcki/Mailbag_9\" title=\"Mailbag 9\">9</a> • <a href=\"/cwcki/Mailbag_10\" title=\"Mailbag 10\">10</a> • <a href=\"/cwcki/Mailbag_11\" title=\"Mailbag 11\">11</a> • <a href=\"/cwcki/Mailbag_12\" title=\"Mailbag 12\">12</a> • <a href=\"/cwcki/Mailbag_13\" title=\"Mailbag 13\">13</a> • <a href=\"/cwcki/Mailbag_14\" title=\"Mailbag 14\">14</a> • <a href=\"/cwcki/Mailbag_15\" title=\"Mailbag 15\">15</a> • <a href=\"/cwcki/Mailbag_16\" title=\"Mailbag 16\">16</a> • <a href=\"/cwcki/Mailbag_17\" title=\"Mailbag 17\">17</a> • <a href=\"/cwcki/Mailbag_18\" title=\"Mailbag 18\">18</a> • <a href=\"/cwcki/Mailbag_19\" title=\"Mailbag 19\">19</a> • <a href=\"/cwcki/Mailbag_20\" title=\"Mailbag 20\">20</a> • <a href=\"/cwcki/Mailbag_21\" title=\"Mailbag 21\">21</a> • <a href=\"/cwcki/Mailbag_22\" title=\"Mailbag 22\">22</a> • <a href=\"/cwcki/Mailbag_23\" title=\"Mailbag 23\">23</a> • <a href=\"/cwcki/Mailbag_24\" title=\"Mailbag 24\">24</a> • <a href=\"/cwcki/Mailbag_25\" title=\"Mailbag 25\">25</a> • <a href=\"/cwcki/Mailbag_26\" title=\"Mailbag 26\">26</a> • <a href=\"/cwcki/Mailbag_27\" title=\"Mailbag 27\">27</a> • <a href=\"/cwcki/Mailbag_28\" title=\"Mailbag 28\">28</a> • <a href=\"/cwcki/Mailbag_29\" title=\"Mailbag 29\">29</a> • <a href=\"/cwcki/Mailbag_30\" title=\"Mailbag 30\">30</a> • <a href=\"/cwcki/Mailbag_31\" title=\"Mailbag 31\">31</a> • <a href=\"/cwcki/Mailbag_32\" title=\"Mailbag 32\">32</a> • <a href=\"/cwcki/Mailbag_33\" title=\"Mailbag 33\">33</a> • <a href=\"/cwcki/Mailbag_34\" title=\"Mailbag 34\">34</a> • <a href=\"/cwcki/Mailbag_35\" title=\"Mailbag 35\">35</a> • <a href=\"/cwcki/Mailbag_36\" title=\"Mailbag 36\">36</a> • <a href=\"/cwcki/Mailbag_37\" title=\"Mailbag 37\">37</a> • <a href=\"/cwcki/Mailbag_38\" title=\"Mailbag 38\">38</a> • <a href=\"/cwcki/Mailbag_39\" title=\"Mailbag 39\">39</a> • <a href=\"/cwcki/Mailbag_40\" title=\"Mailbag 40\">40</a> • <a href=\"/cwcki/Mailbag_41\" title=\"Mailbag 41\">41</a> • <a href=\"/cwcki/Mailbag_42\" title=\"Mailbag 42\">42</a> • <a href=\"/cwcki/Mailbag_43\" title=\"Mailbag 43\">43</a> • <a href=\"/cwcki/Mailbag_44\" title=\"Mailbag 44\">44</a> • <a href=\"/cwcki/Mailbag_45\" title=\"Mailbag 45\">45</a> • <a href=\"/cwcki/Mailbag_46\" title=\"Mailbag 46\">46</a> • <a href=\"/cwcki/Mailbag_47\" title=\"Mailbag 47\">47</a> • <a href=\"/cwcki/Mailbag_48\" title=\"Mailbag 48\">48</a> • <a href=\"/cwcki/Mailbag_49\" title=\"Mailbag 49\">49</a> • <a href=\"/cwcki/Mailbag_50\" title=\"Mailbag 50\">50</a> • <a href=\"/cwcki/Mailbag_51\" title=\"Mailbag 51\">51</a> • <a href=\"/cwcki/Mailbag_52\" title=\"Mailbag 52\">52</a> • <a href=\"/cwcki/Mailbag_53\" title=\"Mailbag 53\">53</a> • <a href=\"/cwcki/Mailbag_54\" title=\"Mailbag 54\">54</a> • <a href=\"/cwcki/Mailbag_55\" title=\"Mailbag 55\">55</a> • <a href=\"/cwcki/Mailbag_56\" title=\"Mailbag 56\">56</a> • <a href=\"/cwcki/Mailbag_57\" title=\"Mailbag 57\">57</a>• <a href=\"/cwcki/Mailbag_58\" title=\"Mailbag 58\">58</a> • <a href=\"/cwcki/Mailbag_59\" title=\"Mailbag 59\">59</a> • <a href=\"/cwcki/Mailbag_60\" title=\"Mailbag 60\">60</a> • <a href=\"/cwcki/Mailbag_61\" title=\"Mailbag 61\">61</a> • <a href=\"/cwcki/Mailbag_62\" title=\"Mailbag 62\">62</a> • <a href=\"/cwcki/Common_Questions\" title=\"Common Questions\">Common Questions</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a>/<a class=\"mw-redirect\" href=\"/cwcki/Surfshack_Tito\" title=\"Surfshack Tito\">Tito</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/The_Wallflower\" title=\"The Wallflower\">The Wallflower</a> (<a href=\"/cwcki/Wallflower_E-mails_1\" title=\"Wallflower E-mails 1\">1</a> • <a href=\"/cwcki/Wallflower_E-mails_2\" title=\"Wallflower E-mails 2\">2</a> • <a href=\"/cwcki/Wallflower_E-mails_3\" title=\"Wallflower E-mails 3\">3</a>) • <a href=\"/cwcki/Surfshack_Tito_E-mails\" title=\"Surfshack Tito E-mails\">Surfshack Tito E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a class=\"mw-redirect\" href=\"/cwcki/Jackie_Romy\" title=\"Jackie Romy\">Jackie Romy</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Jackie_E-mails\" title=\"Jackie E-mails\">1</a> • <a href=\"/cwcki/Jackie_E-mails_2\" title=\"Jackie E-mails 2\">2</a> • <a href=\"/cwcki/Jackie_E-mails_3\" title=\"Jackie E-mails 3\">3</a> • <a href=\"/cwcki/Jackie_E-mails_4\" title=\"Jackie E-mails 4\">4</a> • <a href=\"/cwcki/Jackie_E-mails_5\" title=\"Jackie E-mails 5\">5</a> • <a href=\"/cwcki/Jackie_E-mails_6\" title=\"Jackie E-mails 6\">6</a> • <a href=\"/cwcki/Jackie_E-mails_7\" title=\"Jackie E-mails 7\">7</a> • <a href=\"/cwcki/Jackie_E-mails_8\" title=\"Jackie E-mails 8\">8</a> • <a href=\"/cwcki/Jackie_E-mails_9\" title=\"Jackie E-mails 9\">9</a> • <a href=\"/cwcki/Jackie_E-mails_10\" title=\"Jackie E-mails 10\">10</a> • <a href=\"/cwcki/Jackie_E-mails_11\" title=\"Jackie E-mails 11\">11</a> • <a href=\"/cwcki/Jackie_E-mails_12\" title=\"Jackie E-mails 12\">12</a> • <a href=\"/cwcki/Jackie_E-mails_13\" title=\"Jackie E-mails 13\">13</a> • <a href=\"/cwcki/Jackie_E-mails_14\" title=\"Jackie E-mails 14\">14</a> • <a href=\"/cwcki/Jackie_E-mails_15\" title=\"Jackie E-mails 15\">15</a> • <a href=\"/cwcki/Jackie_E-mails_16\" title=\"Jackie E-mails 16\">16</a> • <a href=\"/cwcki/Jackie_E-mails_17\" title=\"Jackie E-mails 17\">17</a> • <a href=\"/cwcki/Jackie_E-mails_18\" title=\"Jackie E-mails 18\">18</a> • <a href=\"/cwcki/Jackie_E-mails_19\" title=\"Jackie E-mails 19\">19</a> • <a href=\"/cwcki/Jackie_E-mails_20\" title=\"Jackie E-mails 20\">20</a> • <a href=\"/cwcki/Jackie_E-mails_21\" title=\"Jackie E-mails 21\">21</a> • <a href=\"/cwcki/Jackie_E-mails_22\" title=\"Jackie E-mails 22\">22</a> • <a href=\"/cwcki/Jackie_E-mails_23\" title=\"Jackie E-mails 23\">23</a> • <a href=\"/cwcki/Jackie_E-mails_24\" title=\"Jackie E-mails 24\">24</a> • <a href=\"/cwcki/Jackie_E-mails_25\" title=\"Jackie E-mails 25\">25</a> • <a href=\"/cwcki/Jackie_E-mails_26\" title=\"Jackie E-mails 26\">26</a> • <a href=\"/cwcki/Jackie_E-mails_27\" title=\"Jackie E-mails 27\">27</a> • <a href=\"/cwcki/Jackie_E-mails_28\" title=\"Jackie E-mails 28\">28</a> • <a href=\"/cwcki/Jackie_E-mails_29\" title=\"Jackie E-mails 29\">29</a> • <a href=\"/cwcki/Jackie_E-mails_30\" title=\"Jackie E-mails 30\">30</a> • <a href=\"/cwcki/Jackie_E-mails_31\" title=\"Jackie E-mails 31\">31</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Catherine\" title=\"Catherine\">Catherine</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Catherine_E-mails\" title=\"Catherine E-mails\">Catherine E-mails</a> • <a href=\"/cwcki/Open_Relationship_E-mails\" title=\"Open Relationship E-mails\">Open Relationship E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/Thetan\" title=\"Thetan\">Thetan</a>\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Rebeckah_Bentley_E-mails\" title=\"Rebeckah Bentley E-mails\">Rebeckah Bentley E-mails</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\"><a href=\"/cwcki/LoveYouLongTime\" title=\"LoveYouLongTime\">LoveYouLongTime</a>\n</td>\n<td class=\"navbox-list navbox-even\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/LoveYouLongTime_E-mails,_2009\" title=\"LoveYouLongTime E-mails, 2009\">2009</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2010\" title=\"LoveYouLongTime E-mails, 2010\">2010</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2011-2012\" title=\"LoveYouLongTime E-mails, 2011-2012\">2011-2012</a> • <a href=\"/cwcki/LoveYouLongTime_E-mails,_2013-2014\" title=\"LoveYouLongTime E-mails, 2013-2014\">2013-2014‎</a></div>\n</td></tr>\n<tr style=\"height:2px\">\n<td>\n</td></tr>\n<tr>\n<td class=\"navbox-group\" style=\";;\">Other\n</td>\n<td class=\"navbox-list navbox-odd\" style=\"text-align:left;border-left:2px solid #fdfdfd; width:100%;padding:0px;;;\"><div style=\"padding:0em 0.25em\">\n<a href=\"/cwcki/Autism_Awareness_E-mails\" title=\"Autism Awareness E-mails\">Autism Awareness E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/BABSCon_E-mails\" title=\"BABSCon E-mails\">BABSCon E-mails‎</a> • <a href=\"/cwcki/Cole_Smithey_E-mails\" title=\"Cole Smithey E-mails\">Cole Smithey E-mails</a> • <a href=\"/cwcki/Doopie_E-mails\" title=\"Doopie E-mails\">Doopie E-mails</a> • <a class=\"mw-redirect\" href=\"/cwcki/Masturbating_and_squirtin%27\" title=\"Masturbating and squirtin'\">Evan E-mails</a> • <a href=\"/cwcki/Misc_E-mails\" title=\"Misc E-mails\">Misc E-mails</a> • <a href=\"/cwcki/MHS_classmate_E-mails\" title=\"MHS classmate E-mails\">MHS classmate E-mails</a> • <a href=\"/cwcki/Mr._Smith\" title=\"Mr. Smith\">Mr. Smith E-mails</a> • <a href=\"/cwcki/Muscle_bra#The_bra_e-mail\" title=\"Muscle bra\">Muscle bra</a> • <a href=\"/cwcki/Savannah_Chandler\" title=\"Savannah Chandler\">Savannah Chandler Messages</a> • <a class=\"mw-redirect\" href=\"/cwcki/Sydney_Contacts\" title=\"Sydney Contacts\">Sydney Contacts</a> • <a href=\"/cwcki/Uri_Geller\" title=\"Uri Geller\">Uri Geller E-mails</a> • <a class=\"mw-selflink selflink\">White knight E-mails</a></div>\n</td></tr></tbody></table>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240713032734\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.124 seconds\nReal time usage: 0.136 seconds\nPreprocessor visited node count: 978/1000000\nPost‐expand include size: 68240/2097152 bytes\nTemplate argument size: 44395/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 69/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   41.114      1 -total\n 75.68%   31.117      1 Template:Emails\n 65.73%   27.026      1 Template:Navbox\n 11.41%    4.692     10 Template:Quoteboxred\n  9.38%    3.857      1 Template:Tnavbar\n  8.83%    3.631      5 Template:Quotebox\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:7970-0!canonical and timestamp 20240713032734 and revision id 234586. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=White_knight_E-mails&amp;oldid=234586\">http://sonichu.com/w/index.php?title=White_knight_E-mails&amp;oldid=234586</a>\"</div></div>",
  "categories": [
    "Category",
    "E-mails"
  ],
  "links": [
    "Mr. Smith E-mails",
    "2007",
    "57",
    "MHS classmate E-mails",
    "sign",
    "infinitely-high boyfriend-factor",
    "Sydney Contacts",
    "fear of Rejection",
    "43",
    "man in the pickle suit",
    "Autism Awareness E-mails",
    "Rebeckah Bentley E-mails",
    "DICK",
    "Megan Schroeder",
    "60",
    "black person",
    "44",
    "white",
    "14",
    "Surfshack Tito E-mails",
    "CWCipedia",
    "Oct 2008",
    "2005‒06",
    "4chan",
    "your mother",
    "40",
    "56",
    "future",
    "Bubbles Rosechu",
    "infinitely-high BOYFRIEND-FACTOR",
    "their AIM chat",
    "39",
    "great talent of singing",
    "Clyde",
    "Mailbag",
    "Sonichu medallion",
    "21",
    "black",
    "9",
    "the 80's",
    "Vivian Gee",
    "Common Questions",
    "obese",
    "Reggie Fils-Aimé",
    "22",
    "Clyde and Tito PS3 E-mails",
    "5",
    "27",
    "12",
    "Catherine",
    "Cole Smithey E-mails",
    "Jiggliami",
    "25",
    "15",
    "59",
    "girlfriend",
    "49",
    "53",
    "2010",
    "I forgot her name",
    "Jackie Romy",
    "Date Ed",
    "single girls",
    "psychology",
    "Angelica Rosechu",
    "overweight",
    "AGES AGO",
    "Regina e-mails",
    "Sweetheart from the Ground-Up",
    "52",
    "Blanca Weiss",
    "42",
    "2011-2012",
    "54",
    "Doopie E-mails",
    "Katie Bay",
    "17",
    "pretending to be girl",
    "nude pictures",
    "Rosechu",
    "35",
    "Women in General",
    "47",
    "INFINTELY-HIGH BOYFRIEND-FACTOR",
    "BABSCon E-mails‎",
    "LoveYouLongTime",
    "your current \"quest\"",
    "Facebook",
    "April 2009",
    "stress",
    "31",
    "18",
    "Aug",
    "Gregg Mays",
    "Clyde Cash",
    "4",
    "36",
    "Private Villa of Corrupted Citizens",
    "I am Handsome",
    "Catherine E-mails",
    "48",
    "Audiobooks",
    "19",
    "Ivy",
    "Jamsta Sonichu",
    "Lolisa Rosechu",
    "Electric-Hedgehogs",
    "2004‒06",
    "Letter",
    "50",
    "Gal-Pals",
    "Aug‒Dec 2007",
    "PSN Hacking",
    "51",
    "8",
    "10",
    "2",
    "nudes",
    "MySpace",
    "2008",
    "Autism",
    "2013-2014‎",
    "WIDE knowledge",
    "Clyde E-mails",
    "Encyclopedia Dramatica",
    "one giant pussy deflector",
    "Uri Geller E-mails",
    "Tito",
    "3",
    "46",
    "autism",
    "7",
    "Misc E-mails",
    "2007‒08",
    "37",
    "11",
    "23",
    "26",
    "Thetan",
    "2009",
    "13",
    "61",
    "45",
    "video games",
    "guy",
    "FIRST DATE EVER",
    "Sweetheart",
    "24",
    "29",
    "32",
    "Open Relationship E-mails",
    "the talent show",
    "Chris",
    "Vivian",
    "Jack Thaddeus",
    "30",
    "58",
    "KCWC",
    "Samantha Thaddeus",
    "The Wallflower",
    "trolls",
    "1",
    "28",
    "virgin",
    "34",
    "Miyamoto Saga",
    "38",
    "41",
    "20",
    "Jan‒July 2007",
    "Blanca",
    "Evan E-mails",
    "62",
    "Caring",
    "Savannah Chandler Messages",
    "55",
    "33",
    "your wardrobe",
    "Asperger's",
    "your dog",
    "16",
    "6",
    "white knights",
    "Sept"
  ],
  "scraped_at": "2025-11-26T15:09:29.190815"
}