{
  "url": "https://sonichu.com/cwcki/WTJU_Marathon",
  "title": "WTJU Marathon",
  "display_title": "WTJU Marathon",
  "html_content": "<div class=\"mw-body-content mw-content-ltr\" dir=\"ltr\" id=\"mw-content-text\" lang=\"en\"><div class=\"mw-parser-output\"><table style=\"background:#FFF; border:1px solid #00F; border-top:8px solid #00F; color:#000; width:100%; max-width:618px; margin:0 auto 16px;\">\n<tbody><tr style=\"vertical-align:top;\">\n<td style=\"padding:5px;\"><a class=\"image\" href=\"/cwcki/File:Nownownownownow.jpg\"><img alt=\"Nownownownownow.jpg\" decoding=\"async\" height=\"88\" src=\"/w/images/thumb/6/66/Nownownownownow.jpg/90px-Nownownownownow.jpg\" srcset=\"/w/images/thumb/6/66/Nownownownownow.jpg/135px-Nownownownownow.jpg 1.5x, /w/images/6/66/Nownownownownow.jpg 2x\" width=\"90\"/></a>\n</td>\n<td style=\"padding:0 5px 0 1px; width:100%;\"><div style=\"font-size:1.25em; margin:0\"><b>THAT IS MY LINK!!!</b></div>\n<hr/>\n<div style=\"margin-bottom:0\">This article contains link(s) which have been <a href=\"/cwcki/Bob_Walks_In\" title=\"Bob Walks In\">cut down</a> by <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">the Internet Lumberjack</a> or which have otherwise crashed into slumber due to <a href=\"/cwcki/Chris_and_stress\" title=\"Chris and stress\">stress</a>. Please help the CWCki by replacing or restoring these links.</div>\n</td></tr></tbody></table>\n<center>\n<div class=\"boilerplate metadata\" id=\"incomplete\">\n<table cellpadding=\"0\" cellspacing=\"5\" style=\"background-color: #ffffff; border: 5px solid #000000;\">\n<tbody><tr><td><a class=\"image\" href=\"/cwcki/File:Copyright-38672_640.png\"><img alt=\"Copyright-38672 640.png\" decoding=\"async\" height=\"100\" src=\"/w/images/thumb/3/3d/Copyright-38672_640.png/100px-Copyright-38672_640.png\" srcset=\"/w/images/thumb/3/3d/Copyright-38672_640.png/150px-Copyright-38672_640.png 1.5x, /w/images/thumb/3/3d/Copyright-38672_640.png/200px-Copyright-38672_640.png 2x\" width=\"100\"/></a></td>\n<td><p align=\"center\"><b>COPYRIGHT TAKEDOWN</b></p>\n<p>This video has been removed from <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a> and/or elsewhere by the Corporate Jerkops, and requires immediate replacement.</p></td></tr></tbody></table></div>\n</center>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:WTJU_Jazz_MARATHON_omot.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"286\" src=\"/w/images/thumb/6/61/WTJU_Jazz_MARATHON_omot.jpg/300px-WTJU_Jazz_MARATHON_omot.jpg\" srcset=\"/w/images/thumb/6/61/WTJU_Jazz_MARATHON_omot.jpg/450px-WTJU_Jazz_MARATHON_omot.jpg 1.5x, /w/images/thumb/6/61/WTJU_Jazz_MARATHON_omot.jpg/600px-WTJU_Jazz_MARATHON_omot.jpg 2x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:WTJU_Jazz_MARATHON_omot.jpg\" title=\"Enlarge\"></a></div><a class=\"mw-redirect\" href=\"/cwcki/Chris\" title=\"Chris\">Chris</a>'s cover to the album, <a href=\"/cwcki/Autism\" title=\"Autism\">predictably</a> featuring <a href=\"/cwcki/Sonichu_(character)\" title=\"Sonichu (character)\">Sonichu</a>.</div></div></div>\n<p>The <b>WTJU Jazz Marathon</b> was a marathon that <a href=\"/cwcki/Bob_Chandler\" title=\"Bob Chandler\">Bob Chandler</a> helped to host in <a class=\"mw-redirect\" href=\"/cwcki/1990\" title=\"1990\">1990</a>. Over the course of this marathon, Bob shows an impressive amount of knowledge about jazz <a class=\"mw-redirect\" href=\"/cwcki/Music\" title=\"Music\">music</a> in the 1920s and 1930s. Also notable is Bob's use of the word \"negro\" to describe African-American musicians and their music, Bob's droning on about jazz history for minutes at at a time, and the general lack of interest that the audience and the other DJs have in Bob's program, as shown by the lack of donation calls that are made over the course of the show.\n</p><p>Chris first mentioned the marathon in an <a href=\"/cwcki/Megan_emails,_Jan-July_2007#Chris_apologizes_for_being_a_douche\" title=\"Megan emails, Jan-July 2007\">email</a> to <a href=\"/cwcki/Megan_Schroeder\" title=\"Megan Schroeder\">Megan Schroeder</a> in January 2007. The next mention of the marathon was in <a href=\"/cwcki/DayOut#At_Least_My_Face_Is_Not_F3c7ing_Orange\" title=\"DayOut\">At Least My Face Is Not F3c7ing Orange</a> in October 2010, albeit with Chris misremembering the date as 1989. In <a href=\"/cwcki/December_2012\" title=\"December 2012\">December 2012</a>, he put up the marathon on RapidShare (after which it was luckily archived to <a href=\"/cwcki/YouTube\" title=\"YouTube\">YouTube</a>, as RapidShare was shut down a few years later, however the video for disc four was blocked on copyright grounds), and it remained the most notable thing Chris has done about his dad ever since Bob's death until <a href=\"/cwcki/2017\" title=\"2017\">2017</a>, when he <a href=\"/cwcki/CLog_09042017_-_Mister_C\" title=\"CLog 09042017 - Mister C\">read out</a> several <a href=\"/cwcki/Bob%27s_Letters_to_Chris\" title=\"Bob's Letters to Chris\">letters</a> Bob had written for him prior to his death\n</p>\n<div aria-labelledby=\"mw-toc-heading\" class=\"toc\" id=\"toc\" role=\"navigation\"><input class=\"toctogglecheckbox\" id=\"toctogglecheckbox\" role=\"button\" style=\"display:none\" type=\"checkbox\"/><div class=\"toctitle\" dir=\"ltr\" lang=\"en\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Transcript\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Transcript</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Disc_2\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Disc 2</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Disc_3\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Disc 3</span></a></li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Disc_4\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Disc 4</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#eBay\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">eBay</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#References\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">References</span></a></li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Links\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Links</span></a></li>\n</ul>\n</div>\n<h2><span class=\"mw-headline\" id=\"Transcript\">Transcript</span></h2>\n<p><i>[Chris distributed the marathon as a 6-CD set. Only discs 2 to 4 are transcribed here, since Bob was the DJ during that segment of the marathon.]</i>\n</p>\n<h3><span class=\"mw-headline\" id=\"Disc_2\">Disc 2</span></h3>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>1990 WTJU Jazz Marathon Disc 2 Out Of 6</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/-r0A1wvEdIc\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Direct link</b>\n</td>\n<td><a class=\"external text\" href=\"https://youtube.com/watch?v=-r0A1wvEdIc\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/varchive/-r0A1wvEdIc\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td><a class=\"mw-redirect\" href=\"/cwcki/1990\" title=\"1990\">1990</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Music</span><a href=\"/cwcki/Chris_and_music\" title=\"Music\"><img alt=\"Music\" decoding=\"async\" height=\"32\" src=\"/w/images/2/2c/Music.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">Music</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Other</b>\n</td>\n<td><span style=\"display:none\">Audio</span><a href=\"/cwcki/File:Audio.png\" title=\"Audio\"><img alt=\"Audio\" decoding=\"async\" height=\"20\" src=\"/w/images/7/72/Audio.png\" width=\"20\"/></a> Audio\n</td></tr>\n</tbody></table>\n<p><br/>\n<b>Timiny</b>: K, you're listening to the WTJU jazz marathon for 1990, my name is Timiny (sp.?), I'm here in the studio with Bob Chandler, who's prepared an excellent show for us today, of music including jugs, kazoos and washboards. Some really dynamite stuff from between-made between 1928 and 1934. So I'm gonna go ahead and turn the mic over to Bob and I wanna urge everybody in the audience to make a pledge for support of community radio here in <a class=\"mw-redirect\" href=\"/cwcki/Charlottesville,_Virginia\" title=\"Charlottesville, Virginia\">Charlottesville, Virginia</a>. The numbers down here to make a pledge are 924-3418 and 924-3959. And Bob, if you'd be so kind, tell us about this music you're about to play for us. \n</p><p><b>Bob</b>: OK, this is jazzy jugs, kazoos and washboards. It's a style of American jazz that's been far too long overlooked. The musical is a jug, a bottle or even a pipe will serve as well. The hat spitting, and vocalizing into the player can produce a brooding, resonant sound. Not dissimilar to that of a tuba or a string bass. Larger glass vessels and earthenware demijohns does produce a full boom. The player may alter the sound by blowing into the jug at different angles. Singers who like to vocalize through a kazoo, a submarine-like look-like toy that imparts a buzzing sound to the vocal sound similar to that of a comb and paper. One who would want to give it more volume might add an oral funnel, which gives it direction, and carries it further. Another related domestic item, the corrugated washboard, a rubbing board, gave rise to the noted rubbing sounds of the washer window. Its surface gives a staccato beat on a board or similar implement is drawn across the washboards, and its potential as a rhythm instrument was not missed. The players often wore metal thimbles on his fingers to obtain a crisp, rattling sound, more satisfying to the Blues era than the drums were. Cowbells, wood blocks, pans, wire brushes, wooden rods, and other embellishments were added to create excitement and tone color for the rhythmic beat of the music. So here they are, fifteen obscure performances, from 1928 to 1934. Performance number one, is \"Farewell Blues\", August the 17th, 1934, New York Personnel, The Georgia Washboard Stompers. Chick Webb is the celebrated trumpeter, Taft Jordan is the star of the session, surrounded by saxophonists Dave Page, Ben Smith and Carl Wade. Clarence Prophet is at the piano, Steve Washington is doubling banjo and guitar, Ghost Howell is on the bass, and Jake Fenderson is on the washboard, makes this performance really swing! You listen for good breaks by all the personnel in the band, and good, good rhythm by Fenderson on the washboard.\n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Farewell_Blues\" title=\"wikipedia:Farewell Blues\">Farewell Blues</a>\" plays</i>]\n</p><p><b>Bob</b>: Okay, now we goin' on performance number two, which is Tight Like That. This is November the 9th, 1928 with Chicago Personnel, Tampa Red's Hokum Jug Band. It's a great group of Chicago musicians featuring kazoo, guitar and jug by Hudson Whittaker. Tampa Red's guitar, Thomas A. Dorsey's on the piano and the washboard, Frankie \"Half Pint\" Jax on vocals interact to make this a great session. Listen for some very good kazoo and jugs, and notice how Half Pint Jaxon laughs like scat singing. Very unusual.\n</p><p>[<i>\"It's Tight Like That\" plays</i>]\n</p><p><b>Bob</b>: Okay, now we goin' performance number three. Barrelhouse Stomp, which was done March 13th, 1931. Again with Chicago people, the State Street Ramblers. Alfred Bell is singing and strumming washboard, as well as playing the kazoo, Roy Palmer is on trombone, Darryl Howard of New Orleans is on clarinet, Jimmy Blythe, the great Jimmy Blythe is on piano, and Ed Hudson on banjo. The talking is by Alfred Bell. You listen for Howard's clarinet feature, kazoo takes the place of the trumpet throughout so if you think you hear a trumpet, you're not hearing a trumpet, you're hearing a kazoo. [<i>light laugh</i>] Very good washboard and kazoo. Notice how the trombone takes the place of the jug and string bass when the kazoo takes the lead.\n</p><p>[<i>\"Barrelhouse Stomp\" plays</i>]\n</p><p><b>Bob</b>: OK, the next one is \"Forty and Tight\". This was recorded on July 24th, 1929 by Chicago personnel, The Beale Street Washboard Band. The legendary Johnny Dodds is on clarinet, Herb Moran is on cornet, Frank Melrose is on piano, and Warren \"Baby\" Dodds is on washboard. Now, this is unusual because you normally hear him on drums. The teaming of the Dodds brothers when they were at their best. You listen for Baby Dodds, who's not often on the washboard, and very good interplay between the personnel, and each individual instrument of the group can be heard at any time, even if they're all playing at once. I feel this is very unselfish, and if they weren't so good, they wouldn't even try to overplay the other.\n</p><p>[<i>\"Forty and Tight\" plays</i>]\n</p><p><b>Timiny</b>: The Dodds brothers...hot stuff, huh? I'd like to remind you, you're listening to the 1990 Jazz Marathon. We're on the air to entertain you and also to elicit your support for community radio here in Charlottesville, Virginia. All of this music is, of course, a type that you never hear anywhere else, er, probably you've never heard anything like this in your lives, but you have to admit this is really hot jazz. We have a lot more ahead of us, um, Bob's got a whole bunch of tunes lined up. We'd like to hear the phones ring down here, it's sorta like the calm before the storm. The game isn't over yet, and there aren't too many people..active and alive, but we know you're out there, so before everything gets hot, give us a call down here, 924-3418, 924-3959, and support WTJU, so I'll turn the mic over to Bob.\n</p><p><b>Bob</b>: This is performance number five coming up. \"Sweet Lizzie\" was done on October 27, 1930 by Chicago personnel again, and it was called James Cole's Washboard Band. A sizzling fiddle, of all things, by James Cole, and he's backed up by Eddie Dennis, mandolin, washboard and kazoo, Tony Bradley on guitar, you listen for the sizzling fiddle by James Cole, and good rhythm by Bradley on guitar, and the kazoos and the washboards, [<i>laughs</i>], they just can't be, undercut cuz they're great.\n</p><p>[<i>\"Sweet Lizzie\" plays</i>]\n</p><p><b>Bob</b>: And can you imagine, that that was all done with a violin, a mandolin, a kazoo and a washboard? It-it's just amazing. The next performance is known as \"Crazy Blues\". It was done on October the 3rd, 1934, in New York, by the Alabama Jug Band. Now, [<i>laughs</i>], this-this name and the people don't seem to go together but, uh, at any rate, it-it spots the eccentric cigar chewin' Willie \"The Lion\" Smith on piano, and includes Ed Allen's cornet, Cecil Scott's clarinet, Ikey Robinson on banjo, Cyrus St. Clair on bass, Clarence Todd on kazoo, Floyd Casey on washboard, and Clarence Williams blowing zany, highly emotional notes into his jug. It also adds a Ham and Cabbage Trio composed of Williams, Robinson and Todd. Listen for some great jug by Williams, and very interesting washboard by Floyd Casey, which sounds almost like brushes on a snare drum. \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Crazy_Blues\" title=\"wikipedia:Crazy Blues\">Crazy Blues</a>\" plays</i>]\n</p><p><b>Bob</b>: That, that jug by Williams just carries me away, I'm telling you. (Laughs) The next performance is \"Tiger Rag\". It was done on October the 17th, 1934, again by New York personnel. They were called the Georgia Washboard Stompers. This is Chick Webb's celebrated trumpeter Taft Jordan, is the star of this session. He's surrounded by saxophonists Dave Page, Ben Smith and Carl Wade. Clarence Prophet is at the piano, Steve Washington is doubling banjo and guitar, Ghost Howell is on bass, and Jake Fenderson is on washboard, making this performance really swing. Listen for tremendous washboards, pots and pans by Jake Fenderson, great string bass by Ghost Howell and notice the exciting syncopation and hesitation of Taft Jordan on trumpet. \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Tiger_Rag\" title=\"wikipedia:Tiger Rag\">Tiger Rag</a>\" plays</i>]\n</p><p><b>Timiny</b>: Before we get on with the music, I'd like to tell you that you're listening to the jazz marathon, and we're doing this programming for the purpose of eliciting support from the public for continued jazz programming in Charlottesville, and we'd like to hear the phones ring down here, it's been very, very quiet, I know there's a lot going on, but I also know there's a lot of people who haven't yet made a pledge to help us out with our operations for the next year, and, if you will listen to WTJU regularly, and a lot of people do, it's time now to get out your checkbook and be a little generous with the music that we like and enjoy so much. Okay, I'm going to turn the mic over to Bob for more kazoos and washboards and jugs. \n</p><p><b>Bob</b>: K, this next performance is \"Shake Your Shimmy\". It was done on October the 9th, 1928 by Chicago personnel, a group called The Midnight Rounders. And this group was known by several other names too, but it was basically headed up by Jimmy Blythe on piano, William Lyle on bass, Jimmy Bertrand on washboard and woodblocks and Frankie Jackson on vocal. Listen for great washboard and woodblocks by Jimmy Bertrand, and good performances from Blythe and Lyle. Just listen to each player and you just see, boy, they're really having a lot of fun.\n</p><p>[<i>\"Shake Your Shimmy\" plays</i>]\n</p><p><b>Bob</b>: OK, now we'll go back to New York personnel on this cut, and they're playing a song called \"Jazz It Blues\", which was done October the 3rd 1934 again by the Alabama Jug Band, and we have the eccentric cigar chewing Willie \"The Lion\" Smith on piano, Ed Allen's cornet, Cecil Scott's clarinet, Ikey Robinson on banjo, Cyrus St. Clair on bass, Clarence Todd is on kazoo this time, Floyd Casey's on washboard, and Clarence Todd doubles by blowing zany, high emotional notes into his jug. We again have the Ham and Cabbage Vocal Trio of Williams and Robinson and Todd. On this one you should listen for an outstanding recording, listen to the notes of the various pitches that come from the jugs that William is blowing into it. I understand you can change the pitch by the angle at which you blow into the jug, and the, uh, intensity at which you blow it. Uh, everybody takes a solo in this one, and there's great interaction between the players. The trio does scat singing and I myself in 60 years have never heard a growl clarinet before, but Cecil Scott does it on this one, and it's just amazing. \n</p><p>[<i>\"Jazz It Blues\" plays</i>]\n</p><p><b>Bob</b>: Well, that was just a, just a foot tappin', knee slappin' performance there, I tell you. (Laughs). That's just about as good a jazz you can find anywhere. The next performance is done by Chicago people, it's called \"Pleasure Mad\". It was done on April 23rd, 1928, by the Blythe Blue Boys. Now this again is Jimmy Blythe on piano, Natty Dominique on cornet, and we have unknown alto sax, W.E. Burton's on the washboards and vocal comments, and on this one you can listen for a great Jimmy Blythe piano break, and all the fun that these boys have.\n</p><p>[<i>\"Pleasure Mad\" plays</i>]\n</p><p><b>Bob</b>: They-They sure are having fun. (Laughs) That's just infectuous (sic). The next performance is \"Wildman Stomp\", which was done March the 30th, 1931 by Chicago personnel, and it's the State Street Ramblers again. It again has Jimmy Blythe on piano, Ed Hudson on banjo, Alfred Bell on kazoo and washboard. And you listen for a great kazoo solo by Alfred Bell, and a vocal comment by Bell, and what jazz can be made with just a piano, a kazoo, a banjo and a washboard. Wow, what fun they all having. \n</p><p>[<i>\"Wildman Stomp\" plays</i>]\n</p><p><b>Bob</b>: This next one is again by New York personnel, the Alabama Jug Band, that we've heard before. Uh, the name of the song is \"My Gal Sal\", and it was recorded on September the 5th, 1934. Again, we have the cigar chewin' Willie \"The Lion\" Smith on piano, including Ed Allen's cornet, Cecil Scott on clarinet, Ikey Robinson on banjo, Richard Fulbright on bass, Floyd Casey on the washboard, Clarence Todd's on the kazoo, and Clarence Williams is blowing his zany, highly emotional notes in the jug again. And listen to the vocal by Hambone Jackson. This is a good cornet and a good group. Williams on the jug, and Todd's on the kazoo, and Casey on the washboard, they're just hard to beat. \n</p><p>[<i>\"My Gal Sal\" plays</i>]\n</p><p><b>Bob</b>: The next song'll be the \"Gulf Coast Blues\", which is done, which was recorded on September the 5th, 1934 by the same group, the Alabama Jug Band that you just heard, except one of the differences is the writer of this song is also the one who is gonna be blowing the jug, which is Clarence Williams. \n</p><p>[<i>\"Gulf Coast Blues\" plays</i>]\n</p><p><b>Timiny</b>: OK, I'd like to remind you you're listening to WTJU 91.3 FM in Charlottesville, Virginia, it's almost 6:00. We're doing, (inhales), jugs, kazoos (sighs) and other unusual instruments in jazz, and we have about, oh, about 20 more minutes left of this programming and then we're gonna move on to some boogie-woogie jazz, so I'll let Bob Chandler here continue with this great music, the numbers here again, if you, (pause), choose to make a pledge of support to WTJU are 924-3959 and 924-3418. At this point, we're about $1,800 shy of our goal and we have about one more day of the jazz marathon left so it's time to keep, uh, to stop putting it off and get out your checkbook and, (pause), support your community radio. Okay, Bob. Lay a little more of this on us. \n</p><p><b>Bob</b>: OK, the next, the next song we'll hear is by the Alabama Jug Band again, this is the same New York personnel, it was recorded at the same time, it's \"I Wish I Could Shimmy Like My Sister Kate\". \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/I_Wish_I_Could_Shimmy_Like_My_Sister_Kate\" title=\"wikipedia:I Wish I Could Shimmy Like My Sister Kate\">I Wish I Could Shimmy Like My Sister Kate</a>\" plays</i>]\n</p><p><b>Bob</b>: Okay, we'll come now to the last performance of our jugs, kazoos and washboards, which is done by New York personnel, October the 3rd, 1934, again it's the Alabama Jug Band, uh, which was the cigar chewin' Willie \"The Lion\" Smith, Ed Allen's cornet, Cecil Scott's clarinet, Ikey Robinson on banjo, Cyrus St. Clair on tuba, Floyd Casey on washboard, Clarence Todd on kazoo, and Clarence Williams blowing his zany notes into the jug. The vocals by Hambone Jackson, you listen for a great cornet break towards the end of this piece, followed by Willie \"The Lion\" Smith on piano doing his thing. The name of this song is \"Somebody Stole My Gal\". \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Somebody_Stole_My_Gal\" title=\"wikipedia:Somebody Stole My Gal\">Somebody Stole My Gal</a>\" plays</i>]\n</p>\n<h3><span class=\"mw-headline\" id=\"Disc_3\">Disc 3</span></h3>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>1990 WTJU Jazz Marathon Disc 3 Out Of 6</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/clMw0ntg384\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Search for video</b>\n</td>\n<td><a class=\"external text\" href=\"https://www.youtube.com/results?search_query=1990+WTJU+Jazz+Marathon+Disc+3+Out+Of+6\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/vidsearch?q=1990+WTJU+Jazz+Marathon+Disc+3+Out+Of+6\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td><a class=\"mw-redirect\" href=\"/cwcki/1990\" title=\"1990\">1990</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Music</span><a href=\"/cwcki/Chris_and_music\" title=\"Music\"><img alt=\"Music\" decoding=\"async\" height=\"32\" src=\"/w/images/2/2c/Music.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">Music</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Other</b>\n</td>\n<td><span style=\"display:none\">Audio</span><a href=\"/cwcki/File:Audio.png\" title=\"Audio\"><img alt=\"Audio\" decoding=\"async\" height=\"20\" src=\"/w/images/7/72/Audio.png\" width=\"20\"/></a> Audio\n</td></tr>\n</tbody></table>\n<p><br/>\n<b>Bob</b>: Well, I certainly hope that you enjoyed the jugs and the kazoos and the washboards because it's certainly unusual music, you don't hear it much anymore, I think it'd be a lot of fun, I would enjoy going to a place that had it myself, and participating even. We're going to lead into the boogie-woogie show with some boogie-woogie now. Uh, the act, the show will start at 6:30 but we're just gonna lead in with some of the, more modern boogie woogie, not the roots of the boogie woogie but the more modern boogie woogie that was done in the 1939, 1940, 1938, uh, and this is just beautiful music, and the first one we're gonna hear is by one of the greats of the Boogie Woogie Trio, Albert Ammons, and his \"Bass Going Crazy\", this was recorded in 1939.\n</p><p>[<i>\"Bass Going Crazy\" plays</i>]\n</p><p><b>Bob</b>: The next record we're gonna hear, is one by Pete Johnson, which was recorded in 1939, and, uh, it's called \"Climbing and Screaming\", and, it's on the same record so my friend Timiny here is trying to cue it up, so that, uh, we can let it go. That's why I'm hesitating for a minute, give him a little bit of time. So this is \"Climbing and Screaming\" by Pete Johnson from Kansas City, part of the Boogie Woogie Trio.\n</p><p>[<i>\"Climbing &amp; Screaming\" plays</i>]\n</p><p><b>Bob</b>: Okay, that was \"Climbing &amp; Screaming\" by Pete Johnson. Again, we've gotta move to another track on this, uh, record so I'll talk just a little bit. We're gonna have another one by Pete Johnson, and like I say he was part of the Boogie Woogie Trio and he was from Kansas City. And, uh, Timiny says we're ready so, here we go with \"<a href=\"/cwcki/Kacey\" title=\"Kacey\">Kacey</a> On My Mind\".\n</p><p>[<i>\"Kacey On My Mind\" plays</i>]\n</p><p><b>Bob</b>: This next record is, is really part of the piano blues but it's not a boogie-woogie, but it's one which, uh, I think you'll be surprised at, it was very surprising to me, it's played by Meade \"Lux\" Lewis, who's one of the Boogie Woogie Trio again, but he's playing this on a Celeste, which is one of the most beautiful songs I think I've ever heard, I, I, uh,was just, overwhelmed when I heard it, I think you will be too. The name of this tune is The Celeste Blues. \n</p><p>[<i>Bob mistakenly plays the entirety of \"The Pearls\" by Mary Lou Williams</i>]\n</p><p><b>Bob</b>: I-I-I'm sorry, we got the wrong side of that record, what you just heard was Mary Lou Williams, (laughs), who is, uh, one of the great ones for, uh, piano blues also, and she was playing Jelly Roll Morton's famous \"The Pearls\". Now we're gonna, we're gonna play one, next, by Maude \"Lux\"--Meade \"Lux\" Lewis, we'll go back to the Celeste as soon as we flip the record over, after this one, but this is one he did in 1936 called, uh, \"Whistling Blues\". \n</p><p>[<i>\"Whistling Blues\" plays</i>]\n</p><p><b>Bob</b>: OK now, this, this Whistling Blues I picked just because it was kinda unusual, you never hear people whistling anymore. I, myself, find myself whistling, but then, um, I'm a lot older also. (Laughs) Uh, we'll go back to our Celeste Blues, we have it cued up now. And I think that you'll find that this is one of the most beautiful pieces of music you've ever heard. I'm sorry we missed it on our first go-around. \n</p><p>[<i>\"Celeste Blues\" plays</i>]\n</p><p><b>Timiny</b>: You're listening to WTJU 91.3 in Charlottesville. This is the jazz marathon, the 1990 jazz marathon. We haven't had too many phone calls down here. We would like to thank Robert Overstreet for his, uh, generous pledge, and we're still looking for his request. And we're gonna continue now with more boogie-woogie for about another hour and a half before Sineer (sp.?) comes on with her Sarah Vaughan show that you definitely want to stay tuned for, and Bob Chandler is gonna take us in more boogie-woogie.\n</p><p><b>Bob</b>: To start the boogie-woogie, I would like first to tell you a little bit about the piano blues, cuz what you're going to hear is a performance of a collection of piano blues, which also is known as the Barrelhouse, Fast Western, the Piano Boogie-Woogie, the Train Blues, the Juke Joint Jams, the Rent Party Blues, the Brothel Piano and piano music in small cafes and bars around the countryside. The following performances that you'll hear for the next hour-and-a-half were recorded between 1924 and 1938, and these will be divided into two categories. Pre-1920 types of piano blues performances, and Post-1920 through 1950 piano blues and jazz. Although there were a multitude of regional and individual variations, Pre-1920 American negro piano music can in general be divided into two main categories. Ragtime, which was a relatively sophisticated music which included the charming, intricate and quite seriously intended work of a small school of Negro composers. Ragtime reached its highest development, and evolved toward actual jazz piano in the cities of the Eastern Seaboard, particularly in New York, eventually becoming the magnificent stride piano of men like James P. Johnson, Fats Waller, Lucky Roberts, Willie \"The Lion\" Smith and the piano musicians that followed on the streets of Jazz, 52nd Street in New York. Ragtime is a school of piano music into itself, and will be left to others to explore. For me, there's nothing to beat the blues piano, a kind which was, by contrast, a black folk form of music, pure and simple. Its players were self-taught, largely unconcerned with written music, but their music has proved far deeper and more durable. Authentic blues piano was a western and southern type that flourished from Texas to Alabama, through the Mississippi Valley, and had its northern center in Chicago's South Side. It was a folk music played by countless unknown and wandering musicians, riding the freight trains and riverboats from place to place. Most were never recorded, and are only now remembered as vague names by musicians, who became more well known. This was a music invariably played on the dilapidated pianos of lumber camps, back-road dives, speakeasies, brothels, dance halls, cafes, and more importantly, the rent parties of apartments and houses where the tenants would give all-night parties to raise the money to pay the rent. In such surroundings, a piano player was expected to last for hours, which may have something to do with the repetitious form of the music. In any event, functioning mainly as party music and dance music. It had to be strongly rhythmic. At best, it had to simulate the sounds of a full band, and some of the slides and micro-tones of the blues melodies. At its best, this music can be extremely extraordinary, but also deceptively beautiful in its simpler forms. The form of this music was usually that of the 12-bar blues, although 8-bar and even 16-bar variants existed, as well as non-blues tunes that were blues-like in feeling. Some players were quite casual about forming meter, adding or subtracting beats in a haphazard way. Aside from the form itself, the most obvious characteristics of the blues piano is in the blues that you used. There were usually repeated one-bar figures, which sound simple enough, but actually there were innumerable variations, and players prided themselves on the number of basses they knew. There were rolling basses, which kept the hand in the same position for each chord, and walking basses, which moved up and down the keyboard in a set pattern. Some basses used single-note lines, others used thirds, fifths, sixths, and still other broken octaves. Often there were eight to the bar or double-time, a characteristic that has reappeared in rock and soul music. Quite often, the basses started in a rolling, eight-note triplet rhythm. But whatever the specific figure might be, the left hand was the rhythmic bass. The right hand had a completely independent role to play, supplying a contrasting melody line (usually a series of progressive phrases, rather than a sustained or complex melody). \n</p><p>And so, on to the music itself. A small sampling of what could go on for weeks and weeks in the records of my collection alone. There was evidence that the music that we know of as boogie-woogie existed before the turn of the century by players such as William Turk, who was said to have a left hand like God. There was also evidence of players in Birmingham, Alabama, New Orleans, Louis---St. Louis, and the Tenderloin District of New York. The first known published piece of music that shows a form of boogie-woogie, the New Orleans Hop Scop Blues, was written at least as early as 1911 by George Washington Thomas Jr. of Houston, Texas. He later moved to New Orleans in 1914, and this is where he met Clarence Williams and formed a publishing house. George Washington Thomas Jr. also recorded the first known walking bass recording in 1923, it was known as \"The Rocks\", and to my dismay I do not have a copy of it to let you hear. The first song we will hear, though, is New Orleans Hop Scop Blues as it was published in 1915. It appears to be a song to dance to. It was performed by Betsy Smith with Clarence Williams as her piano player. Notice the piano and the form  of the music rather than the words itself. Here is New Orleans Hop Scop Blues.\n</p><p>[<i>\"New Orleans Hop Scop Blues\" plays</i>]\n</p><p><b>Bob</b>: The next piece we will hear is the Farro Street Jive by Little Brother Montgomery from Louisiana, where he crossed the paths of and learned from Lee Green, Roosevelt Sykes \"The Honeydripper\", and many other piano players in the logging camps and barrelhouses of Louisiana in the period of 1915 to the '30s. The next three pieces are typical of the blues up to the early '20s. Here is Farro Street Jive by Little Brother Montgomery.  \n</p><p>[<i>\"Farro Street Jive\" plays</i>]\n</p><p><b>Bob</b>: The next piece is by..\"Dud-Low Joe\" is by Lee Green, and it's the forerunner of the piece that was just played. This name, \"Dud-Low Joe\", is one of the names used for boogie-woogie before 1928 when Pinetop Smith named this gentry of music \"boogie-woogie\". Now, this...this \"Dud-Low Joe\" is, uh, you gotta remember that these people now were back in the...in the before 1920 really playing this in-in the juke joints and turpentine fields of Louisiana, and it's just, just beautiful music.  \n</p><p>[<i>\"Dud-Low Joe\" plays</i>]\n</p><p><b>Bob</b>: The next piano blues that we will hear is The Suitcase Blues by Hersal Thomas. He was the younger brother of George Washington Thomas Jr., and was born in 1910. He was a child prodigy in Houston, and he exceeded his older brothers as a blues pianist. He modeled his style on George's but he elaborated it and developed new, bass figures. When he was 14, he cut his first record, \"The Suitcase Blues\". He had a very busy, but a very short recording career. In Chicago, Hersal was no less a giant on piano than King Oliver was as a horn player. He was in Detroit working at Penny's Pleasure Inn, where he developed food poisoning and died at the age of 16. Here's his very beautiful \"Suitcase Blues\" that he recorded when he was 14 years old in 1925.\n</p><p>[<i>\"Suitcase Blues\" plays</i>]\n</p><p><b>Bob</b>: As I said in the beginning, a lot of these piano players rode the freight trains, both inside the boxcars and underneath the cars, on the rod supports or on the flatcars. They were very accustomed to the sounds the trains made, and the surrounding noise of bells and whistles and echoes of the surrounding trees and buildings that the train passed by. If you've ever ridden a train, you will know what I'm really trying to say. These pianists wrote and played many pieces that became known as the train blues, where they used a piano to make the sounds of the train and the passing bridges and the bells and the buildings. Close your eyes and listen to the train on the next three recordings. First, \"The Honky Tonk Train Blues\" by the great Meade \"Lux\" Lewis. This was recorded in 1935.\n</p><p>[<i>\"Honky Tonk Train Blues\" plays</i>]\n</p><p><b>Bob</b>: Now we'll listen to another train blues. Uh, I guess as you, if you really heard that one, you heard the pounding of the wheels, and the signals and the bells as the train went by crossings, and, uh, it's just amazing how these people, uh, would get this out of a piano and get the actual noise that you were really hearing when you ride a train, if you've ever ridden a train, passenger train or a freight train. Anyway, the next one is, the name of the song is \"No. 29\" and this is by Wesley Wallace. It was done in 1930, and here he actually has a commentary of the things he's doing on the train (even to the point where he jumps off the train and rolls on the ground). So, so listen away.\n</p><p>[<i>\"No. 29\" plays</i>]\n</p><p><b>Phyllis</b>: Okay, um, this is great stuff, I hope you're enjoying it. This is Phyllis White, here with Bob Chandler, bringing you boogie-woogie blues piano, we're gonna move up to Chicago now, but I just wanna let you know that you are listening to WTJU 91.3 FM in Charlottesville, uh, you're listening to the WTJU Jazz Marathon. Um, if you'd like to come down and see all our premiums or give us a call, we'd be glad to tell you what we have to offer while the music's playing and the numbers are 924-3418, 924-3959 so, let's, um, move from, sort of, southern domain up to Chicago and here's, uh, Bob to fill you in on that. \n</p><p><b>Bob</b>: The next, uh, record that we will hear is actually anoth-still another train blues, another example. This is one of the greatest ones by Cripple Clarence Lofton and he was one of the main figures in the Chicago, South Side of Chicago blues piano players. And the name of this one is \"Streamline Train\" by Cripple Clarence Lofton.  \n</p><p>[<i>\"Streamline Train\" plays</i>]\n</p><p><b>Bob</b>: OK, now we'll, we'll all take the train, and we'll go up to Chicago, because, like all of the jazz players, most of the blues piano players began to drift to Chicago starting about 1915. By the early to mid '20s, there were many groups of piano blues players living in the South Side of Chicago. Groups of these piano players lived in an apartment building called Mecca Flats. 2,000 people were reported to be living there, and other famous piano players lived together at 4435 Prairie Avenue, as well as many other locations on the South Side. Some of these at Prairie Avenue were Pinetop Smith, Meade \"Lux\" Lewis, and, uh, some of the other greats. In the '20s and '30s, any night would find many of these blues piano players in the bars and rent parties on the South Side. Jimmy Blythe was a house pianist at Paramount Records, and he had quite a following of younger blues pianists. There was Meade \"Lux\" Lewis and Albert Ammons, and somewhat older player Jimmy Yancey of vaudeville fame, Clarence \"Pinetop\" Smith from Alabama, Hersal Thomas from Texas, Cripple Clarence Lofton, J.H. \"Mr. Freddie\" Shayne, as well as many visiting players as they wandered through. Blythe, Thomas and Shayne were the professional players. Yancey and Lofton were gifted semi-pros. Lewis and Ammons were the strong young professionals to beat, and Smith would have been too, if he had not been killed at the age of 25. With this background, we will move into the '20s, the rent parties of South Side Chicago and the blues pianists there and other cities. We will first hear Jimmy Blythe playing his \"Chicago Stomp\", as recorded in 1924. It must, er, be remembered here that a player may record a piece he has been playing for many years, but recorded at a much later date. So here's Jimmy Blythe, in 1924, playing \"Chicago Stomp\".\n</p><p>[<i>\"Chicago Stomp\" plays</i>] \n</p><p><b>Bob</b>: This next record, where we actually have to flip the record and re-cue it to another track on the same record, but, we will next hear \"The Mellow Blues\" by Jimmy Yancey, and Jimmy Yancey was in vaudeville, he and his wife, and, for many years, and he actually didn't do any recording until 1939, but he was playing the same music back in the '20s that he recorded in 1939, so here is a good example of Jimmy Yancey playing \"The Mellow Blues\".\n</p><p>[<i>\"The Mellow Blues\" plays</i>]\n</p>\n<h3><span class=\"mw-headline\" id=\"Disc_4\">Disc 4</span></h3>\n<table style=\"border: 1px solid #aaa; background-color: #f9f9f9; color: black; margin: .5em auto .5em auto; padding: 0.2em; font-size:89%; width:260px;-moz-border-radius:10px\">\n<tbody><tr>\n<td align=\"center\" bgcolor=\"#3366CC\" colspan=\"2\" style=\"font-size:110%; color:#ffffff;-moz-border-radius:10px\"><b>1990 WTJU Jazz Marathon Disc 4 Out Of 6</b><br/>\n</td></tr>\n<tr style=\"text-align:center;\">\n<td colspan=\"2\"><div class=\"thumb embedvideo autoResize\" style=\"width: 328px;\"><!--\n--><div class=\"embedvideo autoResize\" style=\"\"><!--\n--><div class=\"embedvideowrap youtube\" style=\"width: 320px\"><div class=\"embedvideo-consent\"><!--\n--><div class=\"embedvideo-consent__overlay\"><!--\n--><div class=\"embedvideo-consent__message\">Click to load content</div><!--\n--></div><!--\n--></div><iframe allow=\"accelerometer; clipboard-write; encrypted-media; fullscreen; gyroscope; picture-in-picture\" data-src=\"//www.youtube-nocookie.com/embed/hRGeCpPBE38\" frameborder=\"0\" height=\"180\" loading=\"lazy\" modestbranding=\"1\" width=\"320\"></iframe></div><!--\n--></div><!--\n--></div>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Search for video</b>\n</td>\n<td><a class=\"external text\" href=\"https://www.youtube.com/results?search_query=1990+WTJU+Jazz+Marathon+Disc+4+Out+Of+6\" rel=\"nofollow\">YouTube</a>, <a class=\"external text\" href=\"https://ghostarchive.org/vidsearch?q=1990+WTJU+Jazz+Marathon+Disc+4+Out+Of+6\" rel=\"nofollow\">archive</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Stardate</b>\n</td>\n<td><a class=\"mw-redirect\" href=\"/cwcki/1990\" title=\"1990\">1990</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Subject Matter</b>\n</td>\n<td><span style=\"display:none\">Music</span><a href=\"/cwcki/Chris_and_music\" title=\"Music\"><img alt=\"Music\" decoding=\"async\" height=\"32\" src=\"/w/images/2/2c/Music.png\" width=\"32\"/></a> <a href=\"/cwcki/Chris_and_music\" title=\"Chris and music\">Music</a>\n</td></tr>\n<tr valign=\"top\">\n<td align=\"center\" bgcolor=\"#696969\" style=\"white-space: nowrap;-moz-border-radius:5px;color:#ffffff;\"><b>Other</b>\n</td>\n<td><span style=\"display:none\">Audio</span><a href=\"/cwcki/File:Audio.png\" title=\"Audio\"><img alt=\"Audio\" decoding=\"async\" height=\"20\" src=\"/w/images/7/72/Audio.png\" width=\"20\"/></a> Audio\n</td></tr>\n</tbody></table>\n<p><br/>\n<b>Bob</b>: The next record we will hear is Chain 'Em Down, by Blind Leroy Garnett. Now he was from Fort Worth, and he recorded this in 1929. Uh, this is again another example of some of the regional differences from Chicago but, uh, this is a, this is a great example of this music in, in the middle '20s. \n</p><p>[<i>\"Honky Tonk Train Blues\" briefly plays again</i>]\n</p><p><b>Bob</b>: I'm sorry, we picked the wrong track. We will-we will very shortly here put it on the right one, cuz that was \"Honky Tonk Train\" which we've already heard once, and it's a good piece, but, uh, I wanted at this time to hear \"Chain 'Em Down\", so we'll give it another try if you'll, just bear with us, we'll make it. \n</p><p>[<i>\"Chain 'Em Down\" plays</i>]\n</p><p><b>Bob</b>: Another name that the boogie-woogie gentry had before Pinetop Smith named it was The Dozens, and this was one that a lot of people in Louisiana and-and, uh, Pittsburgh and Kansas City and everywhere else played, and here's a rendition by Will Ezell which is probably one of the more famous ones of The Dozens. And Will Ezell was from Shreveport, Louisiana. This was recorded in 1929. \n</p><p>[<i>\"The Dozens\" plays</i>]\n</p><p><b>Bob</b>: While we're talking now, Phyllis is gonna flip the record and select the next band, but this will be Charlie Spand from Texas, who settled in Detroit, and he had another complete form of boogie-woogie. But, uh, here is Charlie Spand playing his Hastings Street, which was recorded in 1929. \n</p><p>[<i>\"Hastings Street\" plays</i>]\n</p><p><b>Bob</b>: Okay, while Phyllis is cuing the next record, which is actually the same record (but a different track), we will move to a piano player named Henry Brown, who was from Troy, Tennessee, and he moved to St. Louis in 1918, so here we'll hear what he had to say, his own thing as we listen to his \"Deep Morgan\", which was recorded actually in 1930, but this was the kind of music he'd been playing in St. Louis for 10 years before that. \n</p><p>[<i>\"Deep Morgan\" plays</i>]\n</p><p><b>Bob</b>: The next song we will hear is Charles Avery from Chicago, where he's playing his own \"Dearborn Street Breakdown\". This was recorded in 1929 but, here again, he was playing this long before 1929.\n</p><p>[<i>\"Dearborn Street Breakdown\" plays</i>]\n</p><p><b>Bob</b>: Next we will hear one of the most accomplished blues piano pianist, Meade \"Lux\" Lewis, playing what was almost the theme song of J.H. \"Mr. Freddie\" Shayne - Shayne's own \"Mr. Freddie Blues\". This tells us a lot about \"Mr. Freddie\" Shayne. I don't have any records by \"Mr. Freddie\" Shayne, and I wish I did. He came along earlier with some of the-some of the earlier pianists, and I guess he just didn't record that much. At least I don't have the records. But anyway, this is Maude \"Lux\" Lewis playing \"Mr. Freddie's Blues\". This was recorded in 1936. \n</p><p>[<i>\"Mr. Freddie Blues\" plays</i>]\n</p><p><b>Bob</b>: Now, Albert Ammons, Clarence \"Pinetop\" Smith, and Meade \"Lux\" Lewis lived for a time at the same location in South Side, Chicago. Ammons was the only one who had a piano. Can you imagine recording what we would now call jam sessions that they must have had there? Just before Pinetop, now, later we will hear Pinetop's record, uh, his first boogie-woogie, but just before he was killed, he asked Albert Ammons to learn his boogie-woogie. And here it is, what Albert Ammons learned from Pinetop, \"The Boogie Woogie Stomp\" by Albert Ammons.\n</p><p>[<i>\"Boogie Woogie Stomp\" plays</i>]\n</p><p><b>Bob</b>: There's one more of the older Chicago boogie-woogie piano players that we'll hear next. Th-this one is Jimmy Yancey, and this was actually recorded in 1939 because he didn't make any recordings until 1939, even though he was in Vaudeville at the turn of the century. But this was the kind of music that he was playing in the '20s, the mid '20s, and even into the '30s. And, th-this one tells you a lot about how-the kind of music that he could play. This is called \"Tell Him About Me\", by Jimmy Yancey.\n</p><p>[<i>\"Tell Him About Me\" plays</i>]\n</p><p><b>Bob</b>: Now we're getting up to the point in time of about 1928, and we come to the man who vaulted himself into immortality by naming the musical idiom of boogie-woogie, after recording only 8 sides before he was killed...(Chuckles) Actually, it wasn't his fault, he was actually hit by a stray bullet. But he was killed at the age of 25. Pinetop Smith was from Alabama, and he was working in a chili parlor and beer garden in Pittsburgh in 1925 or '26, and Cow Cow Davenport, who was also from Alabama, and was working for one of the record companies visited him as he was on one of his Vaudeville tours, and, as Pinetop was working on and playing his blues and overhand piano style, Cow Cow is reported to have said to Pinetop, \"Boy, look here, you sure have a mean boogie-woogie.\", and he also tried to explain how Pinetop could add boogie-woogie to the words he was making to go with the music. It is thought that Pi-, uh, Cow Cow might even have talked Pinetop into moving to Chicago so Pinetop could make records. Well, here we have the first two sides of the eight sides that Pinetop recorded. First, \"The Jump Steady Blues\", and then Pinetop's boogie-woogie, which is, both recorded in 1928, with Pinetop doing his singing, or talking if you like. But, here again, this shows that boogie-woogie is for dancing as Pinetop gives instructions as he plays. Here's his \"Jump Steady Blues\".\n</p><p>[<i>\"Jump Steady Blues\" plays</i>]\n</p><p><b>Bob</b>: While they're resetting up for the next record, which is one track before this one, I will tell you that what we're gonna hear next is the first record that really put the name to this whole gentry, and i-it's called \"Pinetop's Boogie Woogie\", and this was the first time it was put on record, it was put on record in 1928, and this is how the whole thing got its name. \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Pinetop%27s_Boogie_Woogie\" title=\"wikipedia:Pinetop's Boogie Woogie\">Pinetop's Boogie Woogie</a>\" plays</i>]\n</p><p><b>Bob</b>: And now we come to the record, in 1938, that introduced the whole world to boogie-woogie and the jitterbug dance craze. Next this is Tommy Dorsey's version of Pinetop's music, and you will-if you ever picked up the record, maybe you haven't, but it says right on the record that this is Pinetop Smith's Boogie Woogie, and the name of the record was \"Boogie Woogie\" by Tommy Dorsey, and it was made in 1938. \n</p><p>[<i>\"Boogie Woogie\" plays</i>]\n</p><p><b>Bob</b>: There, that was the Boogie Woogie that people like me grew up with in our teens. It was the introduction of the world to the piano blues. The closeness of John Hammond to Tommy Dorsey, John's love of the piano blues and Tommy Dorsey's recording of Boogie Woogie started John Hammond on a search for the piano blues players that he thought might still live in Chicago. John came up with the idea of a Spirituals to Swing concert to be held at Carnegie Hall in December of 1938. So John started on the, on the search for the jazz and blues greats throughout the country. He found most of the jazz and blues greats, and they agreed to the concert. Of the blues piano players, he found Albert Ammons and Meade \"Lux\" Lewis in Chicago, and Pete Johnson in Kansas City. These three pianists came into being with this concert as The Boogie Woogie Trio. They became very successful as a trio through recording dates, as well as club dates in New York and Chicago for the next group of years, for about ten years. Boogie-Woogie had been born to the world in 1938. It was no longer the property of the black race only, and now must be shared with the rest of the world. How much the world missed for 20 years before John Hammond started his love for the music with the world! Here is the last record for the night, actually the next-to-last record, but this is the last record by the, by The Boogie Woogie Trio, \"The Boogie Woogie Prayer\" by The Boogie Woogie Trio of Ammons, Lewis and Johnson, recorded in 1938. \n</p><p>[<i>\"Boogie Woogie Prayer\" plays</i>]\n</p><p><b>Bob</b>: Okay, since we have a little bit of time left, we're gonna play an extra one here, which-because we really didn't give you a good, uh, record, erm, interpretation from Pete Johnson. Now, Pete Johnson, like I say, was from Kansas City. He was a different group completely from the Chicago crowd, but he plays one mean piano, and he-he was part of this Boogie Woogie Trio from-from Carnegie Hall concert, and we're gonna play one called \"Roll 'Em Pete\" by Pete Johnson at this time. \n</p><p>[<i>\"<a class=\"extiw\" href=\"http://en.wikipedia.org/wiki/Roll_%27Em_Pete\" title=\"wikipedia:Roll 'Em Pete\">Roll 'Em Pete</a>\" plays</i>]\n</p><p><b>Bob</b>: Heh, heh. Well, we have enjoyed sharing our love for this music, and some of my records with you tonight. And if you would like to have a weekly program of this music, just contact Bruce Torrence, the jazz programming director, or Phyllis White, the special programming director, at WTJU. And, incidentally, some of you out there (unless you're at least my age) might not realize that in the beginning, when they were assigning letters to the stations like WTJU, do you know what the WTJU stands for? \n</p><p><b>Phyllis</b>: Thomas Jefferson's University.\n</p><p><b>Bob</b>: That's right, it stands for Thomas Jefferson's University, and I'll tell you a story that came out of Chicago since we spent a lot of time in Chicago tonight. Uh, the story is that in 1925, there was a company who wanted to, um, uh, get their name, really, across the air, and they had-they bought this big radio station in 1925. Radio stations were scarce, but this one-this one was called WLS, and the reason they picked those call letters was because that was Sears &amp; Roebuck, and they stood for The World's Largest Store. So now you know what-what significance these call letters can have for stations because what could be better for a station than WTJU? Thomas Jefferson's University, who, incidentally, another piece of information is that Thomas Jefferson was known as the first real, honest, collector of popular music in the United States of America.\n</p><p><b>Phyllis</b>: (quietly) Hm, interesting. Great. (unintelligible)\n</p><p><b>Bob</b>: So now, if you would like to have a weekly program of this blues piano, just contact Bruce Torrence, the jazz programming director, or Phyllis White, the special programming director, at WTJU, and we will see what can be worked out. \n</p><p><b>Phyllis</b>: (quietly laughs)\n</p><p><b>Bob</b>: This is Bob Chandler and Phyllis White, signing off, and sending you off to the next program. \n</p><p><b>Phyllis</b>: Mmm-hmm.\n</p>\n<h2><span class=\"mw-headline\" id=\"eBay\"><a href=\"/cwcki/EBay\" title=\"EBay\">eBay</a></span></h2>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a class=\"image\" href=\"/cwcki/File:WTJU_Facebook_comments.jpg\"><img alt=\"\" class=\"thumbimage\" decoding=\"async\" height=\"307\" src=\"/w/images/thumb/d/df/WTJU_Facebook_comments.jpg/300px-WTJU_Facebook_comments.jpg\" srcset=\"/w/images/d/df/WTJU_Facebook_comments.jpg 1.5x\" width=\"300\"/></a> <div class=\"thumbcaption\"><div class=\"magnify\"><a class=\"internal\" href=\"/cwcki/File:WTJU_Facebook_comments.jpg\" title=\"Enlarge\"></a></div>WTJU initially approves, then retracts permission to sell.</div></div></div>\n<p>On 14 <a href=\"/cwcki/July_2014\" title=\"July 2014\">July 2014</a>, Chris listed CDs of the marathon on eBay, never mind it was put up for free download already (and on a website that wouldn't be defunct until 8 months after it was posted). The list price was $50, $10 of which Chris claimed would be donated to WTJU. Obviously, the CD cover has <a class=\"mw-redirect\" href=\"/cwcki/Chris_and_his_Ego\" title=\"Chris and his Ego\">Sonichu</a> and the words <a href=\"/cwcki/Chris_and_copyright\" title=\"Chris and copyright\">\"(C) 2000 CWC\" on it</a>. eBay removed the listing, presumably over copyright infringement, and Chris angrily reposted the listing, claiming that he had permission from WTJU to sell it, which is somewhat irrelevant, and which WTJU later retracted. Apparently, WTJU gave the permission, rather than telling him it wasn't theirs to give, because they thought that Bob was a musician who did a set for the station and not a DJ. eBay then removed the listing a second time, but not before two hapless people had bought copies. Chris gave up on relisting the CDs and claimed he was unable to refund the buyers, but promised to ship each of them a color commissioned drawing, autographed photo, and complimentary CD instead.\n</p>\n<h2><span class=\"mw-headline\" id=\"References\">References</span></h2>\n<p><br/>\n</p>\n<h2><span class=\"mw-headline\" id=\"Links\">Links</span></h2>\n<ul><li><a class=\"external text\" href=\"https://archive.org/details/Bobs1990WTJUJazzMarathon\" rel=\"nofollow\">The full marathon</a> on the Internet Archive</li>\n<li><a class=\"external text\" href=\"https://archive.org/details/cwcvideosfrom94to2021/19900915+01+WTJU+Marathon+with+Bob+Chandler+Disc+2.mp4\" rel=\"nofollow\">Disc 2</a></li>\n<li><a class=\"external text\" href=\"https://archive.org/details/cwcvideosfrom94to2021/19900915+01+WTJU+Marathon+with+Bob+Chandler+Disc+3.mp4\" rel=\"nofollow\">Disc 3</a></li>\n<li><a class=\"external text\" href=\"https://archive.org/details/cwcvideosfrom94to2021/19900915+03+WTJU+Marathon+with+Bob+Chandler+Disc+4.mp4\" rel=\"nofollow\">Disc 4</a></li></ul>\n<!-- \nNewPP limit report\nCached time: 20250601212546\nCache expiry: 86400\nReduced expiry: false\nComplications: []\nCPU time usage: 0.095 seconds\nReal time usage: 0.104 seconds\nPreprocessor visited node count: 545/1000000\nPostexpand include size: 11360/2097152 bytes\nTemplate argument size: 2554/2097152 bytes\nHighest expansion depth: 9/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip postexpand size: 1944/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   30.733      1 -total\n 72.57%   22.304      3 Template:Infobox/video\n 18.74%    5.760      1 Template:DeadLinks\n 17.16%    5.273      3 Template:Music\n 11.41%    3.506     36 Template:Pipe\n 11.07%    3.402      6 Template:Icon\n  9.85%    3.026      3 Template:Audio\n  8.14%    2.503      1 Template:Box\n  7.12%    2.187      1 Template:VideoWithContentID\n-->\n<!-- Saved in parser cache with key cwcki-1_:pcache:idhash:21171-0!canonical and timestamp 20250601212546 and revision id 304262. Serialized with JSON.\n -->\n</div>\n<div class=\"printfooter\">Retrieved from \"<a dir=\"ltr\" href=\"http://sonichu.com/w/index.php?title=WTJU_Marathon&amp;oldid=304262\">http://sonichu.com/w/index.php?title=WTJU_Marathon&amp;oldid=304262</a>\"</div></div>",
  "categories": [
    "Articles with dead external links",
    "Articles with Content ID videos",
    "Music"
  ],
  "links": [
    "Music",
    "Chris",
    "read out",
    "predictably",
    "July 2014",
    "Megan Schroeder",
    "the Internet Lumberjack",
    "Sonichu",
    "YouTube",
    "December 2012",
    "music",
    "2017",
    "\"(C) 2000 CWC\" on it",
    "stress",
    "Charlottesville, Virginia",
    "letters",
    "cut down",
    "eBay",
    "Kacey",
    "1990",
    "Bob Chandler"
  ],
  "scraped_at": "2025-11-26T15:15:30.717857"
}